kg_name,question,query
performance_attendance,Show the attendances of the performances at location 'TD Garden' or 'Bell Centre',SELECT ?T1_attendance WHERE { ?T1 a :performance . ?T1 :performance\#attendance ?T1_attendance . ?T1 :performance\#location ?T1_location . ?T1 :performance\#location ?T1_location . FILTER(?T1_location = 'TD Garden' || ?T1_location = 'Bell Centre') .        }
performance_attendance,What is the average number of attendees for performances?,SELECT (avg( ?T1_attendance) as ?aggregation_T1_attendance_42 ) WHERE { ?T1 a :performance . ?T1 :performance\#attendance ?T1_attendance .        }
performance_attendance,Show different locations and the number of performances at each location.,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T1 :performance\#location ?T1_location .        } GROUP BY ?T1_location
performance_attendance,Show the most common location of performances.,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T1 :performance\#location ?T1_location .        } GROUP BY ?T1_location  ORDER BY DESC (?aggregation_all) LIMIT 1
performance_attendance,Show the locations that have at least two performances.,SELECT ?T1_location WHERE { ?T1 a :performance . ?T1 :performance\#location ?T1_location .        } GROUP BY ?T1_location   HAVING(count( *)  >= 2)
performance_attendance,Show the locations that have both performances with more than 2000 attendees and performances with less than 1000 attendees.,SELECT DISTINCT ?T1_location WHERE { ?T1 a :performance . ?T1 :performance\#location ?T1_location . ?T1 :performance\#attendance ?T1_attendance . FILTER(?T1_attendance > 2000) . FILTER (?T1_location in (?T2_location)) .   ?T2 a :performance . ?T2 :performance\#location ?T2_location . ?T2 :performance\#attendance ?T2_attendance .  FILTER(?T2_attendance < 1000) .             }
performance_attendance,Show the names of members and the location of the performances they attended.,SELECT ?T1_name ?T2_location WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :member_attendance\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :performance\#location ?T2_location . ?T2 a :performance . ?T13 :member_attendance\#ref-performance_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :performance\#location ?T2_location .        }
performance_attendance,Show the names of members and the location of performances they attended in ascending alphabetical order of their names.,SELECT ?T1_name ?T2_location WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :member_attendance\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :performance\#location ?T2_location . ?T1 :member\#name ?T1_name . ?T2 a :performance . ?T13 :member_attendance\#ref-performance_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :performance\#location ?T2_location . ?T1 :member\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
performance_attendance,Show the dates of performances with attending members whose roles are 'Violin'.,SELECT ?T1_date WHERE { ?T1 a :performance . ?T13 a :member_attendance . ?T13 :member_attendance\#ref-performance_id ?T1 .  ?T1 :performance\#date ?T1_date . ?T2 :member\#role ?T2_role . ?T2 a :member . ?T13 :member_attendance\#ref-member_id ?T2 .  ?T1 :performance\#date ?T1_date . ?T2 :member\#role ?T2_role . FILTER(?T2_role = 'Violin') .        }
performance_attendance,Show the names of members and the dates of performances they attended in descending order of attendance of the performances.,SELECT ?T1_name ?T2_date WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :member_attendance\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :performance\#date ?T2_date . ?T2 :performance\#attendance ?T2_attendance . ?T2 a :performance . ?T13 :member_attendance\#ref-performance_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :performance\#date ?T2_date . ?T2 :performance\#attendance ?T2_attendance .        }  ORDER BY DESC (?T2_attendance)
performance_attendance,List the names of members who did not attend any performance.,SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#member_id ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) .       {SELECT ?T22_member_id WHERE { ?T22 a :member_attendance . ?T22 :member_attendance\#member_id ?T22_member_id .        }    } }
college_2,Find the buildings which have rooms with capacity more than 50.,SELECT DISTINCT ?T1_building WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . ?T1 :classroom\#capacity ?T1_capacity . FILTER(?T1_capacity > 50) .        }
college_2,What are the distinct buildings with capacities of greater than 50?,SELECT DISTINCT ?T1_building WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . ?T1 :classroom\#capacity ?T1_capacity . FILTER(?T1_capacity > 50) .        }
college_2,Count the number of rooms that are not in the Lamberton building.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . FILTER(?T1_building != 'Lamberton') .        }
college_2,How many classrooms are not in Lamberton?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . FILTER(?T1_building != 'Lamberton') .        }
college_2,Give the name and building of the departments with greater than average budget.,SELECT ?T1_dept_name ?T1_building WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#building ?T1_building . ?T1 :department\#budget ?T1_budget . FILTER(?T1_budget > (?aggregation_T22_budget_25)) .       {SELECT (avg( ?T22_budget) as ?aggregation_T22_budget_25 ) WHERE { ?T22 a :department . ?T22 :department\#budget ?T22_budget .        }    } }
college_2,Find the room number of the rooms which can sit 50 to 100 students and their buildings.,SELECT ?T1_building ?T1_room_number WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . ?T1 :classroom\#room_number ?T1_room_number . ?T1 :classroom\#capacity ?T1_capacity . FILTER(?T1_capacity >= 50 && ?T1_capacity <= 100) .        }
college_2,Find the name and building of the department with the highest budget.,SELECT ?T1_dept_name ?T1_building WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#building ?T1_building . ?T1 :department\#budget ?T1_budget .        }   ORDER BY DESC (?T1_budget) LIMIT 1
college_2,What is the name of the student who has the highest total credits in the History department.,SELECT ?T1_name WHERE { ?T1 a :student . ?T1 :student\#name ?T1_name . ?T1 :student\#tot_cred ?T1_tot_cred . ?T1 :student\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'History') .        }   ORDER BY DESC (?T1_tot_cred) LIMIT 1
college_2,How many rooms does the Lamberton building have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . FILTER(?T1_building = 'Lamberton') .        }
college_2,How many students have advisors?,SELECT DISTINCT (count(DISTINCT ?T1_s_id) as ?aggregation_T1_s_id_181 ) WHERE { ?T1 a :advisor . ?T1 :advisor\#s_id ?T1_s_id .        }
college_2,Count the number of students who have advisors.,SELECT DISTINCT (count(DISTINCT ?T1_s_id) as ?aggregation_T1_s_id_189 ) WHERE { ?T1 a :advisor . ?T1 :advisor\#s_id ?T1_s_id .        }
college_2,How many departments offer courses?,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_142 ) WHERE { ?T1 a :course . ?T1 :course\#dept_name ?T1_dept_name .        }
college_2,Count the number of departments which offer courses.,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_122 ) WHERE { ?T1 a :course . ?T1 :course\#dept_name ?T1_dept_name .        }
college_2,How many different courses offered by Physics department?,SELECT DISTINCT (count(DISTINCT ?T1_course_id) as ?aggregation_T1_course_id_64 ) WHERE { ?T1 a :course . ?T1 :course\#course_id ?T1_course_id . ?T1 :course\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Physics') .        }
college_2,Count the number of courses in the Physics department.,SELECT DISTINCT (count(DISTINCT ?T1_course_id) as ?aggregation_T1_course_id_81 ) WHERE { ?T1 a :course . ?T1 :course\#course_id ?T1_course_id . ?T1 :course\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Physics') .        }
college_2,Find the title of courses that have two prerequisites?,SELECT ?T1_title WHERE { ?T1 a :course . ?T2 a :prereq . ?T2 :prereq\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title .        } GROUP BY ?T1_title   HAVING(count( *)  = 2)
college_2,What are the titles for courses with two prerequisites?,SELECT ?T1_title WHERE { ?T1 a :course . ?T2 a :prereq . ?T2 :prereq\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title .        } GROUP BY ?T1_title   HAVING(count( *)  = 2)
college_2,"Find the title, credit, and department name of courses that have more than one prerequisites?",SELECT ?T1_title ?T1_credits ?T1_dept_name WHERE { ?T1 a :course . ?T2 a :prereq . ?T2 :prereq\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title . ?T1 :course\#credits ?T1_credits . ?T1 :course\#dept_name ?T1_dept_name .        } GROUP BY ?T1_title ?T1_credits ?T1_dept_name   HAVING(count( *)  > 1)
college_2,"What is the title, credit value, and department name for courses with more than one prerequisite?",SELECT ?T1_title ?T1_credits ?T1_dept_name WHERE { ?T1 a :course . ?T2 a :prereq . ?T2 :prereq\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title . ?T1 :course\#credits ?T1_credits . ?T1 :course\#dept_name ?T1_dept_name .        } GROUP BY ?T1_title ?T1_credits ?T1_dept_name   HAVING(count( *)  > 1)
college_2,How many courses that do not have prerequisite?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T1 :course\#course_id ?T1_course_id . FILTER(?T1_course_id not in (?T22_course_id)) .       {SELECT ?T22_course_id WHERE { ?T22 a :prereq . ?T22 :prereq\#course_id ?T22_course_id .        }    } }
college_2,Find the name of the courses that do not have any prerequisite?,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#course_id ?T1_course_id . FILTER(?T1_course_id not in (?T22_course_id)) .       {SELECT ?T22_course_id WHERE { ?T22 a :prereq . ?T22 :prereq\#course_id ?T22_course_id .        }    } }
college_2,What are the titles of courses without prerequisites?,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#course_id ?T1_course_id . FILTER(?T1_course_id not in (?T22_course_id)) .       {SELECT ?T22_course_id WHERE { ?T22 a :prereq . ?T22 :prereq\#course_id ?T22_course_id .        }    } }
college_2,How many different instructors have taught some course?,SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_129 ) WHERE { ?T1 a :teaches . ?T1 :teaches\#id ?T1_id .        }
college_2,Count the number of distinct instructors who have taught a course.,SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_155 ) WHERE { ?T1 a :teaches . ?T1 :teaches\#id ?T1_id .        }
college_2,Find the total budgets of the Marketing or Finance department.,SELECT (sum( ?T1_budget) as ?aggregation_T1_budget_36 ) WHERE { ?T1 a :department . ?T1 :department\#budget ?T1_budget . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Marketing' || ?T1_dept_name = 'Finance') .        }
college_2,What is the sum of budgets of the Marketing and Finance departments?,SELECT (sum( ?T1_budget) as ?aggregation_T1_budget_136 ) WHERE { ?T1 a :department . ?T1 :department\#budget ?T1_budget . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Marketing' || ?T1_dept_name = 'Finance') .        }
college_2,Find the department name of the instructor whose name contains 'Soisalon'.,"SELECT ?T1_dept_name WHERE { ?T1 a :instructor . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#name ?T1_name . FILTER(contains (?T1_name, 'Soisalon')) .        }"
college_2,Count the number of rooms in Lamberton with capacity lower than 50.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . ?T1 :classroom\#capacity ?T1_capacity . FILTER(?T1_building = 'Lamberton' && ?T1_capacity < 50) .        }
college_2,Find the name and budget of departments whose budgets are more than the average budget.,SELECT ?T1_dept_name ?T1_budget WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#budget ?T1_budget . ?T1 :department\#budget ?T1_budget . FILTER(?T1_budget > (?aggregation_T22_budget_88)) .       {SELECT (avg( ?T22_budget) as ?aggregation_T22_budget_88 ) WHERE { ?T22 a :department . ?T22 :department\#budget ?T22_budget .        }    } }
college_2,Give the name of the lowest earning instructor in the Statistics department.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary . ?T1 :instructor\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Statistics') .        }   ORDER BY ASC (?T1_salary) LIMIT 1
college_2,Find the title of course that is provided by both Statistics and Psychology departments.,SELECT DISTINCT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Statistics') . FILTER (?T1_title in (?T2_title)) .   ?T2 a :course . ?T2 :course\#title ?T2_title . ?T2 :course\#dept_name ?T2_dept_name .  FILTER(?T2_dept_name = 'Psychology') .             }
college_2,Find the title of course that is provided by Statistics but not Psychology departments.,SELECT distinct?col1 WHERE { { SELECT (?T1_title as ?col1) WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Statistics') .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :course . ?T2 :course\#title ?T2_title . ?T2 :course\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Psychology') .        }     } }
college_2,Find the id of instructors who taught a class in Fall 2009 but not in Spring 2010.,SELECT distinct?col1 WHERE { { SELECT (?T1_id as ?col1) WHERE { ?T1 a :teaches . ?T1 :teaches\#id ?T1_id . ?T1 :teaches\#semester ?T1_semester . ?T1 :teaches\#year ?T1_year . FILTER(?T1_semester = 'Fall' && ?T1_year = 2009) .   }}  MINUS {SELECT (?T2_id as ?col1) WHERE { ?T2 a :teaches . ?T2 :teaches\#id ?T2_id . ?T2 :teaches\#semester ?T2_semester . ?T2 :teaches\#year ?T2_year . FILTER(?T2_semester = 'Spring' && ?T2_year = 2010) .        }     } }
college_2,Find the name of students who took any class in the years of 2009 and 2010.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :student . ?T2 a :takes . ?T2 :takes\#ref-id ?T1 .  ?T1 :student\#name ?T1_name . ?T2 :takes\#year ?T2_year . ?T2 :takes\#year ?T2_year . FILTER(?T2_year = 2009 || ?T2_year = 2010) .        }
college_2,What are the names of the students who took classes in 2009 or 2010?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :student . ?T2 a :takes . ?T2 :takes\#ref-id ?T1 .  ?T1 :student\#name ?T1_name . ?T2 :takes\#year ?T2_year . ?T2 :takes\#year ?T2_year . FILTER(?T2_year = 2009 || ?T2_year = 2010) .        }
college_2,Find the names of the top 3 departments that provide the largest amount of courses?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T1 :course\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,What are the names of the 3 departments with the most courses?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T1 :course\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,Find the name of the department that offers the highest total credits?,SELECT ?T1_dept_name WHERE { ?T1 a :course . ?T1 :course\#dept_name ?T1_dept_name . ?T1 :course\#credits ?T1_credits .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T1_credits) as ?aggregation_T1_credits_103 )) LIMIT 1
college_2,What is the name of the department with the most credits?,SELECT ?T1_dept_name WHERE { ?T1 a :course . ?T1 :course\#dept_name ?T1_dept_name . ?T1 :course\#credits ?T1_credits .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T1_credits) as ?aggregation_T1_credits_53 )) LIMIT 1
college_2,List the names of all courses ordered by their titles and credits.,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#title ?T1_title .        }  ORDER BY ASC (?T1_title)
college_2,Which department has the lowest budget?,SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#budget ?T1_budget .        }   ORDER BY ASC (?T1_budget) LIMIT 1
college_2,List the names and buildings of all departments sorted by the budget from large to small.,SELECT ?T1_dept_name ?T1_building WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#building ?T1_building . ?T1 :department\#budget ?T1_budget .        }  ORDER BY DESC (?T1_budget)
college_2,Who is the instructor with the highest salary?,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary .        }   ORDER BY DESC (?T1_salary) LIMIT 1
college_2,List the information of all instructors ordered by their salary in ascending order.,SELECT * WHERE { ?T1 a :instructor . ?T1 :instructor\#salary ?T1_salary .        }  ORDER BY ASC (?T1_salary)
college_2,Find the name of the students and their department names sorted by their total credits in ascending order.,SELECT ?T1_name ?T1_dept_name WHERE { ?T1 a :student . ?T1 :student\#name ?T1_name . ?T1 :student\#dept_name ?T1_dept_name . ?T1 :student\#tot_cred ?T1_tot_cred .        }  ORDER BY ASC (?T1_tot_cred)
college_2,list in alphabetic order all course names and their instructors' names in year 2008.,SELECT ?T1_title ?T2_name WHERE { ?T1 a :course . ?T14 a :department . ?T1 :course\#ref-dept_code ?T14 .  ?T1 :course\#title ?T1_title . ?T2 :instructor\#name ?T2_name . ?T1 :course\#title ?T1_title . ?T3 :teaches\#year ?T3_year . ?T2 a :instructor . ?T2 :instructor\#ref-dept_name ?T14 .  ?T1 :course\#title ?T1_title . ?T2 :instructor\#name ?T2_name . ?T1 :course\#title ?T1_title . ?T3 :teaches\#year ?T3_year . ?T3 a :teaches . ?T3 :teaches\#ref-id ?T2 .  ?T1 :course\#title ?T1_title . ?T2 :instructor\#name ?T2_name . ?T1 :course\#title ?T1_title . ?T3 :teaches\#year ?T3_year . FILTER(?T3_year = 2008) .        }  ORDER BY ASC (?T1_title)
college_2,Find the name of instructors who are advising more than one student.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T2 a :advisor . ?T2 :advisor\#ref-i_id ?T1 .  ?T1 :instructor\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
college_2,What are the names of instructors who advise more than one student?,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T2 a :advisor . ?T2 :advisor\#ref-i_id ?T1 .  ?T1 :instructor\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
college_2,Find the name of the students who have more than one advisor?,SELECT ?T1_name WHERE { ?T1 a :student . ?T2 a :advisor . ?T2 :advisor\#ref-s_id ?T1 .  ?T1 :student\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
college_2,What are the names of students who have more than one advisor?,SELECT ?T1_name WHERE { ?T1 a :student . ?T2 a :advisor . ?T2 :advisor\#ref-s_id ?T1 .  ?T1 :student\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
college_2,Find the number of rooms with more than 50 capacity for each building.,SELECT (count( *) as ?aggregation_all) ?T1_building WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . ?T1 :classroom\#capacity ?T1_capacity . FILTER(?T1_capacity > 50) .        } GROUP BY ?T1_building
college_2,How many rooms in each building have a capacity of over 50?,SELECT (count( *) as ?aggregation_all) ?T1_building WHERE { ?T1 a :classroom . ?T1 :classroom\#building ?T1_building . ?T1 :classroom\#capacity ?T1_capacity . FILTER(?T1_capacity > 50) .        } GROUP BY ?T1_building
college_2,Find the maximum and average capacity among rooms in each building.,SELECT (max( ?T1_capacity) as ?aggregation_T1_capacity_111 ) (avg( ?T1_capacity) as ?aggregation_T1_capacity_107 ) ?T1_building WHERE { ?T1 a :classroom . ?T1 :classroom\#capacity ?T1_capacity . ?T1 :classroom\#capacity ?T1_capacity . ?T1 :classroom\#building ?T1_building .        } GROUP BY ?T1_building
college_2,What are the greatest and average capacity for rooms in each building?,SELECT (max( ?T1_capacity) as ?aggregation_T1_capacity_86 ) (avg( ?T1_capacity) as ?aggregation_T1_capacity_51 ) ?T1_building WHERE { ?T1 a :classroom . ?T1 :classroom\#capacity ?T1_capacity . ?T1 :classroom\#capacity ?T1_capacity . ?T1 :classroom\#building ?T1_building .        } GROUP BY ?T1_building
college_2,Find the title of the course that is offered by more than one department.,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title .        } GROUP BY ?T1_title   HAVING(count( *)  > 1)
college_2,Find the total credits of courses provided by different department.,SELECT (sum( ?T1_credits) as ?aggregation_T1_credits_98 ) ?T1_dept_name WHERE { ?T1 a :course . ?T1 :course\#credits ?T1_credits . ?T1 :course\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name
college_2,How many total credits are offered by each department?,SELECT (sum( ?T1_credits) as ?aggregation_T1_credits_61 ) ?T1_dept_name WHERE { ?T1 a :course . ?T1 :course\#credits ?T1_credits . ?T1 :course\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name
college_2,Find the minimum salary for the departments whose average salary is above the average payment of all instructors.,SELECT (min( ?T1_salary) as ?aggregation_T1_salary_18 ) ?T1_dept_name WHERE { ?T1 a :instructor . ?T1 :instructor\#salary ?T1_salary . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#salary ?T1_salary .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_64 ) WHERE { ?T22 a :instructor . ?T22 :instructor\#salary ?T22_salary .        }    } } GROUP BY ?T1_dept_name   HAVING(avg( ?T1_salary)  > (?aggregation_T22_salary_64))
college_2,What is the lowest salary in departments with average salary greater than the overall average.,SELECT (min( ?T1_salary) as ?aggregation_T1_salary_195 ) ?T1_dept_name WHERE { ?T1 a :instructor . ?T1 :instructor\#salary ?T1_salary . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#salary ?T1_salary .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_34 ) WHERE { ?T22 a :instructor . ?T22 :instructor\#salary ?T22_salary .        }    } } GROUP BY ?T1_dept_name   HAVING(avg( ?T1_salary)  > (?aggregation_T22_salary_34))
college_2,Find the number of courses provided in each semester and year.,SELECT (count( *) as ?aggregation_all) ?T1_semester ?T1_year WHERE { ?T1 a :section . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year .        } GROUP BY ?T1_year
college_2,How many courses are provided in each semester and year?,SELECT (count( *) as ?aggregation_all) ?T1_semester ?T1_year WHERE { ?T1 a :section . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year .        } GROUP BY ?T1_year
college_2,Find the year which offers the largest number of courses.,SELECT ?T1_year (count( *) as ?aggregation_all) WHERE { ?T1 a :section . ?T1 :section\#year ?T1_year .        } GROUP BY ?T1_year  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,Which year had the greatest number of courses?,SELECT ?T1_year (count( *) as ?aggregation_all) WHERE { ?T1 a :section . ?T1 :section\#year ?T1_year .        } GROUP BY ?T1_year  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,Find the year and semester when offers the largest number of courses.,SELECT ?T1_semester (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 a :section . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year .        } GROUP BY ?T1_semester  ?T1_year  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,What is the year and semester with the most courses?,SELECT ?T1_semester (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 a :section . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year .        } GROUP BY ?T1_semester  ?T1_year  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,Find the name of department has the highest amount of students?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,What is the name of the deparment with the highest enrollment?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1
college_2,Find the total number of students in each department.,SELECT (count( *) as ?aggregation_all) ?T1_dept_name WHERE { ?T1 a :student . ?T1 :student\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name
college_2,How many students are in each department?,SELECT (count( *) as ?aggregation_all) ?T1_dept_name WHERE { ?T1 a :student . ?T1 :student\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name
college_2,Find the semester and year which has the least number of student taking any class.,SELECT ?T1_semester (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 a :takes . ?T1 :takes\#semester ?T1_semester . ?T1 :takes\#year ?T1_year .        } GROUP BY ?T1_semester  ?T1_year  ORDER BY ASC (?aggregation_all) LIMIT 1
college_2,Which semeseter and year had the fewest students?,SELECT ?T1_semester (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 a :takes . ?T1 :takes\#semester ?T1_semester . ?T1 :takes\#year ?T1_year .        } GROUP BY ?T1_semester  ?T1_year  ORDER BY ASC (?aggregation_all) LIMIT 1
college_2,Give id of the instructor who advises students in the History department.,SELECT ?T1_i_id WHERE { ?T1 a :advisor . ?T2 a :student . ?T1 :advisor\#ref-s_id ?T2 .  ?T1 :advisor\#i_id ?T1_i_id . ?T2 :student\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'History') .        }
college_2,Find the id of the courses that do not have any prerequisite?,SELECT distinct?col1 WHERE { { SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :course . ?T1 :course\#course_id ?T1_course_id .   }}  MINUS {SELECT (?T2_course_id as ?col1) WHERE { ?T2 a :prereq . ?T2 :prereq\#course_id ?T2_course_id .        }     } }
college_2,What are the ids of courses without prerequisites?,SELECT distinct?col1 WHERE { { SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :course . ?T1 :course\#course_id ?T1_course_id .   }}  MINUS {SELECT (?T2_course_id as ?col1) WHERE { ?T2 a :prereq . ?T2 :prereq\#course_id ?T2_course_id .        }     } }
college_2,What are the names of courses without prerequisites?,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#course_id ?T1_course_id . FILTER(?T1_course_id not in (?T22_course_id)) .       {SELECT ?T22_course_id WHERE { ?T22 a :prereq . ?T22 :prereq\#course_id ?T22_course_id .        }    } }
college_2,Give the title of the prerequisite to the course International Finance.,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#course_id ?T1_course_id . FILTER(?T1_course_id in (?T23_title)) .       {SELECT ?T22_prereq_id WHERE { ?T22 a :prereq . ?T23 a :course . ?T22 :prereq\#ref-course_id ?T23 .  ?T22 :prereq\#prereq_id ?T22_prereq_id . ?T23 :course\#title ?T23_title . FILTER(?T23_title = 'International Finance') .        }    } }
college_2,Find the title of course whose prerequisite is course Differential Geometry.,SELECT ?T1_title WHERE { ?T1 a :course . ?T1 :course\#title ?T1_title . ?T1 :course\#course_id ?T1_course_id . FILTER(?T1_course_id in (?T23_title)) .       {SELECT ?T22_course_id WHERE { ?T22 a :prereq . ?T23 a :course . ?T22 :prereq\#ref-course_id ?T23 .  ?T22 :prereq\#course_id ?T22_course_id . ?T23 :course\#title ?T23_title . FILTER(?T23_title = 'Differential Geometry') .        }    } }
college_2,Find the names of students who have taken any course in the fall semester of year 2003.,SELECT ?T1_name WHERE { ?T1 a :student . ?T1 :student\#name ?T1_name . ?T1 :student\#id ?T1_id . FILTER(?T1_id in (?T22_year)) .       {SELECT ?T22_id WHERE { ?T22 a :takes . ?T22 :takes\#id ?T22_id . ?T22 :takes\#semester ?T22_semester . ?T22 :takes\#year ?T22_year . FILTER(?T22_semester = 'Fall' && ?T22_year = 2003) .        }    } }
college_2,What are the names of students who took a course in the Fall of 2003?,SELECT ?T1_name WHERE { ?T1 a :student . ?T1 :student\#name ?T1_name . ?T1 :student\#id ?T1_id . FILTER(?T1_id in (?T22_year)) .       {SELECT ?T22_id WHERE { ?T22 a :takes . ?T22 :takes\#id ?T22_id . ?T22 :takes\#semester ?T22_semester . ?T22 :takes\#year ?T22_year . FILTER(?T22_semester = 'Fall' && ?T22_year = 2003) .        }    } }
college_2,Give the title of the course offered in Chandler during the Fall of 2010.,SELECT ?T1_title WHERE { ?T1 a :course . ?T2 a :section . ?T2 :section\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title . ?T2 :section\#building ?T2_building . ?T2 :section\#semester ?T2_semester . ?T2 :section\#year ?T2_year . FILTER(?T2_building = 'Chandler' && ?T2_semester = 'Fall' && ?T2_year = 2010) .        }
college_2,Find the name of the instructors who taught C Programming course before.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T13 a :department . ?T1 :instructor\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T2 :course\#title ?T2_title . ?T2 a :course . ?T2 :course\#ref-dept_code ?T13 .  ?T1 :instructor\#name ?T1_name . ?T2 :course\#title ?T2_title . FILTER(?T2_title = 'C Programming') .        }
college_2,Find the name and salary of instructors who are advisors of the students from the Math department.,SELECT ?T1_name ?T1_salary WHERE { ?T1 a :instructor . ?T13 a :department . ?T1 :instructor\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary . ?T2 :student\#dept_name ?T2_dept_name . ?T2 a :student . ?T2 :student\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary . ?T2 :student\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Math') .        }
college_2,"Find the name of instructors who are advisors of the students from the Math department, and sort the results by students' total credit.",SELECT ?T1_name WHERE { ?T1 a :instructor . ?T13 a :department . ?T1 :instructor\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T2 :student\#tot_cred ?T2_tot_cred . ?T2 :student\#dept_name ?T2_dept_name . ?T2 a :student . ?T2 :student\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T2 :student\#tot_cred ?T2_tot_cred . ?T2 :student\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Math') .        }  ORDER BY ASC (?T2_tot_cred)
college_2,Find the name of instructor who is the advisor of the student who has the highest number of total credits.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T13 a :department . ?T1 :instructor\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T2 :student\#tot_cred ?T2_tot_cred . ?T2 a :student . ?T2 :student\#ref-dept_name ?T13 .  ?T1 :instructor\#name ?T1_name . ?T2 :student\#tot_cred ?T2_tot_cred .        }   ORDER BY DESC (?T2_tot_cred) LIMIT 1
college_2,Find the name of instructors who didn't teach any courses?,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#id ?T1_id . FILTER(?T1_id not in (?T22_id)) .       {SELECT ?T22_id WHERE { ?T22 a :teaches . ?T22 :teaches\#id ?T22_id .        }    } }
