kg_name,question,query
sports_competition,What is the average number of points for players from the 'AIB' club?,SELECT (avg( ?T1_points) as ?aggregation_T1_points_150 ) WHERE { ?T1 a :player . ?T2 a :club . ?T1 :player\#ref-club_id ?T2 .  ?T1 :player\#points ?T1_points . ?T2 :club\#name ?T2_name . FILTER(?T2_name = 'AIB') .        }
sports_competition,List the position of players and the average number of points of players of each position.,SELECT ?T1_position (avg( ?T1_points) as ?aggregation_T1_points_196 ) WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position . ?T1 :player\#points ?T1_points .        } GROUP BY ?T1_position
sports_competition,List the position of players with average number of points scored by players of that position bigger than 20.,SELECT ?T1_position WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position . ?T1 :player\#points ?T1_points .        } GROUP BY ?T1_position   HAVING(avg( ?T1_points)  >= 20)
sports_competition,What are the positions of players whose average number of points scored by that position is larger than 20?,SELECT ?T1_position WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position . ?T1 :player\#points ?T1_points .        } GROUP BY ?T1_position   HAVING(avg( ?T1_points)  >= 20)
sports_competition,List the types of competition and the number of competitions of each type.,SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a :competition . ?T1 :competition\#competition_type ?T1_competition_type .        } GROUP BY ?T1_competition_type
sports_competition,List the most common type of competition.,SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a :competition . ?T1 :competition\#competition_type ?T1_competition_type .        } GROUP BY ?T1_competition_type  ORDER BY DESC (?aggregation_all) LIMIT 1
sports_competition,What is the most common competition type?,SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a :competition . ?T1 :competition\#competition_type ?T1_competition_type .        } GROUP BY ?T1_competition_type  ORDER BY DESC (?aggregation_all) LIMIT 1
sports_competition,List the types of competition that have at most five competitions of that type.,SELECT ?T1_competition_type WHERE { ?T1 a :competition . ?T1 :competition\#competition_type ?T1_competition_type .        } GROUP BY ?T1_competition_type   HAVING(count( *)  <= 5)
sports_competition,List the names of clubs that do not have any players.,SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :club\#name ?T1_name . ?T1 :club\#club_id ?T1_club_id . FILTER(?T1_club_id not in (?T22_club_id)) .       {SELECT ?T22_club_id WHERE { ?T22 a :player . ?T22 :player\#club_id ?T22_club_id .        }    } }
sports_competition,What are the names of all clubs that do not have any players?,SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :club\#name ?T1_name . ?T1 :club\#club_id ?T1_club_id . FILTER(?T1_club_id not in (?T22_club_id)) .       {SELECT ?T22_club_id WHERE { ?T22 a :player . ?T22 :player\#club_id ?T22_club_id .        }    } }
sports_competition,What are the positions with both players having more than 20 points and less than 10 points.,SELECT DISTINCT ?T1_position WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position . ?T1 :player\#points ?T1_points . FILTER(?T1_points > 20) . FILTER (?T1_position in (?T2_position)) .   ?T2 a :player . ?T2 :player\#position ?T2_position . ?T2 :player\#points ?T2_points .  FILTER(?T2_points < 10) .             }
sports_competition,Show total points of all players.,SELECT (sum( ?T1_points) as ?aggregation_T1_points_110 ) WHERE { ?T1 a :player . ?T1 :player\#points ?T1_points .        }
sports_competition,What is the total number of points for all players?,SELECT (sum( ?T1_points) as ?aggregation_T1_points_46 ) WHERE { ?T1 a :player . ?T1 :player\#points ?T1_points .        }
sports_competition,how many different positions are there?,SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_128 ) WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position .        }
sports_competition,How many different position for players are listed?,SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_189 ) WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position .        }
sports_competition,what are the name of players who get more than the average points.,SELECT ?T1_name WHERE { ?T1 a :player . ?T1 :player\#name ?T1_name . ?T1 :player\#points ?T1_points . FILTER(?T1_points > (?aggregation_T22_points_56)) .       {SELECT (avg( ?T22_points) as ?aggregation_T22_points_56 ) WHERE { ?T22 a :player . ?T22 :player\#points ?T22_points .        }    } }
sports_competition,find the number of players whose points are lower than 30 in each position.,SELECT (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position . ?T1 :player\#points ?T1_points . FILTER(?T1_points < 30) .        } GROUP BY ?T1_position
sports_competition,which countries did participated in both Friendly and Tournament type competitions.,SELECT DISTINCT ?T1_country WHERE { ?T1 a :competition . ?T1 :competition\#country ?T1_country . ?T1 :competition\#competition_type ?T1_competition_type . FILTER(?T1_competition_type = 'Friendly') . FILTER (?T1_country in (?T2_country)) .   ?T2 a :competition . ?T2 :competition\#country ?T2_country . ?T2 :competition\#competition_type ?T2_competition_type .  FILTER(?T2_competition_type = 'Tournament') .             }
sports_competition,Find the countries that have never participated in any competition with Friendly type.,SELECT distinct?T1_country WHERE { { SELECT (?T1_country as ?col1) WHERE { ?T1 a :competition . ?T1 :competition\#country ?T1_country .   }}  MINUS {SELECT (?T2_country as ?col1) WHERE { ?T2 a :competition . ?T2 :competition\#country ?T2_country . ?T2 :competition\#competition_type ?T2_competition_type . FILTER(?T2_competition_type = 'Friendly') .        }     } }
manufacturer,How many furniture components are there in total?,SELECT (sum( ?T1_num_of_component) as ?aggregation_T1_num_of_component_92 ) WHERE { ?T1 a :furniture . ?T1 :furniture\#num_of_component ?T1_num_of_component .        }
manufacturer,Return the name and id of the furniture with the highest market rate.,SELECT ?T1_name ?T1_furniture_id WHERE { ?T1 a :furniture . ?T1 :furniture\#name ?T1_name . ?T1 :furniture\#furniture_id ?T1_furniture_id . ?T1 :furniture\#market_rate ?T1_market_rate .        }   ORDER BY DESC (?T1_market_rate) LIMIT 1
manufacturer,find the total market rate of the furnitures that have the top 2 market shares.,SELECT (sum(?t1_market_rate) as ?sum) WHERE{ SELECT ?t1_market_rate WHERE{?t1 a :furniture.?t1 :furniture\#market_rate ?t1_market_rate . }ORDER BY DESC (?t1_market_rate) LIMIT 2}
manufacturer,Find the component amounts and names of all furnitures that have more than 10 components.,SELECT ?T1_num_of_component ?T1_name WHERE { ?T1 a :furniture . ?T1 :furniture\#num_of_component ?T1_num_of_component . ?T1 :furniture\#name ?T1_name . ?T1 :furniture\#num_of_component ?T1_num_of_component . FILTER(?T1_num_of_component > 10) .        }
manufacturer,Find the name and component amount of the least popular furniture.,SELECT ?T1_name ?T1_num_of_component WHERE { ?T1 a :furniture . ?T1 :furniture\#name ?T1_name . ?T1 :furniture\#num_of_component ?T1_num_of_component . ?T1 :furniture\#market_rate ?T1_market_rate .        }   ORDER BY ASC (?T1_market_rate) LIMIT 1
manufacturer,Find the names of furnitures whose prices are lower than the highest price.,SELECT ?T1_name WHERE { ?T1 a :furniture . ?T2 a :furniture_manufacte . ?T2 :furniture_manufacte\#ref-furniture_id ?T1 .  ?T1 :furniture\#name ?T1_name . ?T2 :furniture_manufacte\#price_in_dollar ?T2_price_in_dollar . FILTER(?T2_price_in_dollar < (?aggregation_T23_price_in_dollar_123)) .       {SELECT (max( ?T23_price_in_dollar) as ?aggregation_T23_price_in_dollar_123 ) WHERE { ?T23 a :furniture_manufacte . ?T23 :furniture_manufacte\#price_in_dollar ?T23_price_in_dollar .        }    } }
manufacturer,Which manufacturer has the most number of shops? List its name and year of opening.,SELECT ?T1_open_year ?T1_name WHERE { ?T1 a :manufacturer . ?T1 :manufacturer\#open_year ?T1_open_year . ?T1 :manufacturer\#name ?T1_name . ?T1 :manufacturer\#num_of_shops ?T1_num_of_shops .        }   ORDER BY DESC (?T1_num_of_shops) LIMIT 1
manufacturer,Find the average number of factories for the manufacturers that have more than 20 shops.,SELECT (avg( ?T1_num_of_factories) as ?aggregation_T1_num_of_factories_70 ) WHERE { ?T1 a :manufacturer . ?T1 :manufacturer\#num_of_factories ?T1_num_of_factories . ?T1 :manufacturer\#num_of_shops ?T1_num_of_shops . FILTER(?T1_num_of_shops > 20) .        }
manufacturer,List all manufacturer names and ids ordered by their opening year.,SELECT ?T1_name ?T1_manufacturer_id WHERE { ?T1 a :manufacturer . ?T1 :manufacturer\#name ?T1_name . ?T1 :manufacturer\#manufacturer_id ?T1_manufacturer_id . ?T1 :manufacturer\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
manufacturer,Give me the name and year of opening of the manufacturers that have either less than 10 factories or more than 10 shops.,SELECT ?T1_name ?T1_open_year WHERE { ?T1 a :manufacturer . ?T1 :manufacturer\#name ?T1_name . ?T1 :manufacturer\#open_year ?T1_open_year . ?T1 :manufacturer\#num_of_shops ?T1_num_of_shops . ?T1 :manufacturer\#num_of_factories ?T1_num_of_factories . FILTER(?T1_num_of_shops > 10 || ?T1_num_of_factories < 10) .        }
manufacturer,what is the average number of factories and maximum number of shops for manufacturers that opened before 1990.,SELECT (max( ?T1_num_of_shops) as ?aggregation_T1_num_of_shops_12 ) (avg( ?T1_num_of_factories) as ?aggregation_T1_num_of_factories_19 ) WHERE { ?T1 a :manufacturer . ?T1 :manufacturer\#num_of_shops ?T1_num_of_shops . ?T1 :manufacturer\#num_of_factories ?T1_num_of_factories . ?T1 :manufacturer\#open_year ?T1_open_year . FILTER(?T1_open_year < 1990) .        }
manufacturer,Find the id and number of shops for the company that produces the most expensive furniture.,SELECT ?T1_manufacturer_id ?T1_num_of_shops WHERE { ?T1 a :manufacturer . ?T2 a :furniture_manufacte . ?T2 :furniture_manufacte\#ref-manufacturer_id ?T1 .  ?T1 :manufacturer\#manufacturer_id ?T1_manufacturer_id . ?T1 :manufacturer\#num_of_shops ?T1_num_of_shops . ?T2 :furniture_manufacte\#price_in_dollar ?T2_price_in_dollar .        }   ORDER BY DESC (?T2_price_in_dollar) LIMIT 1
manufacturer,Find the number of funiture types produced by each manufacturer as well as the company names.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :furniture_manufacte . ?T2 a :manufacturer . ?T1 :furniture_manufacte\#ref-manufacturer_id ?T2 .  ?T2 :manufacturer\#name ?T2_name .        } GROUP BY ?T2_name
manufacturer,Give me the names and prices of furnitures which some companies are manufacturing.,SELECT ?T1_name ?T2_price_in_dollar WHERE { ?T1 a :furniture . ?T2 a :furniture_manufacte . ?T2 :furniture_manufacte\#ref-furniture_id ?T1 .  ?T1 :furniture\#name ?T1_name . ?T2 :furniture_manufacte\#price_in_dollar ?T2_price_in_dollar .        }
manufacturer,Find the market shares and names of furnitures which no any company is producing in our records.,SELECT ?T1_market_rate ?T1_name WHERE { ?T1 a :furniture . ?T1 :furniture\#market_rate ?T1_market_rate . ?T1 :furniture\#name ?T1_name . ?T1 :furniture\#furniture_id ?T1_furniture_id . FILTER(?T1_furniture_id not in (?T22_furniture_id)) .       {SELECT ?T22_furniture_id WHERE { ?T22 a :furniture_manufacte . ?T22 :furniture_manufacte\#furniture_id ?T22_furniture_id .        }    } }
manufacturer,Find the name of the company that produces both furnitures with less than 6 components and furnitures with more than 10 components.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :manufacturer . ?T13 a :furniture_manufacte . ?T13 :furniture_manufacte\#ref-manufacturer_id ?T1 .  ?T1 :manufacturer\#name ?T1_name . ?T2 :furniture\#num_of_component ?T2_num_of_component . ?T2 a :furniture . ?T13 :furniture_manufacte\#ref-furniture_id ?T2 .  ?T1 :manufacturer\#name ?T1_name . ?T2 :furniture\#num_of_component ?T2_num_of_component . FILTER(?T2_num_of_component < 6) . FILTER (?T1_name in (?T3_name)) .   ?T3 a :manufacturer . ?T15 a :furniture_manufacte . ?T15 :furniture_manufacte\#ref-manufacturer_id ?T3 .  ?T3 :manufacturer\#name ?T3_name . ?T4 :furniture\#num_of_component ?T4_num_of_component . ?T4 a :furniture . ?T15 :furniture_manufacte\#ref-furniture_id ?T4 .  ?T3 :manufacturer\#name ?T3_name . ?T4 :furniture\#num_of_component ?T4_num_of_component .  FILTER(?T4_num_of_component > 10) .             }
hr_1,Display the first name and department name for each employee.,SELECT ?T1_first_name ?T2_department_name WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :employees\#ref-department_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T2 :departments\#department_name ?T2_department_name .        }
hr_1,What are the first name and department name of all employees?,SELECT ?T1_first_name ?T2_department_name WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :employees\#ref-department_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T2 :departments\#department_name ?T2_department_name .        }
hr_1,"List the full name (first and last name), and salary for those employees who earn below 6000.",SELECT ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary < 6000) .        }
hr_1,"Display the first name, and department number for all employees whose last name is 'McEwen'.",SELECT ?T1_first_name ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#last_name ?T1_last_name . FILTER(?T1_last_name = 'McEwen') .        }
hr_1,Return all the information for all employees without any department number.,SELECT (count(*) as ?agg) WHERE {?t1 a :employees . ?t1 :employees\#deparment_id ?t1_department_id . FILTER (?t1_deparment_id =0)}
hr_1,What are all the employees without a department number?,SELECT (count(*) as ?agg) WHERE {?t1 a :employees . ?t1 :employees\#deparment_id ?t1_department_id . FILTER (?t1_deparment_id =0)}
hr_1,Display all the information about the department Marketing.,SELECT * WHERE { ?T1 a :departments . ?T1 :departments\#department_name ?T1_department_name . FILTER(?T1_department_name = 'Marketing') .        }
hr_1,What is all the information about the Marketing department?,SELECT * WHERE { ?T1 a :departments . ?T1 :departments\#department_name ?T1_department_name . FILTER(?T1_department_name = 'Marketing') .        }
hr_1,"display the full name (first and last), hire date, salary, and department number for those employees whose first name does not containing the letter M.",SELECT ?T1_first_name ?T1_last_name ?T1_hire_date ?T1_salary ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#hire_date ?T1_hire_date . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#first_name ?T1_first_name . FILTER(?T1_first_name not like 'M') .        }
hr_1,Return the phone numbers of employees with salaries between 8000 and 12000.,SELECT ?T1_phone_number WHERE { ?T1 a :employees . ?T1 :employees\#phone_number ?T1_phone_number . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary >= 8000 && ?T1_salary <= 12000) .        }
hr_1,display all the information of employees whose salary is in the range of 8000 and 12000 and commission is not null or department number does not equal to 40.,"SELECT (count(*) as ?agg) WHERE {?t1 a :employees .?t1 :employees\#salary ?t1_salary . ?t1 :employees\#commission_pct ?t1_commission_pct .  ?t1 :employees\#deparment_id ?t1_department_id .
FILTER(?t1_salary >= 8000 && ?t1_salary <= 12000) FILTER(?t1_commission_pct = 0) FILTER (?t1_department_id != 40) }"
hr_1,Return the full names and salaries of employees with null commissions.,SELECT ?t1_first_name ?t1_last_name ?t1_salary WHERE {?t1 a :employees .?t1 :employees\#first_name ?t1_first_name . ?t1 :employees\#last_name ?t1_last_name .  ?t1 :employees\#salary ?t1_salary . ?t1 :employees\#commission_pct ?t1_commission_pct . FILTER(?t1_commission_pct = 0)  }
hr_1,"Display the first and last name, and salary for those employees whose first name is ending with the letter m.","SELECT ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#first_name ?T1_first_name . FILTER(contains (?T1_first_name, 'm')) .        }"
hr_1,"Find job id and date of hire for those employees who was hired between November 5th, 2007 and July 5th, 2009.",SELECT ?T1_job_id ?T1_hire_date WHERE { ?T1 a :employees . ?T1 :employees\#job_id ?T1_job_id . ?T1 :employees\#hire_date ?T1_hire_date . ?T1 :employees\#hire_date ?T1_hire_date . FILTER(?T1_hire_date >= 2007-11-05 && ?T1_hire_date <= 2009-07-05) .        }
hr_1,What are the full names of employees who with in department 70 or 90?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_department_id = 70 || ?T1_department_id = 90) .        }
hr_1,Find the salary and manager number for those employees who is working under a manager.,SELECT ?t1_salary ?t1_manager_id WHERE {?t1 a :employees .?t1 :employees\#manager_id ?t1_manager_id .  ?t1 :employees\#salary ?t1_salary . FILTER(?t1_manager_id = 0)  
hr_1,What are the salaries and manager ids for employees who have managers?,SELECT ?t1_salary ?t1_manager_id WHERE {?t1 a :employees .?t1 :employees\#manager_id ?t1_manager_id .  ?t1 :employees\#salary ?t1_salary . FILTER(?t1_manager_id = 0)  
hr_1,display all the details from Employees table for those employees who was hired before 2002-06-21.,SELECT * WHERE { ?T1 a :employees . ?T1 :employees\#hire_date ?T1_hire_date . FILTER(?T1_hire_date < 2002-06-21) .        }
hr_1,display all the information for all employees who have the letters D or S in their first name and also arrange the result in descending order by salary.,"SELECT * WHERE { ?T1 a :employees . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#first_name ?T1_first_name . FILTER(contains (?T1_first_name, 'D') || contains (?T1_first_name, 'S')) .        }  ORDER BY DESC (?T1_salary)"
hr_1,"display those employees who joined after 7th September, 1987.",SELECT * WHERE { ?T1 a :employees . ?T1 :employees\#hire_date ?T1_hire_date . FILTER(?T1_hire_date > 1987-09-07) .        }
hr_1,display the job title of jobs which minimum salary is greater than 9000.,SELECT ?T1_job_title WHERE { ?T1 a :jobs . ?T1 :jobs\#job_title ?T1_job_title . ?T1 :jobs\#min_salary ?T1_min_salary . FILTER(?T1_min_salary > 9000) .        }
hr_1,Which job titles correspond to jobs with salaries over 9000?,SELECT ?T1_job_title WHERE { ?T1 a :jobs . ?T1 :jobs\#job_title ?T1_job_title . ?T1 :jobs\#min_salary ?T1_min_salary . FILTER(?T1_min_salary > 9000) .        }
hr_1,"display job Title, the difference between minimum and maximum salaries for those jobs which max salary within the range 12000 to 18000.",SELECT ?T1_job_title ?T1_max_salary - ?T1_min_salary WHERE { ?T1 a :jobs . ?T1 :jobs\#job_title ?T1_job_title . ?T1 :jobs\#max_salary ?T1_max_salary . ?T1 :jobs\#min_salary ?T1_min_salary . ?T1 :jobs\#max_salary ?T1_max_salary . FILTER(?T1_max_salary >= 12000 && ?T1_max_salary <= 18000) .        }
hr_1,display the emails of the employees who have no commission percentage and salary within the range 7000 to 12000 and works in that department which number is 50.,"SELECT ?t1_email WHERE {?t1 a :employees .?t1 :employees\#email ?t1_salary . ?t1 :employees\#commission_pct ?t1_commission_pct .  ?t1 :employees\#deparment_id ?t1_department_id .
FILTER(?t1_salary >= 8000 && ?t1_salary <= 12000) FILTER(?t1_commission_pct != 0) FILTER (?t1_department_id = 50) }"
hr_1,display the employee ID for each employee and the date on which he ended his previous job.,SELECT ?T1_employee_id (max( ?T1_end_date) as ?aggregation_T1_end_date_196 ) WHERE { ?T1 a :job_history . ?T1 :job_history\#employee_id ?T1_employee_id . ?T1 :job_history\#end_date ?T1_end_date .        } GROUP BY ?T1_employee_id
hr_1,display those departments where more than ten employees work who got a commission percentage.,SELECT ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#commission_pct ?T1_commission_pct .        } GROUP BY ?T1_department_id   HAVING(count( ?T1_commission_pct) as ?aggregation_T1_commission_pct_121 ) > 10)
hr_1,Find the ids of the departments where any manager is managing 4 or more employees.,SELECT DISTINCT ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#employee_id ?T1_employee_id .        } GROUP BY ?T1_department_id   HAVING(count( ?T1_employee_id) as ?aggregation_T1_employee_id_131 ) >= 4)
hr_1,display the average salary of employees for each department who gets a commission percentage.,SELECT ?t1_department_id (AVG(?t1_salary) as ?agg) WHERE {?t1 a :employees .?t1 :employees\#salary ?t1_salary . ?t1 :employees\#commission_pct ?t1_commission_pct .  ?t1 :employees\#deparment_id ?t1_department_id . FILTER(?t1_commission_pct != 0)} GROUP BY ?t1_department_id
hr_1,display the country ID and number of cities for each country.,SELECT ?T1_country_id (count( *) as ?aggregation_all) WHERE { ?T1 a :locations . ?T1 :locations\#country_id ?T1_country_id .        } GROUP BY ?T1_country_id
hr_1,display job ID for those jobs that were done by two or more for more than 300 days.,SELECT ?T1_job_id WHERE { ?T1 a :job_history . ?T1 :job_history\#job_id ?T1_job_id . ?T1 :job_history\#end_date ?T1_end_date . ?T1 :job_history\#start_date ?T1_start_date . FILTER(?T1_end_date - ?T1_start_date > 300) .        } GROUP BY ?T1_job_id   HAVING(count( *)  >= 2)
hr_1,What are the job ids for jobs done more than once for a period of more than 300 days?,SELECT ?T1_job_id WHERE { ?T1 a :job_history . ?T1 :job_history\#job_id ?T1_job_id . ?T1 :job_history\#end_date ?T1_end_date . ?T1 :job_history\#start_date ?T1_start_date . FILTER(?T1_end_date - ?T1_start_date > 300) .        } GROUP BY ?T1_job_id   HAVING(count( *)  >= 2)
hr_1,display the ID for those employees who did two or more jobs in the past.,SELECT ?T1_employee_id WHERE { ?T1 a :job_history . ?T1 :job_history\#employee_id ?T1_employee_id .        } GROUP BY ?T1_employee_id   HAVING(count( *)  >= 2)
hr_1,What are the employee ids for employees who have held two or more jobs?,SELECT ?T1_employee_id WHERE { ?T1 a :job_history . ?T1 :job_history\#employee_id ?T1_employee_id .        } GROUP BY ?T1_employee_id   HAVING(count( *)  >= 2)
hr_1,Find employee with ID and name of the country presently where (s)he is working.,SELECT ?T1_employee_id ?T2_country_name WHERE { ?T1 a :employees . ?T13 a :departments . ?T1 :employees\#ref-department_id ?T13 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :countries\#country_name ?T2_country_name . ?T14 a :locations . ?T13 :departments\#ref-location_id ?T14 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :countries\#country_name ?T2_country_name . ?T2 a :countries . ?T14 :locations\#ref-country_id ?T2 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :countries\#country_name ?T2_country_name .        }
hr_1,display the department name and number of employees in each of the department.,SELECT ?T1_department_name (count( *) as ?aggregation_all) WHERE { ?T1 a :departments . ?T2 a :employees . ?T2 :employees\#ref-department_id ?T1 .  ?T1 :departments\#department_name ?T1_department_name .        } GROUP BY ?T1_department_name
hr_1,display job title and average salary of employees.,SELECT ?T1_job_title (avg( ?T2_salary) as ?aggregation_T2_salary_28 ) WHERE { ?T1 a :jobs . ?T2 a :employees . ?T2 :employees\#ref-job_id ?T1 .  ?T1 :jobs\#job_title ?T1_job_title . ?T2 :employees\#salary ?T2_salary .        } GROUP BY ?T1_job_title
hr_1,What is the average salary for each job title?,SELECT ?T1_job_title (avg( ?T2_salary) as ?aggregation_T2_salary_198 ) WHERE { ?T1 a :jobs . ?T2 a :employees . ?T2 :employees\#ref-job_id ?T1 .  ?T1 :jobs\#job_title ?T1_job_title . ?T2 :employees\#salary ?T2_salary .        } GROUP BY ?T1_job_title
hr_1,Provide the full names of employees earning more than the employee with id 163.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary > (?T22_employee_id)) .       {SELECT ?T22_salary WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary . ?T22 :employees\#employee_id ?T22_employee_id . FILTER(?T22_employee_id = 163) .        }    } }
hr_1,return the smallest salary for every departments.,SELECT (min( ?T1_salary) as ?aggregation_T1_salary_22 ) ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id .        } GROUP BY ?T1_department_id
hr_1,What is the minimum salary in each department?,SELECT (min( ?T1_salary) as ?aggregation_T1_salary_7 ) ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id .        } GROUP BY ?T1_department_id
hr_1,Find the first name and last name and department id for those employees who earn such amount of salary which is the smallest salary of any of the departments.,SELECT ?T1_first_name ?T1_last_name ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary in (?aggregation_T22_salary_83)) .       {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_83 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } }
hr_1,What are the full names and department ids for the lowest paid employees across all departments.,SELECT ?T1_first_name ?T1_last_name ?T1_department_id WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary in (?aggregation_T22_salary_140)) .       {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_140 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } }
hr_1,Find the employee id for all employees who earn more than the average salary.,SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary > (?aggregation_T22_salary_176)) .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_176 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } }
hr_1,What are the employee ids for employees who make more than the average?,SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary > (?aggregation_T22_salary_184)) .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_184 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } }
hr_1,display the employee id and salary of all employees who report to Payam (first name).,SELECT ?T1_employee_id ?T1_salary WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#manager_id ?T1_manager_id . FILTER(?T1_manager_id = (?T22_first_name)) .       {SELECT ?T22_employee_id WHERE { ?T22 a :employees . ?T22 :employees\#employee_id ?T22_employee_id . ?T22 :employees\#first_name ?T22_first_name . FILTER(?T22_first_name = 'Payam') .        }    } }
hr_1,find the name of all departments that do actually have one or more employees assigned to them.,SELECT DISTINCT ?T1_department_name WHERE { ?T1 a :departments . ?T1 :departments\#department_name ?T1_department_name .        }
hr_1,get the details of employees who manage a department.,"SELECT DISTINCT * WHERE { ?T1 a :departments . ?T2 a :employees . ?T2 :employees\#ref-department_id ?T1 .  ?T2 :employees\#employee_id ?T2_employee_id . FILTER(?T2_employee_id = [0, 6, False]) .        }"
hr_1,What is all the information regarding employees who are managers?,"SELECT DISTINCT * WHERE { ?T1 a :departments . ?T2 a :employees . ?T2 :employees\#ref-department_id ?T1 .  ?T2 :employees\#employee_id ?T2_employee_id . FILTER(?T2_employee_id = [0, 6, False]) .        }"
hr_1,Find the job ID for those jobs which average salary is above 8000.,SELECT ?T1_job_id WHERE { ?T1 a :employees . ?T1 :employees\#job_id ?T1_job_id . ?T1 :employees\#salary ?T1_salary .        } GROUP BY ?T1_job_id   HAVING(avg( ?T1_salary)  > 8000)
hr_1,display the employee ID and job name for all those jobs in department 80.,SELECT ?T1_employee_id ?T2_job_title WHERE { ?T1 a :employees . ?T2 a :jobs . ?T1 :employees\#ref-job_id ?T2 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :jobs\#job_title ?T2_job_title . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_department_id = 80) .        }
hr_1,what are the employee ids and job titles for employees in department 80?,SELECT ?T1_employee_id ?T2_job_title WHERE { ?T1 a :employees . ?T2 a :jobs . ?T1 :employees\#ref-job_id ?T2 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :jobs\#job_title ?T2_job_title . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_department_id = 80) .        }
hr_1,Give the first name and job id for all employees in the Finance department.,SELECT ?T1_first_name ?T1_job_id WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :employees\#ref-department_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#job_id ?T1_job_id . ?T2 :departments\#department_name ?T2_department_name . FILTER(?T2_department_name = 'Finance') .        }
hr_1,display all the information of the employees whose salary if within the range of smallest salary and 2500.,SELECT * WHERE { ?T1 a :employees . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary between (?aggregation_T22_salary_91)) .       {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_91 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } }
hr_1,Find the ids of the employees who does not work in those departments where some employees works whose manager id within the range 100 and 200.,SELECT * WHERE { ?T1 a :employees . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_department_id not in (?T22_manager_id)) .       {SELECT ?T22_department_id WHERE { ?T22 a :departments . ?T22 :departments\#department_id ?T22_department_id . ?T22 :departments\#manager_id ?T22_manager_id . FILTER(?T22_manager_id >= 100 && ?T22_manager_id <= 200) .        }    } }
