kg_name,question,query
restaurants,where are some restaurants good for arabic food in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,what are some good places in mountain view for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where are some good arabic restaurants in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,show me a good arabic restaurant in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good arabic in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good arabic restaurant in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good place in mountain view for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where are some good arabics in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a restaurant in mountain view that serves good arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,what are some good restaurants in mountain view for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some restaurants good for arabic food in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where can i eat some good arabic food in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some good places for arabic in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good arabic in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a restaurant in mountain view that serves good arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some good arabic restaurants in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where are some good places for arabic in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some good arabics in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good restaurant in mountain view for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good arabic restaurant in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,what are some good places for arabic in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good restaurant in mountain view for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good place in mountain view for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where can i find a jamerican cuisine in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#name ?T2_name . FILTER(?T1_city_name = 'san francisco' && ?T2_name = 'jamerican cuisine') .        }
restaurants,where is jamerican cuisine in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#name ?T2_name . FILTER(?T1_city_name = 'san francisco' && ?T2_name = 'jamerican cuisine') .        }
restaurants,where is a jamerican cuisine in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#name ?T2_name . FILTER(?T1_city_name = 'san francisco' && ?T2_name = 'jamerican cuisine') .        }
restaurants,where can we find some restaurants in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . FILTER(?T2_city_name in (?T23_region)) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'bay area') .        }    } }
restaurants,give me some restaurants in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . FILTER(?T2_city_name in (?T23_region)) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'bay area') .        }    } }
restaurants,give me a restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . FILTER(?T2_city_name in (?T23_region)) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'bay area') .        }    } }
restaurants,where can i find a restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . FILTER(?T2_city_name in (?T23_region)) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'bay area') .        }    } }
restaurants,give me a good restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T2_city_name in (?T23_region) && ?T2_rating > 2.5) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'region0') .        }    } }
restaurants,what are some good restaurants in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T2_city_name in (?T23_region) && ?T2_rating > 2.5) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'region0') .        }    } }
restaurants,give me some good restaurants in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T2_city_name in (?T23_region) && ?T2_rating > 2.5) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'region0') .        }    } }
restaurants,what is a good restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#city_name ?T2_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T2_city_name in (?T23_region) && ?T2_rating > 2.5) .       {SELECT ?T23_city_name WHERE { ?T23 a :geographic . ?T23 :geographic\#city_name ?T23_city_name . ?T23 :geographic\#region ?T23_region . FILTER(?T23_region = 'region0') .        }    } }