kg_name,question,query
swimming,Find the name of the swimmer who has at least 2 records.,SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\#ref-swimmer_id ?T1 .  ?T1 :swimmer\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
swimming,"Find the name and nationality of the swimmer who has won (i.e., has a result of 'win') more than 1 time.",SELECT ?T1_name ?T1_nationality WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\#ref-swimmer_id ?T1 .  ?T1 :swimmer\#name ?T1_name . ?T1 :swimmer\#nationality ?T1_nationality . ?T2 :record\#result ?T2_result . FILTER(?T2_result = 'Win') .        } GROUP BY ?T1_name ?T1_nationality   HAVING(count( *)  > 1)
swimming,Find the names of the swimmers who have no record.,SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T1 :swimmer\#name ?T1_name . ?T1 :swimmer\#id ?T1_id . FILTER(?T1_id not in (?T22_swimmer_id)) .       {SELECT ?T22_swimmer_id WHERE { ?T22 a :record . ?T22 :record\#swimmer_id ?T22_swimmer_id .        }    } }
swimming,Find the names of the swimmers who have both 'win' and 'loss' results in the record.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\#ref-swimmer_id ?T1 .  ?T1 :swimmer\#name ?T1_name . ?T2 :record\#result ?T2_result . FILTER(?T2_result = 'Win') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :swimmer . ?T4 a :record . ?T4 :record\#ref-swimmer_id ?T3 .  ?T3 :swimmer\#name ?T3_name . ?T4 :record\#result ?T4_result .  FILTER(?T4_result = 'Loss') .             }
swimming,Find the names of stadiums that some Australian swimmers have been to.,SELECT ?T1_name WHERE { ?T1 a :stadium . ?T13 a :event . ?T13 :event\#ref-stadium_id ?T1 .  ?T1 :stadium\#name ?T1_name . ?T2 :swimmer\#nationality ?T2_nationality . ?T14 a :record . ?T14 :record\#ref-event_id ?T13 .  ?T1 :stadium\#name ?T1_name . ?T2 :swimmer\#nationality ?T2_nationality . ?T2 a :swimmer . ?T14 :record\#ref-swimmer_id ?T2 .  ?T1 :stadium\#name ?T1_name . ?T2 :swimmer\#nationality ?T2_nationality . FILTER(?T2_nationality = 'Australia') .        }
swimming,Find the names of stadiums that the most swimmers have been to.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T13 a :event . ?T13 :event\#ref-stadium_id ?T1 .  ?T1 :stadium\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
swimming,Find all details for each swimmer.,SELECT * WHERE { ?T1 a :swimmer .        }
railway,How many railways are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :railway .        }
railway,List the builders of railways in ascending alphabetical order.,SELECT ?T1_builder WHERE { ?T1 a :railway . ?T1 :railway\#builder ?T1_builder . ?T1 :railway\#builder ?T1_builder .        }  ORDER BY ASC (?T1_builder)
railway,List the wheels and locations of the railways.,SELECT ?T1_wheels ?T1_location WHERE { ?T1 a :railway . ?T1 :railway\#wheels ?T1_wheels . ?T1 :railway\#location ?T1_location .        }
railway,What is the maximum level of managers in countries that are not 'Australia'?,SELECT (max( ?T1_level) as ?aggregation_T1_level_100 ) WHERE { ?T1 a :manager . ?T1 :manager\#level ?T1_level . ?T1 :manager\#country ?T1_country . FILTER(?T1_country != 'Australia ') .        }
railway,What is the average age for all managers?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_12 ) WHERE { ?T1 a :manager . ?T1 :manager\#age ?T1_age .        }
railway,What are the names of managers in ascending order of level?,SELECT ?T1_name WHERE { ?T1 a :manager . ?T1 :manager\#name ?T1_name . ?T1 :manager\#level ?T1_level .        }  ORDER BY ASC (?T1_level)
railway,What are the names and arrival times of trains?,SELECT ?T1_name ?T1_arrival WHERE { ?T1 a :train . ?T1 :train\#name ?T1_name . ?T1 :train\#arrival ?T1_arrival .        }
railway,What is the name of the oldest manager?,SELECT ?T1_name WHERE { ?T1 a :manager . ?T1 :manager\#name ?T1_name . ?T1 :manager\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
railway,Show the names of trains and locations of railways they are in.,SELECT ?T1_name ?T2_location WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :train\#ref-railway_id ?T2 .  ?T1 :train\#name ?T1_name . ?T2 :railway\#location ?T2_location .        }
railway,Show the builder of railways associated with the trains named 'Andaman Exp'.,SELECT ?T1_builder WHERE { ?T1 a :railway . ?T2 a :train . ?T2 :train\#ref-railway_id ?T1 .  ?T1 :railway\#builder ?T1_builder . ?T2 :train\#name ?T2_name . FILTER(?T2_name = 'Andaman Exp') .        }
railway,Show id and location of railways that are associated with more than one train.,SELECT ?T1_railway_id ?T2_location WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :train\#ref-railway_id ?T2 .  ?T1 :train\#railway_id ?T1_railway_id . ?T2 :railway\#location ?T2_location .        } GROUP BY ?T1_railway_id ?T2_location   HAVING(count( *)  > 1)
railway,Show the id and builder of the railway that are associated with the most trains.,SELECT ?T1_railway_id (count( *) as ?aggregation_all) ?T2_builder WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :train\#ref-railway_id ?T2 .  ?T1 :train\#railway_id ?T1_railway_id . ?T2 :railway\#builder ?T2_builder .        } GROUP BY ?T1_railway_id ?T2_builder  ORDER BY DESC (?aggregation_all) LIMIT 1
railway,"Show different builders of railways, along with the corresponding number of railways using each builder.",SELECT ?T1_builder (count( *) as ?aggregation_all) WHERE { ?T1 a :railway . ?T1 :railway\#builder ?T1_builder .        } GROUP BY ?T1_builder
railway,Show the most common builder of railways.,SELECT ?T1_builder (count( *) as ?aggregation_all) WHERE { ?T1 a :railway . ?T1 :railway\#builder ?T1_builder .        } GROUP BY ?T1_builder  ORDER BY DESC (?aggregation_all) LIMIT 1
railway,Show different locations of railways along with the corresponding number of railways at each location.,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :railway . ?T1 :railway\#location ?T1_location .        } GROUP BY ?T1_location
railway,Show the locations that have more than one railways.,SELECT ?T1_location WHERE { ?T1 a :railway . ?T1 :railway\#location ?T1_location .        } GROUP BY ?T1_location   HAVING(count( *)  > 1)
railway,List the object number of railways that do not have any trains.,SELECT ?T1_objectnumber WHERE { ?T1 a :railway . ?T1 :railway\#objectnumber ?T1_objectnumber . ?T1 :railway\#railway_id ?T1_railway_id . FILTER(?T1_railway_id not in (?T22_railway_id)) .       {SELECT ?T22_railway_id WHERE { ?T22 a :train . ?T22 :train\#railway_id ?T22_railway_id .        }    } }
railway,Show the countries that have both managers of age above 50 and managers of age below 46.,SELECT DISTINCT ?T1_country WHERE { ?T1 a :manager . ?T1 :manager\#country ?T1_country . ?T1 :manager\#age ?T1_age . FILTER(?T1_age > 50) . FILTER (?T1_country in (?T2_country)) .   ?T2 a :manager . ?T2 :manager\#country ?T2_country . ?T2 :manager\#age ?T2_age .  FILTER(?T2_age < 46) .             }
railway,Show the distinct countries of managers.,SELECT DISTINCT ?T1_country WHERE { ?T1 a :manager . ?T1 :manager\#country ?T1_country .        }
railway,Show the working years of managers in descending order of their level.,SELECT ?T1_working_year_starts WHERE { ?T1 a :manager . ?T1 :manager\#working_year_starts ?T1_working_year_starts . ?T1 :manager\#level ?T1_level .        }  ORDER BY DESC (?T1_level)
railway,Show the countries that have managers of age above 50 or below 46.,SELECT ?T1_country WHERE { ?T1 a :manager . ?T1 :manager\#country ?T1_country . ?T1 :manager\#age ?T1_age . ?T1 :manager\#age ?T1_age . FILTER(?T1_age > 50 || ?T1_age < 46) .        }
customers_and_products_contacts,How many addresses are there in country USA?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\#country ?T1_country . FILTER(?T1_country = 'USA') .        }
customers_and_products_contacts,Show each state and the number of addresses in each state.,SELECT ?T1_state_province_county (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county .        } GROUP BY ?T1_state_province_county
customers_and_products_contacts,Show names and phones of customers who do not have address information.,SELECT ?T1_customer_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :customer_address_history . ?T22 :customer_address_history\#customer_id ?T22_customer_id .        }    } }
customers_and_products_contacts,Show the name of the customer who has the most orders.,SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_products_contacts,Show the names of customers who have both an order in completed status and an order in part status.,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :customer_orders\#order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'Completed') . FILTER (?T1_customer_name in (?T3_customer_name)) .   ?T3 a :customers . ?T4 a :customer_orders . ?T4 :customer_orders\#ref-customer_id ?T3 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :customer_orders\#order_status_code ?T4_order_status_code .  FILTER(?T4_order_status_code = 'Part') .             }
customers_and_products_contacts,"Show the name, phone, and payment method code for all customers in descending order of customer number.",SELECT ?T1_customer_name ?T1_customer_phone ?T1_payment_method_code WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#payment_method_code ?T1_payment_method_code . ?T1 :customers\#customer_number ?T1_customer_number .        }  ORDER BY DESC (?T1_customer_number)
customers_and_products_contacts,Show the product name and total order quantity for each product.,SELECT ?T1_product_name (sum( ?T2_order_quantity) as ?aggregation_T2_order_quantity_105 ) WHERE { ?T1 a :products . ?T2 a :order_items . ?T2 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :order_items\#order_quantity ?T2_order_quantity .        } GROUP BY ?T1_product_name
customers_and_products_contacts,"Show the minimum, maximum, average price for all products.",SELECT (min( ?T1_product_price) as ?aggregation_T1_product_price_153 ) (max( ?T1_product_price) as ?aggregation_T1_product_price_66 ) (avg( ?T1_product_price) as ?aggregation_T1_product_price_45 ) WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price .        }
customers_and_products_contacts,How many products have a price higher than the average?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price > (?aggregation_T22_product_price_136)) .       {SELECT (avg( ?T22_product_price) as ?aggregation_T22_product_price_136 ) WHERE { ?T22 a :products . ?T22 :products\#product_price ?T22_product_price .        }    } }
customers_and_products_contacts,"Show the customer name, customer address city, date from, and date to for each customer address history.",SELECT ?T1_customer_name ?T2_city ?T3_date_from ?T3_date_to WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\#ref-address_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :addresses\#city ?T2_city . ?T3 :customer_address_history\#date_from ?T3_date_from . ?T3 :customer_address_history\#date_to ?T3_date_to . ?T3 a :customer_address_history . ?T3 :customer_address_history\#ref-address_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :addresses\#city ?T2_city . ?T3 :customer_address_history\#date_from ?T3_date_from . ?T3 :customer_address_history\#date_to ?T3_date_to .        }
customers_and_products_contacts,Show the names of customers who use Credit Card payment method and have more than 2 orders.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#payment_method_code ?T1_payment_method_code . FILTER(?T1_payment_method_code = 'Credit Card') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  > 2)
customers_and_products_contacts,What are the name and phone of the customer with the most ordered product quantity?,SELECT ?T1_customer_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :order_items\#order_quantity ?T2_order_quantity . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :order_items\#order_quantity ?T2_order_quantity .        } GROUP BY ?T1_customer_name ?T1_customer_phone  ORDER BY DESC ((sum( ?T2_order_quantity) as ?aggregation_T2_order_quantity_17 )) LIMIT 1
customers_and_products_contacts,Show the product type and name for the products with price higher than 1000 or lower than 500.,SELECT ?T1_product_type_code ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price > 1000 || ?T1_product_price < 500) .        }
dorm_1,Find the name of dorms only for female (F gender).,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#gender ?T1_gender . FILTER(?T1_gender = 'F') .        }
dorm_1,What are the names of the all-female dorms?,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#gender ?T1_gender . FILTER(?T1_gender = 'F') .        }
dorm_1,Find the name of dorms that can accommodate more than 300 students.,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#student_capacity ?T1_student_capacity . FILTER(?T1_student_capacity > 300) .        }
dorm_1,How many female students (sex is F) whose age is below 25?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#sex ?T1_sex . ?T1 :student\#age ?T1_age . FILTER(?T1_sex = 'F' && ?T1_age < 25) .        }
dorm_1,How many girl students who are younger than 25?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#sex ?T1_sex . ?T1 :student\#age ?T1_age . FILTER(?T1_sex = 'F' && ?T1_age < 25) .        }
dorm_1,Find the first name of students who is older than 20.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age . FILTER(?T1_age > 20) .        }
dorm_1,What are the first names of all students who are older than 20?,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age . FILTER(?T1_age > 20) .        }
dorm_1,Find the first name of students living in city PHL whose age is between 20 and 25.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#city_code ?T1_city_code . ?T1 :student\#age ?T1_age . FILTER(?T1_city_code = 'PHL' && ?T1_age >= 20 && ?T1_age <= 25) .        }
dorm_1,How many dorms are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm .        }
dorm_1,How many dorms are in the database?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm .        }
dorm_1,Find the number of distinct amenities.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm_amenity .        }
dorm_1,How many diffrent dorm amenities are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm_amenity .        }
dorm_1,Find the total capacity of all dorms.,SELECT (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_114 ) WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity .        }
dorm_1,What is the total student capacity of all dorms?,SELECT (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_19 ) WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity .        }
dorm_1,How many students are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student .        }
dorm_1,How many students exist?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student .        }
dorm_1,Find the average age of all students living in the each city.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_85 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code
dorm_1,What is the average age for each city and what are those cities?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_113 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code
dorm_1,Find the average and total capacity of dorms for the students with gender X.,SELECT (avg( ?T1_student_capacity) as ?aggregation_T1_student_capacity_88 ) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_187 ) WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#gender ?T1_gender . FILTER(?T1_gender = 'X') .        }
dorm_1,What is the average and total capacity for all dorms who are of gender X?,SELECT (avg( ?T1_student_capacity) as ?aggregation_T1_student_capacity_128 ) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_52 ) WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#gender ?T1_gender . FILTER(?T1_gender = 'X') .        }
dorm_1,Find the number of dorms that have some amenity.,SELECT DISTINCT (count(DISTINCT ?T1_dormid) as ?aggregation_T1_dormid_54 ) WHERE { ?T1 a :has_amenity . ?T1 :has_amenity\#dormid ?T1_dormid .        }
dorm_1,How many dorms have amenities?,SELECT DISTINCT (count(DISTINCT ?T1_dormid) as ?aggregation_T1_dormid_43 ) WHERE { ?T1 a :has_amenity . ?T1 :has_amenity\#dormid ?T1_dormid .        }
dorm_1,Find the name of dorms that do not have any amenity,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#dormid ?T1_dormid . FILTER(?T1_dormid not in (?T22_dormid)) .       {SELECT ?T22_dormid WHERE { ?T22 a :has_amenity . ?T22 :has_amenity\#dormid ?T22_dormid .        }    } }
dorm_1,What are the names of all the dorms that don't have any amenities?,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#dormid ?T1_dormid . FILTER(?T1_dormid not in (?T22_dormid)) .       {SELECT ?T22_dormid WHERE { ?T22 a :has_amenity . ?T22 :has_amenity\#dormid ?T22_dormid .        }    } }
dorm_1,Find the number of distinct gender for dorms.,SELECT DISTINCT (count(DISTINCT ?T1_gender) as ?aggregation_T1_gender_171 ) WHERE { ?T1 a :dorm . ?T1 :dorm\#gender ?T1_gender .        }
dorm_1,How many different genders are there in the dorms?,SELECT DISTINCT (count(DISTINCT ?T1_gender) as ?aggregation_T1_gender_43 ) WHERE { ?T1 a :dorm . ?T1 :dorm\#gender ?T1_gender .        }
dorm_1,Find the capacity and gender type of the dorm whose name has substring Donor.,"SELECT ?T1_student_capacity ?T1_gender WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#gender ?T1_gender . ?T1 :dorm\#dorm_name ?T1_dorm_name . FILTER(contains (?T1_dorm_name, 'Donor')) .        }"
dorm_1,Find the name and gender type of the dorms whose capacity is greater than 300 or less than 100.,SELECT ?T1_dorm_name ?T1_gender WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#gender ?T1_gender . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#student_capacity ?T1_student_capacity . FILTER(?T1_student_capacity > 300 || ?T1_student_capacity < 100) .        }
dorm_1,Find the numbers of different majors and cities.,SELECT DISTINCT (count(DISTINCT ?T1_major) as ?aggregation_T1_major_25 ) (count(DISTINCT ?T1_city_code) as ?aggregation_T1_city_code_193 ) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major . ?T1 :student\#city_code ?T1_city_code .        }
dorm_1,Find the name of dorms which have both TV Lounge and Study Room as amenities.,SELECT DISTINCT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-dormid ?T1 .  ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T2 :dorm_amenity\#amenity_name ?T2_amenity_name . ?T2 a :dorm_amenity . ?T13 :has_amenity\#ref-amenid ?T2 .  ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T2 :dorm_amenity\#amenity_name ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') . FILTER (?T1_dorm_name in (?T3_dorm_name)) .   ?T3 a :dorm . ?T15 a :has_amenity . ?T15 :has_amenity\#ref-dormid ?T3 .  ?T3 :dorm\#dorm_name ?T3_dorm_name . ?T4 :dorm_amenity\#amenity_name ?T4_amenity_name . ?T4 a :dorm_amenity . ?T15 :has_amenity\#ref-amenid ?T4 .  ?T3 :dorm\#dorm_name ?T3_dorm_name . ?T4 :dorm_amenity\#amenity_name ?T4_amenity_name .  FILTER(?T4_amenity_name = 'Study Room') .             }
dorm_1,Find the name of dorms which have TV Lounge but no Study Room as amenity.,SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a :dorm . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-dormid ?T1 .  ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T2 :dorm_amenity\#amenity_name ?T2_amenity_name . ?T2 a :dorm_amenity . ?T13 :has_amenity\#ref-amenid ?T2 .  ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T2 :dorm_amenity\#amenity_name ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') .   }}  MINUS {SELECT (?T3_dorm_name as ?col1) WHERE { ?T3 a :dorm . ?T15 a :has_amenity . ?T15 :has_amenity\#ref-dormid ?T3 .  ?T3 :dorm\#dorm_name ?T3_dorm_name . ?T4 :dorm_amenity\#amenity_name ?T4_amenity_name . ?T4 a :dorm_amenity . ?T15 :has_amenity\#ref-amenid ?T4 .  ?T3 :dorm\#dorm_name ?T3_dorm_name . ?T4 :dorm_amenity\#amenity_name ?T4_amenity_name . FILTER(?T4_amenity_name = 'Study Room') .        }     } }
dorm_1,What is the name of each dorm that has a TV Lounge but no study rooms?,SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a :dorm . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-dormid ?T1 .  ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T2 :dorm_amenity\#amenity_name ?T2_amenity_name . ?T2 a :dorm_amenity . ?T13 :has_amenity\#ref-amenid ?T2 .  ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T2 :dorm_amenity\#amenity_name ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') .   }}  MINUS {SELECT (?T3_dorm_name as ?col1) WHERE { ?T3 a :dorm . ?T15 a :has_amenity . ?T15 :has_amenity\#ref-dormid ?T3 .  ?T3 :dorm\#dorm_name ?T3_dorm_name . ?T4 :dorm_amenity\#amenity_name ?T4_amenity_name . ?T4 a :dorm_amenity . ?T15 :has_amenity\#ref-amenid ?T4 .  ?T3 :dorm\#dorm_name ?T3_dorm_name . ?T4 :dorm_amenity\#amenity_name ?T4_amenity_name . FILTER(?T4_amenity_name = 'Study Room') .        }     } }
dorm_1,Find the last name of students who is either female (sex is F) and living in the city of code BAL or male (sex is M) and in age of below 20.,SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#sex ?T1_sex . ?T1 :student\#city_code ?T1_city_code . FILTER(?T1_sex = 'F' && ?T1_city_code = 'BAL') .   }} UNION {SELECT (?T1_lname as ?col1) WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#sex ?T1_sex . ?T1 :student\#age ?T1_age . FILTER(?T1_sex = 'M' && ?T1_age < 20) .        }      } }
dorm_1,Find the name of the dorm with the largest capacity.,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#student_capacity ?T1_student_capacity .        }   ORDER BY DESC (?T1_student_capacity) LIMIT 1
dorm_1,What are the names of the dorm with the largest capacity?,SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#student_capacity ?T1_student_capacity .        }   ORDER BY DESC (?T1_student_capacity) LIMIT 1
dorm_1,List in alphabetic order all different amenities.,SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name .        }  ORDER BY ASC (?T1_amenity_name)
dorm_1,What are the different dorm amenity names in alphabetical order?,SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name .        }  ORDER BY ASC (?T1_amenity_name)
dorm_1,What is the code of the city with the most students?,SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code  ORDER BY DESC (?aggregation_all) LIMIT 1
dorm_1,Find the first and last name of students whose age is younger than the average age.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . FILTER(?T1_age < (?aggregation_T22_age_173)) .       {SELECT (avg( ?T22_age) as ?aggregation_T22_age_173 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } }
dorm_1,"List the first and last name of students who are not living in the city with code HKG, and sorted the results by their ages.",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code . FILTER(?T1_city_code != 'HKG') .        }  ORDER BY ASC (?T1_age)
dorm_1,"List name of all amenities which Anonymous Donor Hall has, and sort the results in alphabetic order.",SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :has_amenity\#ref-dormid ?T2 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Anonymous Donor Hall') .        }  ORDER BY ASC (?T1_amenity_name)
dorm_1,Find the number of dorms and total capacity for each gender.,SELECT (count( *) as ?aggregation_all) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_96 ) ?T1_gender WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#gender ?T1_gender .        } GROUP BY ?T1_gender
dorm_1,How many dorms are there and what is the total capacity for each gender?,SELECT (count( *) as ?aggregation_all) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_64 ) ?T1_gender WHERE { ?T1 a :dorm . ?T1 :dorm\#student_capacity ?T1_student_capacity . ?T1 :dorm\#gender ?T1_gender .        } GROUP BY ?T1_gender
dorm_1,Find the average and oldest age for students with different sex.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_105 ) (max( ?T1_age) as ?aggregation_T1_age_144 ) ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex .        } GROUP BY ?T1_sex
dorm_1,What is the average and oldest age for each gender of student?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_93 ) (max( ?T1_age) as ?aggregation_T1_age_145 ) ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex .        } GROUP BY ?T1_sex
dorm_1,Find the number of students in each major.,SELECT (count( *) as ?aggregation_all) ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major
dorm_1,How many students are there in each major?,SELECT (count( *) as ?aggregation_all) ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major
dorm_1,Find the number and average age of students living in each city.,SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_86 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code
dorm_1,How many students live in each city and what are their average ages?,SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_165 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code
dorm_1,Find the average age and number of male students (with sex M) from each city.,SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_16 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        } GROUP BY ?T1_city_code
dorm_1,What is the average age and how many male students are there in each city?,SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_77 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        } GROUP BY ?T1_city_code
dorm_1,Find the number of students for the cities where have more than one student.,SELECT (count( *) as ?aggregation_all) ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code   HAVING(count( *)  > 1)
dorm_1,Find the first and last name of students who are not in the largest major.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#major ?T1_major . FILTER(?T1_major != (?T22_major)) .       {SELECT ?T22_major (count( *) as ?aggregation_all) WHERE { ?T22 a :student . ?T22 :student\#major ?T22_major .        } GROUP BY ?T22_major  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
dorm_1,Find the number of students whose age is older than the average age for each gender.,SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#sex ?T1_sex . ?T1 :student\#age ?T1_age . FILTER(?T1_age > (?aggregation_T22_age_129)) .       {SELECT (avg( ?T22_age) as ?aggregation_T22_age_129 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } } GROUP BY ?T1_sex
dorm_1,How many students are older than average for each gender?,SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#sex ?T1_sex . ?T1 :student\#age ?T1_age . FILTER(?T1_age > (?aggregation_T22_age_161)) .       {SELECT (avg( ?T22_age) as ?aggregation_T22_age_161 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } } GROUP BY ?T1_sex
dorm_1,Find the average age of students living in each dorm and the name of dorm.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_171 ) ?T2_dorm_name WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :dorm\#dorm_name ?T2_dorm_name .        } GROUP BY ?T2_dorm_name
