kg_name,question,query
cre_drama_workshop_groups,"List the description, code and the number of services for each service type.",SELECT ?T1_service_type_description ?T2_service_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_service_types . ?T2 a :services . ?T2 :services\#ref-service_type_code ?T1 .  ?T1 :ref_service_types\#service_type_description ?T1_service_type_description . ?T2 :services\#service_type_code ?T2_service_type_code .        } GROUP BY ?T1_service_type_description ?T2_service_type_code
cre_drama_workshop_groups,What is the description and code of the type of service that is performed the most often?,SELECT ?T1_service_type_description (count( *) as ?aggregation_all) ?T1_service_type_code WHERE { ?T1 a :ref_service_types . ?T2 a :services . ?T2 :services\#ref-service_type_code ?T1 .  ?T1 :ref_service_types\#service_type_description ?T1_service_type_description . ?T1 :ref_service_types\#service_type_code ?T1_service_type_code .        } GROUP BY ?T1_service_type_description ?T1_service_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_drama_workshop_groups,Give me all the phone numbers and email addresses of the workshop groups where services are performed.,SELECT ?T1_store_phone ?T1_store_email_address WHERE { ?T1 a :drama_workshop_groups . ?T1 :drama_workshop_groups\#store_phone ?T1_store_phone . ?T1 :drama_workshop_groups\#store_email_address ?T1_store_email_address .        }
cre_drama_workshop_groups,What are the names of workshop groups in which services with product name 'film' are performed?,SELECT ?T1_store_phone ?T1_store_email_address WHERE { ?T1 a :drama_workshop_groups . ?T2 a :services . ?T2 :services\#ref-workshop_group_id ?T1 .  ?T1 :drama_workshop_groups\#store_phone ?T1_store_phone . ?T1 :drama_workshop_groups\#store_email_address ?T1_store_email_address . ?T2 :services\#product_name ?T2_product_name . FILTER(?T2_product_name = 'film') .        }
cre_drama_workshop_groups,"For each distinct product name, show its average product price.",SELECT ?T1_product_name (avg( ?T1_product_price) as ?aggregation_T1_product_price_150 ) WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_name
cre_drama_workshop_groups,Find the product names whose average product price is below 1000000.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_name   HAVING(avg( ?T1_product_price)  < 1000000)
cre_drama_workshop_groups,What are the total order quantities of photo products?,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_16 ) WHERE { ?T1 a :order_items . ?T2 a :products . ?T1 :order_items\#ref-product_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'photo') .        }
cre_drama_workshop_groups,Compute the total order quantities of the product 'photo'.,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_150 ) WHERE { ?T1 a :order_items . ?T2 a :products . ?T1 :order_items\#ref-product_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'photo') .        }
cre_drama_workshop_groups,What are the order details of the products with price higher than 2000?,SELECT ?T1_other_item_details WHERE { ?T1 a :order_items . ?T2 a :products . ?T1 :order_items\#ref-product_id ?T2 .  ?T1 :order_items\#other_item_details ?T1_other_item_details . ?T2 :products\#product_price ?T2_product_price . FILTER(?T2_product_price > 2000) .        }
cre_drama_workshop_groups,What are the actual delivery dates of orders with quantity 1?,SELECT ?T1_actual_delivery_date WHERE { ?T1 a :customer_orders . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T1 .  ?T1 :customer_orders\#actual_delivery_date ?T1_actual_delivery_date . ?T2 :order_items\#order_quantity ?T2_order_quantity . FILTER(?T2_order_quantity = 1) .        }
cre_drama_workshop_groups,What are the order dates of orders with price higher than 1000?,SELECT ?T1_order_date WHERE { ?T1 a :customer_orders . ?T13 a :order_items . ?T13 :order_items\#ref-order_id ?T1 .  ?T1 :customer_orders\#order_date ?T1_order_date . ?T2 :products\#product_price ?T2_product_price . ?T2 a :products . ?T13 :order_items\#ref-product_id ?T2 .  ?T1 :customer_orders\#order_date ?T1_order_date . ?T2 :products\#product_price ?T2_product_price . FILTER(?T2_product_price > 1000) .        }
cre_drama_workshop_groups,Find the number of distinct currency codes used in drama workshop groups.,SELECT DISTINCT (count(DISTINCT ?T1_currency_code) as ?aggregation_T1_currency_code_52 ) WHERE { ?T1 a :drama_workshop_groups . ?T1 :drama_workshop_groups\#currency_code ?T1_currency_code .        }
cre_drama_workshop_groups,Return the the names of the drama workshop groups that are located in Feliciaberg city.,SELECT ?T1_store_name WHERE { ?T1 a :drama_workshop_groups . ?T2 a :addresses . ?T1 :drama_workshop_groups\#ref-address_id ?T2 .  ?T1 :drama_workshop_groups\#store_name ?T1_store_name . ?T2 :addresses\#city_town ?T2_city_town . FILTER(?T2_city_town = 'Feliciaberg') .        }
cre_drama_workshop_groups,List the email addresses of the drama workshop groups located in Alaska state.,SELECT ?T1_store_email_address WHERE { ?T1 a :drama_workshop_groups . ?T2 a :addresses . ?T1 :drama_workshop_groups\#ref-address_id ?T2 .  ?T1 :drama_workshop_groups\#store_email_address ?T1_store_email_address . ?T2 :addresses\#state_county ?T2_state_county . FILTER(?T2_state_county = 'Alaska') .        }
cre_drama_workshop_groups,Show all cities along with the number of drama workshop groups in each city.,SELECT ?T1_city_town (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :drama_workshop_groups . ?T2 :drama_workshop_groups\#ref-address_id ?T1 .  ?T1 :addresses\#city_town ?T1_city_town .        } GROUP BY ?T1_city_town
cre_drama_workshop_groups,Which marketing region has the most drama workshop groups? Give me the region code.,SELECT ?T1_marketing_region_code (count( *) as ?aggregation_all) WHERE { ?T1 a :drama_workshop_groups . ?T1 :drama_workshop_groups\#marketing_region_code ?T1_marketing_region_code .        } GROUP BY ?T1_marketing_region_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_drama_workshop_groups,Show all cities where at least one customer lives in but no performer lives in.,SELECT distinct?col1 WHERE { { SELECT (?T1_city_town as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#city_town ?T1_city_town .   }}  MINUS {SELECT (?T2_city_town as ?col1) WHERE { ?T2 a :addresses . ?T2 :addresses\#city_town ?T2_city_town .        }     } }
cre_drama_workshop_groups,Which cities have at least one customer but no performer?,SELECT distinct?col1 WHERE { { SELECT (?T1_city_town as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#city_town ?T1_city_town .   }}  MINUS {SELECT (?T2_city_town as ?col1) WHERE { ?T2 a :addresses . ?T2 :addresses\#city_town ?T2_city_town .        }     } }
cre_drama_workshop_groups,What is the most frequent status of bookings?,SELECT ?T1_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :bookings . ?T1 :bookings\#status_code ?T1_status_code .        } GROUP BY ?T1_status_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_drama_workshop_groups,Which status code is the most common of all the bookings?,SELECT ?T1_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :bookings . ?T1 :bookings\#status_code ?T1_status_code .        } GROUP BY ?T1_status_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_drama_workshop_groups,What are the names of the workshop groups that have bookings with status code 'stop'?,SELECT ?T1_store_name WHERE { ?T1 a :drama_workshop_groups . ?T2 a :bookings . ?T2 :bookings\#ref-workshop_group_id ?T1 .  ?T1 :drama_workshop_groups\#store_name ?T1_store_name . ?T2 :bookings\#status_code ?T2_status_code . FILTER(?T2_status_code = 'stop') .        }
cre_drama_workshop_groups,Show the names of all the clients with no booking.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :clients . ?T1 :clients\#customer_name ?T1_customer_name .   }}  MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :clients . ?T2 :clients\#customer_name ?T2_customer_name .        }     } }
cre_drama_workshop_groups,What are the names of the clients who do not have any booking?,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :clients . ?T1 :clients\#customer_name ?T1_customer_name .   }}  MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :clients . ?T2 :clients\#customer_name ?T2_customer_name .        }     } }
cre_drama_workshop_groups,What is the average quantities ordered with payment method code 'MasterCard' on invoices?,SELECT (avg( ?T1_order_quantity) as ?aggregation_T1_order_quantity_192 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#order_quantity ?T1_order_quantity . ?T1 :invoices\#payment_method_code ?T1_payment_method_code . FILTER(?T1_payment_method_code = 'MasterCard') .        }
cre_drama_workshop_groups,Check the invoices record and compute the average quantities ordered with the payment method 'MasterCard'.,SELECT (avg( ?T1_order_quantity) as ?aggregation_T1_order_quantity_151 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#order_quantity ?T1_order_quantity . ?T1 :invoices\#payment_method_code ?T1_payment_method_code . FILTER(?T1_payment_method_code = 'MasterCard') .        }
cre_drama_workshop_groups,What is the product ID of the most frequently ordered item on invoices?,SELECT ?T1_product_id (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#product_id ?T1_product_id .        } GROUP BY ?T1_product_id  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_drama_workshop_groups,What is the description of the service type which offers both the photo product and the film product?,SELECT DISTINCT ?T1_service_type_description WHERE { ?T1 a :ref_service_types . ?T2 a :services . ?T2 :services\#ref-service_type_code ?T1 .  ?T1 :ref_service_types\#service_type_description ?T1_service_type_description . ?T2 :services\#product_name ?T2_product_name . FILTER(?T2_product_name = 'photo') . FILTER (?T1_service_type_description in (?T3_service_type_description)) .   ?T3 a :ref_service_types . ?T4 a :services . ?T4 :services\#ref-service_type_code ?T3 .  ?T3 :ref_service_types\#service_type_description ?T3_service_type_description . ?T4 :services\#product_name ?T4_product_name .  FILTER(?T4_product_name = 'film') .             }
music_2,How many bands are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :band .        }
music_2,What are all the labels?,SELECT DISTINCT ?T1_label WHERE { ?T1 a :albums . ?T1 :albums\#label ?T1_label .        }
music_2,What are the different album labels listed?,SELECT DISTINCT ?T1_label WHERE { ?T1 a :albums . ?T1 :albums\#label ?T1_label .        }
music_2,Find all the albums in 2012.,SELECT * WHERE { ?T1 a :albums . ?T1 :albums\#year ?T1_year . FILTER(?T1_year = 2012) .        }
music_2,Find all the stage positions of the musicians with first name 'Solveig',SELECT DISTINCT ?T1_stageposition WHERE { ?T1 a :performance . ?T2 a :band . ?T1 :performance\#ref-bandmate ?T2 .  ?T1 :performance\#stageposition ?T1_stageposition . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Solveig') .        }
music_2,What are the different stage positions for all musicians whose first name is 'Solveig'?,SELECT DISTINCT ?T1_stageposition WHERE { ?T1 a :performance . ?T2 a :band . ?T1 :performance\#ref-bandmate ?T2 .  ?T1 :performance\#stageposition ?T1_stageposition . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Solveig') .        }
music_2,How many songs are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :songs .        }
music_2,Find all the songs performed by artist with last name 'Heilo',SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :performance . ?T13 :performance\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#lastname ?T2_lastname . ?T2 a :band . ?T13 :performance\#ref-bandmate ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }
music_2,What are the names of the songs by the artist whose last name is 'Heilo'?,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :performance . ?T13 :performance\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#lastname ?T2_lastname . ?T2 a :band . ?T13 :performance\#ref-bandmate ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }
music_2,Hom many musicians performed in the song 'Flash'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T2 a :songs . ?T1 :performance\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Flash') .        }
music_2,How many musicians play in the song 'Flash'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T2 a :songs . ?T1 :performance\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Flash') .        }
music_2,Find all the songs produced by artists with first name 'Marianne'.,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :performance . ?T13 :performance\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#firstname ?T2_firstname . ?T2 a :band . ?T13 :performance\#ref-bandmate ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Marianne') .        }
music_2,What are the names of all songs produced by the artist with the first name 'Marianne'?,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :performance . ?T13 :performance\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#firstname ?T2_firstname . ?T2 a :band . ?T13 :performance\#ref-bandmate ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Marianne') .        }
music_2,Who performed the song named 'Badlands'? Show the first name and the last name.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T13 a :performance . ?T13 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T2 a :songs . ?T13 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }
music_2,What are the first and last names of the artist who perfomed the song 'Badlands'?,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T13 a :performance . ?T13 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T2 a :songs . ?T13 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }
music_2,Who is performing in the back stage position for the song 'Badlands'? Show the first name and the last name.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T3 a :performance . ?T3 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T3 :performance\#stageposition ?T3_stageposition . ?T2 a :songs . ?T3 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T3 :performance\#stageposition ?T3_stageposition . FILTER(?T2_title = 'Badlands' && ?T3_stageposition = 'back') .        }
music_2,What are the first and last names of the performer who was in the back stage position for the song 'Badlands'?,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T3 a :performance . ?T3 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T3 :performance\#stageposition ?T3_stageposition . ?T2 a :songs . ?T3 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T3 :performance\#stageposition ?T3_stageposition . FILTER(?T2_title = 'Badlands' && ?T3_stageposition = 'back') .        }
music_2,How many unique labels are there for albums?,SELECT DISTINCT (count(DISTINCT ?T1_label) as ?aggregation_T1_label_173 ) WHERE { ?T1 a :albums . ?T1 :albums\#label ?T1_label .        }
music_2,What are the unique labels for the albums?,SELECT DISTINCT (count(DISTINCT ?T1_label) as ?aggregation_T1_label_22 ) WHERE { ?T1 a :albums . ?T1 :albums\#label ?T1_label .        }
music_2,What is the label that has the most albums?,SELECT ?T1_label (count( *) as ?aggregation_all) WHERE { ?T1 a :albums . ?T1 :albums\#label ?T1_label .        } GROUP BY ?T1_label  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the label with the most albums?,SELECT ?T1_label (count( *) as ?aggregation_all) WHERE { ?T1 a :albums . ?T1 :albums\#label ?T1_label .        } GROUP BY ?T1_label  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the last name of the musician who was in the most songs?,SELECT ?T1_lastname (count( *) as ?aggregation_all) WHERE { ?T1 a :band . ?T2 a :performance . ?T2 :performance\#ref-bandmate ?T1 .  ?T1 :band\#lastname ?T1_lastname .        } GROUP BY ?T1_lastname  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,Find all the songs whose name contains the word 'the'.,"SELECT ?T1_title WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title . ?T1 :songs\#title ?T1_title . FILTER(contains (?T1_title, ' the ')) .        }"
music_2,What are the names of the songs whose title has the word 'the'?,"SELECT ?T1_title WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title . ?T1 :songs\#title ?T1_title . FILTER(contains (?T1_title, ' the ')) .        }"
music_2,What are all the instruments used?,SELECT DISTINCT ?T1_instrument WHERE { ?T1 a :instruments . ?T1 :instruments\#instrument ?T1_instrument .        }
music_2,What are the different instruments listed in the database?,SELECT DISTINCT ?T1_instrument WHERE { ?T1 a :instruments . ?T1 :instruments\#instrument ?T1_instrument .        }
music_2,What instrument did the musician with last name 'Heilo' use in the song 'Le Pop'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . FILTER(?T2_lastname = 'Heilo' && ?T3_title = 'Le Pop') .        }
music_2,What instruments did the musician with the last name 'Heilo' play in the song 'Le Pop'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . FILTER(?T2_lastname = 'Heilo' && ?T3_title = 'Le Pop') .        }
music_2,What is the most used instrument?,SELECT ?T1_instrument (count( *) as ?aggregation_all) WHERE { ?T1 a :instruments . ?T1 :instruments\#instrument ?T1_instrument .        } GROUP BY ?T1_instrument  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What instrument is used the most?,SELECT ?T1_instrument (count( *) as ?aggregation_all) WHERE { ?T1 a :instruments . ?T1 :instruments\#instrument ?T1_instrument .        } GROUP BY ?T1_instrument  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,How many songs have used the instrument 'drums'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :instruments . ?T1 :instruments\#instrument ?T1_instrument . FILTER(?T1_instrument = 'drums') .        }
music_2,How many songs use drums as an instrument?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :instruments . ?T1 :instruments\#instrument ?T1_instrument . FILTER(?T1_instrument = 'drums') .        }
music_2,What instruments does the the song 'Le Pop' use?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\#ref-songid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,What are the instruments are used in the song 'Le Pop'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\#ref-songid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,How many instruments does the song 'Le Pop' use?,SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_159 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\#ref-songid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,How many different instruments are used in the song 'Le Pop'?,SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_66 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\#ref-songid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,How many instrument does the musician with last name 'Heilo' use?,SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_63 ) WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }
music_2,How many different instruments does the musician with the last name 'Heilo' use?,SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_153 ) WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }
music_2,Find all the instruments ever used by the musician with last name 'Heilo'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }
music_2,What are all the instruments used by the musician with the last name 'Heilo'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }
music_2,Which song has the most vocals?,SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title .        } GROUP BY ?T1_title  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the song with the most vocals?,SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title .        } GROUP BY ?T1_title  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,Which vocal type is the most frequently appearring type?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T1 :vocals\#type ?T1_type .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the type of vocables that appears most frequently?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T1 :vocals\#type ?T1_type .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,Which vocal type has the band mate with last name 'Heilo' played the most?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the type of vocals that the band member with the last name 'Heilo' played the most?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What are the vocal types used in song 'Le Pop'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,What are the types of vocals used in the song 'Le Pop'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,Find the number of vocal types used in song 'Demon Kitty Rag'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Demon Kitty Rag') .        }
music_2,What are the types of vocals used in the song 'Demon Kitty Rag'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Demon Kitty Rag') .        }
music_2,How many songs have a lead vocal?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_100 ) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :vocals\#type ?T2_type . FILTER(?T2_type = 'lead') .        }
music_2,How many songs have vocals of type lead?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_128 ) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :vocals\#type ?T2_type . FILTER(?T2_type = 'lead') .        }
music_2,Which vocal type did the musician with first name 'Solveig' played in the song with title 'A Bar in Amsterdam'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . ?T3 :songs\#title ?T3_title . FILTER(?T2_firstname = 'Solveig' && ?T3_title = 'A Bar In Amsterdam') .        }
music_2,What are the types of vocals that the musician with the first name 'Solveig' played in the song 'A Bar in Amsterdam'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . ?T3 :songs\#title ?T3_title . FILTER(?T2_firstname = 'Solveig' && ?T3_title = 'A Bar In Amsterdam') .        }
music_2,Find all the songs that do not have a lead vocal.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_title as ?col1) WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :songs . ?T3 a :vocals . ?T3 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . ?T3 :vocals\#type ?T3_type . FILTER(?T3_type = 'lead') .        }     } }
music_2,What are the names of the songs without a lead vocal?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_title as ?col1) WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :songs . ?T3 a :vocals . ?T3 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . ?T3 :vocals\#type ?T3_type . FILTER(?T3_type = 'lead') .        }     } }
music_2,Find all the vocal types.,SELECT DISTINCT ?T1_type WHERE { ?T1 a :vocals . ?T1 :vocals\#type ?T1_type .        }
music_2,What are the different types of vocals?,SELECT DISTINCT ?T1_type WHERE { ?T1 a :vocals . ?T1 :vocals\#type ?T1_type .        }
music_2,What are the albums produced in year 2010?,SELECT * WHERE { ?T1 a :albums . ?T1 :albums\#year ?T1_year . FILTER(?T1_year = 2010) .        }
music_2,What information is there on albums from 2010?,SELECT * WHERE { ?T1 a :albums . ?T1 :albums\#year ?T1_year . FILTER(?T1_year = 2010) .        }
music_2,Who performed the song named 'Le Pop'?,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T13 a :performance . ?T13 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T2 a :songs . ?T13 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,What is the first and last name of artist who performed 'Le Pop'?,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T13 a :performance . ?T13 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T2 a :songs . ?T13 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,What is the last name of the musician that have produced the most songs?,SELECT ?T1_lastname (count( *) as ?aggregation_all) WHERE { ?T1 a :band . ?T2 a :performance . ?T2 :performance\#ref-bandmate ?T1 .  ?T1 :band\#lastname ?T1_lastname .        } GROUP BY ?T1_lastname  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the last name of the artist who sang the most songs?,SELECT ?T1_lastname (count( *) as ?aggregation_all) WHERE { ?T1 a :band . ?T2 a :performance . ?T2 :performance\#ref-bandmate ?T1 .  ?T1 :band\#lastname ?T1_lastname .        } GROUP BY ?T1_lastname  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What instrument did the musician with last name 'Heilo' use in the song 'Badlands'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . FILTER(?T2_lastname = 'Heilo' && ?T3_title = 'Badlands') .        }
