kg_name,question,query
flight_1,Show the id and name of the employee with maximum salary.,SELECT ?T1_eid ?T1_name WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary .        }   ORDER BY DESC (?T1_salary) LIMIT 1
flight_1,What is the id and name of the employee with the highest salary?,SELECT ?T1_eid ?T1_name WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary .        }   ORDER BY DESC (?T1_salary) LIMIT 1
flight_1,Show the name of employees with three lowest salaries.,SELECT ?T1_name WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary .        }   ORDER BY ASC (?T1_salary) LIMIT 1
flight_1,What is the name of the 3 employees who get paid the least?,SELECT ?T1_name WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary .        }   ORDER BY ASC (?T1_salary) LIMIT 1
flight_1,Show names for all employees with salary more than the average.,SELECT ?T1_name WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary . FILTER(?T1_salary > (?aggregation_T22_salary_108)) .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_108 ) WHERE { ?T22 a :employee . ?T22 :employee\#salary ?T22_salary .        }    } }
flight_1,Show the id and salary of Mark Young.,SELECT ?T1_eid ?T1_salary WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#name ?T1_name . FILTER(?T1_name = 'Mark Young') .        }
flight_1,What is the id and salary of the employee named Mark Young?,SELECT ?T1_eid ?T1_salary WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#name ?T1_name . FILTER(?T1_name = 'Mark Young') .        }
flight_1,How many flights do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :flight .        }
flight_1,What is the number of flights?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :flight .        }
flight_1,"Show flight number, origin, destination of all flights in the alphabetical order of the departure cities.",SELECT ?T1_flno ?T1_origin ?T1_destination WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . ?T1 :flight\#origin ?T1_origin .        }  ORDER BY ASC (?T1_origin)
flight_1,Show all flight number from Los Angeles.,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#origin ?T1_origin . FILTER(?T1_origin = 'Los Angeles') .        }
flight_1,What are the numbers of all flights coming from Los Angeles?,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#origin ?T1_origin . FILTER(?T1_origin = 'Los Angeles') .        }
flight_1,Show origins of all flights with destination Honolulu.,SELECT ?T1_origin WHERE { ?T1 a :flight . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . FILTER(?T1_destination = 'Honolulu') .        }
flight_1,What are the origins of all flights that are headed to Honolulu?,SELECT ?T1_origin WHERE { ?T1 a :flight . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . FILTER(?T1_destination = 'Honolulu') .        }
flight_1,Show me the departure date and arrival date for all flights from Los Angeles to Honolulu.,SELECT ?T1_departure_date ?T1_arrival_date WHERE { ?T1 a :flight . ?T1 :flight\#departure_date ?T1_departure_date . ?T1 :flight\#arrival_date ?T1_arrival_date . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . FILTER(?T1_origin = 'Los Angeles' && ?T1_destination = 'Honolulu') .        }
flight_1,Show flight number for all flights with more than 2000 distance.,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#distance ?T1_distance . FILTER(?T1_distance > 2000) .        }
flight_1,What is the average price for flights from Los Angeles to Honolulu.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_108 ) WHERE { ?T1 a :flight . ?T1 :flight\#price ?T1_price . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . FILTER(?T1_origin = 'Los Angeles' && ?T1_destination = 'Honolulu') .        }
flight_1,What is the average price for flights from LA to Honolulu?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_39 ) WHERE { ?T1 a :flight . ?T1 :flight\#price ?T1_price . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . FILTER(?T1_origin = 'Los Angeles' && ?T1_destination = 'Honolulu') .        }
flight_1,Show origin and destination for flights with price higher than 300.,SELECT ?T1_origin ?T1_destination WHERE { ?T1 a :flight . ?T1 :flight\#origin ?T1_origin . ?T1 :flight\#destination ?T1_destination . ?T1 :flight\#price ?T1_price . FILTER(?T1_price > 300) .        }
flight_1,Show the flight number and distance of the flight with maximum price.,SELECT ?T1_flno ?T1_distance WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#distance ?T1_distance . ?T1 :flight\#price ?T1_price .        }   ORDER BY DESC (?T1_price) LIMIT 1
flight_1,Show the flight number of flights with three lowest distances.,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#distance ?T1_distance .        }   ORDER BY ASC (?T1_distance) LIMIT 1
flight_1,What are the numbers of the shortest flights?,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T1 :flight\#flno ?T1_flno . ?T1 :flight\#distance ?T1_distance .        }   ORDER BY ASC (?T1_distance) LIMIT 1
flight_1,What is the average distance and average price for flights from Los Angeles.,SELECT (avg( ?T1_distance) as ?aggregation_T1_distance_85 ) (avg( ?T1_price) as ?aggregation_T1_price_82 ) WHERE { ?T1 a :flight . ?T1 :flight\#distance ?T1_distance . ?T1 :flight\#price ?T1_price . ?T1 :flight\#origin ?T1_origin . FILTER(?T1_origin = 'Los Angeles') .        }
flight_1,What is the average distance and price for all flights from LA?,SELECT (avg( ?T1_distance) as ?aggregation_T1_distance_33 ) (avg( ?T1_price) as ?aggregation_T1_price_155 ) WHERE { ?T1 a :flight . ?T1 :flight\#distance ?T1_distance . ?T1 :flight\#price ?T1_price . ?T1 :flight\#origin ?T1_origin . FILTER(?T1_origin = 'Los Angeles') .        }
flight_1,Show all origins and the number of flights from each origin.,SELECT ?T1_origin (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#origin ?T1_origin .        } GROUP BY ?T1_origin
flight_1,Show all destinations and the number of flights to each destination.,SELECT ?T1_destination (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#destination ?T1_destination .        } GROUP BY ?T1_destination
flight_1,What are the destinations and number of flights to each one?,SELECT ?T1_destination (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#destination ?T1_destination .        } GROUP BY ?T1_destination
flight_1,Which origin has most number of flights?,SELECT ?T1_origin (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#origin ?T1_origin .        } GROUP BY ?T1_origin  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_1,What place has the most flights coming from there?,SELECT ?T1_origin (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#origin ?T1_origin .        } GROUP BY ?T1_origin  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_1,Which destination has least number of flights?,SELECT ?T1_destination (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#destination ?T1_destination .        } GROUP BY ?T1_destination  ORDER BY ASC (?aggregation_all) LIMIT 1
flight_1,What destination has the fewest number of flights?,SELECT ?T1_destination (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#destination ?T1_destination .        } GROUP BY ?T1_destination  ORDER BY ASC (?aggregation_all) LIMIT 1
flight_1,What is the aircraft name for the flight with number 99,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T2 a :flight . ?T2 :flight\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name . ?T2 :flight\#flno ?T2_flno . FILTER(?T2_flno = 99) .        }
flight_1,What is the name of the aircraft that was on flight number 99?,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T2 a :flight . ?T2 :flight\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name . ?T2 :flight\#flno ?T2_flno . FILTER(?T2_flno = 99) .        }
flight_1,Show all flight numbers with aircraft Airbus A340-300.,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T2 a :aircraft . ?T1 :flight\#ref-aid ?T2 .  ?T1 :flight\#flno ?T1_flno . ?T2 :aircraft\#name ?T2_name . FILTER(?T2_name = 'Airbus A340-300') .        }
flight_1,What are the flight numbers for the aircraft Airbus A340-300?,SELECT ?T1_flno WHERE { ?T1 a :flight . ?T2 a :aircraft . ?T1 :flight\#ref-aid ?T2 .  ?T1 :flight\#flno ?T1_flno . ?T2 :aircraft\#name ?T2_name . FILTER(?T2_name = 'Airbus A340-300') .        }
flight_1,Show aircraft names and number of flights for each aircraft.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :flight . ?T2 :flight\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name .        } GROUP BY ?T1_name
flight_1,Show names for all aircraft with at least two flights.,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T2 a :flight . ?T2 :flight\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
flight_1,What are the names for all aircrafts with at least 2 flights?,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T2 a :flight . ?T2 :flight\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
flight_1,How many employees have certificate.,SELECT DISTINCT (count(DISTINCT ?T1_eid) as ?aggregation_T1_eid_26 ) WHERE { ?T1 a :certificate . ?T1 :certificate\#eid ?T1_eid .        }
flight_1,What is the count of distinct employees with certificates?,SELECT DISTINCT (count(DISTINCT ?T1_eid) as ?aggregation_T1_eid_42 ) WHERE { ?T1 a :certificate . ?T1 :certificate\#eid ?T1_eid .        }
flight_1,Show ids for all employees who don't have a certificate.,SELECT distinct?col1 WHERE { { SELECT (?T1_eid as ?col1) WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid .   }}  MINUS {SELECT (?T2_eid as ?col1) WHERE { ?T2 a :certificate . ?T2 :certificate\#eid ?T2_eid .        }     } }
flight_1,What are the ids of all employees that don't have certificates?,SELECT distinct?col1 WHERE { { SELECT (?T1_eid as ?col1) WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid .   }}  MINUS {SELECT (?T2_eid as ?col1) WHERE { ?T2 a :certificate . ?T2 :certificate\#eid ?T2_eid .        }     } }
flight_1,Show names for all aircrafts of which John Williams has certificates.,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T13 a :certificate . ?T13 :certificate\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name . ?T2 :employee\#name ?T2_name . ?T2 a :employee . ?T13 :certificate\#ref-eid ?T2 .  ?T1 :aircraft\#name ?T1_name . ?T2 :employee\#name ?T2_name . FILTER(?T2_name = 'John Williams') .        }
flight_1,Show names for all employees who have certificate of Boeing 737-800.,SELECT ?T1_name WHERE { ?T1 a :employee . ?T13 a :certificate . ?T13 :certificate\#ref-eid ?T1 .  ?T1 :employee\#name ?T1_name . ?T2 :aircraft\#name ?T2_name . ?T2 a :aircraft . ?T13 :certificate\#ref-aid ?T2 .  ?T1 :employee\#name ?T1_name . ?T2 :aircraft\#name ?T2_name . FILTER(?T2_name = 'Boeing 737-800') .        }
flight_1,Show names for all employees who have certificates on both Boeing 737-800 and Airbus A340-300.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :employee . ?T13 a :certificate . ?T13 :certificate\#ref-eid ?T1 .  ?T1 :employee\#name ?T1_name . ?T2 :aircraft\#name ?T2_name . ?T2 a :aircraft . ?T13 :certificate\#ref-aid ?T2 .  ?T1 :employee\#name ?T1_name . ?T2 :aircraft\#name ?T2_name . FILTER(?T2_name = 'Boeing 737-800') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :employee . ?T15 a :certificate . ?T15 :certificate\#ref-eid ?T3 .  ?T3 :employee\#name ?T3_name . ?T4 :aircraft\#name ?T4_name . ?T4 a :aircraft . ?T15 :certificate\#ref-aid ?T4 .  ?T3 :employee\#name ?T3_name . ?T4 :aircraft\#name ?T4_name .  FILTER(?T4_name = 'Airbus A340-300') .             }
flight_1,Show names for all employees who do not have certificate of Boeing 737-800.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :employee . ?T14 a :certificate . ?T14 :certificate\#ref-eid ?T2 .  ?T2 :employee\#name ?T2_name . ?T3 :aircraft\#name ?T3_name . ?T3 a :aircraft . ?T14 :certificate\#ref-aid ?T3 .  ?T2 :employee\#name ?T2_name . ?T3 :aircraft\#name ?T3_name . FILTER(?T3_name = 'Boeing 737-800') .        }     } }
flight_1,Show the name of aircraft which fewest people have its certificate.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :certificate . ?T2 :certificate\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_1,Show the name and distance of the aircrafts with more than 5000 distance and which at least 5 people have its certificate.,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T2 a :certificate . ?T2 :certificate\#ref-aid ?T1 .  ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance . FILTER(?T1_distance > 5000) .        } GROUP BY ?T1_name ORDER BY ASC ((count( *) as ?aggregation_all))
allergy_1,How many allergies are there?,SELECT DISTINCT (count(DISTINCT ?T1_allergy) as ?aggregation_T1_allergy_51 ) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergy ?T1_allergy .        }
allergy_1,How many allergy entries are there?,SELECT DISTINCT (count(DISTINCT ?T1_allergy) as ?aggregation_T1_allergy_35 ) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergy ?T1_allergy .        }
allergy_1,How many different allergy types exist?,SELECT DISTINCT (count(DISTINCT ?T1_allergytype) as ?aggregation_T1_allergytype_44 ) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        }
allergy_1,How many distinct allergies are there?,SELECT DISTINCT (count(DISTINCT ?T1_allergytype) as ?aggregation_T1_allergytype_135 ) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        }
allergy_1,Show all allergy types.,SELECT DISTINCT ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        }
allergy_1,What are the different allergy types?,SELECT DISTINCT ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        }
allergy_1,Show all allergies and their types.,SELECT ?T1_allergy ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergy ?T1_allergy . ?T1 :allergy_type\#allergytype ?T1_allergytype .        }
allergy_1,What are the allergies and their types?,SELECT ?T1_allergy ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergy ?T1_allergy . ?T1 :allergy_type\#allergytype ?T1_allergytype .        }
allergy_1,Show all allergies with type food.,SELECT DISTINCT ?T1_allergy WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergy ?T1_allergy . ?T1 :allergy_type\#allergytype ?T1_allergytype . FILTER(?T1_allergytype = 'food') .        }
allergy_1,What are all the different food allergies?,SELECT DISTINCT ?T1_allergy WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergy ?T1_allergy . ?T1 :allergy_type\#allergytype ?T1_allergytype . FILTER(?T1_allergytype = 'food') .        }
allergy_1,What is the type of allergy Cat?,SELECT ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype . ?T1 :allergy_type\#allergy ?T1_allergy . FILTER(?T1_allergy = 'Cat') .        }
allergy_1,What is allergy type of a cat allergy?,SELECT ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype . ?T1 :allergy_type\#allergy ?T1_allergy . FILTER(?T1_allergy = 'Cat') .        }
allergy_1,How many allergies have type animal?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype . FILTER(?T1_allergytype = 'animal') .        }
allergy_1,How many animal type allergies exist?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype . FILTER(?T1_allergytype = 'animal') .        }
allergy_1,Show all allergy types and the number of allergies in each type.,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype
allergy_1,Which allergy type has most number of allergies?,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,Which allergy type is most common?,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,Which allergy type has least number of allergies?,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype  ORDER BY ASC (?aggregation_all) LIMIT 1
allergy_1,Which allergy type is the least common?,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype  ORDER BY ASC (?aggregation_all) LIMIT 1
allergy_1,How many students are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student .        }
allergy_1,What is the total number of students?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student .        }
allergy_1,Show first name and last name for all students.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname .        }
allergy_1,How many different advisors are listed?,SELECT DISTINCT (count(DISTINCT ?T1_advisor) as ?aggregation_T1_advisor_34 ) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        }
allergy_1,How many advisors are there?,SELECT DISTINCT (count(DISTINCT ?T1_advisor) as ?aggregation_T1_advisor_170 ) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        }
allergy_1,Show all majors.,SELECT DISTINCT ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        }
allergy_1,What are the different majors?,SELECT DISTINCT ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        }
allergy_1,Show all cities where students live.,SELECT DISTINCT ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        }
allergy_1,What cities do students live in?,SELECT DISTINCT ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        }
allergy_1,"Show first name, last name, age for all female students. Their sex is F.",SELECT ?T1_fname ?T1_lname ?T1_age WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
allergy_1,What are the full names and ages for all female students whose sex is F?,SELECT ?T1_fname ?T1_lname ?T1_age WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
allergy_1,Show student ids for all male students.,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
allergy_1,What are the student ids for all male students?,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
allergy_1,How many students are age 18?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . FILTER(?T1_age = 18) .        }
allergy_1,How many students are 18 years old?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . FILTER(?T1_age = 18) .        }
allergy_1,Show all student ids who are older than 20.,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#age ?T1_age . FILTER(?T1_age > 20) .        }
allergy_1,What are the student ids for students over 20 years old?,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#age ?T1_age . FILTER(?T1_age > 20) .        }
allergy_1,Which city does the student whose last name is 'Kim' live in?,SELECT ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code . ?T1 :student\#lname ?T1_lname . FILTER(?T1_lname = 'Kim') .        }
allergy_1,Who is the advisor of student with ID 1004?,SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid = 1004) .        }
allergy_1,Who advises student 1004?,SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid = 1004) .        }
allergy_1,How many students live in HKG or CHI?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code . ?T1 :student\#city_code ?T1_city_code . FILTER(?T1_city_code = 'HKG' || ?T1_city_code = 'CHI') .        }
allergy_1,"Show the minimum, average, and maximum age of all students.",SELECT (min( ?T1_age) as ?aggregation_T1_age_47 ) (avg( ?T1_age) as ?aggregation_T1_age_76 ) (max( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age .        }
allergy_1,What is the last name of the youngest student?,SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_62)) .       {SELECT (min( ?T22_age) as ?aggregation_T22_age_62 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } }
allergy_1,Provide the last name of the youngest student.,SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_139)) .       {SELECT (min( ?T22_age) as ?aggregation_T22_age_139 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } }
allergy_1,Show the student id of the oldest student.,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_35)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_35 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } }
allergy_1,What student id corresponds to the oldest student?,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_59)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_59 ) WHERE { ?T22 a :student . ?T22 :student\#age ?T22_age .        }    } }
allergy_1,Show all majors and corresponding number of students.,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major
allergy_1,How many students are there for each major?,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major
allergy_1,Which major has most number of students?,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,What is the largest major?,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,Show all ages and corresponding number of students.,SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age .        } GROUP BY ?T1_age
allergy_1,How old is each student and how many students are each age?,SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age .        } GROUP BY ?T1_age
allergy_1,Show the average age for male and female students.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_108 ) ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex .        } GROUP BY ?T1_sex
allergy_1,What are the average ages for male and female students?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_175 ) ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex .        } GROUP BY ?T1_sex
allergy_1,Show all cities and corresponding number of students.,SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code
allergy_1,How many students live in each city?,SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code
allergy_1,Show all advisors and corresponding number of students.,SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor
allergy_1,How many students does each advisor have?,SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor
allergy_1,Which advisor has most number of students?,SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,How many students have cat allergies?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#allergy ?T1_allergy . FILTER(?T1_allergy = 'Cat') .        }
allergy_1,How many students are affected by cat allergies?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#allergy ?T1_allergy . FILTER(?T1_allergy = 'Cat') .        }
allergy_1,Show all student IDs who have at least two allergies.,SELECT ?T1_stuid WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#stuid ?T1_stuid .        } GROUP BY ?T1_stuid   HAVING(count( *)  >= 2)
allergy_1,What are the students ids of students who have more than one allergy?,SELECT ?T1_stuid WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#stuid ?T1_stuid .        } GROUP BY ?T1_stuid   HAVING(count( *)  >= 2)
allergy_1,What are the student ids of students who don't have any allergies?,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :has_allergy . ?T2 :has_allergy\#stuid ?T2_stuid .        }     } }
allergy_1,Which students are unaffected by allergies?,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :has_allergy . ?T2 :has_allergy\#stuid ?T2_stuid .        }     } }
allergy_1,How many female students have milk or egg allergies?,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :student\#ref-has_allergy_id ?T1 . FILTER(?T2_sex = 'F' && ?T1_allergy = 'Milk' || ?T1_allergy = 'Eggs') .        }
allergy_1,How many students who are female are allergic to milk or eggs?,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :student\#ref-has_allergy_id ?T1 . FILTER(?T2_sex = 'F' && ?T1_allergy = 'Milk' || ?T1_allergy = 'Eggs') .        }
allergy_1,How many students have a food allergy?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T2 a :allergy_type . ?T1 :has_allergy\#ref-allergy ?T2 .  ?T2 :allergy_type\#allergytype ?T2_allergytype . FILTER(?T2_allergytype = 'food') .        }
allergy_1,How many students are affected by food related allergies?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T2 a :allergy_type . ?T1 :has_allergy\#ref-allergy ?T2 .  ?T2 :allergy_type\#allergytype ?T2_allergytype . FILTER(?T2_allergytype = 'food') .        }
allergy_1,Which allergy has most number of students affected?,SELECT ?T1_allergy (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#allergy ?T1_allergy .        } GROUP BY ?T1_allergy  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,Which allergy is the most common?,SELECT ?T1_allergy (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#allergy ?T1_allergy .        } GROUP BY ?T1_allergy  ORDER BY DESC (?aggregation_all) LIMIT 1
allergy_1,Show all allergies with number of students affected.,SELECT ?T1_allergy (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#allergy ?T1_allergy .        } GROUP BY ?T1_allergy
allergy_1,How many students have each different allergy?,SELECT ?T1_allergy (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :has_allergy\#allergy ?T1_allergy .        } GROUP BY ?T1_allergy
allergy_1,Show all allergy type with number of students affected.,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T2 a :has_allergy . ?T2 :has_allergy\#ref-allergy ?T1 .  ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype
allergy_1,How many students are affected by each allergy type?,SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T2 a :has_allergy . ?T2 :has_allergy\#ref-allergy ?T1 .  ?T1 :allergy_type\#allergytype ?T1_allergytype .        } GROUP BY ?T1_allergytype
allergy_1,Find the last name and age of the student who has allergy to both milk and cat.,SELECT ?T1_lname ?T1_age WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_allergy)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T22 :has_allergy\#stuid ?T22_stuid . ?T22 :has_allergy\#allergy ?T22_allergy . FILTER(?T22_allergy = 'Milk') .        }    } }
allergy_1,What are the last names and ages of the students who are allergic to milk and cat?,SELECT ?T1_lname ?T1_age WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_allergy)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T22 :has_allergy\#stuid ?T22_stuid . ?T22 :has_allergy\#allergy ?T22_allergy . FILTER(?T22_allergy = 'Milk') .        }    } }
allergy_1,What are the allergies and their types that the student with first name Lisa has? And order the result by name of allergies.,SELECT ?T1_allergy ?T1_allergytype WHERE { ?T2 :student\#ref-allergy_type_id ?T1 . FILTER(?T2_fname = 'Lisa') .        }  ORDER BY ASC (?T1_allergy)
allergy_1,What are the first name and gender of the students who have allergy to milk but can put up with cats?,SELECT ?T1_fname ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#sex ?T1_sex . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_allergy)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T22 :has_allergy\#stuid ?T22_stuid . ?T22 :has_allergy\#allergy ?T22_allergy . FILTER(?T22_allergy = 'Milk') .        }    } }
