kg_name,question,query
soccer_2,How many different colleges do attend the tryout test?,SELECT DISTINCT (count(DISTINCT ?T1_cname) as ?aggregation_T1_cname_126 ) WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname .        }
soccer_2,How many different colleges were represented at tryouts?,SELECT DISTINCT (count(DISTINCT ?T1_cname) as ?aggregation_T1_cname_73 ) WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname .        }
soccer_2,What are the unique types of player positions in the tryout?,SELECT DISTINCT (count(DISTINCT ?T1_ppos) as ?aggregation_T1_ppos_179 ) WHERE { ?T1 a :tryout . ?T1 :tryout\#ppos ?T1_ppos .        }
soccer_2,What are the different types of player positions?,SELECT DISTINCT (count(DISTINCT ?T1_ppos) as ?aggregation_T1_ppos_85 ) WHERE { ?T1 a :tryout . ?T1 :tryout\#ppos ?T1_ppos .        }
soccer_2,How many students got accepted after the tryout?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tryout . ?T1 :tryout\#decision ?T1_decision . FILTER(?T1_decision = 'yes') .        }
soccer_2,How many students received a yes from tryouts?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tryout . ?T1 :tryout\#decision ?T1_decision . FILTER(?T1_decision = 'yes') .        }
soccer_2,How many students whose are playing the role of goalie?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tryout . ?T1 :tryout\#ppos ?T1_ppos . FILTER(?T1_ppos = 'goalie') .        }
soccer_2,What is the number of students playing as a goalie?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tryout . ?T1 :tryout\#ppos ?T1_ppos . FILTER(?T1_ppos = 'goalie') .        }
soccer_2,"Find the max, average and min training hours of all players.",SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_60 ) (max( ?T1_hs) as ?aggregation_T1_hs_124 ) (min( ?T1_hs) as ?aggregation_T1_hs_63 ) WHERE { ?T1 a :player . ?T1 :player\#hs ?T1_hs . ?T1 :player\#hs ?T1_hs . ?T1 :player\#hs ?T1_hs .        }
soccer_2,What is average enrollment of colleges in the state FL?,SELECT (avg( ?T1_enr) as ?aggregation_T1_enr_191 ) WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr . ?T1 :college\#state ?T1_state . FILTER(?T1_state = 'FL') .        }
soccer_2,What is average number of students enrolled in Florida colleges?,SELECT (avg( ?T1_enr) as ?aggregation_T1_enr_85 ) WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr . ?T1 :college\#state ?T1_state . FILTER(?T1_state = 'FL') .        }
soccer_2,What are the names of players who train between 500 and 1500 hours?,SELECT ?T1_pname WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#hs ?T1_hs . FILTER(?T1_hs >= 500 && ?T1_hs <= 1500) .        }
soccer_2,Find the players whose names contain letter 'a'.,"SELECT DISTINCT ?T1_pname WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#pname ?T1_pname . FILTER(contains (?T1_pname, 'a')) .        }"
soccer_2,Who are the players that have names containing the letter a?,"SELECT DISTINCT ?T1_pname WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#pname ?T1_pname . FILTER(contains (?T1_pname, 'a')) .        }"
soccer_2,"Find the name, enrollment of the colleges whose size is bigger than 10000 and location is in state LA.",SELECT ?T1_cname ?T1_enr WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr . ?T1 :college\#enr ?T1_enr . ?T1 :college\#state ?T1_state . FILTER(?T1_enr > 10000 && ?T1_state = 'LA') .        }
soccer_2,List all information about college sorted by enrollment number in the ascending order.,SELECT * WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr .        }  ORDER BY ASC (?T1_enr)
soccer_2,List the name of the colleges whose enrollment is greater 18000 sorted by the college's name.,SELECT ?T1_cname WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr > 18000) .        }  ORDER BY ASC (?T1_cname)
soccer_2,Find the name of players whose card is yes in the descending order of training hours.,SELECT ?T1_pname WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#hs ?T1_hs . ?T1 :player\#ycard ?T1_ycard . FILTER(?T1_ycard = 'yes') .        }  ORDER BY DESC (?T1_hs)
soccer_2,Find the name of different colleges involved in the tryout in alphabetical order.,SELECT DISTINCT ?T1_cname WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname . ?T1 :tryout\#cname ?T1_cname .        }  ORDER BY ASC (?T1_cname)
soccer_2,Which position is most popular among players in the tryout?,SELECT ?T1_ppos (count( *) as ?aggregation_all) WHERE { ?T1 a :tryout . ?T1 :tryout\#ppos ?T1_ppos .        } GROUP BY ?T1_ppos  ORDER BY DESC (?aggregation_all) LIMIT 1
soccer_2,What was the most popular position at tryouts?,SELECT ?T1_ppos (count( *) as ?aggregation_all) WHERE { ?T1 a :tryout . ?T1 :tryout\#ppos ?T1_ppos .        } GROUP BY ?T1_ppos  ORDER BY DESC (?aggregation_all) LIMIT 1
soccer_2,Find the number of students who participate in the tryout for each college ordered by descending count.,SELECT (count( *) as ?aggregation_all) ?T1_cname WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname .        } GROUP BY ?T1_cname ORDER BY DESC ((count( *) as ?aggregation_all))
soccer_2,What is minimum hours of the students playing in different position?,SELECT (min( ?T1_hs) as ?aggregation_T1_hs_9 ) ?T2_ppos WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#hs ?T1_hs . ?T2 :tryout\#ppos ?T2_ppos .        } GROUP BY ?T2_ppos
soccer_2,What are the names of schools with the top 3 largest size?,SELECT ?T1_cname WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr .        }   ORDER BY DESC (?T1_enr) LIMIT 1
soccer_2,What are the names of the schools with the top 3 largest class sizes?,SELECT ?T1_cname WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr .        }   ORDER BY DESC (?T1_enr) LIMIT 1
soccer_2,What is the name of the school with smallest enrollment size per state?,SELECT ?T1_cname ?T1_state (min( ?T1_enr) as ?aggregation_T1_enr_159 ) WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#state ?T1_state . ?T1 :college\#enr ?T1_enr .        } GROUP BY ?T1_state
soccer_2,Find the states where have some college students in tryout.,SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T1 :college\#state ?T1_state .        }
soccer_2,What are the different states that have students trying out?,SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T1 :college\#state ?T1_state .        }
soccer_2,Find the states where have some college students in tryout and their decisions are yes.,SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }
soccer_2,What are the different states that had students successfully try out?,SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }
soccer_2,Find the name and college of students whose decisions are yes in the tryout.,SELECT ?T1_pname ?T2_cname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#pname ?T1_pname . ?T2 :tryout\#cname ?T2_cname . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }
soccer_2,Find the name of all students who were in the tryout sorted in alphabetic order.,SELECT ?T1_pname WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#pname ?T1_pname .        }  ORDER BY ASC (?T1_pname)
soccer_2,What are the names of all students who tried out in alphabetical order?,SELECT ?T1_pname WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#pname ?T1_pname .        }  ORDER BY ASC (?T1_pname)
soccer_2,Find the name and hours of the students whose tryout decision is yes.,SELECT ?T1_pname ?T1_hs WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#pname ?T1_pname . ?T1 :player\#hs ?T1_hs . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }
soccer_2,Find the states of the colleges that have students in the tryout who played in striker position.,SELECT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :tryout\#ppos ?T2_ppos . FILTER(?T2_ppos = 'striker') .        }
soccer_2,Find the names of the students who are in the position of striker and got a yes tryout decision.,SELECT ?T1_pname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#pname ?T1_pname . ?T2 :tryout\#decision ?T2_decision . ?T2 :tryout\#ppos ?T2_ppos . FILTER(?T2_decision = 'yes' && ?T2_ppos = 'striker') .        }
soccer_2,Find the state of the college which player Charles is attending.,SELECT ?T1_state WHERE { ?T1 a :college . ?T13 a :tryout . ?T13 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :player\#pname ?T2_pname . ?T2 a :player . ?T13 :tryout\#ref-pid ?T2 .  ?T1 :college\#state ?T1_state . ?T2 :player\#pname ?T2_pname . FILTER(?T2_pname = 'Charles') .        }
soccer_2,In which state is the college that Charles attends?,SELECT ?T1_state WHERE { ?T1 a :college . ?T13 a :tryout . ?T13 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :player\#pname ?T2_pname . ?T2 a :player . ?T13 :tryout\#ref-pid ?T2 .  ?T1 :college\#state ?T1_state . ?T2 :player\#pname ?T2_pname . FILTER(?T2_pname = 'Charles') .        }
soccer_2,Find the average and maximum hours for the students whose tryout decision is yes.,SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_184 ) (max( ?T1_hs) as ?aggregation_T1_hs_132 ) WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#hs ?T1_hs . ?T1 :player\#hs ?T1_hs . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }
soccer_2,Find the average hours for the students whose tryout decision is no.,SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_39 ) WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#hs ?T1_hs . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'no') .        }
soccer_2,Which college has any student who is a goalie and succeeded in the tryout.,SELECT ?T1_cname WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname . ?T1 :tryout\#decision ?T1_decision . ?T1 :tryout\#ppos ?T1_ppos . FILTER(?T1_decision = 'yes' && ?T1_ppos = 'goalie') .        }
soccer_2,Find the name of the tryout players who are from the college with largest size.,SELECT ?T1_pname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :tryout\#ref-pid ?T1 .  ?T1 :player\#pname ?T1_pname . ?T2 :tryout\#cname ?T2_cname . FILTER(?T2_cname = (?T23_enr)) .       {SELECT ?T23_cname WHERE { ?T23 a :college . ?T23 :college\#cname ?T23_cname . ?T23 :college\#enr ?T23_enr .        }   ORDER BY DESC (?T23_enr) LIMIT 1 } }
soccer_2,What is the state and enrollment of the colleges where have any students who got accepted in the tryout decision.,SELECT DISTINCT ?T1_state ?T1_enr WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T1 :college\#enr ?T1_enr . ?T2 :tryout\#decision ?T2_decision . FILTER(?T2_decision = 'yes') .        }
soccer_2,Find the names of either colleges in LA with greater than 15000 size or in state AZ with less than 13000 enrollment.,SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr . ?T1 :college\#state ?T1_state . FILTER(?T1_enr < 13000 && ?T1_state = 'AZ') .   }} UNION {SELECT (?T1_cname as ?col1) WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr . ?T1 :college\#state ?T1_state . FILTER(?T1_enr > 15000 && ?T1_state = 'LA') .        }      } }
soccer_2,Find the names of schools that have some students playing in goalie and mid positions.,SELECT DISTINCT ?T1_cname WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname . ?T1 :tryout\#ppos ?T1_ppos . FILTER(?T1_ppos = 'goalie') . FILTER (?T1_cname in (?T2_cname)) .   ?T2 a :tryout . ?T2 :tryout\#cname ?T2_cname . ?T2 :tryout\#ppos ?T2_ppos .  FILTER(?T2_ppos = 'mid') .             }
soccer_2,Find the names of states that have some college students playing in goalie and mid positions.,SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :tryout\#ppos ?T2_ppos . FILTER(?T2_ppos = 'goalie') . FILTER (?T1_state in (?T3_state)) .   ?T3 a :college . ?T4 a :tryout . ?T4 :tryout\#ref-cname ?T3 .  ?T3 :college\#state ?T3_state . ?T4 :tryout\#ppos ?T4_ppos .  FILTER(?T4_ppos = 'mid') .             }
soccer_2,How many schools have some students playing in goalie and mid positions.,SELECT (count(*) as ?agg) WHERE {{SELECT ?t1_cName WHERE {?t1 a :tryout . ?t1 :tryout\#pPos  ?t1_Ppos . FILTER (?t1_Ppos='goalie') }}FILTER (?t1_cName in (?t2_cName)) FILTER NOT EXISTS {SELECT ?t2_cName WHERE {?t2 a :tryout . ?t2 :tryout\#pPos  ?t2_Ppos . FILTER (?t2_Ppos='mid')}}}
soccer_2,How many schools have students playing in goalie and mid-field positions?,SELECT (count(*) as ?agg) WHERE {{SELECT ?t1_cName WHERE {?t1 a :tryout . ?t1 :tryout\#pPos  ?t1_Ppos . FILTER (?t1_Ppos='goalie') }}FILTER (?t1_cName in (?t2_cName)) FILTER NOT EXISTS {SELECT ?t2_cName WHERE {?t2 a :tryout . ?t2 :tryout\#pPos  ?t2_Ppos . FILTER (?t2_Ppos='mid')}}}
soccer_2,Find the names of schools that have some players in the mid position but not in the goalie position.,SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a :tryout . ?T1 :tryout\#cname ?T1_cname . ?T1 :tryout\#ppos ?T1_ppos . FILTER(?T1_ppos = 'mid') .   }}  MINUS {SELECT (?T2_cname as ?col1) WHERE { ?T2 a :tryout . ?T2 :tryout\#cname ?T2_cname . ?T2 :tryout\#ppos ?T2_ppos . FILTER(?T2_ppos = 'goalie') .        }     } }
soccer_2,Find the names of states that have some college students playing in the mid position but not in the goalie position.,SELECT distinct?col1 WHERE { { SELECT (?T1_state as ?col1) WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :tryout\#ref-cname ?T1 .  ?T1 :college\#state ?T1_state . ?T2 :tryout\#ppos ?T2_ppos . FILTER(?T2_ppos = 'mid') .   }}  MINUS {SELECT (?T3_state as ?col1) WHERE { ?T3 a :college . ?T4 a :tryout . ?T4 :tryout\#ref-cname ?T3 .  ?T3 :college\#state ?T3_state . ?T4 :tryout\#ppos ?T4_ppos . FILTER(?T4_ppos = 'goalie') .        }     } }
soccer_2,How many states that have some college students playing in the mid position but not in the goalie position.,SELECT (count(*) as ?agg) WHERE {{ SELECT ?t1_state WHERE {?t1 a :college . ?t2 a :tryout . ?t1 :college\#ref-cName ?t2 . ?t2 :tryout\#pPos ?t2_pPos. FILTER (?t2_pPos = 'mid') }}MINUS {SELECT ?t1_state WHERE {?t1 a :college . ?t2 a :tryout . ?t1 :college\#ref-cName ?t2 . ?t2 :tryout\#pPos ?t2_pPos. FILTER (?t2_pPos = 'goalie')}}}
soccer_2,What is the count of states with college students playing in the mid position but not as goalies?,SELECT (count(*) as ?agg) WHERE {{ SELECT ?t1_state WHERE {?t1 a :college . ?t2 a :tryout . ?t1 :college\#ref-cName ?t2 . ?t2 :tryout\#pPos ?t2_pPos. FILTER (?t2_pPos = 'mid') }}MINUS {SELECT ?t1_state WHERE {?t1 a :college . ?t2 a :tryout . ?t1 :college\#ref-cName ?t2 . ?t2 :tryout\#pPos ?t2_pPos. FILTER (?t2_pPos = 'goalie')}}}
soccer_2,Find the states where have the colleges whose enrollments are less than the largest size.,SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T1 :college\#state ?T1_state . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr < (?aggregation_T22_enr_175)) .       {SELECT (max( ?T22_enr) as ?aggregation_T22_enr_175 ) WHERE { ?T22 a :college . ?T22 :college\#enr ?T22_enr .        }    } }
soccer_2,Find names of colleges with enrollment greater than that of some (at least one) college in the FL state.,SELECT DISTINCT ?T1_cname WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr > (?T22_state)) .       {SELECT (min( ?T22_enr) as ?aggregation_T22_enr_69 ) WHERE { ?T22 a :college . ?T22 :college\#enr ?T22_enr . ?T22 :college\#state ?T22_state . FILTER(?T22_state = 'FL') .        }    } }
soccer_2,Find names of all colleges whose enrollment is greater than that of all colleges in the FL state.,SELECT ?T1_cname WHERE { ?T1 a :college . ?T1 :college\#cname ?T1_cname . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr > (?T22_state)) .       {SELECT (max( ?T22_enr) as ?aggregation_T22_enr_193 ) WHERE { ?T22 a :college . ?T22 :college\#enr ?T22_enr . ?T22 :college\#state ?T22_state . FILTER(?T22_state = 'FL') .        }    } }
soccer_2,How many states have a college with more students than average?,SELECT DISTINCT (count(DISTINCT ?T1_state) as ?aggregation_T1_state_107 ) WHERE { ?T1 a :college . ?T1 :college\#state ?T1_state . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr > (?aggregation_T22_enr_91)) .       {SELECT (avg( ?T22_enr) as ?aggregation_T22_enr_91 ) WHERE { ?T22 a :college . ?T22 :college\#enr ?T22_enr .        }    } }
soccer_2,How many states have smaller colleges than average?,SELECT DISTINCT (count(DISTINCT ?T1_state) as ?aggregation_T1_state_130 ) WHERE { ?T1 a :college . ?T1 :college\#state ?T1_state . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr < (?aggregation_T22_enr_132)) .       {SELECT (avg( ?T22_enr) as ?aggregation_T22_enr_132 ) WHERE { ?T22 a :college . ?T22 :college\#enr ?T22_enr .        }    } }
device,How many devices are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :device .        }
device,List the carriers of devices in ascending alphabetical order.,SELECT ?T1_carrier WHERE { ?T1 a :device . ?T1 :device\#carrier ?T1_carrier . ?T1 :device\#carrier ?T1_carrier .        }  ORDER BY ASC (?T1_carrier)
device,What are the carriers of devices whose software platforms are not 'Android'?,SELECT ?T1_carrier WHERE { ?T1 a :device . ?T1 :device\#carrier ?T1_carrier . ?T1 :device\#software_platform ?T1_software_platform . FILTER(?T1_software_platform != 'Android') .        }
device,What are the names of shops in ascending order of open year?,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T1 :shop\#shop_name ?T1_shop_name . ?T1 :shop\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
device,What is the average quantity of stocks?,SELECT (avg( ?T1_quantity) as ?aggregation_T1_quantity_134 ) WHERE { ?T1 a :stock . ?T1 :stock\#quantity ?T1_quantity .        }
device,Give the average quantity of stocks.,SELECT (avg( ?T1_quantity) as ?aggregation_T1_quantity_51 ) WHERE { ?T1 a :stock . ?T1 :stock\#quantity ?T1_quantity .        }
device,What are the names and location of the shops in ascending alphabetical order of name.,SELECT ?T1_shop_name ?T1_location WHERE { ?T1 a :shop . ?T1 :shop\#shop_name ?T1_shop_name . ?T1 :shop\#location ?T1_location . ?T1 :shop\#shop_name ?T1_shop_name .        }  ORDER BY ASC (?T1_shop_name)
device,How many different software platforms are there for devices?,SELECT DISTINCT (count(DISTINCT ?T1_software_platform) as ?aggregation_T1_software_platform_166 ) WHERE { ?T1 a :device . ?T1 :device\#software_platform ?T1_software_platform .        }
device,Count the number of different software platforms.,SELECT DISTINCT (count(DISTINCT ?T1_software_platform) as ?aggregation_T1_software_platform_48 ) WHERE { ?T1 a :device . ?T1 :device\#software_platform ?T1_software_platform .        }
device,List the open date of open year of the shop named 'Apple'.,SELECT ?T1_open_date ?T1_open_year WHERE { ?T1 a :shop . ?T1 :shop\#open_date ?T1_open_date . ?T1 :shop\#open_year ?T1_open_year . ?T1 :shop\#shop_name ?T1_shop_name . FILTER(?T1_shop_name = 'Apple') .        }
device,What are the open dates and years for the shop named Apple?,SELECT ?T1_open_date ?T1_open_year WHERE { ?T1 a :shop . ?T1 :shop\#open_date ?T1_open_date . ?T1 :shop\#open_year ?T1_open_year . ?T1 :shop\#shop_name ?T1_shop_name . FILTER(?T1_shop_name = 'Apple') .        }
device,List the name of the shop with the latest open year.,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T1 :shop\#shop_name ?T1_shop_name . ?T1 :shop\#open_year ?T1_open_year .        }   ORDER BY DESC (?T1_open_year) LIMIT 1
device,Show names of shops and the carriers of devices they have in stock.,SELECT ?T1_shop_name ?T2_carrier WHERE { ?T1 a :shop . ?T13 a :stock . ?T13 :stock\#ref-shop_id ?T1 .  ?T1 :shop\#shop_name ?T1_shop_name . ?T2 :device\#carrier ?T2_carrier . ?T2 a :device . ?T13 :stock\#ref-device_id ?T2 .  ?T1 :shop\#shop_name ?T1_shop_name . ?T2 :device\#carrier ?T2_carrier .        }
device,Show names of shops that have more than one kind of device in stock.,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T2 a :stock . ?T2 :stock\#ref-shop_id ?T1 .  ?T1 :shop\#shop_name ?T1_shop_name .        } GROUP BY ?T1_shop_name   HAVING(count( *)  > 1)
device,Show the name of the shop that has the most kind of devices in stock.,SELECT ?T1_shop_name (count( *) as ?aggregation_all) WHERE { ?T1 a :shop . ?T2 a :stock . ?T2 :stock\#ref-shop_id ?T1 .  ?T1 :shop\#shop_name ?T1_shop_name .        } GROUP BY ?T1_shop_name  ORDER BY DESC (?aggregation_all) LIMIT 1
device,Show the name of the shop that have the largest quantity of devices in stock.,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T2 a :stock . ?T2 :stock\#ref-shop_id ?T1 .  ?T1 :shop\#shop_name ?T1_shop_name . ?T2 :stock\#quantity ?T2_quantity .        } GROUP BY ?T1_shop_name  ORDER BY DESC ((sum( ?T2_quantity) as ?aggregation_T2_quantity_65 )) LIMIT 1
device,What is the name of the shop that has the greatest quantity of devices in stock?,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T2 a :stock . ?T2 :stock\#ref-shop_id ?T1 .  ?T1 :shop\#shop_name ?T1_shop_name . ?T2 :stock\#quantity ?T2_quantity .        } GROUP BY ?T1_shop_name  ORDER BY DESC ((sum( ?T2_quantity) as ?aggregation_T2_quantity_196 )) LIMIT 1
device,Please show different software platforms and the corresponding number of devices using each.,SELECT ?T1_software_platform (count( *) as ?aggregation_all) WHERE { ?T1 a :device . ?T1 :device\#software_platform ?T1_software_platform .        } GROUP BY ?T1_software_platform
device,Please show the software platforms of devices in descending order of the count.,SELECT ?T1_software_platform WHERE { ?T1 a :device . ?T1 :device\#software_platform ?T1_software_platform .        } GROUP BY ?T1_software_platform ORDER BY DESC ((count( *) as ?aggregation_all))
device,List the software platform shared by the greatest number of devices.,SELECT ?T1_software_platform (count( *) as ?aggregation_all) WHERE { ?T1 a :device . ?T1 :device\#software_platform ?T1_software_platform .        } GROUP BY ?T1_software_platform  ORDER BY DESC (?aggregation_all) LIMIT 1
device,What is the software platform that is most common amongst all devices?,SELECT ?T1_software_platform (count( *) as ?aggregation_all) WHERE { ?T1 a :device . ?T1 :device\#software_platform ?T1_software_platform .        } GROUP BY ?T1_software_platform  ORDER BY DESC (?aggregation_all) LIMIT 1
device,List the names of shops that have no devices in stock.,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T1 :shop\#shop_name ?T1_shop_name . ?T1 :shop\#shop_id ?T1_shop_id . FILTER(?T1_shop_id not in (?T22_shop_id)) .       {SELECT ?T22_shop_id WHERE { ?T22 a :stock . ?T22 :stock\#shop_id ?T22_shop_id .        }    } }
device,What are the names of shops that do not have any devices in stock?,SELECT ?T1_shop_name WHERE { ?T1 a :shop . ?T1 :shop\#shop_name ?T1_shop_name . ?T1 :shop\#shop_id ?T1_shop_id . FILTER(?T1_shop_id not in (?T22_shop_id)) .       {SELECT ?T22_shop_id WHERE { ?T22 a :stock . ?T22 :stock\#shop_id ?T22_shop_id .        }    } }
device,Show the locations shared by shops with open year later than 2012 and shops with open year before 2008.,SELECT DISTINCT ?T1_location WHERE { ?T1 a :shop . ?T1 :shop\#location ?T1_location . ?T1 :shop\#open_year ?T1_open_year . FILTER(?T1_open_year > '2012') . FILTER (?T1_location in (?T2_location)) .   ?T2 a :shop . ?T2 :shop\#location ?T2_location . ?T2 :shop\#open_year ?T2_open_year .  FILTER(?T2_open_year < '2008') .             }
device,List the carriers of devices that have no devices in stock.,SELECT ?T1_carrier WHERE { ?T1 a :device . ?T1 :device\#carrier ?T1_carrier . ?T1 :device\#device_id ?T1_device_id . FILTER(?T1_device_id not in (?T22_device_id)) .       {SELECT ?T22_device_id WHERE { ?T22 a :stock . ?T22 :stock\#device_id ?T22_device_id .        }    } }
device,What are the carriers of devices that are not in stock anywhere?,SELECT ?T1_carrier WHERE { ?T1 a :device . ?T1 :device\#carrier ?T1_carrier . ?T1 :device\#device_id ?T1_device_id . FILTER(?T1_device_id not in (?T22_device_id)) .       {SELECT ?T22_device_id WHERE { ?T22 a :stock . ?T22 :stock\#device_id ?T22_device_id .        }    } }
device,Show the carriers of devices in stock at more than one shop.,SELECT ?T1_carrier WHERE { ?T1 a :device . ?T2 a :stock . ?T2 :stock\#ref-device_id ?T1 .  ?T1 :device\#carrier ?T1_carrier .        } GROUP BY ?T1_carrier   HAVING(count( *)  > 1)
cre_drama_workshop_groups,How many bookings do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :bookings .        }
cre_drama_workshop_groups,List the order dates of all the bookings.,SELECT ?T1_order_date WHERE { ?T1 a :bookings . ?T1 :bookings\#order_date ?T1_order_date .        }
cre_drama_workshop_groups,What is the order date of each booking?,SELECT ?T1_order_date WHERE { ?T1 a :bookings . ?T1 :bookings\#order_date ?T1_order_date .        }
cre_drama_workshop_groups,Show all the planned delivery dates and actual delivery dates of bookings.,SELECT ?T1_planned_delivery_date ?T1_actual_delivery_date WHERE { ?T1 a :bookings . ?T1 :bookings\#planned_delivery_date ?T1_planned_delivery_date . ?T1 :bookings\#actual_delivery_date ?T1_actual_delivery_date .        }
cre_drama_workshop_groups,How many customers do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }
cre_drama_workshop_groups,What are the phone and email for customer Harold?,SELECT ?T1_customer_phone ?T1_customer_email_address WHERE { ?T1 a :customers . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#customer_email_address ?T1_customer_email_address . ?T1 :customers\#customer_name ?T1_customer_name . FILTER(?T1_customer_name = 'Harold') .        }
cre_drama_workshop_groups,Show all the Store_Name of drama workshop groups.,SELECT ?T1_store_name WHERE { ?T1 a :drama_workshop_groups . ?T1 :drama_workshop_groups\#store_name ?T1_store_name .        }
cre_drama_workshop_groups,What are the store names of drama workshop groups?,SELECT ?T1_store_name WHERE { ?T1 a :drama_workshop_groups . ?T1 :drama_workshop_groups\#store_name ?T1_store_name .        }
cre_drama_workshop_groups,"Show the minimum, average, maximum order quantity of all invoices.",SELECT (min( ?T1_order_quantity) as ?aggregation_T1_order_quantity_187 ) (avg( ?T1_order_quantity) as ?aggregation_T1_order_quantity_33 ) (max( ?T1_order_quantity) as ?aggregation_T1_order_quantity_86 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#order_quantity ?T1_order_quantity . ?T1 :invoices\#order_quantity ?T1_order_quantity . ?T1 :invoices\#order_quantity ?T1_order_quantity .        }
cre_drama_workshop_groups,"What are the minimum, average, and maximum quantities ordered? Check all the invoices.",SELECT (min( ?T1_order_quantity) as ?aggregation_T1_order_quantity_188 ) (avg( ?T1_order_quantity) as ?aggregation_T1_order_quantity_92 ) (max( ?T1_order_quantity) as ?aggregation_T1_order_quantity_40 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#order_quantity ?T1_order_quantity . ?T1 :invoices\#order_quantity ?T1_order_quantity . ?T1 :invoices\#order_quantity ?T1_order_quantity .        }
cre_drama_workshop_groups,What are the distinct payment method codes in all the invoices?,SELECT DISTINCT ?T1_payment_method_code WHERE { ?T1 a :invoices . ?T1 :invoices\#payment_method_code ?T1_payment_method_code .        }
cre_drama_workshop_groups,What is the description of the marketing region China?,SELECT ?T1_marketing_region_descriptrion WHERE { ?T1 a :marketing_regions . ?T1 :marketing_regions\#marketing_region_descriptrion ?T1_marketing_region_descriptrion . ?T1 :marketing_regions\#marketing_region_name ?T1_marketing_region_name . FILTER(?T1_marketing_region_name = 'China') .        }
cre_drama_workshop_groups,Find the marketing region description of China?,SELECT ?T1_marketing_region_descriptrion WHERE { ?T1 a :marketing_regions . ?T1 :marketing_regions\#marketing_region_descriptrion ?T1_marketing_region_descriptrion . ?T1 :marketing_regions\#marketing_region_name ?T1_marketing_region_name . FILTER(?T1_marketing_region_name = 'China') .        }
cre_drama_workshop_groups,Show all the distinct product names with price higher than the average.,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price > (?aggregation_T22_product_price_56)) .       {SELECT (avg( ?T22_product_price) as ?aggregation_T22_product_price_56 ) WHERE { ?T22 a :products . ?T22 :products\#product_price ?T22_product_price .        }    } }
cre_drama_workshop_groups,What is the name of the most expensive product?,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
cre_drama_workshop_groups,What is the phone number of the performer Ashley?,SELECT ?T1_customer_phone WHERE { ?T1 a :performers . ?T1 :performers\#customer_phone ?T1_customer_phone . ?T1 :performers\#customer_name ?T1_customer_name . FILTER(?T1_customer_name = 'Ashley') .        }
cre_drama_workshop_groups,Show all payment method codes and the number of orders for each code.,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code
cre_drama_workshop_groups,What is the payment method code used by the most orders?,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_drama_workshop_groups,Which city is the address of the store named 'FJA Filming' located in?,SELECT ?T1_city_town WHERE { ?T1 a :addresses . ?T2 a :stores . ?T2 :stores\#ref-address_id ?T1 .  ?T1 :addresses\#city_town ?T1_city_town . ?T2 :stores\#store_name ?T2_store_name . FILTER(?T2_store_name = 'FJA Filming') .        }
cre_drama_workshop_groups,What are the states or counties of the address of the stores with marketing region code 'CA'?,SELECT ?T1_state_county WHERE { ?T1 a :addresses . ?T2 a :stores . ?T2 :stores\#ref-address_id ?T1 .  ?T1 :addresses\#state_county ?T1_state_county . ?T2 :stores\#marketing_region_code ?T2_marketing_region_code . FILTER(?T2_marketing_region_code = 'CA') .        }
cre_drama_workshop_groups,Return the name of the marketing region the store Rob Dinning is located in.,SELECT ?T1_marketing_region_name WHERE { ?T1 a :marketing_regions . ?T2 a :stores . ?T2 :stores\#ref-marketing_region_code ?T1 .  ?T1 :marketing_regions\#marketing_region_name ?T1_marketing_region_name . ?T2 :stores\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Rob Dinning') .        }
cre_drama_workshop_groups,Give me the descriptions of the service types that cost more than 100.,SELECT ?T1_service_type_description WHERE { ?T1 a :ref_service_types . ?T2 a :services . ?T2 :services\#ref-service_type_code ?T1 .  ?T1 :ref_service_types\#service_type_description ?T1_service_type_description . ?T2 :services\#product_price ?T2_product_price . FILTER(?T2_product_price > 100) .        }
