kg_name,question,query
tracking_software_problems,List the first and last names of all distinct staff members who are assigned to the problem whose id is 1.,SELECT DISTINCT ?T1_staff_first_name ?T1_staff_last_name WHERE { ?T1 a :staff . ?T2 a :problem_log . ?T2 :problem_log\#ref-assigned_to_staff_id ?T1 .  ?T1 :staff\#staff_first_name ?T1_staff_first_name . ?T1 :staff\#staff_last_name ?T1_staff_last_name . ?T2 :problem_log\#problem_id ?T2_problem_id . FILTER(?T2_problem_id = 1) .        }
tracking_software_problems,List the problem id and log id which are assigned to the staff named Rylan Homenick.,SELECT DISTINCT ?T1_problem_id ?T1_problem_log_id WHERE { ?T1 a :problem_log . ?T2 a :staff . ?T1 :problem_log\#ref-assigned_to_staff_id ?T2 .  ?T1 :problem_log\#problem_id ?T1_problem_id . ?T1 :problem_log\#problem_log_id ?T1_problem_log_id . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_first_name = 'Rylan' && ?T2_staff_last_name = 'Homenick') .        }
tracking_software_problems,How many problems are there for product voluptatem?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :problems . ?T2 a :product . ?T1 :problems\#ref-product_id ?T2 .  ?T2 :product\#product_name ?T2_product_name . FILTER(?T2_product_name = 'voluptatem') .        }
tracking_software_problems,How many problems did the product called 'voluptatem' have in record?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :problems . ?T2 a :product . ?T1 :problems\#ref-product_id ?T2 .  ?T2 :product\#product_name ?T2_product_name . FILTER(?T2_product_name = 'voluptatem') .        }
tracking_software_problems,How many problems does the product with the most problems have? List the number of the problems and product name.,SELECT (count( *) as ?aggregation_all) ?T2_product_name WHERE { ?T1 a :problems . ?T2 a :product . ?T1 :problems\#ref-product_id ?T2 .  ?T2 :product\#product_name ?T2_product_name .        } GROUP BY ?T2_product_name  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_software_problems,Give me a list of descriptions of the problems that are reported by the staff whose first name is Christop.,SELECT ?T1_problem_description WHERE { ?T1 a :problems . ?T2 a :staff . ?T1 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :problems\#problem_description ?T1_problem_description . ?T2 :staff\#staff_first_name ?T2_staff_first_name . FILTER(?T2_staff_first_name = 'Christop') .        }
tracking_software_problems,Find the ids of the problems that are reported by the staff whose last name is Bosco.,SELECT ?T1_problem_id WHERE { ?T1 a :problems . ?T2 a :staff . ?T1 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :problems\#problem_id ?T1_problem_id . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_last_name = 'Bosco') .        }
tracking_software_problems,What are the ids of the problems which are reported after 1978-06-26?,SELECT ?T1_problem_id WHERE { ?T1 a :problems . ?T1 :problems\#problem_id ?T1_problem_id . ?T1 :problems\#date_problem_reported ?T1_date_problem_reported . FILTER(?T1_date_problem_reported > 1978-06-26) .        }
tracking_software_problems,What are the ids of the problems which are reported before 1978-06-26?,SELECT ?T1_problem_id WHERE { ?T1 a :problems . ?T1 :problems\#problem_id ?T1_problem_id . ?T1 :problems\#date_problem_reported ?T1_date_problem_reported . FILTER(?T1_date_problem_reported < 1978-06-26) .        }
tracking_software_problems,"For each product with some problems, list the count of problems and the product id.",SELECT (count( *) as ?aggregation_all) ?T2_product_id WHERE { ?T1 a :problems . ?T2 a :product . ?T1 :problems\#ref-product_id ?T2 .  ?T2 :product\#product_id ?T2_product_id .        } GROUP BY ?T2_product_id
tracking_software_problems,What are the products that have problems reported after 1986-11-13? Give me the product id and the count of problems reported after 1986-11-13.,SELECT (count( *) as ?aggregation_all) ?T1_product_id WHERE { ?T1 a :product . ?T2 a :problems . ?T2 :problems\#ref-product_id ?T1 .  ?T1 :product\#product_id ?T1_product_id . ?T2 :problems\#date_problem_reported ?T2_date_problem_reported . FILTER(?T2_date_problem_reported > 1986-11-13) .        } GROUP BY ?T1_product_id
tracking_software_problems,List the names of all the distinct product names in alphabetical order?,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :product . ?T1 :product\#product_name ?T1_product_name . ?T1 :product\#product_name ?T1_product_name .        }  ORDER BY ASC (?T1_product_name)
tracking_software_problems,List all the distinct product names ordered by product id?,SELECT DISTINCT ?T1_product_name ?T1_product_id WHERE { ?T1 a :product . ?T1 :product\#product_name ?T1_product_name . ?T1 :product\#product_id ?T1_product_id . ?T1 :product\#product_id ?T1_product_id .        }  ORDER BY ASC (?T1_product_id)
tracking_software_problems,What is the list of distinct product names sorted by product id?,SELECT DISTINCT ?T1_product_name ?T1_product_id WHERE { ?T1 a :product . ?T1 :product\#product_name ?T1_product_name . ?T1 :product\#product_id ?T1_product_id . ?T1 :product\#product_id ?T1_product_id .        }  ORDER BY ASC (?T1_product_id)
tracking_software_problems,Which problems were reported by the staff named Dameon Frami or Jolie Weber? Give me the ids of the problems.,SELECT distinct?col1 WHERE { { SELECT (?T1_product_id as ?col1) WHERE { ?T1 a :problems . ?T2 a :staff . ?T1 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :problems\#product_id ?T1_product_id . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_first_name = 'Dameon' && ?T2_staff_last_name = 'Frami') .   }} UNION {SELECT (?T1_product_id as ?col1) WHERE { ?T1 a :problems . ?T2 a :staff . ?T1 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :problems\#product_id ?T1_product_id . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_first_name = 'Jolie' && ?T2_staff_last_name = 'Weber') .        }      } }
tracking_software_problems,"For which product was there a problem reported by Christop Berge, with closure authorised by Ashley Medhurst? Return the product ids.",SELECT DISTINCT ?T1_product_id WHERE { ?T1 a :problems . ?T2 a :staff . ?T1 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :problems\#product_id ?T1_product_id . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_first_name = 'Christop' && ?T2_staff_last_name = 'Berge') . FILTER (?T1_product_id in (?T3_product_id)) .   ?T3 a :problems . ?T4 a :staff . ?T3 :problems\#ref-closure_authorised_by_staff_id ?T4 .  ?T3 :problems\#product_id ?T3_product_id . ?T4 :staff\#staff_first_name ?T4_staff_first_name . ?T4 :staff\#staff_last_name ?T4_staff_last_name .  FILTER(?T4_staff_first_name = 'Ashley' && ?T4_staff_last_name = 'Medhurst') .             }
tracking_software_problems,Which problems were reported before the date of any problem reported by the staff Lysanne Turcotte? Give me the ids of the problems.,SELECT ?T1_problem_id WHERE { ?T1 a :problems . ?T1 :problems\#problem_id ?T1_problem_id . ?T1 :problems\#date_problem_reported ?T1_date_problem_reported . FILTER(?T1_date_problem_reported < (?T23_staff_last_name)) .       {SELECT (min( ?T22_date_problem_reported) as ?aggregation_T22_date_problem_reported_123 ) WHERE { ?T22 a :problems . ?T23 a :staff . ?T22 :problems\#ref-closure_authorised_by_staff_id ?T23 .  ?T22 :problems\#date_problem_reported ?T22_date_problem_reported . ?T23 :staff\#staff_first_name ?T23_staff_first_name . ?T23 :staff\#staff_last_name ?T23_staff_last_name . FILTER(?T23_staff_first_name = 'Lysanne' && ?T23_staff_last_name = 'Turcotte') .        }    } }
tracking_software_problems,Find the ids of the problems reported after the date of any problems reported by the staff Rylan Homenick.,SELECT ?T1_problem_id WHERE { ?T1 a :problems . ?T1 :problems\#problem_id ?T1_problem_id . ?T1 :problems\#date_problem_reported ?T1_date_problem_reported . FILTER(?T1_date_problem_reported > (?T23_staff_last_name)) .       {SELECT (max( ?T22_date_problem_reported) as ?aggregation_T22_date_problem_reported_16 ) WHERE { ?T22 a :problems . ?T23 a :staff . ?T22 :problems\#ref-closure_authorised_by_staff_id ?T23 .  ?T22 :problems\#date_problem_reported ?T22_date_problem_reported . ?T23 :staff\#staff_first_name ?T23_staff_first_name . ?T23 :staff\#staff_last_name ?T23_staff_last_name . FILTER(?T23_staff_first_name = 'Rylan' && ?T23_staff_last_name = 'Homenick') .        }    } }
tracking_software_problems,Find the top 3 products which have the largest number of problems?,SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :product . ?T2 a :problems . ?T2 :problems\#ref-product_id ?T1 .  ?T1 :product\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_software_problems,List the ids of the problems from the product 'voluptatem' that are reported after 1995?,"SELECT ?t1_problem_id WHERE {?t1 a :problems . ?t2 a :product . ?t1 :problems\#ref-product_id ?t2 . ?t2 :product\#product_name ?t2_product_name . ?t1 :problems\#date_problem_reported ?t1_date_problem_reported . FILTER (?t2_product_name = 'voluptatem') FILTER (contains(xsd:text(?t1_date_problem_reported), '1995'))}"
tracking_software_problems,What are the ids of the problems that are from the product 'voluptatem' and are reported after 1995?,"SELECT ?t1_problem_id WHERE {?t1 a :problems . ?t2 a :product . ?t1 :problems\#ref-product_id ?t2 . ?t2 :product\#product_name ?t2_product_name . ?t1 :problems\#date_problem_reported ?t1_date_problem_reported . FILTER (?t2_product_name = 'voluptatem') FILTER (contains(xsd:text(?t1_date_problem_reported), '1995'))}"
tracking_software_problems,Find the first and last name of the staff members who reported problems from the product 'rem' but not 'aut'?,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_staff_first_name as ?col1) (?T1_staff_last_name as ?col2) WHERE { ?T1 a :staff . ?T13 a :problems . ?T13 :problems\#ref-closure_authorised_by_staff_id ?T1 .  ?T1 :staff\#staff_first_name ?T1_staff_first_name . ?T1 :staff\#staff_last_name ?T1_staff_last_name . ?T2 :product\#product_name ?T2_product_name . ?T2 a :product . ?T13 :problems\#ref-product_id ?T2 .  ?T1 :staff\#staff_first_name ?T1_staff_first_name . ?T1 :staff\#staff_last_name ?T1_staff_last_name . ?T2 :product\#product_name ?T2_product_name . FILTER(?T2_product_name = 'rem') .   }}  MINUS {SELECT (?T3_staff_first_name as ?col1) (?T3_staff_last_name as ?col2) WHERE { ?T3 a :staff . ?T15 a :problems . ?T15 :problems\#ref-closure_authorised_by_staff_id ?T3 .  ?T3 :staff\#staff_first_name ?T3_staff_first_name . ?T3 :staff\#staff_last_name ?T3_staff_last_name . ?T4 :product\#product_name ?T4_product_name . ?T4 a :product . ?T15 :problems\#ref-product_id ?T4 .  ?T3 :staff\#staff_first_name ?T3_staff_first_name . ?T3 :staff\#staff_last_name ?T3_staff_last_name . ?T4 :product\#product_name ?T4_product_name . FILTER(?T4_product_name = 'aut') .        }     } }
tracking_software_problems,Find the products which have problems reported by both Lacey Bosco and Kenton Champlin?,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :product . ?T13 a :problems . ?T13 :problems\#ref-product_id ?T1 .  ?T1 :product\#product_name ?T1_product_name . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . ?T2 a :staff . ?T13 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :product\#product_name ?T1_product_name . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_first_name = 'Lacey' && ?T2_staff_last_name = 'Bosco') . FILTER (?T1_product_name in (?T3_product_name)) .   ?T3 a :product . ?T15 a :problems . ?T15 :problems\#ref-product_id ?T3 .  ?T3 :product\#product_name ?T3_product_name . ?T4 :staff\#staff_first_name ?T4_staff_first_name . ?T4 :staff\#staff_last_name ?T4_staff_last_name . ?T4 a :staff . ?T15 :problems\#ref-closure_authorised_by_staff_id ?T4 .  ?T3 :product\#product_name ?T3_product_name . ?T4 :staff\#staff_first_name ?T4_staff_first_name . ?T4 :staff\#staff_last_name ?T4_staff_last_name .  FILTER(?T4_staff_first_name = 'Kenton' && ?T4_staff_last_name = 'Champlin') .             }
tracking_software_problems,Which products have problems reported by both the staff named Lacey Bosco and the staff named Kenton Champlin?,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :product . ?T13 a :problems . ?T13 :problems\#ref-product_id ?T1 .  ?T1 :product\#product_name ?T1_product_name . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . ?T2 a :staff . ?T13 :problems\#ref-closure_authorised_by_staff_id ?T2 .  ?T1 :product\#product_name ?T1_product_name . ?T2 :staff\#staff_first_name ?T2_staff_first_name . ?T2 :staff\#staff_last_name ?T2_staff_last_name . FILTER(?T2_staff_first_name = 'Lacey' && ?T2_staff_last_name = 'Bosco') . FILTER (?T1_product_name in (?T3_product_name)) .   ?T3 a :product . ?T15 a :problems . ?T15 :problems\#ref-product_id ?T3 .  ?T3 :product\#product_name ?T3_product_name . ?T4 :staff\#staff_first_name ?T4_staff_first_name . ?T4 :staff\#staff_last_name ?T4_staff_last_name . ?T4 a :staff . ?T15 :problems\#ref-closure_authorised_by_staff_id ?T4 .  ?T3 :product\#product_name ?T3_product_name . ?T4 :staff\#staff_first_name ?T4_staff_first_name . ?T4 :staff\#staff_last_name ?T4_staff_last_name .  FILTER(?T4_staff_first_name = 'Kenton' && ?T4_staff_last_name = 'Champlin') .             }
shop_membership,"Show name, address road, and city for all branches sorted by open year.",SELECT ?T1_name ?T1_address_road ?T1_city WHERE { ?T1 a :branch . ?T1 :branch\#name ?T1_name . ?T1 :branch\#address_road ?T1_address_road . ?T1 :branch\#city ?T1_city . ?T1 :branch\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
shop_membership,What are names for top three branches with most number of membership?,SELECT ?T1_name WHERE { ?T1 a :branch . ?T1 :branch\#name ?T1_name . ?T1 :branch\#membership_amount ?T1_membership_amount .        }   ORDER BY DESC (?T1_membership_amount) LIMIT 1
shop_membership,What are the names for the 3 branches that have the most memberships?,SELECT ?T1_name WHERE { ?T1 a :branch . ?T1 :branch\#name ?T1_name . ?T1 :branch\#membership_amount ?T1_membership_amount .        }   ORDER BY DESC (?T1_membership_amount) LIMIT 1
shop_membership,Show all distinct city where branches with at least 100 memberships are located.,SELECT DISTINCT ?T1_city WHERE { ?T1 a :branch . ?T1 :branch\#city ?T1_city . ?T1 :branch\#membership_amount ?T1_membership_amount . FILTER(?T1_membership_amount >= 100) .        }
shop_membership,What are the different cities that have more than 100 memberships?,SELECT DISTINCT ?T1_city WHERE { ?T1 a :branch . ?T1 :branch\#city ?T1_city . ?T1 :branch\#membership_amount ?T1_membership_amount . FILTER(?T1_membership_amount >= 100) .        }
shop_membership,List all open years when at least two shops are opened.,SELECT ?T1_open_year WHERE { ?T1 a :branch . ?T1 :branch\#open_year ?T1_open_year .        } GROUP BY ?T1_open_year   HAVING(count( *)  >= 2)
shop_membership,What are the opening years in which at least two shops opened?,SELECT ?T1_open_year WHERE { ?T1 a :branch . ?T1 :branch\#open_year ?T1_open_year .        } GROUP BY ?T1_open_year   HAVING(count( *)  >= 2)
shop_membership,Show minimum and maximum amount of memberships for all branches opened in 2011 or located at city London.,SELECT (min( ?T1_membership_amount) as ?aggregation_T1_membership_amount_185 ) (max( ?T1_membership_amount) as ?aggregation_T1_membership_amount_19 ) WHERE { ?T1 a :branch . ?T1 :branch\#membership_amount ?T1_membership_amount . ?T1 :branch\#membership_amount ?T1_membership_amount . ?T1 :branch\#open_year ?T1_open_year . ?T1 :branch\#city ?T1_city . FILTER(?T1_open_year = 2011 || ?T1_city = 'London') .        }
shop_membership,Show the city and the number of branches opened before 2010 for each city.,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :branch . ?T1 :branch\#city ?T1_city . ?T1 :branch\#open_year ?T1_open_year . FILTER(?T1_open_year < 2010) .        } GROUP BY ?T1_city
shop_membership,How many different levels do members have?,SELECT DISTINCT (count(DISTINCT ?T1_level) as ?aggregation_T1_level_152 ) WHERE { ?T1 a :member . ?T1 :member\#level ?T1_level .        }
shop_membership,What are the different membership levels?,SELECT DISTINCT (count(DISTINCT ?T1_level) as ?aggregation_T1_level_5 ) WHERE { ?T1 a :member . ?T1 :member\#level ?T1_level .        }
shop_membership,"Show card number, name, and hometown for all members in a descending order of level.",SELECT ?T1_card_number ?T1_name ?T1_hometown WHERE { ?T1 a :member . ?T1 :member\#card_number ?T1_card_number . ?T1 :member\#name ?T1_name . ?T1 :member\#hometown ?T1_hometown . ?T1 :member\#level ?T1_level .        }  ORDER BY DESC (?T1_level)
shop_membership,Show the membership level with most number of members.,SELECT ?T1_level (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :member\#level ?T1_level .        } GROUP BY ?T1_level  ORDER BY DESC (?aggregation_all) LIMIT 1
shop_membership,What is the membership level with the most people?,SELECT ?T1_level (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :member\#level ?T1_level .        } GROUP BY ?T1_level  ORDER BY DESC (?aggregation_all) LIMIT 1
shop_membership,Show all member names and registered branch names sorted by register year.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :member . ?T14 a :purchase . ?T14 :purchase\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :branch\#name ?T2_name . ?T3 :membership_register_branch\#register_year ?T3_register_year . ?T2 a :branch . ?T14 :purchase\#ref-branch_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :branch\#name ?T2_name . ?T3 :membership_register_branch\#register_year ?T3_register_year . ?T3 a :membership_register_branch . ?T3 :membership_register_branch\#ref-branch_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :branch\#name ?T2_name . ?T3 :membership_register_branch\#register_year ?T3_register_year .        }  ORDER BY ASC (?T3_register_year)
shop_membership,Show all branch names with the number of members in each branch registered after 2015.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :branch . ?T2 a :membership_register_branch . ?T2 :membership_register_branch\#ref-branch_id ?T1 .  ?T1 :branch\#name ?T1_name . ?T2 :membership_register_branch\#register_year ?T2_register_year . FILTER(?T2_register_year > 2015) .        } GROUP BY ?T1_name
shop_membership,Show member names without any registered branch.,SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#member_id ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) .       {SELECT ?T22_member_id WHERE { ?T22 a :membership_register_branch . ?T22 :membership_register_branch\#member_id ?T22_member_id .        }    } }
shop_membership,List the branch name and city without any registered members.,SELECT ?T1_name ?T1_city WHERE { ?T1 a :branch . ?T1 :branch\#name ?T1_name . ?T1 :branch\#city ?T1_city . ?T1 :branch\#branch_id ?T1_branch_id . FILTER(?T1_branch_id not in (?T22_branch_id)) .       {SELECT ?T22_branch_id WHERE { ?T22 a :membership_register_branch . ?T22 :membership_register_branch\#branch_id ?T22_branch_id .        }    } }
shop_membership,Show the member name and hometown who registered a branch in 2016.,SELECT ?T1_name ?T1_hometown WHERE { ?T1 a :member . ?T2 a :membership_register_branch . ?T2 :membership_register_branch\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T1 :member\#hometown ?T1_hometown . ?T2 :membership_register_branch\#register_year ?T2_register_year . FILTER(?T2_register_year = 2016) .        }
shop_membership,Show all city with a branch opened in 2001 and a branch with more than 100 membership.,SELECT ?T1_city WHERE { ?T1 a :branch . ?T1 :branch\#city ?T1_city . ?T1 :branch\#open_year ?T1_open_year . ?T1 :branch\#membership_amount ?T1_membership_amount . FILTER(?T1_open_year = 2001 && ?T1_membership_amount > 100) .        }
shop_membership,Show all cities without a branch having more than 100 memberships.,SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :branch . ?T1 :branch\#city ?T1_city .   }}  MINUS {SELECT (?T2_city as ?col1) WHERE { ?T2 a :branch . ?T2 :branch\#city ?T2_city . ?T2 :branch\#membership_amount ?T2_membership_amount . FILTER(?T2_membership_amount > 100) .        }     } }
shop_membership,What are the cities that do not have any branches with more than 100 members?,SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :branch . ?T1 :branch\#city ?T1_city .   }}  MINUS {SELECT (?T2_city as ?col1) WHERE { ?T2 a :branch . ?T2 :branch\#city ?T2_city . ?T2 :branch\#membership_amount ?T2_membership_amount . FILTER(?T2_membership_amount > 100) .        }     } }
shop_membership,What is the total number of purchases for members with level 6?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :purchase . ?T2 a :member . ?T1 :purchase\#ref-member_id ?T2 .  ?T2 :member\#level ?T2_level . FILTER(?T2_level = 6) .        }
shop_membership,What are the total purchases for members rated at level 6?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :purchase . ?T2 a :member . ?T1 :purchase\#ref-member_id ?T2 .  ?T2 :member\#level ?T2_level . FILTER(?T2_level = 6) .        }
shop_membership,"Find the name of branches where have some members whose hometown is in Louisville, Kentucky and some in Hiram, Georgia.","SELECT DISTINCT ?T1_name WHERE { ?T1 a :branch . ?T13 a :purchase . ?T13 :purchase\#ref-branch_id ?T1 .  ?T1 :branch\#name ?T1_name . ?T2 :member\#hometown ?T2_hometown . ?T2 a :member . ?T13 :purchase\#ref-member_id ?T2 .  ?T1 :branch\#name ?T1_name . ?T2 :member\#hometown ?T2_hometown . FILTER(?T2_hometown = 'Louisville ,  Kentucky') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :branch . ?T15 a :purchase . ?T15 :purchase\#ref-branch_id ?T3 .  ?T3 :branch\#name ?T3_name . ?T4 :member\#hometown ?T4_hometown . ?T4 a :member . ?T15 :purchase\#ref-member_id ?T4 .  ?T3 :branch\#name ?T3_name . ?T4 :member\#hometown ?T4_hometown .  FILTER(?T4_hometown = 'Hiram ,  Georgia') .             }"
shop_membership,"What are the names of the branches that have some members with a hometown in Louisville, Kentucky and also those from Hiram, Goergia?","SELECT DISTINCT ?T1_name WHERE { ?T1 a :branch . ?T13 a :purchase . ?T13 :purchase\#ref-branch_id ?T1 .  ?T1 :branch\#name ?T1_name . ?T2 :member\#hometown ?T2_hometown . ?T2 a :member . ?T13 :purchase\#ref-member_id ?T2 .  ?T1 :branch\#name ?T1_name . ?T2 :member\#hometown ?T2_hometown . FILTER(?T2_hometown = 'Louisville ,  Kentucky') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :branch . ?T15 a :purchase . ?T15 :purchase\#ref-branch_id ?T3 .  ?T3 :branch\#name ?T3_name . ?T4 :member\#hometown ?T4_hometown . ?T4 a :member . ?T15 :purchase\#ref-member_id ?T4 .  ?T3 :branch\#name ?T3_name . ?T4 :member\#hometown ?T4_hometown .  FILTER(?T4_hometown = 'Hiram ,  Georgia') .             }"
shop_membership,list the card number of all members whose hometown address includes word 'Kentucky'.,"SELECT ?T1_card_number WHERE { ?T1 a :member . ?T1 :member\#card_number ?T1_card_number . ?T1 :member\#hometown ?T1_hometown . FILTER(contains (?T1_hometown, 'Kentucky')) .        }"
shop_membership,What are the card numbers of members from Kentucky?,"SELECT ?T1_card_number WHERE { ?T1 a :member . ?T1 :member\#card_number ?T1_card_number . ?T1 :member\#hometown ?T1_hometown . FILTER(contains (?T1_hometown, 'Kentucky')) .        }"
voter_2,How many students are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student .        }
voter_2,Find the number of voting records in total.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :voting_record .        }
voter_2,How many voting records do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :voting_record .        }
voter_2,Find the distinct number of president votes.,SELECT DISTINCT (count(DISTINCT ?T1_president_vote) as ?aggregation_T1_president_vote_179 ) WHERE { ?T1 a :voting_record . ?T1 :voting_record\#president_vote ?T1_president_vote .        }
voter_2,How many distinct president votes are recorded?,SELECT DISTINCT (count(DISTINCT ?T1_president_vote) as ?aggregation_T1_president_vote_24 ) WHERE { ?T1 a :voting_record . ?T1 :voting_record\#president_vote ?T1_president_vote .        }
voter_2,Find the maximum age of all the students.,SELECT (max( ?T1_age) as ?aggregation_T1_age_48 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age .        }
voter_2,What is the oldest age among the students?,SELECT (max( ?T1_age) as ?aggregation_T1_age_72 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age .        }
voter_2,Find the last names of students with major 50.,SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 50) .        }
voter_2,What are the last names of students studying major 50?,SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 50) .        }
voter_2,Find the first names of students with age above 22.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age . FILTER(?T1_age > 22) .        }
voter_2,What are the first names of all the students aged above 22?,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age . FILTER(?T1_age > 22) .        }
voter_2,What are the majors of male (sex is M) students?,SELECT ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
voter_2,What is the average age of female (sex is F) students?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_142 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
voter_2,Find the average age of female students.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_70 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
voter_2,What are the maximum and minimum age of students with major 600?,SELECT (max( ?T1_age) as ?aggregation_T1_age_187 ) (min( ?T1_age) as ?aggregation_T1_age_143 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 600) .        }
voter_2,Tell me the ages of the oldest and youngest students studying major 600.,SELECT (max( ?T1_age) as ?aggregation_T1_age_75 ) (min( ?T1_age) as ?aggregation_T1_age_65 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 600) .        }
voter_2,Who are the advisors for students that live in a city with city code 'BAL'?,SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor . ?T1 :student\#city_code ?T1_city_code . FILTER(?T1_city_code = 'BAL') .        }
voter_2,What are the distinct secretary votes in the fall election cycle?,SELECT DISTINCT ?T1_secretary_vote WHERE { ?T1 a :voting_record . ?T1 :voting_record\#secretary_vote ?T1_secretary_vote . ?T1 :voting_record\#election_cycle ?T1_election_cycle . FILTER(?T1_election_cycle = 'Fall') .        }
voter_2,What are the distinct president votes on 08/30/2015?,SELECT DISTINCT ?T1_president_vote WHERE { ?T1 a :voting_record . ?T1 :voting_record\#president_vote ?T1_president_vote . ?T1 :voting_record\#registration_date ?T1_registration_date . FILTER(?T1_registration_date = '08/30/2015') .        }
voter_2,Report the distinct registration date and the election cycle.,SELECT DISTINCT ?T1_registration_date ?T1_election_cycle WHERE { ?T1 a :voting_record . ?T1 :voting_record\#registration_date ?T1_registration_date . ?T1 :voting_record\#election_cycle ?T1_election_cycle .        }
voter_2,What are the distinct registration dates and the election cycles?,SELECT DISTINCT ?T1_registration_date ?T1_election_cycle WHERE { ?T1 a :voting_record . ?T1 :voting_record\#registration_date ?T1_registration_date . ?T1 :voting_record\#election_cycle ?T1_election_cycle .        }
voter_2,Report the distinct president vote and the vice president vote.,SELECT DISTINCT ?T1_president_vote ?T1_vice_president_vote WHERE { ?T1 a :voting_record . ?T1 :voting_record\#president_vote ?T1_president_vote . ?T1 :voting_record\#vice_president_vote ?T1_vice_president_vote .        }
voter_2,Find the distinct last names of the students who have class president votes.,SELECT DISTINCT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname .        }
voter_2,Find the distinct ages of students who have secretary votes in the fall election cycle.,SELECT DISTINCT ?T1_age WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T2_election_cycle = 'Fall') .        }
voter_2,Find the distinct Advisor of students who have treasurer votes in the spring election cycle.,SELECT DISTINCT ?T1_advisor WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#advisor ?T1_advisor . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T2_election_cycle = 'Spring') .        }
voter_2,Find the first and last names of all the female (sex is F) students who have president votes.,SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
voter_2,Find the first and last name of all the students of age 18 who have vice president votes.,SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . FILTER(?T1_age = 18) .        }
voter_2,Count the number of male students who had class senator votes in the fall election cycle.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#sex ?T1_sex . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T1_sex = 'M' && ?T2_election_cycle = 'Fall') .        }
voter_2,Find the number of students whose city code is NYC and who have class senator votes in the spring election cycle.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#city_code ?T1_city_code . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T1_city_code = 'NYC' && ?T2_election_cycle = 'Spring') .        }
voter_2,Find the average age of students who live in the city with code 'NYC' and have secretary votes in the spring election cycle.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_30 ) WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T1_city_code = 'NYC' && ?T2_election_cycle = 'Spring') .        }
