kg_name,question,query
phone_1,List the hardware model name for the phones that have screen mode type 'Text' or RAM size greater than 32.,SELECT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\#ref-screen_mode ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T2 :screen_mode\#type ?T2_type . ?T3 :chip_model\#ram_mib ?T3_ram_mib . ?T3 a :chip_model . ?T1 :phone\#ref-chip_model ?T3 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T2 :screen_mode\#type ?T2_type . ?T3 :chip_model\#ram_mib ?T3_ram_mib . FILTER(?T2_type = 'Text' || ?T3_ram_mib > 32) .        }
phone_1,List the hardware model name for the phones that were produced by 'Nokia Corporation' or whose screen mode type is 'Graphics.',SELECT DISTINCT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\#ref-screen_mode ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T2 :screen_mode\#type ?T2_type . ?T1 :phone\#company_name ?T1_company_name . FILTER(?T2_type = 'Graphics' || ?T1_company_name = 'Nokia Corporation') .        }
phone_1,List the hardware model name for the phons that were produced by 'Nokia Corporation' but whose screen mode type is not Text.,SELECT DISTINCT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\#ref-screen_mode ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\#company_name ?T1_company_name . ?T2 :screen_mode\#type ?T2_type . FILTER(?T1_company_name = 'Nokia Corporation' && ?T2_type != 'Text') .        }
phone_1,List the phone hardware model and company name for the phones whose screen usage in kb is between 10 and 15.,SELECT DISTINCT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\#ref-screen_mode ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\#company_name ?T1_company_name . ?T2 :screen_mode\#used_kb ?T2_used_kb . FILTER(?T2_used_kb >= 10 && ?T2_used_kb <= 15) .        }
phone_1,Find the number of phones for each accreditation type.,SELECT ?T1_accreditation_type (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :phone\#accreditation_type ?T1_accreditation_type .        } GROUP BY ?T1_accreditation_type
phone_1,How many phones belongs to each accreditation type?,SELECT ?T1_accreditation_type (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :phone\#accreditation_type ?T1_accreditation_type .        } GROUP BY ?T1_accreditation_type
phone_1,Find the accreditation level that more than 3 phones use.,SELECT ?T1_accreditation_level WHERE { ?T1 a :phone . ?T1 :phone\#accreditation_level ?T1_accreditation_level .        } GROUP BY ?T1_accreditation_level   HAVING(count( *)  > 3)
phone_1,Find the details for all chip models.,SELECT * WHERE { ?T1 a :chip_model .        }
phone_1,How many models do not have the wifi function?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :chip_model . ?T1 :chip_model\#wifi ?T1_wifi . FILTER(?T1_wifi = 'No') .        }
phone_1,List all the model names sorted by their launch year.,SELECT ?T1_model_name WHERE { ?T1 a :chip_model . ?T1 :chip_model\#model_name ?T1_model_name . ?T1 :chip_model\#launch_year ?T1_launch_year .        }  ORDER BY ASC (?T1_launch_year)
phone_1,Find the average ram mib size of the chip models that are never used by any phone.,SELECT (avg( ?T1_ram_mib) as ?aggregation_T1_ram_mib_200 ) WHERE { ?T1 a :chip_model . ?T1 :chip_model\#ram_mib ?T1_ram_mib . ?T1 :chip_model\#model_name ?T1_model_name . FILTER(?T1_model_name not in (?T22_chip_model)) .       {SELECT ?T22_chip_model WHERE { ?T22 a :phone . ?T22 :phone\#chip_model ?T22_chip_model .        }    } }
phone_1,Find the names of the chip models that are not used by any phone with full accreditation type.,SELECT distinct?col1 WHERE { { SELECT (?T1_model_name as ?col1) WHERE { ?T1 a :chip_model . ?T1 :chip_model\#model_name ?T1_model_name .   }}  MINUS {SELECT (?T2_chip_model as ?col1) WHERE { ?T2 a :phone . ?T2 :phone\#chip_model ?T2_chip_model . ?T2 :phone\#accreditation_type ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Full') .        }     } }
phone_1,Find the pixels of the screen modes that are used by both phones with full accreditation types and phones with Provisional accreditation types.,SELECT DISTINCT ?T1_pixels WHERE { ?T1 a :screen_mode . ?T2 a :phone . ?T2 :phone\#ref-screen_mode ?T1 .  ?T1 :screen_mode\#pixels ?T1_pixels . ?T2 :phone\#accreditation_type ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Provisional') . FILTER (?T1_pixels in (?T3_pixels)) .   ?T3 a :screen_mode . ?T4 a :phone . ?T4 :phone\#ref-screen_mode ?T3 .  ?T3 :screen_mode\#pixels ?T3_pixels . ?T4 :phone\#accreditation_type ?T4_accreditation_type .  FILTER(?T4_accreditation_type = 'Full') .             }
match_season,How many countries are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :country .        }
match_season,Show the country name and capital of all countries.,SELECT ?T1_country_name ?T1_capital WHERE { ?T1 a :country . ?T1 :country\#country_name ?T1_country_name . ?T1 :country\#capital ?T1_capital .        }
match_season,What are the names and capitals of each country?,SELECT ?T1_country_name ?T1_capital WHERE { ?T1 a :country . ?T1 :country\#country_name ?T1_country_name . ?T1 :country\#capital ?T1_capital .        }
match_season,Show all official native languages that contain the word 'English'.,"SELECT ?T1_official_native_language WHERE { ?T1 a :country . ?T1 :country\#official_native_language ?T1_official_native_language . ?T1 :country\#official_native_language ?T1_official_native_language . FILTER(contains (?T1_official_native_language, 'English')) .        }"
match_season,Show all distinct positions of matches.,SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position .        }
match_season,What are the different positions for match season?,SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position .        }
match_season,Show the players from college UCLA.,SELECT ?T1_player WHERE { ?T1 a :match_season . ?T1 :match_season\#player ?T1_player . ?T1 :match_season\#college ?T1_college . FILTER(?T1_college = 'UCLA') .        }
match_season,Who are the players from UCLA?,SELECT ?T1_player WHERE { ?T1 a :match_season . ?T1 :match_season\#player ?T1_player . ?T1 :match_season\#college ?T1_college . FILTER(?T1_college = 'UCLA') .        }
match_season,Show the distinct position of players from college UCLA or Duke.,SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position . ?T1 :match_season\#college ?T1_college . ?T1 :match_season\#college ?T1_college . FILTER(?T1_college = 'UCLA' || ?T1_college = 'Duke') .        }
match_season,What are the different positions of players from UCLA or Duke colleges?,SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position . ?T1 :match_season\#college ?T1_college . ?T1 :match_season\#college ?T1_college . FILTER(?T1_college = 'UCLA' || ?T1_college = 'Duke') .        }
match_season,Show the draft pick numbers and draft classes of players whose positions are defenders.,SELECT ?T1_draft_pick_number ?T1_draft_class WHERE { ?T1 a :match_season . ?T1 :match_season\#draft_pick_number ?T1_draft_pick_number . ?T1 :match_season\#draft_class ?T1_draft_class . ?T1 :match_season\#position ?T1_position . FILTER(?T1_position = 'Defender') .        }
match_season,How many distinct teams are involved in match seasons?,SELECT DISTINCT (count(DISTINCT ?T1_team) as ?aggregation_T1_team_134 ) WHERE { ?T1 a :match_season . ?T1 :match_season\#team ?T1_team .        }
match_season,Count the number of different teams involved in match season.,SELECT DISTINCT (count(DISTINCT ?T1_team) as ?aggregation_T1_team_199 ) WHERE { ?T1 a :match_season . ?T1 :match_season\#team ?T1_team .        }
match_season,Show the players and the years played.,SELECT ?T1_player ?T1_years_played WHERE { ?T1 a :player . ?T1 :player\#player ?T1_player . ?T1 :player\#years_played ?T1_years_played .        }
match_season,Who are the different players and how many years has each played?,SELECT ?T1_player ?T1_years_played WHERE { ?T1 a :player . ?T1 :player\#player ?T1_player . ?T1 :player\#years_played ?T1_years_played .        }
match_season,Show all team names.,SELECT ?T1_name WHERE { ?T1 a :team . ?T1 :team\#name ?T1_name .        }
match_season,What are the names of all teams?,SELECT ?T1_name WHERE { ?T1 a :team . ?T1 :team\#name ?T1_name .        }
match_season,"Show the season, the player, and the name of the country that player belongs to.",SELECT ?T1_season ?T1_player ?T2_country_name WHERE { ?T1 a :match_season . ?T2 a :country . ?T1 :match_season\#ref-country ?T2 .  ?T1 :match_season\#season ?T1_season . ?T1 :match_season\#player ?T1_player . ?T2 :country\#country_name ?T2_country_name .        }
match_season,Which players are from Indonesia?,SELECT ?T1_player WHERE { ?T1 a :match_season . ?T2 a :country . ?T1 :match_season\#ref-country ?T2 .  ?T1 :match_season\#player ?T1_player . ?T2 :country\#country_name ?T2_country_name . FILTER(?T2_country_name = 'Indonesia') .        }
match_season,Who are the players from Indonesia?,SELECT ?T1_player WHERE { ?T1 a :match_season . ?T2 a :country . ?T1 :match_season\#ref-country ?T2 .  ?T1 :match_season\#player ?T1_player . ?T2 :country\#country_name ?T2_country_name . FILTER(?T2_country_name = 'Indonesia') .        }
match_season,Give the different positions of players who play for the country with the capital Dublin.,SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T2 a :country . ?T1 :match_season\#ref-country ?T2 .  ?T1 :match_season\#position ?T1_position . ?T2 :country\#capital ?T2_capital . FILTER(?T2_capital = 'Dublin') .        }
match_season,Return the official native languages of countries who have players from Maryland or Duke colleges.,SELECT ?T1_official_native_language WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :match_season\#ref-country ?T1 .  ?T1 :country\#official_native_language ?T1_official_native_language . ?T2 :match_season\#college ?T2_college . ?T2 :match_season\#college ?T2_college . FILTER(?T2_college = 'Maryland' || ?T2_college = 'Duke') .        }
match_season,How many distinct official languages are there among countries of players whose positions are defenders.,SELECT DISTINCT (count(DISTINCT ?T1_official_native_language) as ?aggregation_T1_official_native_language_149 ) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :match_season\#ref-country ?T1 .  ?T1 :country\#official_native_language ?T1_official_native_language . ?T2 :match_season\#position ?T2_position . FILTER(?T2_position = 'Defender') .        }
match_season,Count the number of different official languages corresponding to countries that players who play Defender are from.,SELECT DISTINCT (count(DISTINCT ?T1_official_native_language) as ?aggregation_T1_official_native_language_30 ) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :match_season\#ref-country ?T1 .  ?T1 :country\#official_native_language ?T1_official_native_language . ?T2 :match_season\#position ?T2_position . FILTER(?T2_position = 'Defender') .        }
match_season,"Show the season, the player, and the name of the team that players belong to.",SELECT ?T1_season ?T1_player ?T2_name WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :match_season\#ref-team ?T2 .  ?T1 :match_season\#season ?T1_season . ?T1 :match_season\#player ?T1_player . ?T2 :team\#name ?T2_name .        }
match_season,Show the positions of the players from the team with name 'Ryley Goldner'.,SELECT ?T1_position WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :match_season\#ref-team ?T2 .  ?T1 :match_season\#position ?T1_position . ?T2 :team\#name ?T2_name . FILTER(?T2_name = 'Ryley Goldner') .        }
match_season,How many distinct colleges are associated with players from the team with name 'Columbus Crew'.,SELECT DISTINCT (count(DISTINCT ?T1_college) as ?aggregation_T1_college_106 ) WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :match_season\#ref-team ?T2 .  ?T1 :match_season\#college ?T1_college . ?T2 :team\#name ?T2_name . FILTER(?T2_name = 'Columbus Crew') .        }
match_season,Count the number of different colleges that players who play for Columbus Crew are from.,SELECT DISTINCT (count(DISTINCT ?T1_college) as ?aggregation_T1_college_160 ) WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :match_season\#ref-team ?T2 .  ?T1 :match_season\#college ?T1_college . ?T2 :team\#name ?T2_name . FILTER(?T2_name = 'Columbus Crew') .        }
match_season,Show the players and years played for players from team 'Columbus Crew'.,SELECT ?T1_player ?T1_years_played WHERE { ?T1 a :player . ?T2 a :team . ?T1 :player\#ref-team ?T2 .  ?T1 :player\#player ?T1_player . ?T1 :player\#years_played ?T1_years_played . ?T2 :team\#name ?T2_name . FILTER(?T2_name = 'Columbus Crew') .        }
match_season,Show the position of players and the corresponding number of players.,SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position .        } GROUP BY ?T1_position
match_season,How many players played each position?,SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position .        } GROUP BY ?T1_position
match_season,Show the country names and the corresponding number of players.,SELECT ?T1_country_name (count( *) as ?aggregation_all) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :match_season\#ref-country ?T1 .  ?T1 :country\#country_name ?T1_country_name .        } GROUP BY ?T1_country_name
match_season,How many players are from each country?,SELECT ?T1_country_name (count( *) as ?aggregation_all) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :match_season\#ref-country ?T1 .  ?T1 :country\#country_name ?T1_country_name .        } GROUP BY ?T1_country_name
match_season,Return all players sorted by college in ascending alphabetical order.,SELECT ?T1_player WHERE { ?T1 a :match_season . ?T1 :match_season\#player ?T1_player . ?T1 :match_season\#college ?T1_college .        }  ORDER BY ASC (?T1_college)
match_season,Show the most common position of players in match seasons.,SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position .        } GROUP BY ?T1_position  ORDER BY DESC (?aggregation_all) LIMIT 1
match_season,What is the position that is most common among players in match seasons?,SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :match_season\#position ?T1_position .        } GROUP BY ?T1_position  ORDER BY DESC (?aggregation_all) LIMIT 1
match_season,Show the top 3 most common colleges of players in match seasons.,SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :match_season\#college ?T1_college .        } GROUP BY ?T1_college  ORDER BY DESC (?aggregation_all) LIMIT 1
match_season,What are the three colleges from which the most players are from?,SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :match_season\#college ?T1_college .        } GROUP BY ?T1_college  ORDER BY DESC (?aggregation_all) LIMIT 1
match_season,Show the name of colleges that have at least two players.,SELECT ?T1_college WHERE { ?T1 a :match_season . ?T1 :match_season\#college ?T1_college .        } GROUP BY ?T1_college   HAVING(count( *)  >= 2)
match_season,What are the names of all colleges that have two or more players?,SELECT ?T1_college WHERE { ?T1 a :match_season . ?T1 :match_season\#college ?T1_college .        } GROUP BY ?T1_college   HAVING(count( *)  >= 2)
match_season,Show the name of colleges that have at least two players in descending alphabetical order.,SELECT ?T1_college WHERE { ?T1 a :match_season . ?T1 :match_season\#college ?T1_college . ?T1 :match_season\#college ?T1_college .        } GROUP BY ?T1_college ORDER BY DESC (?T1_college)  HAVING(count( *)  >= 2)
match_season,What are the names of teams that do no have match season record?,SELECT ?T1_name WHERE { ?T1 a :team . ?T1 :team\#name ?T1_name . ?T1 :team\#team_id ?T1_team_id . FILTER(?T1_team_id not in (?T22_team)) .       {SELECT ?T22_team WHERE { ?T22 a :match_season . ?T22 :match_season\#team ?T22_team .        }    } }
match_season,"Return the names of countries that have players that play the Forward position, as well as players who play the Defender position.",SELECT DISTINCT ?T1_country_name WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :match_season\#ref-country ?T1 .  ?T1 :country\#country_name ?T1_country_name . ?T2 :match_season\#position ?T2_position . FILTER(?T2_position = 'Forward') . FILTER (?T1_country_name in (?T3_country_name)) .   ?T3 a :country . ?T4 a :match_season . ?T4 :match_season\#ref-country ?T3 .  ?T3 :country\#country_name ?T3_country_name . ?T4 :match_season\#position ?T4_position .  FILTER(?T4_position = 'Defender') .             }
match_season,"Return the colleges that have players who play the Midfielder position, as well as players who play the Defender position.",SELECT DISTINCT ?T1_college WHERE { ?T1 a :match_season . ?T1 :match_season\#college ?T1_college . ?T1 :match_season\#position ?T1_position . FILTER(?T1_position = 'Midfielder') . FILTER (?T1_college in (?T2_college)) .   ?T2 a :match_season . ?T2 :match_season\#college ?T2_college . ?T2 :match_season\#position ?T2_position .  FILTER(?T2_position = 'Defender') .             }
climbing,How many climbers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :climber .        }
climbing,List the names of climbers in descending order of points.,SELECT ?T1_name WHERE { ?T1 a :climber . ?T1 :climber\#name ?T1_name . ?T1 :climber\#points ?T1_points .        }  ORDER BY DESC (?T1_points)
climbing,List the names of climbers whose country is not Switzerland.,SELECT ?T1_name WHERE { ?T1 a :climber . ?T1 :climber\#name ?T1_name . ?T1 :climber\#country ?T1_country . FILTER(?T1_country != 'Switzerland') .        }
climbing,What is the maximum point for climbers whose country is United Kingdom?,SELECT (max( ?T1_points) as ?aggregation_T1_points_21 ) WHERE { ?T1 a :climber . ?T1 :climber\#points ?T1_points . ?T1 :climber\#country ?T1_country . FILTER(?T1_country = 'United Kingdom') .        }
climbing,Return the maximum number of points for climbers from the United Kingdom.,SELECT (max( ?T1_points) as ?aggregation_T1_points_136 ) WHERE { ?T1 a :climber . ?T1 :climber\#points ?T1_points . ?T1 :climber\#country ?T1_country . FILTER(?T1_country = 'United Kingdom') .        }
climbing,How many distinct countries are the climbers from?,SELECT DISTINCT (count(DISTINCT ?T1_country) as ?aggregation_T1_country_11 ) WHERE { ?T1 a :climber . ?T1 :climber\#country ?T1_country .        }
climbing,Count the number of different countries that climbers are from.,SELECT DISTINCT (count(DISTINCT ?T1_country) as ?aggregation_T1_country_127 ) WHERE { ?T1 a :climber . ?T1 :climber\#country ?T1_country .        }
climbing,What are the names of mountains in ascending alphabetical order?,SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
climbing,What are the countries of mountains with height bigger than 5000?,SELECT ?T1_country WHERE { ?T1 a :mountain . ?T1 :mountain\#country ?T1_country . ?T1 :mountain\#height ?T1_height . FILTER(?T1_height > 5000) .        }
climbing,What is the name of the highest mountain?,SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#height ?T1_height .        }   ORDER BY DESC (?T1_height) LIMIT 1
climbing,List the distinct ranges of the mountains with the top 3 prominence.,SELECT DISTINCT ?T1_range ?T1_prominence WHERE { ?T1 a :mountain . ?T1 :mountain\#range ?T1_range . ?T1 :mountain\#prominence ?T1_prominence . ?T1 :mountain\#prominence ?T1_prominence .        }   ORDER BY DESC (?T1_prominence) LIMIT 1
climbing,Show names of climbers and the names of mountains they climb.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :climber . ?T2 a :mountain . ?T1 :climber\#ref-mountain_id ?T2 .  ?T1 :climber\#name ?T1_name . ?T2 :mountain\#name ?T2_name .        }
climbing,Show the names of climbers and the heights of mountains they climb.,SELECT ?T1_name ?T2_height WHERE { ?T1 a :climber . ?T2 a :mountain . ?T1 :climber\#ref-mountain_id ?T2 .  ?T1 :climber\#name ?T1_name . ?T2 :mountain\#height ?T2_height .        }
climbing,Show the height of the mountain climbed by the climber with the maximum points.,SELECT ?T1_height WHERE { ?T1 a :mountain . ?T2 a :climber . ?T2 :climber\#ref-mountain_id ?T1 .  ?T1 :mountain\#height ?T1_height . ?T2 :climber\#points ?T2_points .        }   ORDER BY DESC (?T2_points) LIMIT 1
climbing,Show the distinct names of mountains climbed by climbers from country 'West Germany'.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :mountain . ?T2 a :climber . ?T2 :climber\#ref-mountain_id ?T1 .  ?T1 :mountain\#name ?T1_name . ?T2 :climber\#country ?T2_country . FILTER(?T2_country = 'West Germany') .        }
climbing,Show the times used by climbers to climb mountains in Country Uganda.,SELECT ?T1_time WHERE { ?T1 a :climber . ?T2 a :mountain . ?T1 :climber\#ref-mountain_id ?T2 .  ?T1 :climber\#time ?T1_time . ?T2 :mountain\#country ?T2_country . FILTER(?T2_country = 'Uganda') .        }
climbing,Please show the countries and the number of climbers from each country.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :climber . ?T1 :climber\#country ?T1_country .        } GROUP BY ?T1_country
climbing,How many climbers are from each country?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :climber . ?T1 :climber\#country ?T1_country .        } GROUP BY ?T1_country
climbing,List the countries that have more than one mountain.,SELECT ?T1_country WHERE { ?T1 a :mountain . ?T1 :mountain\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  > 1)
climbing,Which countries have more than one mountain?,SELECT ?T1_country WHERE { ?T1 a :mountain . ?T1 :mountain\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  > 1)
climbing,List the names of mountains that do not have any climber.,SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#mountain_id ?T1_mountain_id . FILTER(?T1_mountain_id not in (?T22_mountain_id)) .       {SELECT ?T22_mountain_id WHERE { ?T22 a :climber . ?T22 :climber\#mountain_id ?T22_mountain_id .        }    } }
climbing,What are the names of countains that no climber has climbed?,SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#mountain_id ?T1_mountain_id . FILTER(?T1_mountain_id not in (?T22_mountain_id)) .       {SELECT ?T22_mountain_id WHERE { ?T22 a :climber . ?T22 :climber\#mountain_id ?T22_mountain_id .        }    } }
climbing,Show the countries that have mountains with height more than 5600 stories and mountains with height less than 5200.,SELECT DISTINCT ?T1_country WHERE { ?T1 a :mountain . ?T1 :mountain\#country ?T1_country . ?T1 :mountain\#height ?T1_height . FILTER(?T1_height > 5600) . FILTER (?T1_country in (?T2_country)) .   ?T2 a :mountain . ?T2 :mountain\#country ?T2_country . ?T2 :mountain\#height ?T2_height .  FILTER(?T2_height < 5200) .             }
climbing,Show the range that has the most number of mountains.,SELECT ?T1_range (count( *) as ?aggregation_all) WHERE { ?T1 a :mountain . ?T1 :mountain\#range ?T1_range .        } GROUP BY ?T1_range  ORDER BY DESC (?aggregation_all) LIMIT 1
climbing,Which range contains the most mountains?,SELECT ?T1_range (count( *) as ?aggregation_all) WHERE { ?T1 a :mountain . ?T1 :mountain\#range ?T1_range .        } GROUP BY ?T1_range  ORDER BY DESC (?aggregation_all) LIMIT 1
climbing,Show the names of mountains with height more than 5000 or prominence more than 1000.,SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#height ?T1_height . ?T1 :mountain\#prominence ?T1_prominence . FILTER(?T1_height > 5000 || ?T1_prominence > 1000) .        }
body_builder,How many body builders are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :body_builder .        }
body_builder,List the total scores of body builders in ascending order.,SELECT ?T1_total WHERE { ?T1 a :body_builder . ?T1 :body_builder\#total ?T1_total . ?T1 :body_builder\#total ?T1_total .        }  ORDER BY ASC (?T1_total)
body_builder,List the snatch score and clean jerk score of body builders in ascending order of snatch score.,SELECT ?T1_snatch ?T1_clean_jerk WHERE { ?T1 a :body_builder . ?T1 :body_builder\#snatch ?T1_snatch . ?T1 :body_builder\#clean_jerk ?T1_clean_jerk . ?T1 :body_builder\#snatch ?T1_snatch .        }  ORDER BY ASC (?T1_snatch)
body_builder,What is the average snatch score of body builders?,SELECT (avg( ?T1_snatch) as ?aggregation_T1_snatch_110 ) WHERE { ?T1 a :body_builder . ?T1 :body_builder\#snatch ?T1_snatch .        }
body_builder,What are the birthdays of people in ascending order of height?,SELECT ?T1_birth_date WHERE { ?T1 a :people . ?T1 :people\#birth_date ?T1_birth_date . ?T1 :people\#height ?T1_height .        }  ORDER BY ASC (?T1_height)
body_builder,What are the names of body builders?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name .        }
body_builder,What are the names of body builders whose total score is higher than 300?,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :body_builder . ?T2 :body_builder\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :body_builder\#total ?T2_total . FILTER(?T2_total > 300) .        }
body_builder,What is the name of the body builder with the greatest body weight?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#weight ?T1_weight .        }   ORDER BY DESC (?T1_weight) LIMIT 1
body_builder,What are the heights of body builders with total score smaller than 315?,SELECT ?T1_height WHERE { ?T1 a :people . ?T2 a :body_builder . ?T2 :body_builder\#ref-people_id ?T1 .  ?T1 :people\#height ?T1_height . ?T2 :body_builder\#total ?T2_total . FILTER(?T2_total < 315) .        }
body_builder,What are the names of body builders in descending order of total scores?,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :body_builder . ?T2 :body_builder\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :body_builder\#total ?T2_total .        }  ORDER BY DESC (?T2_total)
body_builder,List each birth place along with the number of people from there.,SELECT ?T1_birth_place (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#birth_place ?T1_birth_place .        } GROUP BY ?T1_birth_place
body_builder,What is the most common birth place of people?,SELECT ?T1_birth_place (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#birth_place ?T1_birth_place .        } GROUP BY ?T1_birth_place  ORDER BY DESC (?aggregation_all) LIMIT 1
body_builder,What are the birth places that are shared by at least two people?,SELECT ?T1_birth_place WHERE { ?T1 a :people . ?T1 :people\#birth_place ?T1_birth_place .        } GROUP BY ?T1_birth_place   HAVING(count( *)  >= 2)
body_builder,List the height and weight of people in descending order of height.,SELECT ?T1_height ?T1_weight WHERE { ?T1 a :people . ?T1 :people\#height ?T1_height . ?T1 :people\#weight ?T1_weight . ?T1 :people\#height ?T1_height .        }  ORDER BY DESC (?T1_height)
body_builder,Show all information about each body builder.,SELECT * WHERE { ?T1 a :body_builder .        }
body_builder,List the names and origins of people who are not body builders.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_birth_place as ?col2) WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#birth_place ?T1_birth_place .   }}  MINUS {SELECT (?T2_name as ?col1) (?T2_birth_place as ?col2) WHERE { ?T2 a :people . ?T2 :people\#name ?T2_name . ?T2 :people\#birth_place ?T2_birth_place .        }     } }
body_builder,How many distinct birth places are there?,SELECT DISTINCT (count(DISTINCT ?T1_birth_place) as ?aggregation_T1_birth_place_137 ) WHERE { ?T1 a :people . ?T1 :people\#birth_place ?T1_birth_place .        }
body_builder,How many persons are not body builders?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) .       {SELECT ?T22_people_id WHERE { ?T22 a :body_builder . ?T22 :body_builder\#people_id ?T22_people_id .        }    } }
body_builder,List the weight of the body builders who have snatch score higher than 140 or have the height greater than 200.,SELECT ?T1_weight WHERE { ?T1 a :people . ?T2 a :body_builder . ?T2 :body_builder\#ref-people_id ?T1 .  ?T1 :people\#weight ?T1_weight . ?T2 :body_builder\#snatch ?T2_snatch . ?T1 :people\#height ?T1_height . FILTER(?T2_snatch > 140 || ?T1_height > 200) .        }
body_builder,What are the total scores of the body builders whose birthday contains the string 'January' ?,"SELECT ?T1_total WHERE { ?T1 a :body_builder . ?T2 a :people . ?T1 :body_builder\#ref-people_id ?T2 .  ?T1 :body_builder\#total ?T1_total . ?T2 :people\#birth_date ?T2_birth_date . FILTER(contains (?T2_birth_date, 'January')) .        }"
body_builder,What is the minimum snatch score?,SELECT (min( ?T1_snatch) as ?aggregation_T1_snatch_141 ) WHERE { ?T1 a :body_builder . ?T1 :body_builder\#snatch ?T1_snatch .        }
election_representative,How many elections are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :election .        }
election_representative,List the votes of elections in descending order.,SELECT ?T1_votes WHERE { ?T1 a :election . ?T1 :election\#votes ?T1_votes . ?T1 :election\#votes ?T1_votes .        }  ORDER BY DESC (?T1_votes)
election_representative,List the dates and vote percents of elections.,SELECT ?T1_date ?T1_vote_percent WHERE { ?T1 a :election . ?T1 :election\#date ?T1_date . ?T1 :election\#vote_percent ?T1_vote_percent .        }
election_representative,What are the minimum and maximum vote percents of elections?,SELECT (min( ?T1_vote_percent) as ?aggregation_T1_vote_percent_121 ) (max( ?T1_vote_percent) as ?aggregation_T1_vote_percent_106 ) WHERE { ?T1 a :election . ?T1 :election\#vote_percent ?T1_vote_percent . ?T1 :election\#vote_percent ?T1_vote_percent .        }
election_representative,What are the names and parties of representatives?,SELECT ?T1_name ?T1_party WHERE { ?T1 a :representative . ?T1 :representative\#name ?T1_name . ?T1 :representative\#party ?T1_party .        }
election_representative,What are the names of representatives whose party is not 'Republican'?,SELECT ?T1_name WHERE { ?T1 a :representative . ?T1 :representative\#name ?T1_name . ?T1 :representative\#party ?T1_party . FILTER(?T1_party != 'Republican') .        }
election_representative,What are the names of representatives and the dates of elections they participated in.,SELECT ?T1_name ?T2_date WHERE { ?T1 a :representative . ?T2 a :election . ?T2 :election\#ref-representative_id ?T1 .  ?T1 :representative\#name ?T1_name . ?T2 :election\#date ?T2_date .        }
election_representative,What are the names of representatives in descending order of votes?,SELECT ?T1_name WHERE { ?T1 a :representative . ?T2 a :election . ?T2 :election\#ref-representative_id ?T1 .  ?T1 :representative\#name ?T1_name . ?T2 :election\#votes ?T2_votes .        }  ORDER BY DESC (?T2_votes)
election_representative,What is the party of the representative that has the smallest number of votes.,SELECT ?T1_party WHERE { ?T1 a :representative . ?T2 a :election . ?T2 :election\#ref-representative_id ?T1 .  ?T1 :representative\#party ?T1_party . ?T2 :election\#votes ?T2_votes .        }   ORDER BY ASC (?T2_votes) LIMIT 1
