kg_name,question,query
loan_1,"Find the state, account type, and credit score of the customer whose number of loan is 0.",SELECT ?T1_state ?T1_acc_type ?T1_credit_score WHERE { ?T1 a :customer . ?T1 :customer\#state ?T1_state . ?T1 :customer\#acc_type ?T1_acc_type . ?T1 :customer\#credit_score ?T1_credit_score . ?T1 :customer\#no_of_loans ?T1_no_of_loans . FILTER(?T1_no_of_loans = 0) .        }
loan_1,Find the number of different cities which banks are located at.,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_139 ) WHERE { ?T1 a :bank . ?T1 :bank\#city ?T1_city .        }
loan_1,In how many different cities are banks located?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_95 ) WHERE { ?T1 a :bank . ?T1 :bank\#city ?T1_city .        }
loan_1,Find the number of different states which banks are located at.,SELECT DISTINCT (count(DISTINCT ?T1_state) as ?aggregation_T1_state_140 ) WHERE { ?T1 a :bank . ?T1 :bank\#state ?T1_state .        }
loan_1,In how many different states are banks located?,SELECT DISTINCT (count(DISTINCT ?T1_state) as ?aggregation_T1_state_127 ) WHERE { ?T1 a :bank . ?T1 :bank\#state ?T1_state .        }
loan_1,How many distinct types of accounts are there?,SELECT DISTINCT (count(DISTINCT ?T1_acc_type) as ?aggregation_T1_acc_type_3 ) WHERE { ?T1 a :customer . ?T1 :customer\#acc_type ?T1_acc_type .        }
loan_1,Count the number of different account types.,SELECT DISTINCT (count(DISTINCT ?T1_acc_type) as ?aggregation_T1_acc_type_136 ) WHERE { ?T1 a :customer . ?T1 :customer\#acc_type ?T1_acc_type .        }
loan_1,Find the name and account balance of the customer whose name includes the letter a.,"SELECT ?T1_cust_name ?T1_acc_bal WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_bal ?T1_acc_bal . ?T1 :customer\#cust_name ?T1_cust_name . FILTER(contains (?T1_cust_name, 'a')) .        }"
loan_1,Find the total account balance of each customer from Utah or Texas.,SELECT (sum( ?T1_acc_bal) as ?aggregation_T1_acc_bal_1 ) WHERE { ?T1 a :customer . ?T1 :customer\#acc_bal ?T1_acc_bal . ?T1 :customer\#state ?T1_state . ?T1 :customer\#state ?T1_state . FILTER(?T1_state = 'Utah' || ?T1_state = 'Texas') .        }
loan_1,Find the name of customers who have both saving and checking account types.,SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_type ?T1_acc_type . FILTER(?T1_acc_type = 'saving') . FILTER (?T1_cust_name in (?T2_cust_name)) .   ?T2 a :customer . ?T2 :customer\#cust_name ?T2_cust_name . ?T2 :customer\#acc_type ?T2_acc_type .  FILTER(?T2_acc_type = 'checking') .             }
loan_1,What are the names of customers who have both savings and checking accounts?,SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_type ?T1_acc_type . FILTER(?T1_acc_type = 'saving') . FILTER (?T1_cust_name in (?T2_cust_name)) .   ?T2 a :customer . ?T2 :customer\#cust_name ?T2_cust_name . ?T2 :customer\#acc_type ?T2_acc_type .  FILTER(?T2_acc_type = 'checking') .             }
loan_1,Find the name of customers who do not have an saving account.,SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name .   }}  MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T2 :customer\#cust_name ?T2_cust_name . ?T2 :customer\#acc_type ?T2_acc_type . FILTER(?T2_acc_type = 'saving') .        }     } }
loan_1,What are the names of customers who do not have saving accounts?,SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name .   }}  MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T2 :customer\#cust_name ?T2_cust_name . ?T2 :customer\#acc_type ?T2_acc_type . FILTER(?T2_acc_type = 'saving') .        }     } }
loan_1,Find the name of customers who do not have a loan with a type of Mortgages.,SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name .   }}  MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T3 a :loan . ?T3 :loan\#ref-cust_id ?T2 .  ?T2 :customer\#cust_name ?T2_cust_name . ?T3 :loan\#loan_type ?T3_loan_type . FILTER(?T3_loan_type = 'Mortgages') .        }     } }
loan_1,What are the names of customers who have not taken a Mortage loan?,SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name .   }}  MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T3 a :loan . ?T3 :loan\#ref-cust_id ?T2 .  ?T2 :customer\#cust_name ?T2_cust_name . ?T3 :loan\#loan_type ?T3_loan_type . FILTER(?T3_loan_type = 'Mortgages') .        }     } }
loan_1,Find the name of customers who have loans of both Mortgages and Auto.,SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Mortgages') . FILTER (?T1_cust_name in (?T3_cust_name)) .   ?T3 a :customer . ?T4 a :loan . ?T4 :loan\#ref-cust_id ?T3 .  ?T3 :customer\#cust_name ?T3_cust_name . ?T4 :loan\#loan_type ?T4_loan_type .  FILTER(?T4_loan_type = 'Auto') .             }
loan_1,What are the names of customers who have taken both Mortgage and Auto loans?,SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Mortgages') . FILTER (?T1_cust_name in (?T3_cust_name)) .   ?T3 a :customer . ?T4 a :loan . ?T4 :loan\#ref-cust_id ?T3 .  ?T3 :customer\#cust_name ?T3_cust_name . ?T4 :loan\#loan_type ?T4_loan_type .  FILTER(?T4_loan_type = 'Auto') .             }
loan_1,Find the name of customers whose credit score is below the average credit scores of all customers.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#credit_score ?T1_credit_score . FILTER(?T1_credit_score < (?aggregation_T22_credit_score_191)) .       {SELECT (avg( ?T22_credit_score) as ?aggregation_T22_credit_score_191 ) WHERE { ?T22 a :customer . ?T22 :customer\#credit_score ?T22_credit_score .        }    } }
loan_1,Find the branch name of the bank that has the most number of customers.,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bank\#bname ?T1_bname . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        }   ORDER BY DESC (?T1_no_of_customers) LIMIT 1
loan_1,Find the name of customer who has the lowest credit score.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#credit_score ?T1_credit_score .        }   ORDER BY ASC (?T1_credit_score) LIMIT 1
loan_1,What is the name of the customer with the worst credit score?,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#credit_score ?T1_credit_score .        }   ORDER BY ASC (?T1_credit_score) LIMIT 1
loan_1,"Find the name, account type, and account balance of the customer who has the highest credit score.",SELECT ?T1_cust_name ?T1_acc_type ?T1_acc_bal WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_type ?T1_acc_type . ?T1 :customer\#acc_bal ?T1_acc_bal . ?T1 :customer\#credit_score ?T1_credit_score .        }   ORDER BY DESC (?T1_credit_score) LIMIT 1
loan_1,Find the name of customer who has the highest amount of loans.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_cust_name  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_81 )) LIMIT 1
loan_1,What is the name of the customer who has greatest total loan amount?,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_cust_name  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_108 )) LIMIT 1
loan_1,Find the state which has the most number of customers.,SELECT ?T1_state WHERE { ?T1 a :bank . ?T1 :bank\#state ?T1_state . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        } GROUP BY ?T1_state  ORDER BY DESC ((sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_73 )) LIMIT 1
loan_1,Which state has the greatest total number of bank customers?,SELECT ?T1_state WHERE { ?T1 a :bank . ?T1 :bank\#state ?T1_state . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        } GROUP BY ?T1_state  ORDER BY DESC ((sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_8 )) LIMIT 1
loan_1,"For each account type, find the average account balance of customers with credit score lower than 50.",SELECT (avg( ?T1_acc_bal) as ?aggregation_T1_acc_bal_77 ) ?T1_acc_type WHERE { ?T1 a :customer . ?T1 :customer\#acc_bal ?T1_acc_bal . ?T1 :customer\#acc_type ?T1_acc_type . ?T1 :customer\#credit_score ?T1_credit_score . FILTER(?T1_credit_score < 50) .        } GROUP BY ?T1_acc_type
loan_1,"For each state, find the total account balance of customers whose credit score is above 100.",SELECT (sum( ?T1_acc_bal) as ?aggregation_T1_acc_bal_118 ) ?T1_state WHERE { ?T1 a :customer . ?T1 :customer\#acc_bal ?T1_acc_bal . ?T1 :customer\#state ?T1_state . ?T1 :customer\#credit_score ?T1_credit_score . FILTER(?T1_credit_score > 100) .        } GROUP BY ?T1_state
loan_1,Find the total amount of loans offered by each bank branch.,SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_198 ) ?T2_bname WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :loan\#ref-branch_id ?T2 .  ?T1 :loan\#amount ?T1_amount . ?T2 :bank\#bname ?T2_bname .        } GROUP BY ?T2_bname
loan_1,Find the name of customers who have more than one loan.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name .        } GROUP BY ?T1_cust_name   HAVING(count( *)  > 1)
loan_1,What are the names of customers who have taken out more than one loan?,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name .        } GROUP BY ?T1_cust_name   HAVING(count( *)  > 1)
loan_1,Find the name and account balance of the customers who have loans with a total amount of more than 5000.,SELECT ?T1_cust_name ?T1_acc_type WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_type ?T1_acc_type . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_cust_name ?T1_acc_type   HAVING(sum( ?T2_amount)  > 5000)
loan_1,What are the names and account balances for customers who have taken a total amount of more than 5000 in loans?,SELECT ?T1_cust_name ?T1_acc_type WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_type ?T1_acc_type . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_cust_name ?T1_acc_type   HAVING(sum( ?T2_amount)  > 5000)
loan_1,Find the name of bank branch that provided the greatest total amount of loans.,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\#ref-branch_id ?T1 .  ?T1 :bank\#bname ?T1_bname . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_85 )) LIMIT 1
loan_1,What is the name of the bank branch that has lent the greatest amount?,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\#ref-branch_id ?T1 .  ?T1 :bank\#bname ?T1_bname . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_149 )) LIMIT 1
loan_1,Find the name of bank branch that provided the greatest total amount of loans to customers with credit score is less than 100.,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\#ref-branch_id ?T1 .  ?T1 :bank\#bname ?T1_bname . ?T2 :loan\#amount ?T2_amount . ?T3 :customer\#credit_score ?T3_credit_score . ?T3 a :customer . ?T2 :loan\#ref-cust_id ?T3 .  ?T1 :bank\#bname ?T1_bname . ?T2 :loan\#amount ?T2_amount . ?T3 :customer\#credit_score ?T3_credit_score . FILTER(?T3_credit_score < 100) .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_144 )) LIMIT 1
loan_1,"What is the name of the bank branch that has lended the largest total amount in loans, specifically to customers with credit scores below 100?",SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\#ref-branch_id ?T1 .  ?T1 :bank\#bname ?T1_bname . ?T2 :loan\#amount ?T2_amount . ?T3 :customer\#credit_score ?T3_credit_score . ?T3 a :customer . ?T2 :loan\#ref-cust_id ?T3 .  ?T1 :bank\#bname ?T1_bname . ?T2 :loan\#amount ?T2_amount . ?T3 :customer\#credit_score ?T3_credit_score . FILTER(?T3_credit_score < 100) .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_120 )) LIMIT 1
loan_1,Find the name of bank branches that provided some loans.,SELECT DISTINCT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bank\#bname ?T1_bname .        }
loan_1,What are the names of the different banks that have provided loans?,SELECT DISTINCT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bank\#bname ?T1_bname .        }
loan_1,Find the name and credit score of the customers who have some loans.,SELECT DISTINCT ?T1_cust_name ?T1_credit_score WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#credit_score ?T1_credit_score .        }
loan_1,Find the the name of the customers who have a loan with amount more than 3000.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#amount ?T2_amount . FILTER(?T2_amount > 3000) .        }
loan_1,Find the city and name of bank branches that provide business loans.,SELECT ?T1_bname ?T1_city WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\#ref-branch_id ?T1 .  ?T1 :bank\#bname ?T1_bname . ?T1 :bank\#city ?T1_city . ?T2 :loan\#loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Business') .        }
loan_1,Find the names of bank branches that have provided a loan to any customer whose credit score is below 100.,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :customer . ?T2 :customer\#ref-branch_id ?T1 .  ?T1 :bank\#bname ?T1_bname . ?T2 :customer\#credit_score ?T2_credit_score . FILTER(?T2_credit_score < 100) .        }
loan_1,Find the total amount of loans provided by bank branches in the state of New York.,SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_23 ) WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :loan\#ref-branch_id ?T2 .  ?T1 :loan\#amount ?T1_amount . ?T2 :bank\#state ?T2_state . FILTER(?T2_state = 'New York') .        }
loan_1,What is the total amount of money loaned by banks in New York state?,SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_3 ) WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :loan\#ref-branch_id ?T2 .  ?T1 :loan\#amount ?T1_amount . ?T2 :bank\#state ?T2_state . FILTER(?T2_state = 'New York') .        }
loan_1,Find the average credit score of the customers who have some loan.,SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_168 ) WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#credit_score ?T1_credit_score . ?T1 :customer\#cust_id ?T1_cust_id .        }
loan_1,What is the average credit score for customers who have taken a loan?,SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_15 ) WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#credit_score ?T1_credit_score . ?T1 :customer\#cust_id ?T1_cust_id .        }
loan_1,Find the average credit score of the customers who do not have any loan.,SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_148 ) WHERE { ?T1 a :customer . ?T1 :customer\#credit_score ?T1_credit_score . ?T1 :customer\#cust_id ?T1_cust_id . FILTER(?T1_cust_id not in (?T22_cust_id)) .       {SELECT ?T22_cust_id WHERE { ?T22 a :loan . ?T22 :loan\#cust_id ?T22_cust_id .        }    } }
behavior_monitoring,How many assessment notes are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :assessment_notes .        }
behavior_monitoring,What are the dates of the assessment notes?,SELECT ?T1_date_of_notes WHERE { ?T1 a :assessment_notes . ?T1 :assessment_notes\#date_of_notes ?T1_date_of_notes .        }
behavior_monitoring,How many addresses have zip code 197?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\#zip_postcode ?T1_zip_postcode . FILTER(?T1_zip_postcode = '197') .        }
behavior_monitoring,How many distinct incident type codes are there?,SELECT DISTINCT (count(DISTINCT ?T1_incident_type_code) as ?aggregation_T1_incident_type_code_85 ) WHERE { ?T1 a :behavior_incident . ?T1 :behavior_incident\#incident_type_code ?T1_incident_type_code .        }
behavior_monitoring,Return all distinct detention type codes.,SELECT DISTINCT ?T1_detention_type_code WHERE { ?T1 a :detention . ?T1 :detention\#detention_type_code ?T1_detention_type_code .        }
behavior_monitoring,What are the start and end dates for incidents with incident type code 'NOISE'?,SELECT ?T1_date_incident_start ?T1_date_incident_end WHERE { ?T1 a :behavior_incident . ?T1 :behavior_incident\#date_incident_start ?T1_date_incident_start . ?T1 :behavior_incident\#date_incident_end ?T1_date_incident_end . ?T1 :behavior_incident\#incident_type_code ?T1_incident_type_code . FILTER(?T1_incident_type_code = 'NOISE') .        }
behavior_monitoring,Return all detention summaries.,SELECT ?T1_detention_summary WHERE { ?T1 a :detention . ?T1 :detention\#detention_summary ?T1_detention_summary .        }
behavior_monitoring,Return the cell phone number and email address for all students.,SELECT ?T1_cell_mobile_number ?T1_email_address WHERE { ?T1 a :students . ?T1 :students\#cell_mobile_number ?T1_cell_mobile_number . ?T1 :students\#email_address ?T1_email_address .        }
behavior_monitoring,What is the email of the student with first name 'Emma' and last name 'Rohan'?,SELECT ?T1_email_address WHERE { ?T1 a :students . ?T1 :students\#email_address ?T1_email_address . ?T1 :students\#first_name ?T1_first_name . ?T1 :students\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Emma' && ?T1_last_name = 'Rohan') .        }
behavior_monitoring,How many distinct students have been in detention?,SELECT DISTINCT (count(DISTINCT ?T1_student_id) as ?aggregation_T1_student_id_164 ) WHERE { ?T1 a :students_in_detention . ?T1 :students_in_detention\#student_id ?T1_student_id .        }
behavior_monitoring,What is the gender of the teacher with last name 'Medhurst'?,SELECT ?T1_gender WHERE { ?T1 a :teachers . ?T1 :teachers\#gender ?T1_gender . ?T1 :teachers\#last_name ?T1_last_name . FILTER(?T1_last_name = 'Medhurst') .        }
behavior_monitoring,What is the incident type description for the incident type with code 'VIOLENCE'?,SELECT ?T1_incident_type_description WHERE { ?T1 a :ref_incident_type . ?T1 :ref_incident_type\#incident_type_description ?T1_incident_type_description . ?T1 :ref_incident_type\#incident_type_code ?T1_incident_type_code . FILTER(?T1_incident_type_code = 'VIOLENCE') .        }
behavior_monitoring,Find the maximum and minimum monthly rental for all student addresses.,SELECT (max( ?T1_monthly_rental) as ?aggregation_T1_monthly_rental_169 ) (min( ?T1_monthly_rental) as ?aggregation_T1_monthly_rental_81 ) WHERE { ?T1 a :student_addresses . ?T1 :student_addresses\#monthly_rental ?T1_monthly_rental . ?T1 :student_addresses\#monthly_rental ?T1_monthly_rental .        }
behavior_monitoring,Find the first names of teachers whose email address contains the word 'man'.,"SELECT ?T1_first_name WHERE { ?T1 a :teachers . ?T1 :teachers\#first_name ?T1_first_name . ?T1 :teachers\#email_address ?T1_email_address . FILTER(contains (?T1_email_address, 'man')) .        }"
behavior_monitoring,List all information about the assessment notes sorted by date in ascending order.,SELECT * WHERE { ?T1 a :assessment_notes . ?T1 :assessment_notes\#date_of_notes ?T1_date_of_notes .        }  ORDER BY ASC (?T1_date_of_notes)
behavior_monitoring,List all cities of addresses in alphabetical order.,SELECT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#city ?T1_city .        }  ORDER BY ASC (?T1_city)
behavior_monitoring,Find the first names and last names of teachers in alphabetical order of last name.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :teachers . ?T1 :teachers\#first_name ?T1_first_name . ?T1 :teachers\#last_name ?T1_last_name . ?T1 :teachers\#last_name ?T1_last_name .        }  ORDER BY ASC (?T1_last_name)
behavior_monitoring,"Find all information about student addresses, and sort by monthly rental in descending order.",SELECT * WHERE { ?T1 a :student_addresses . ?T1 :student_addresses\#monthly_rental ?T1_monthly_rental .        }  ORDER BY DESC (?T1_monthly_rental)
behavior_monitoring,Find the id and first name of the student that has the most number of assessment notes?,SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_first_name WHERE { ?T1 a :assessment_notes . ?T2 a :students . ?T1 :assessment_notes\#ref-student_id ?T2 .  ?T1 :assessment_notes\#student_id ?T1_student_id . ?T2 :students\#first_name ?T2_first_name .        } GROUP BY ?T1_student_id ?T2_first_name  ORDER BY DESC (?aggregation_all) LIMIT 1
behavior_monitoring,Find the ids and first names of the 3 teachers that have the most number of assessment notes?,SELECT ?T1_teacher_id (count( *) as ?aggregation_all) ?T2_first_name WHERE { ?T1 a :assessment_notes . ?T2 a :teachers . ?T1 :assessment_notes\#ref-teacher_id ?T2 .  ?T1 :assessment_notes\#teacher_id ?T1_teacher_id . ?T2 :teachers\#first_name ?T2_first_name .        } GROUP BY ?T1_teacher_id ?T2_first_name  ORDER BY DESC (?aggregation_all) LIMIT 1
behavior_monitoring,Find the id and last name of the student that has the most behavior incidents?,SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_last_name WHERE { ?T1 a :behavior_incident . ?T2 a :students . ?T1 :behavior_incident\#ref-student_id ?T2 .  ?T1 :behavior_incident\#student_id ?T1_student_id . ?T2 :students\#last_name ?T2_last_name .        } GROUP BY ?T1_student_id ?T2_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
behavior_monitoring,Find the id and last name of the teacher that has the most detentions with detention type code 'AFTER'?,SELECT ?T1_teacher_id (count( *) as ?aggregation_all) ?T2_last_name WHERE { ?T1 a :detention . ?T2 a :teachers . ?T1 :detention\#ref-teacher_id ?T2 .  ?T1 :detention\#teacher_id ?T1_teacher_id . ?T2 :teachers\#last_name ?T2_last_name . ?T1 :detention\#detention_type_code ?T1_detention_type_code . FILTER(?T1_detention_type_code = 'AFTER') .        } GROUP BY ?T1_teacher_id ?T2_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
behavior_monitoring,What are the id and first name of the student whose addresses have the highest average monthly rental?,SELECT ?T1_student_id ?T2_first_name WHERE { ?T1 a :student_addresses . ?T2 a :students . ?T1 :student_addresses\#ref-student_id ?T2 .  ?T1 :student_addresses\#student_id ?T1_student_id . ?T2 :students\#first_name ?T2_first_name . ?T1 :student_addresses\#monthly_rental ?T1_monthly_rental .        } GROUP BY ?T1_student_id ?T2_first_name  ORDER BY DESC ((avg( ?T1_monthly_rental) as ?aggregation_T1_monthly_rental_39 )) LIMIT 1
behavior_monitoring,Find the id and city of the student address with the highest average monthly rental.,SELECT ?T1_address_id ?T2_city WHERE { ?T1 a :student_addresses . ?T2 a :addresses . ?T1 :student_addresses\#ref-address_id ?T2 .  ?T1 :student_addresses\#address_id ?T1_address_id . ?T2 :addresses\#city ?T2_city . ?T1 :student_addresses\#monthly_rental ?T1_monthly_rental .        } GROUP BY ?T1_address_id ?T2_city  ORDER BY DESC ((avg( ?T1_monthly_rental) as ?aggregation_T1_monthly_rental_18 )) LIMIT 1
behavior_monitoring,What are the code and description of the most frequent behavior incident type?,SELECT ?T1_incident_type_code (count( *) as ?aggregation_all) ?T2_incident_type_description WHERE { ?T1 a :behavior_incident . ?T2 a :ref_incident_type . ?T1 :behavior_incident\#ref-incident_type_code ?T2 .  ?T1 :behavior_incident\#incident_type_code ?T1_incident_type_code . ?T2 :ref_incident_type\#incident_type_description ?T2_incident_type_description .        } GROUP BY ?T1_incident_type_code ?T2_incident_type_description  ORDER BY DESC (?aggregation_all) LIMIT 1
behavior_monitoring,What are the code and description of the least frequent detention type ?,SELECT ?T1_detention_type_code (count( *) as ?aggregation_all) ?T2_detention_type_description WHERE { ?T1 a :detention . ?T2 a :ref_detention_type . ?T1 :detention\#ref-detention_type_code ?T2 .  ?T1 :detention\#detention_type_code ?T1_detention_type_code . ?T2 :ref_detention_type\#detention_type_description ?T2_detention_type_description .        } GROUP BY ?T1_detention_type_code ?T2_detention_type_description  ORDER BY ASC (?aggregation_all) LIMIT 1
behavior_monitoring,Find the dates of assessment notes for students with first name 'Fanny'.,SELECT ?T1_date_of_notes WHERE { ?T1 a :assessment_notes . ?T2 a :students . ?T1 :assessment_notes\#ref-student_id ?T2 .  ?T1 :assessment_notes\#date_of_notes ?T1_date_of_notes . ?T2 :students\#first_name ?T2_first_name . FILTER(?T2_first_name = 'Fanny') .        }
behavior_monitoring,Find the texts of assessment notes for teachers with last name 'Schuster'.,SELECT ?T1_text_of_notes WHERE { ?T1 a :assessment_notes . ?T2 a :teachers . ?T1 :assessment_notes\#ref-teacher_id ?T2 .  ?T1 :assessment_notes\#text_of_notes ?T1_text_of_notes . ?T2 :teachers\#last_name ?T2_last_name . FILTER(?T2_last_name = 'Schuster') .        }
behavior_monitoring,Find the start and end dates of behavior incidents of students with last name 'Fahey'.,SELECT ?T1_date_incident_start ?T1_date_incident_end WHERE { ?T1 a :behavior_incident . ?T2 a :students . ?T1 :behavior_incident\#ref-student_id ?T2 .  ?T1 :behavior_incident\#date_incident_start ?T1_date_incident_start . ?T1 :behavior_incident\#date_incident_end ?T1_date_incident_end . ?T2 :students\#last_name ?T2_last_name . FILTER(?T2_last_name = 'Fahey') .        }
behavior_monitoring,Find the start and end dates of detentions of teachers with last name 'Schultz'.,SELECT ?T1_datetime_detention_start ?T1_datetime_detention_end WHERE { ?T1 a :detention . ?T2 a :teachers . ?T1 :detention\#ref-teacher_id ?T2 .  ?T1 :detention\#datetime_detention_start ?T1_datetime_detention_start . ?T1 :detention\#datetime_detention_end ?T1_datetime_detention_end . ?T2 :teachers\#last_name ?T2_last_name . FILTER(?T2_last_name = 'Schultz') .        }
behavior_monitoring,What are the monthly rentals of student addresses in Texas state?,SELECT ?T1_monthly_rental WHERE { ?T1 a :student_addresses . ?T2 a :addresses . ?T1 :student_addresses\#ref-address_id ?T2 .  ?T1 :student_addresses\#monthly_rental ?T1_monthly_rental . ?T2 :addresses\#state_province_county ?T2_state_province_county . FILTER(?T2_state_province_county = 'Texas') .        }
behavior_monitoring,What are the line 1 and average monthly rentals of all student addresses?,SELECT ?T1_line_1 (avg( ?T2_monthly_rental) as ?aggregation_T2_monthly_rental_18 ) WHERE { ?T1 a :addresses . ?T2 a :student_addresses . ?T2 :student_addresses\#ref-address_id ?T1 .  ?T1 :addresses\#line_1 ?T1_line_1 . ?T2 :student_addresses\#monthly_rental ?T2_monthly_rental .        } GROUP BY ?T1_line_1
behavior_monitoring,What is the zip code of the address where the teacher with first name 'Lyla' lives?,SELECT ?T1_zip_postcode WHERE { ?T1 a :addresses . ?T2 a :teachers . ?T2 :teachers\#ref-address_id ?T1 .  ?T1 :addresses\#zip_postcode ?T1_zip_postcode . ?T2 :teachers\#first_name ?T2_first_name . FILTER(?T2_first_name = 'Lyla') .        }
behavior_monitoring,What are the email addresses of teachers whose address has zip code '918'?,SELECT ?T1_email_address WHERE { ?T1 a :teachers . ?T2 a :addresses . ?T1 :teachers\#ref-address_id ?T2 .  ?T1 :teachers\#email_address ?T1_email_address . ?T2 :addresses\#zip_postcode ?T2_zip_postcode . FILTER(?T2_zip_postcode = '918') .        }
behavior_monitoring,How many students are not involved in any behavior incident?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T1 :students\#student_id ?T1_student_id . FILTER(?T1_student_id not in (?T22_student_id)) .       {SELECT ?T22_student_id WHERE { ?T22 a :behavior_incident . ?T22 :behavior_incident\#student_id ?T22_student_id .        }    } }
behavior_monitoring,Find the last names of teachers who are not involved in any detention.,SELECT distinct?col1 WHERE { { SELECT (?T1_last_name as ?col1) WHERE { ?T1 a :teachers . ?T1 :teachers\#last_name ?T1_last_name .   }}  MINUS {SELECT (?T2_last_name as ?col1) WHERE { ?T2 a :teachers . ?T2 :teachers\#last_name ?T2_last_name .        }     } }
assets_maintenance,Which assets have 2 parts and have less than 2 fault logs? List the asset id and detail.,SELECT DISTINCT ?T1_asset_id ?T1_asset_details WHERE { ?T1 a :assets . ?T2 a :asset_parts . ?T2 :asset_parts\#ref-asset_id ?T1 .  ?T1 :assets\#asset_id ?T1_asset_id . ?T1 :assets\#asset_details ?T1_asset_details . FILTER (?T1_asset_id in (?T3_asset_id)) . FILTER (?T1_asset_details in (?T3_asset_details)) .   ?T3 a :assets . ?T4 a :fault_log . ?T4 :fault_log\#ref-asset_id ?T3 .  ?T3 :assets\#asset_id ?T3_asset_id . ?T3 :assets\#asset_details ?T3_asset_details .     GROUP BY ?T3_asset_id ?T3_asset_details   HAVING(count( *)  < 2)      } GROUP BY ?T1_asset_id ?T1_asset_details   HAVING(count( *)  = 2)
assets_maintenance,How many assets does each maintenance contract contain? List the number and the contract id.,SELECT (count( *) as ?aggregation_all) ?T2_maintenance_contract_id WHERE { ?T1 a :assets . ?T2 a :maintenance_contracts . ?T1 :assets\#ref-maintenance_contract_id ?T2 .  ?T2 :maintenance_contracts\#maintenance_contract_id ?T2_maintenance_contract_id .        } GROUP BY ?T2_maintenance_contract_id
assets_maintenance,How many assets does each third party company supply? List the count and the company id.,SELECT (count( *) as ?aggregation_all) ?T2_company_id WHERE { ?T13 a :maintenance_contracts . ?T2 a :third_party_companies . ?T13 :maintenance_contracts\#ref-maintenance_contract_company_id ?T2 .  ?T2 :third_party_companies\#company_id ?T2_company_id .        } GROUP BY ?T2_company_id
