kg_name,question,query
race_track,"What is the minimum, maximum, and average seating for all tracks.",SELECT (min( ?T1_seating) as ?aggregation_T1_seating_13 ) (max( ?T1_seating) as ?aggregation_T1_seating_71 ) (avg( ?T1_seating) as ?aggregation_T1_seating_66 ) WHERE { ?T1 a :track . ?T1 :track\#seating ?T1_seating . ?T1 :track\#seating ?T1_seating . ?T1 :track\#seating ?T1_seating .        }
race_track,"Return the minimum, maximum, and average seating across all tracks.",SELECT (min( ?T1_seating) as ?aggregation_T1_seating_89 ) (max( ?T1_seating) as ?aggregation_T1_seating_92 ) (avg( ?T1_seating) as ?aggregation_T1_seating_152 ) WHERE { ?T1 a :track . ?T1 :track\#seating ?T1_seating . ?T1 :track\#seating ?T1_seating . ?T1 :track\#seating ?T1_seating .        }
race_track,"Show the name, location, open year for all tracks with a seating higher than the average.",SELECT ?T1_name ?T1_location ?T1_year_opened WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#location ?T1_location . ?T1 :track\#year_opened ?T1_year_opened . ?T1 :track\#seating ?T1_seating . FILTER(?T1_seating > (?aggregation_T22_seating_24)) .       {SELECT (avg( ?T22_seating) as ?aggregation_T22_seating_24 ) WHERE { ?T22 a :track . ?T22 :track\#seating ?T22_seating .        }    } }
race_track,What are distinct locations where tracks are located?,SELECT DISTINCT ?T1_location WHERE { ?T1 a :track . ?T1 :track\#location ?T1_location .        }
race_track,How many races are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :race .        }
race_track,What are the distinct classes that races can have?,SELECT DISTINCT ?T1_class WHERE { ?T1 a :race . ?T1 :race\#class ?T1_class .        }
race_track,"Show name, class, and date for all races.",SELECT ?T1_name ?T1_class ?T1_date WHERE { ?T1 a :race . ?T1 :race\#name ?T1_name . ?T1 :race\#class ?T1_class . ?T1 :race\#date ?T1_date .        }
race_track,Show the race class and number of races in each class.,SELECT ?T1_class (count( *) as ?aggregation_all) WHERE { ?T1 a :race . ?T1 :race\#class ?T1_class .        } GROUP BY ?T1_class
race_track,What is the race class with most number of races.,SELECT ?T1_class (count( *) as ?aggregation_all) WHERE { ?T1 a :race . ?T1 :race\#class ?T1_class .        } GROUP BY ?T1_class  ORDER BY DESC (?aggregation_all) LIMIT 1
race_track,List the race class with at least two races.,SELECT ?T1_class WHERE { ?T1 a :race . ?T1 :race\#class ?T1_class .        } GROUP BY ?T1_class   HAVING(count( *)  >= 2)
race_track,What are the classes of races that have two or more corresponding races?,SELECT ?T1_class WHERE { ?T1 a :race . ?T1 :race\#class ?T1_class .        } GROUP BY ?T1_class   HAVING(count( *)  >= 2)
race_track,What are the names for tracks without a race in class 'GT'.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :track . ?T3 a :race . ?T3 :race\#ref-track_id ?T2 .  ?T2 :track\#name ?T2_name . ?T3 :race\#class ?T3_class . FILTER(?T3_class = 'GT') .        }     } }
race_track,Show all track names that have had no races.,SELECT ?T1_name WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#track_id ?T1_track_id . FILTER(?T1_track_id not in (?T22_track_id)) .       {SELECT ?T22_track_id WHERE { ?T22 a :race . ?T22 :race\#track_id ?T22_track_id .        }    } }
race_track,Show year where a track with a seating at least 5000 opened and a track with seating no more than 4000 opened.,SELECT ?T1_year_opened WHERE { ?T1 a :track . ?T1 :track\#year_opened ?T1_year_opened . ?T1 :track\#seating ?T1_seating . FILTER(?T1_seating >= 4000 && ?T1_seating <= 5000) .        }
race_track,Show the name of track and the number of races in each track.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :race . ?T2 :race\#ref-track_id ?T1 .  ?T1 :track\#name ?T1_name .        } GROUP BY ?T1_name
race_track,Show the name of track with most number of races.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :race . ?T2 :race\#ref-track_id ?T1 .  ?T1 :track\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
race_track,What is the name of the track that has had the greatest number of races?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :race . ?T2 :race\#ref-track_id ?T1 .  ?T1 :track\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
race_track,Show the name and date for each race and its track name.,SELECT ?T1_name ?T1_date ?T2_name WHERE { ?T1 a :race . ?T2 a :track . ?T1 :race\#ref-track_id ?T2 .  ?T1 :race\#name ?T1_name . ?T1 :race\#date ?T1_date . ?T2 :track\#name ?T2_name .        }
race_track,Show the name and location of track with 1 race.,SELECT ?T1_name ?T1_location WHERE { ?T1 a :track . ?T2 a :race . ?T2 :race\#ref-track_id ?T1 .  ?T1 :track\#name ?T1_name . ?T1 :track\#location ?T1_location .        } GROUP BY ?T1_name ?T1_location   HAVING(count( *)  = 1)
race_track,What are the names and locations of tracks that have had exactly 1 race?,SELECT ?T1_name ?T1_location WHERE { ?T1 a :track . ?T2 a :race . ?T2 :race\#ref-track_id ?T1 .  ?T1 :track\#name ?T1_name . ?T1 :track\#location ?T1_location .        } GROUP BY ?T1_name ?T1_location   HAVING(count( *)  = 1)
race_track,Find the locations where have both tracks with more than 90000 seats and tracks with less than 70000 seats.,SELECT DISTINCT ?T1_location WHERE { ?T1 a :track . ?T1 :track\#location ?T1_location . ?T1 :track\#seating ?T1_seating . FILTER(?T1_seating > 90000) . FILTER (?T1_location in (?T2_location)) .   ?T2 a :track . ?T2 :track\#location ?T2_location . ?T2 :track\#seating ?T2_seating .  FILTER(?T2_seating < 70000) .             }
race_track,"What are the locations that have both tracks with more than 90000 seats, and tracks with fewer than 70000 seats?",SELECT DISTINCT ?T1_location WHERE { ?T1 a :track . ?T1 :track\#location ?T1_location . ?T1 :track\#seating ?T1_seating . FILTER(?T1_seating > 90000) . FILTER (?T1_location in (?T2_location)) .   ?T2 a :track . ?T2 :track\#location ?T2_location . ?T2 :track\#seating ?T2_seating .  FILTER(?T2_seating < 70000) .             }
coffee_shop,How many members have the black membership card?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :member\#membership_card ?T1_membership_card . FILTER(?T1_membership_card = 'Black') .        }
coffee_shop,Find the number of members living in each address.,SELECT (count( *) as ?aggregation_all) ?T1_address WHERE { ?T1 a :member . ?T1 :member\#address ?T1_address .        } GROUP BY ?T1_address
coffee_shop,Give me the names of members whose address is in Harford or Waterbury.,SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#address ?T1_address . ?T1 :member\#address ?T1_address . FILTER(?T1_address = 'Harford' || ?T1_address = 'Waterbury') .        }
coffee_shop,Find the ids and names of members who are under age 30 or with black membership card.,SELECT ?T1_name ?T1_member_id WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#member_id ?T1_member_id . ?T1 :member\#membership_card ?T1_membership_card . ?T1 :member\#age ?T1_age . FILTER(?T1_membership_card = 'Black' || ?T1_age < 30) .        }
coffee_shop,"Find the purchase time, age and address of each member, and show the results in the order of purchase time.",SELECT ?T1_time_of_purchase ?T1_age ?T1_address WHERE { ?T1 a :member . ?T1 :member\#time_of_purchase ?T1_time_of_purchase . ?T1 :member\#age ?T1_age . ?T1 :member\#address ?T1_address . ?T1 :member\#time_of_purchase ?T1_time_of_purchase .        }  ORDER BY ASC (?T1_time_of_purchase)
coffee_shop,Which membership card has more than 5 members?,SELECT ?T1_membership_card WHERE { ?T1 a :member . ?T1 :member\#membership_card ?T1_membership_card .        } GROUP BY ?T1_membership_card   HAVING(count( *)  > 5)
coffee_shop,How many members are not living in Hartford?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :member\#address ?T1_address . FILTER(?T1_address != 'Hartford') .        }
coffee_shop,Which address do not have any member with the black membership card?,SELECT distinct?col1 WHERE { { SELECT (?T1_address as ?col1) WHERE { ?T1 a :member . ?T1 :member\#address ?T1_address .   }}  MINUS {SELECT (?T2_address as ?col1) WHERE { ?T2 a :member . ?T2 :member\#address ?T2_address . ?T2 :member\#membership_card ?T2_membership_card . FILTER(?T2_membership_card = 'Black') .        }     } }
coffee_shop,Show the shop addresses ordered by their opening year.,SELECT ?T1_address WHERE { ?T1 a :shop . ?T1 :shop\#address ?T1_address . ?T1 :shop\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
coffee_shop,What are the average score and average staff number of all shops?,SELECT (avg( ?T1_num_of_staff) as ?aggregation_T1_num_of_staff_135 ) (avg( ?T1_score) as ?aggregation_T1_score_157 ) WHERE { ?T1 a :shop . ?T1 :shop\#num_of_staff ?T1_num_of_staff . ?T1 :shop\#score ?T1_score .        }
coffee_shop,Find the id and address of the shops whose score is below the average score.,SELECT ?T1_shop_id ?T1_address WHERE { ?T1 a :shop . ?T1 :shop\#shop_id ?T1_shop_id . ?T1 :shop\#address ?T1_address . ?T1 :shop\#score ?T1_score . FILTER(?T1_score < (?aggregation_T22_score_36)) .       {SELECT (avg( ?T22_score) as ?aggregation_T22_score_36 ) WHERE { ?T22 a :shop . ?T22 :shop\#score ?T22_score .        }    } }
coffee_shop,Find the address and staff number of the shops that do not have any happy hour.,SELECT ?T1_address ?T1_num_of_staff WHERE { ?T1 a :shop . ?T1 :shop\#address ?T1_address . ?T1 :shop\#num_of_staff ?T1_num_of_staff . ?T1 :shop\#shop_id ?T1_shop_id . FILTER(?T1_shop_id not in (?T22_shop_id)) .       {SELECT ?T22_shop_id WHERE { ?T22 a :happy_hour . ?T22 :happy_hour\#shop_id ?T22_shop_id .        }    } }
coffee_shop,What are the id and address of the shops which have a happy hour in May?,SELECT ?T1_address ?T1_shop_id WHERE { ?T1 a :shop . ?T2 a :happy_hour . ?T2 :happy_hour\#ref-shop_id ?T1 .  ?T1 :shop\#address ?T1_address . ?T1 :shop\#shop_id ?T1_shop_id . ?T2 :happy_hour\#month ?T2_month . FILTER(?T2_month = 'May') .        }
coffee_shop,which shop has happy hour most frequently? List its id and number of happy hours.,SELECT ?T1_shop_id (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :happy_hour . ?T1 :happy_hour\#shop_id ?T1_shop_id .        } GROUP BY ?T1_shop_id  ORDER BY DESC (?aggregation_all) LIMIT 1
coffee_shop,Which month has the most happy hours?,SELECT ?T1_month (count( *) as ?aggregation_all) WHERE { ?T1 a :happy_hour . ?T1 :happy_hour\#month ?T1_month .        } GROUP BY ?T1_month  ORDER BY DESC (?aggregation_all) LIMIT 1
coffee_shop,Which months have more than 2 happy hours?,SELECT ?T1_month WHERE { ?T1 a :happy_hour . ?T1 :happy_hour\#month ?T1_month .        } GROUP BY ?T1_month   HAVING(count( *)  > 2)
chinook_1,How many albums are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :album .        }
chinook_1,List the names of all music genres.,SELECT ?T1_name WHERE { ?T1 a :genre . ?T1 :genre\#name ?T1_name .        }
chinook_1,What are the names of different music genres?,SELECT ?T1_name WHERE { ?T1 a :genre . ?T1 :genre\#name ?T1_name .        }
chinook_1,Find all the customer information in state NY.,SELECT * WHERE { ?T1 a :customer . ?T1 :customer\#state ?T1_state . FILTER(?T1_state = 'NY') .        }
chinook_1,What is all the customer information for customers in NY state?,SELECT * WHERE { ?T1 a :customer . ?T1 :customer\#state ?T1_state . FILTER(?T1_state = 'NY') .        }
chinook_1,What are the first names and last names of the employees who live in Calgary city.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :employee . ?T1 :employee\#firstname ?T1_firstname . ?T1 :employee\#lastname ?T1_lastname . ?T1 :employee\#city ?T1_city . FILTER(?T1_city = 'Calgary') .        }
chinook_1,What are the distinct billing countries of the invoices?,SELECT DISTINCT ?T1_billingcountry WHERE { ?T1 a :invoice . ?T1 :invoice\#billingcountry ?T1_billingcountry .        }
chinook_1,Find the names of all artists that have 'a' in their names.,"SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#name ?T1_name . FILTER(contains (?T1_name, 'a')) .        }"
chinook_1,What are the names of artist who have the letter 'a' in their names?,"SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#name ?T1_name . FILTER(contains (?T1_name, 'a')) .        }"
chinook_1,Find the title of all the albums of the artist 'AC/DC'.,SELECT ?T1_title WHERE { ?T1 a :album . ?T2 a :artist . ?T1 :album\#ref-artistid ?T2 .  ?T1 :album\#title ?T1_title . ?T2 :artist\#name ?T2_name . FILTER(?T2_name = 'AC/DC') .        }
chinook_1,What are the titles of albums by the artist 'AC/DC'?,SELECT ?T1_title WHERE { ?T1 a :album . ?T2 a :artist . ?T1 :album\#ref-artistid ?T2 .  ?T1 :album\#title ?T1_title . ?T2 :artist\#name ?T2_name . FILTER(?T2_name = 'AC/DC') .        }
chinook_1,Hom many albums does the artist 'Metallica' have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :album . ?T2 a :artist . ?T1 :album\#ref-artistid ?T2 .  ?T2 :artist\#name ?T2_name . FILTER(?T2_name = 'Metallica') .        }
chinook_1,Which artist does the album 'Balls to the Wall' belong to?,SELECT ?T1_name WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\#ref-artistid ?T1 .  ?T1 :artist\#name ?T1_name . ?T2 :album\#title ?T2_title . FILTER(?T2_title = 'Balls to the Wall') .        }
chinook_1,Which artist has the most albums?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\#ref-artistid ?T1 .  ?T1 :artist\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
chinook_1,What is the name of the artist with the greatest number of albums?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\#ref-artistid ?T1 .  ?T1 :artist\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
chinook_1,Find the names of all the tracks that contain the word 'you'.,"SELECT ?T1_name WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#name ?T1_name . FILTER(contains (?T1_name, 'you')) .        }"
chinook_1,What are the names of tracks that contain the the word you in them?,"SELECT ?T1_name WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#name ?T1_name . FILTER(contains (?T1_name, 'you')) .        }"
chinook_1,What is the average unit price of all the tracks?,SELECT (avg( ?T1_unitprice) as ?aggregation_T1_unitprice_58 ) WHERE { ?T1 a :track . ?T1 :track\#unitprice ?T1_unitprice .        }
chinook_1,Find the average unit price for a track.,SELECT (avg( ?T1_unitprice) as ?aggregation_T1_unitprice_37 ) WHERE { ?T1 a :track . ?T1 :track\#unitprice ?T1_unitprice .        }
chinook_1,Find the maximum and minimum durations of tracks in milliseconds.,SELECT (max( ?T1_milliseconds) as ?aggregation_T1_milliseconds_108 ) (min( ?T1_milliseconds) as ?aggregation_T1_milliseconds_126 ) WHERE { ?T1 a :track . ?T1 :track\#milliseconds ?T1_milliseconds . ?T1 :track\#milliseconds ?T1_milliseconds .        }
chinook_1,"Show the album names, ids and the number of tracks for each album.",SELECT ?T1_title ?T2_albumid (count( *) as ?aggregation_all) WHERE { ?T1 a :album . ?T2 a :track . ?T2 :track\#ref-albumid ?T1 .  ?T1 :album\#title ?T1_title . ?T2 :track\#albumid ?T2_albumid .        } GROUP BY ?T1_title ?T2_albumid
chinook_1,"What are the names and ids of the different albums, and how many tracks are on each?",SELECT ?T1_title ?T2_albumid (count( *) as ?aggregation_all) WHERE { ?T1 a :album . ?T2 a :track . ?T2 :track\#ref-albumid ?T1 .  ?T1 :album\#title ?T1_title . ?T2 :track\#albumid ?T2_albumid .        } GROUP BY ?T1_title ?T2_albumid
chinook_1,What is the name of the most common genre in all tracks?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :genre . ?T2 a :track . ?T2 :track\#ref-genreid ?T1 .  ?T1 :genre\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
chinook_1,What is the least common media type in all tracks?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :mediatype . ?T2 a :track . ?T2 :track\#ref-mediatypeid ?T1 .  ?T1 :mediatype\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY ASC (?aggregation_all) LIMIT 1
chinook_1,What is the name of the media type that is least common across all tracks?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :mediatype . ?T2 a :track . ?T2 :track\#ref-mediatypeid ?T1 .  ?T1 :mediatype\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY ASC (?aggregation_all) LIMIT 1
chinook_1,Show the album names and ids for albums that contain tracks with unit price bigger than 1.,SELECT ?T1_title ?T2_albumid WHERE { ?T1 a :album . ?T2 a :track . ?T2 :track\#ref-albumid ?T1 .  ?T1 :album\#title ?T1_title . ?T2 :track\#albumid ?T2_albumid . ?T2 :track\#unitprice ?T2_unitprice . FILTER(?T2_unitprice > 1) .        }
chinook_1,What are the titles and ids for albums containing tracks with unit price greater than 1?,SELECT ?T1_title ?T2_albumid WHERE { ?T1 a :album . ?T2 a :track . ?T2 :track\#ref-albumid ?T1 .  ?T1 :album\#title ?T1_title . ?T2 :track\#albumid ?T2_albumid . ?T2 :track\#unitprice ?T2_unitprice . FILTER(?T2_unitprice > 1) .        }
chinook_1,How many tracks belong to rock genre?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Rock') .        }
chinook_1,What is the average unit price of tracks that belong to Jazz genre?,SELECT (avg( ?T1_unitprice) as ?aggregation_T1_unitprice_19 ) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T1 :track\#unitprice ?T1_unitprice . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Jazz') .        }
chinook_1,Find the average unit price of jazz tracks.,SELECT (avg( ?T1_unitprice) as ?aggregation_T1_unitprice_38 ) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T1 :track\#unitprice ?T1_unitprice . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Jazz') .        }
chinook_1,What is the first name and last name of the customer that has email 'luisg@embraer.com.br'?,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :customer . ?T1 :customer\#firstname ?T1_firstname . ?T1 :customer\#lastname ?T1_lastname . ?T1 :customer\#email ?T1_email . FILTER(?T1_email = 'luisg@embraer.com.br') .        }
chinook_1,How many customers have email that contains 'gmail.com'?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customer . ?T1 :customer\#email ?T1_email . FILTER(contains (?T1_email, 'gmail.com')) .        }"
chinook_1,Find the full names of employees who help customers with the first name Leonie.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :employee . ?T2 a :customer . ?T2 :customer\#ref-supportrepid ?T1 .  ?T1 :employee\#firstname ?T1_firstname . ?T1 :employee\#lastname ?T1_lastname . ?T2 :customer\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Leonie') .        }
chinook_1,Find the cities corresponding to employees who help customers with the postal code 70174.,SELECT ?T1_city WHERE { ?T1 a :employee . ?T2 a :customer . ?T2 :customer\#ref-supportrepid ?T1 .  ?T1 :employee\#city ?T1_city . ?T2 :customer\#postalcode ?T2_postalcode . FILTER(?T2_postalcode = '70174') .        }
chinook_1,How many distinct cities does the employees live in?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_94 ) WHERE { ?T1 a :employee . ?T1 :employee\#city ?T1_city .        }
chinook_1,Find the number of different cities that employees live in.,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_99 ) WHERE { ?T1 a :employee . ?T1 :employee\#city ?T1_city .        }
chinook_1,Find all invoice dates corresponding to customers with first name Astrid and last name Gruber.,SELECT ?T1_invoicedate WHERE { ?T1 a :invoice . ?T2 a :customer . ?T1 :invoice\#ref-customerid ?T2 .  ?T1 :invoice\#invoicedate ?T1_invoicedate . ?T2 :customer\#firstname ?T2_firstname . ?T2 :customer\#lastname ?T2_lastname . FILTER(?T2_firstname = 'Astrid' && ?T2_lastname = 'Gruber') .        }
chinook_1,Find all the customer last names that do not have invoice totals larger than 20.,SELECT distinct?col1 WHERE { { SELECT (?T1_lastname as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\#lastname ?T1_lastname .   }}  MINUS {SELECT (?T2_lastname as ?col1) WHERE { ?T2 a :customer . ?T3 a :invoice . ?T3 :invoice\#ref-customerid ?T2 .  ?T2 :customer\#lastname ?T2_lastname . ?T3 :invoice\#total ?T3_total . FILTER(?T3_total > 20) .        }     } }
chinook_1,Find the first names of all customers that live in Brazil and have an invoice.,SELECT DISTINCT ?T1_firstname WHERE { ?T1 a :customer . ?T1 :customer\#firstname ?T1_firstname . ?T1 :customer\#country ?T1_country . FILTER(?T1_country = 'Brazil') .        }
chinook_1,Find the address of all customers that live in Germany and have invoice.,SELECT DISTINCT ?T1_address WHERE { ?T1 a :customer . ?T1 :customer\#address ?T1_address . ?T1 :customer\#country ?T1_country . FILTER(?T1_country = 'Germany') .        }
chinook_1,List the phone numbers of all employees.,SELECT ?T1_phone WHERE { ?T1 a :employee . ?T1 :employee\#phone ?T1_phone .        }
chinook_1,What are the phone numbers for each employee?,SELECT ?T1_phone WHERE { ?T1 a :employee . ?T1 :employee\#phone ?T1_phone .        }
chinook_1,How many tracks are in the AAC audio file media type?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :mediatype . ?T1 :track\#ref-mediatypeid ?T2 .  ?T2 :mediatype\#name ?T2_name . FILTER(?T2_name = 'AAC audio file') .        }
chinook_1,Find the average millisecond length of Latin and Pop tracks.,SELECT (avg( ?T1_milliseconds) as ?aggregation_T1_milliseconds_166 ) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T1 :track\#milliseconds ?T1_milliseconds . ?T2 :genre\#name ?T2_name . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Latin' || ?T2_name = 'Pop') .        }
chinook_1,Please show the employee first names and ids of employees who serve at least 10 customers.,SELECT ?T1_firstname ?T1_supportrepid WHERE { ?T1 a :customer . ?T2 a :employee . ?T1 :customer\#ref-supportrepid ?T2 .  ?T1 :customer\#firstname ?T1_firstname . ?T1 :customer\#supportrepid ?T1_supportrepid .        } GROUP BY ?T1_firstname ?T1_supportrepid   HAVING(count( *)  >= 10)
chinook_1,What are the first names and support rep ids for employees serving 10 or more customers?,SELECT ?T1_firstname ?T1_supportrepid WHERE { ?T1 a :customer . ?T2 a :employee . ?T1 :customer\#ref-supportrepid ?T2 .  ?T1 :customer\#firstname ?T1_firstname . ?T1 :customer\#supportrepid ?T1_supportrepid .        } GROUP BY ?T1_firstname ?T1_supportrepid   HAVING(count( *)  >= 10)
chinook_1,Please show the employee last names that serves no more than 20 customers.,SELECT ?T1_lastname WHERE { ?T1 a :customer . ?T2 a :employee . ?T1 :customer\#ref-supportrepid ?T2 .  ?T1 :customer\#lastname ?T1_lastname .        } GROUP BY ?T1_lastname   HAVING(count( *)  <= 20)
chinook_1,What are the last names of employees who serve at most 20 customers?,SELECT ?T1_lastname WHERE { ?T1 a :customer . ?T2 a :employee . ?T1 :customer\#ref-supportrepid ?T2 .  ?T1 :customer\#lastname ?T1_lastname .        } GROUP BY ?T1_lastname   HAVING(count( *)  <= 20)
chinook_1,Please list all album titles in alphabetical order.,SELECT ?T1_title WHERE { ?T1 a :album . ?T1 :album\#title ?T1_title . ?T1 :album\#title ?T1_title .        }  ORDER BY ASC (?T1_title)
chinook_1,Please list the name and id of all artists that have at least 3 albums in alphabetical order.,SELECT ?T1_name ?T2_artistid WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\#ref-artistid ?T1 .  ?T1 :artist\#name ?T1_name . ?T2 :album\#artistid ?T2_artistid . ?T1 :artist\#name ?T1_name .        } GROUP BY ?T1_name ?T2_artistid ORDER BY ASC (?T1_name)  HAVING(count( *)  >= 3)
chinook_1,"What are the names and ids of artists with 3 or more albums, listed in alphabetical order?",SELECT ?T1_name ?T2_artistid WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\#ref-artistid ?T1 .  ?T1 :artist\#name ?T1_name . ?T2 :album\#artistid ?T2_artistid . ?T1 :artist\#name ?T1_name .        } GROUP BY ?T1_name ?T2_artistid ORDER BY ASC (?T1_name)  HAVING(count( *)  >= 3)
chinook_1,Find the names of artists that do not have any albums.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :artist . ?T2 :artist\#name ?T2_name .        }     } }
chinook_1,What are the names of artists who have not released any albums?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :artist . ?T2 :artist\#name ?T2_name .        }     } }
chinook_1,What is the average unit price of rock tracks?,SELECT (avg( ?T1_unitprice) as ?aggregation_T1_unitprice_158 ) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T1 :track\#unitprice ?T1_unitprice . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Rock') .        }
chinook_1,Find the average unit price of tracks from the Rock genre.,SELECT (avg( ?T1_unitprice) as ?aggregation_T1_unitprice_184 ) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T1 :track\#unitprice ?T1_unitprice . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Rock') .        }
chinook_1,Find the maximum and minimum millisecond lengths of pop tracks.,SELECT (max( ?T1_milliseconds) as ?aggregation_T1_milliseconds_74 ) (min( ?T1_milliseconds) as ?aggregation_T1_milliseconds_50 ) WHERE { ?T1 a :track . ?T2 a :genre . ?T1 :track\#ref-genreid ?T2 .  ?T1 :track\#milliseconds ?T1_milliseconds . ?T1 :track\#milliseconds ?T1_milliseconds . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Pop') .        }
chinook_1,What are the birth dates of employees living in Edmonton?,SELECT ?T1_birthdate WHERE { ?T1 a :employee . ?T1 :employee\#birthdate ?T1_birthdate . ?T1 :employee\#city ?T1_city . FILTER(?T1_city = 'Edmonton') .        }
chinook_1,What are the distinct unit prices of all tracks?,SELECT DISTINCT ?T1_unitprice WHERE { ?T1 a :track . ?T1 :track\#unitprice ?T1_unitprice .        }
chinook_1,How many artists do not have any album?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T1 :artist\#artistid ?T1_artistid . FILTER(?T1_artistid not in (?T22_artistid)) .       {SELECT ?T22_artistid WHERE { ?T22 a :album . ?T22 :album\#artistid ?T22_artistid .        }    } }
chinook_1,What are the album titles for albums containing both 'Reggae' and 'Rock' genre tracks?,SELECT DISTINCT ?T1_title WHERE { ?T1 a :album . ?T13 a :artist . ?T1 :album\#ref-artistid ?T13 .  ?T1 :album\#title ?T1_title . ?T2 :genre\#name ?T2_name . ?T2 a :genre . ?T13 :artist\#ref-preferred_genre ?T2 .  ?T1 :album\#title ?T1_title . ?T2 :genre\#name ?T2_name . FILTER(?T2_name = 'Reggae') . FILTER (?T1_title in (?T3_title)) .   ?T3 a :album . ?T15 a :artist . ?T3 :album\#ref-artistid ?T15 .  ?T3 :album\#title ?T3_title . ?T4 :genre\#name ?T4_name . ?T4 a :genre . ?T15 :artist\#ref-preferred_genre ?T4 .  ?T3 :album\#title ?T3_title . ?T4 :genre\#name ?T4_name .  FILTER(?T4_name = 'Rock') .             }
insurance_fnol,Find all the phone numbers.,SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :available_policies\#customer_phone ?T1_customer_phone .        }
insurance_fnol,What are all the phone numbers?,SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :available_policies\#customer_phone ?T1_customer_phone .        }
insurance_fnol,What are the customer phone numbers under the policy 'Life Insurance'?,SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :available_policies\#customer_phone ?T1_customer_phone . ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . FILTER(?T1_policy_type_code = 'Life Insurance') .        }
insurance_fnol,What are the phone numbers of customers using the policy with the code 'Life Insurance'?,SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :available_policies\#customer_phone ?T1_customer_phone . ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . FILTER(?T1_policy_type_code = 'Life Insurance') .        }
insurance_fnol,Which policy type has the most records in the database?,SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :available_policies . ?T1 :available_policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_fnol,Which policy type appears most frequently in the available policies?,SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :available_policies . ?T1 :available_policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_fnol,Find the phone numbers of customers using the most common policy type among the available policies.,SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :available_policies\#customer_phone ?T1_customer_phone . ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . FILTER(?T1_policy_type_code = (?T22_policy_type_code)) .       {SELECT ?T22_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T22 a :available_policies . ?T22 :available_policies\#policy_type_code ?T22_policy_type_code .        } GROUP BY ?T22_policy_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
insurance_fnol,Find the policy type used by more than 4 customers.,SELECT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T1 :available_policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code   HAVING(count( *)  > 4)
insurance_fnol,Find the total and average amount of settlements.,SELECT (sum( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_184 ) (avg( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_179 ) WHERE { ?T1 a :settlements . ?T1 :settlements\#settlement_amount ?T1_settlement_amount . ?T1 :settlements\#settlement_amount ?T1_settlement_amount .        }
insurance_fnol,Return the sum and average of all settlement amounts.,SELECT (sum( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_190 ) (avg( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_150 ) WHERE { ?T1 a :settlements . ?T1 :settlements\#settlement_amount ?T1_settlement_amount . ?T1 :settlements\#settlement_amount ?T1_settlement_amount .        }
insurance_fnol,Find the name of services that have been used for more than 2 times in first notification of loss.,SELECT ?T1_service_name WHERE { ?T1 a :services . ?T2 a :first_notification_of_loss . ?T2 :first_notification_of_loss\#ref-service_id ?T1 .  ?T1 :services\#service_name ?T1_service_name .        } GROUP BY ?T1_service_name   HAVING(count( *)  > 2)
insurance_fnol,What is the effective date of the claim that has the largest amount of total settlement?,SELECT ?T1_effective_date WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\#ref-claim_id ?T1 .  ?T1 :claims\#effective_date ?T1_effective_date . ?T2 :settlements\#settlement_amount ?T2_settlement_amount .        } GROUP BY ?T1_effective_date  ORDER BY DESC ((sum( ?T2_settlement_amount) as ?aggregation_T2_settlement_amount_194 )) LIMIT 1
