kg_name,question,query
voter_2,What is the average age of students who have city code 'NYC' and have secretary votes for the spring election cycle?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_132 ) WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#age ?T1_age . ?T1 :student\#city_code ?T1_city_code . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T1_city_code = 'NYC' && ?T2_election_cycle = 'Spring') .        }
voter_2,Find the average age of female (sex is F) students who have secretary votes in the spring election cycle.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_180 ) WHERE { ?T1 a :student . ?T2 a :voting_record . ?T2 :voting_record\#ref-class_president_vote ?T1 .  ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex . ?T2 :voting_record\#election_cycle ?T2_election_cycle . FILTER(?T1_sex = 'F' && ?T2_election_cycle = 'Spring') .        }
voter_2,Find the distinct first names of all the students who have vice president votes and whose city code is not PIT.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_fname as ?col1) WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname .   }}  MINUS {SELECT DISTINCT (?T2_fname as ?col1) WHERE { ?T2 a :student . ?T2 :student\#fname ?T2_fname . ?T2 :student\#city_code ?T2_city_code . FILTER(?T2_city_code = 'PIT') .        }     } }
voter_2,Find the distinct last names of all the students who have president votes and whose advisor is not 2192.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_lname as ?col1) WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname .   }}  MINUS {SELECT DISTINCT (?T2_lname as ?col1) WHERE { ?T2 a :student . ?T2 :student\#lname ?T2_lname . ?T2 :student\#advisor ?T2_advisor . FILTER(?T2_advisor = 2192) .        }     } }
voter_2,What are the distinct last names of the students who have president votes but do not have 2192 as the advisor?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_lname as ?col1) WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname .   }}  MINUS {SELECT DISTINCT (?T2_lname as ?col1) WHERE { ?T2 a :student . ?T2 :student\#lname ?T2_lname . ?T2 :student\#advisor ?T2_advisor . FILTER(?T2_advisor = 2192) .        }     } }
voter_2,Find the distinct last names of all the students who have president votes and whose advisor is 8741.,SELECT DISTINCT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . FILTER (?T1_lname in (?T2_lname)) .  SELECT DISTINCT ?T2_lname WHERE { ?T2 a :student . ?T2 :student\#lname ?T2_lname . ?T2 :student\#advisor ?T2_advisor . FILTER(?T2_advisor = 8741) .        }          }
voter_2,What are the distinct last names of the students who have president votes and have 8741 as the advisor?,SELECT DISTINCT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . FILTER (?T1_lname in (?T2_lname)) .  SELECT DISTINCT ?T2_lname WHERE { ?T2 a :student . ?T2 :student\#lname ?T2_lname . ?T2 :student\#advisor ?T2_advisor . FILTER(?T2_advisor = 8741) .        }          }
voter_2,How many students does each advisor have?,SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor
voter_2,Report all advisors that advise more than 2 students.,SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor   HAVING(count( *)  > 2)
voter_2,Which advisors have more than two students?,SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor   HAVING(count( *)  > 2)
voter_2,Report all majors that have less than 3 students.,SELECT ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major   HAVING(count( *)  < 3)
voter_2,What are the majors only less than three students are studying?,SELECT ?T1_major WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major   HAVING(count( *)  < 3)
voter_2,"For each election cycle, report the number of voting records.",SELECT ?T1_election_cycle (count( *) as ?aggregation_all) WHERE { ?T1 a :voting_record . ?T1 :voting_record\#election_cycle ?T1_election_cycle .        } GROUP BY ?T1_election_cycle
voter_2,Which major has the most students?,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major  ORDER BY DESC (?aggregation_all) LIMIT 1
voter_2,What is the most common major among female (sex is F) students?,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        } GROUP BY ?T1_major  ORDER BY DESC (?aggregation_all) LIMIT 1
voter_2,What is the city_code of the city that the most students live in?,SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code  ORDER BY DESC (?aggregation_all) LIMIT 1
voter_2,Which advisors are advising more than 2 students?,SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor   HAVING(count( *)  > 2)
products_gen_characteristics,How many products are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products .        }
products_gen_characteristics,How many colors are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors .        }
products_gen_characteristics,How many characteristics are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :characteristics .        }
products_gen_characteristics,What are the names and buying prices of all the products?,SELECT ?T1_product_name ?T1_typical_buying_price WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#typical_buying_price ?T1_typical_buying_price .        }
products_gen_characteristics,List the description of all the colors.,SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T1 :ref_colors\#color_description ?T1_color_description .        }
products_gen_characteristics,What are the descriptions for each color?,SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T1 :ref_colors\#color_description ?T1_color_description .        }
products_gen_characteristics,Find the names of all the product characteristics.,SELECT DISTINCT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T1 :characteristics\#characteristic_name ?T1_characteristic_name .        }
products_gen_characteristics,What are the different names of the product characteristics?,SELECT DISTINCT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T1 :characteristics\#characteristic_name ?T1_characteristic_name .        }
products_gen_characteristics,What are the names of products with category 'Spices'?,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') .        }
products_gen_characteristics,"List the names, color descriptions and product descriptions of products with category 'Herbs'.",SELECT ?T1_product_name ?T2_color_description ?T1_product_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . ?T1 :products\#product_description ?T1_product_description . ?T1 :products\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') .        }
products_gen_characteristics,How many products are there under the category 'Seeds'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Seeds') .        }
products_gen_characteristics,Find the number of products with category 'Spices' and typically sold above 1000.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_category_code ?T1_product_category_code . ?T1 :products\#typical_buying_price ?T1_typical_buying_price . FILTER(?T1_product_category_code = 'Spices' && ?T1_typical_buying_price > 1000) .        }
products_gen_characteristics,What is the category and typical buying price  of the product with name 'cumin'?,SELECT ?T1_product_category_code ?T1_typical_buying_price WHERE { ?T1 a :products . ?T1 :products\#product_category_code ?T1_product_category_code . ?T1 :products\#typical_buying_price ?T1_typical_buying_price . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'cumin') .        }
products_gen_characteristics,Which category does the product named 'flax' belong to?,SELECT ?T1_product_category_code WHERE { ?T1 a :products . ?T1 :products\#product_category_code ?T1_product_category_code . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'flax') .        }
products_gen_characteristics,What is the name of the product with the color description 'yellow'?,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . FILTER(?T2_color_description = 'yellow') .        }
products_gen_characteristics,Find the category descriptions of the products whose descriptions include letter 't'.,"SELECT ?T1_product_category_description WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\#product_category_description ?T1_product_category_description . ?T2 :products\#product_description ?T2_product_description . FILTER(contains (?T2_product_description, 't')) .        }"
products_gen_characteristics,What is the color description of the product with name 'catnip'?,SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :products\#ref-color_code ?T1 .  ?T1 :ref_colors\#color_description ?T1_color_description . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'catnip') .        }
products_gen_characteristics,What is the color code and description of the product named 'chervil'?,SELECT ?T1_color_code ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#color_code ?T1_color_code . ?T2 :ref_colors\#color_description ?T2_color_description . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'chervil') .        }
products_gen_characteristics,Find the id and color description of the products with at least 2 characteristics.,SELECT ?T1_product_id ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_id ?T1_product_id . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 a :product_characteristics . ?T3 :product_characteristics\#ref-product_id ?T1 .  ?T1 :products\#product_id ?T1_product_id . ?T2 :ref_colors\#color_description ?T2_color_description .        } GROUP BY ?T1_product_id ?T2_color_description   HAVING(count( *)  >= 2)
products_gen_characteristics,What are the product ids and color descriptions for products with two or more characteristics?,SELECT ?T1_product_id ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_id ?T1_product_id . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 a :product_characteristics . ?T3 :product_characteristics\#ref-product_id ?T1 .  ?T1 :products\#product_id ?T1_product_id . ?T2 :ref_colors\#color_description ?T2_color_description .        } GROUP BY ?T1_product_id ?T2_color_description   HAVING(count( *)  >= 2)
products_gen_characteristics,What are the names of products with 'white' as their color description?,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . FILTER(?T2_color_description = 'white') .        }
products_gen_characteristics,What are the name and typical buying and selling prices of the products that have color described as 'yellow'?,SELECT ?T1_product_name ?T1_typical_buying_price ?T1_typical_selling_price WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#typical_buying_price ?T1_typical_buying_price . ?T1 :products\#typical_selling_price ?T1_typical_selling_price . ?T2 :ref_colors\#color_description ?T2_color_description . FILTER(?T2_color_description = 'yellow') .        }
products_gen_characteristics,How many characteristics does the product named 'sesame' have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :product_characteristics . ?T2 a :products . ?T1 :product_characteristics\#ref-product_id ?T2 .  ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }
products_gen_characteristics,How many distinct characteristic names does the product 'cumin' have?,SELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_22 ) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\#ref-product_id ?T2 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }
products_gen_characteristics,Count the number of different characteristic names the product 'cumin' has.,SELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_61 ) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\#ref-product_id ?T2 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }
products_gen_characteristics,What are all the characteristic names of product 'sesame'?,SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\#ref-product_id ?T2 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }
products_gen_characteristics,List all the characteristic names and data types of product 'cumin'.,SELECT ?T1_characteristic_name ?T1_characteristic_data_type WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T1 :characteristics\#characteristic_data_type ?T1_characteristic_data_type . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\#ref-product_id ?T2 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T1 :characteristics\#characteristic_data_type ?T1_characteristic_data_type . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') .        }
products_gen_characteristics,How many characteristics does the product named 'laurel' have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'laurel') .        }
products_gen_characteristics,Find the number of characteristics that the product 'flax' has.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'flax') .        }
products_gen_characteristics,Find the name of the products that have the color description 'red' and have the characteristic name 'fast'.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :characteristics\#characteristic_name ?T3_characteristic_name . ?T14 a :product_characteristics . ?T14 :product_characteristics\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :characteristics\#characteristic_name ?T3_characteristic_name . ?T3 a :characteristics . ?T14 :product_characteristics\#ref-characteristic_id ?T3 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :characteristics\#characteristic_name ?T3_characteristic_name . FILTER(?T2_color_description = 'red' && ?T3_characteristic_name = 'fast') .        }
products_gen_characteristics,How many products have the characteristic named 'hot'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :product_characteristics . ?T2 a :characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T2 .  ?T2 :characteristics\#characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'hot') .        }
products_gen_characteristics,List the all the distinct names of the products with the characteristic name 'warm'.,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :characteristics\#characteristic_name ?T2_characteristic_name . ?T2 a :characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :characteristics\#characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'warm') .        }
products_gen_characteristics,Find the number of the products that have their color described as 'red' and have a characteristic named 'slow'.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :characteristics\#characteristic_name ?T3_characteristic_name . ?T14 a :product_characteristics . ?T14 :product_characteristics\#ref-product_id ?T1 .  ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :characteristics\#characteristic_name ?T3_characteristic_name . ?T3 a :characteristics . ?T14 :product_characteristics\#ref-characteristic_id ?T3 .  ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :characteristics\#characteristic_name ?T3_characteristic_name . FILTER(?T2_color_description = 'red' && ?T3_characteristic_name = 'slow') .        }
products_gen_characteristics,What is the unit of measuerment of the product category code 'Herbs'?,SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T1 :ref_product_categories\#unit_of_measure ?T1_unit_of_measure . ?T1 :ref_product_categories\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') .        }
products_gen_characteristics,Find the product category description of the product category with code 'Spices'.,SELECT ?T1_product_category_description WHERE { ?T1 a :ref_product_categories . ?T1 :ref_product_categories\#product_category_description ?T1_product_category_description . ?T1 :ref_product_categories\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') .        }
products_gen_characteristics,What is the description of the product category with the code 'Spices'?,SELECT ?T1_product_category_description WHERE { ?T1 a :ref_product_categories . ?T1 :ref_product_categories\#product_category_description ?T1_product_category_description . ?T1 :ref_product_categories\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') .        }
products_gen_characteristics,What is the product category description and unit of measurement of category 'Herbs'?,SELECT ?T1_product_category_description ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T1 :ref_product_categories\#product_category_description ?T1_product_category_description . ?T1 :ref_product_categories\#unit_of_measure ?T1_unit_of_measure . ?T1 :ref_product_categories\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') .        }
products_gen_characteristics,What is the unit of measurement of product named 'cumin'?,SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\#unit_of_measure ?T1_unit_of_measure . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') .        }
products_gen_characteristics,Find the unit of measurement and product category code of product named 'chervil'.,SELECT ?T1_unit_of_measure ?T1_product_category_code WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\#unit_of_measure ?T1_unit_of_measure . ?T1 :ref_product_categories\#product_category_code ?T1_product_category_code . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'chervil') .        }
products_gen_characteristics,What are the unit of measure and category code for the 'chervil' product?,SELECT ?T1_unit_of_measure ?T1_product_category_code WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\#unit_of_measure ?T1_unit_of_measure . ?T1 :ref_product_categories\#product_category_code ?T1_product_category_code . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'chervil') .        }
products_gen_characteristics,Find the product names that are colored 'white' but do not have unit of measurement 'Handful'.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\#ref-color_code ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :ref_product_categories\#unit_of_measure ?T3_unit_of_measure . ?T3 a :ref_product_categories . ?T1 :products\#ref-product_category_code ?T3 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :ref_colors\#color_description ?T2_color_description . ?T3 :ref_product_categories\#unit_of_measure ?T3_unit_of_measure . FILTER(?T2_color_description = 'white' && ?T3_unit_of_measure != 'Handful') .        }
products_gen_characteristics,What is the description of the color for most products?,SELECT ?T1_color_description (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :products\#ref-color_code ?T1 .  ?T1 :ref_colors\#color_description ?T1_color_description .        } GROUP BY ?T1_color_description  ORDER BY DESC (?aggregation_all) LIMIT 1
products_gen_characteristics,What is the description of the color used by least products?,SELECT ?T1_color_description (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :products\#ref-color_code ?T1 .  ?T1 :ref_colors\#color_description ?T1_color_description .        } GROUP BY ?T1_color_description  ORDER BY ASC (?aggregation_all) LIMIT 1
products_gen_characteristics,What is the characteristic name used by most number of the products?,SELECT ?T1_characteristic_name (count( *) as ?aggregation_all) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name .        } GROUP BY ?T1_characteristic_name  ORDER BY DESC (?aggregation_all) LIMIT 1
products_gen_characteristics,"Give the names, details, and data types of characteristics that are not found in any product.",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_characteristic_name as ?col1) (?T1_other_characteristic_details as ?col2) (?T1_characteristic_data_type as ?col3) WHERE { ?T1 a :characteristics . ?T1 :characteristics\#characteristic_name ?T1_characteristic_name . ?T1 :characteristics\#other_characteristic_details ?T1_other_characteristic_details . ?T1 :characteristics\#characteristic_data_type ?T1_characteristic_data_type .   }}  MINUS {SELECT (?T2_characteristic_name as ?col1) (?T2_other_characteristic_details as ?col2) (?T2_characteristic_data_type as ?col3) WHERE { ?T2 a :characteristics . ?T2 :characteristics\#characteristic_name ?T2_characteristic_name . ?T2 :characteristics\#other_characteristic_details ?T2_other_characteristic_details . ?T2 :characteristics\#characteristic_data_type ?T2_characteristic_data_type .        }     } }
products_gen_characteristics,What are characteristic names used at least twice across all products?,SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name .        } GROUP BY ?T1_characteristic_name   HAVING(count( *)  >= 2)
products_gen_characteristics,Give the names of characteristics that are in two or more products?,SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\#ref-characteristic_id ?T1 .  ?T1 :characteristics\#characteristic_name ?T1_characteristic_name .        } GROUP BY ?T1_characteristic_name   HAVING(count( *)  >= 2)
products_gen_characteristics,How many colors are never used by any product?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . ?T1 :ref_colors\#color_code ?T1_color_code . FILTER(?T1_color_code not in (?T22_color_code)) .       {SELECT ?T22_color_code WHERE { ?T22 a :products . ?T22 :products\#color_code ?T22_color_code .        }    } }
swimming,How many events are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :event .        }
swimming,List all the event names by year from the most recent to the oldest.,SELECT ?T1_name WHERE { ?T1 a :event . ?T1 :event\#name ?T1_name . ?T1 :event\#year ?T1_year .        }  ORDER BY DESC (?T1_year)
swimming,What is the name of the event that happened in the most recent year?,SELECT ?T1_name WHERE { ?T1 a :event . ?T1 :event\#name ?T1_name . ?T1 :event\#year ?T1_year .        }   ORDER BY DESC (?T1_year) LIMIT 1
swimming,How many stadiums are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium .        }
swimming,Find the name of the stadium that has the maximum capacity.,SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :stadium\#name ?T1_name . ?T1 :stadium\#capacity ?T1_capacity .        }   ORDER BY DESC (?T1_capacity) LIMIT 1
swimming,Find the names of stadiums whose capacity is smaller than the average capacity.,SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :stadium\#name ?T1_name . ?T1 :stadium\#capacity ?T1_capacity . FILTER(?T1_capacity < (?aggregation_T22_capacity_157)) .       {SELECT (avg( ?T22_capacity) as ?aggregation_T22_capacity_157 ) WHERE { ?T22 a :stadium . ?T22 :stadium\#capacity ?T22_capacity .        }    } }
swimming,Find the country that has the most stadiums.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T1 :stadium\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
swimming,Which country has at most 3 stadiums listed?,SELECT ?T1_country WHERE { ?T1 a :stadium . ?T1 :stadium\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  <= 3)
swimming,How many cities have a stadium that was opened before the year of 2006?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_143 ) WHERE { ?T1 a :stadium . ?T1 :stadium\#city ?T1_city . ?T1 :stadium\#opening_year ?T1_opening_year . FILTER(?T1_opening_year < 2006) .        }
swimming,How many stadiums does each country have?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T1 :stadium\#country ?T1_country .        } GROUP BY ?T1_country
swimming,Which countries do not have a stadium that was opened after 2006?,SELECT distinct?T1_country WHERE { { SELECT (?T1_country as ?col1) WHERE { ?T1 a :stadium . ?T1 :stadium\#country ?T1_country .   }}  MINUS {SELECT (?T2_country as ?col1) WHERE { ?T2 a :stadium . ?T2 :stadium\#country ?T2_country . ?T2 :stadium\#opening_year ?T2_opening_year . FILTER(?T2_opening_year > 2006) .        }     } }
swimming,How many stadiums are not in country 'Russia'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T1 :stadium\#country ?T1_country . FILTER(?T1_country != 'Russia') .        }
swimming,"Find the names of all swimmers, sorted by their 100 meter scores in ascending order.",SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T1 :swimmer\#name ?T1_name . ?T1 :swimmer\#meter_100 ?T1_meter_100 .        }  ORDER BY ASC (?T1_meter_100)
swimming,How many different countries are all the swimmers from?,SELECT DISTINCT (count(DISTINCT ?T1_nationality) as ?aggregation_T1_nationality_143 ) WHERE { ?T1 a :swimmer . ?T1 :swimmer\#nationality ?T1_nationality .        }
swimming,List countries that have more than one swimmer.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :swimmer . ?T1 :swimmer\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality   HAVING(count( *)  > 1)
swimming,Find all 200 meter and 300 meter results of swimmers with nationality 'Australia'.,SELECT ?T1_meter_200 ?T1_meter_300 WHERE { ?T1 a :swimmer . ?T1 :swimmer\#meter_200 ?T1_meter_200 . ?T1 :swimmer\#meter_300 ?T1_meter_300 . ?T1 :swimmer\#nationality ?T1_nationality . FILTER(?T1_nationality = 'Australia') .        }
swimming,Find the names of swimmers who has a result of 'win'.,SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\#ref-swimmer_id ?T1 .  ?T1 :swimmer\#name ?T1_name . ?T2 :record\#result ?T2_result . FILTER(?T2_result = 'Win') .        }
swimming,What is the name of the stadium which held the most events?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T2 a :event . ?T2 :event\#ref-stadium_id ?T1 .  ?T1 :stadium\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
swimming,Find the name and capacity of the stadium where the event named 'World Junior' happened.,SELECT ?T1_name ?T1_capacity WHERE { ?T1 a :stadium . ?T2 a :event . ?T2 :event\#ref-stadium_id ?T1 .  ?T1 :stadium\#name ?T1_name . ?T1 :stadium\#capacity ?T1_capacity . ?T2 :event\#name ?T2_name . FILTER(?T2_name = 'World Junior') .        }
swimming,Find the names of stadiums which have never had any event.,SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :stadium\#name ?T1_name . ?T1 :stadium\#id ?T1_id . FILTER(?T1_id not in (?T22_stadium_id)) .       {SELECT ?T22_stadium_id WHERE { ?T22 a :event . ?T22 :event\#stadium_id ?T22_stadium_id .        }    } }
swimming,Find the name of the swimmer who has the most records.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :record\#ref-swimmer_id ?T1 .  ?T1 :swimmer\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
