kg_name,question,query
hr_1,display the employee name ( first name and last name ) and hire date for all employees in the same department as Clara.,SELECT ?T1_first_name ?T1_last_name ?T1_hire_date WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#hire_date ?T1_hire_date . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_department_id = (?T22_first_name)) .       {SELECT ?T22_department_id WHERE { ?T22 a :employees . ?T22 :employees\#department_id ?T22_department_id . ?T22 :employees\#first_name ?T22_first_name . FILTER(?T22_first_name = 'Clara') .        }    } }
hr_1,display the employee number and name( first name and last name ) for all employees who work in a department with any employee whose name contains a T.,"SELECT ?T1_employee_id ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_department_id in (?T22_first_name)) .       {SELECT ?T22_department_id WHERE { ?T22 a :employees . ?T22 :employees\#department_id ?T22_department_id . ?T22 :employees\#first_name ?T22_first_name . FILTER(contains (?T22_first_name, 'T')) .        }    } }"
hr_1,"display the employee number, name( first name and last name ), and salary for all employees who earn more than the average salary and who work in a department with any employee with a 'J' in their first name.","SELECT ?T1_employee_id ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_salary > (?aggregation_T22_salary_192) && ?T1_department_id in (?T22_first_name)) .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_192 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } {SELECT ?T22_department_id WHERE { ?T22 a :employees . ?T22 :employees\#department_id ?T22_department_id . ?T22 :employees\#first_name ?T22_first_name . FILTER(contains (?T22_first_name, 'J')) .        }    } }"
hr_1,"What are the ids, full names, and salaries for employees making more than average and who work in a department with employees who have the letter J in their first name?","SELECT ?T1_employee_id ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id . FILTER(?T1_salary > (?aggregation_T22_salary_190) && ?T1_department_id in (?T22_first_name)) .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_190 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary .        }    } {SELECT ?T22_department_id WHERE { ?T22 a :employees . ?T22 :employees\#department_id ?T22_department_id . ?T22 :employees\#first_name ?T22_first_name . FILTER(contains (?T22_first_name, 'J')) .        }    } }"
hr_1,display the employee number and job id for all employees whose salary is smaller than any salary of those employees whose job title is MK_MAN.,SELECT ?T1_employee_id ?T1_job_id WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#job_id ?T1_job_id . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary < (?T22_job_id)) .       {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_71 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary . ?T22 :employees\#job_id ?T22_job_id . FILTER(?T22_job_id = 'MK_MAN') .        }    } }
hr_1,"display the employee number, name( first name and last name ) and job title for all employees whose salary is more than any salary of those employees whose job title is PU_MAN.",SELECT ?T1_employee_id ?T1_first_name ?T1_last_name ?T1_job_id WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#job_id ?T1_job_id . ?T1 :employees\#salary ?T1_salary . FILTER(?T1_salary > (?T22_job_id)) .       {SELECT (max( ?T22_salary) as ?aggregation_T22_salary_171 ) WHERE { ?T22 a :employees . ?T22 :employees\#salary ?T22_salary . ?T22 :employees\#job_id ?T22_job_id . FILTER(?T22_job_id = 'PU_MAN') .        }    } }
hr_1,display the department id and the total salary for those departments which contains at least two employees.,SELECT ?T1_department_id (sum( ?T1_salary) as ?aggregation_T1_salary_199 ) WHERE { ?T1 a :employees . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#salary ?T1_salary .        } GROUP BY ?T1_department_id   HAVING(count( *)  >= 2)
hr_1,display all the information of those employees who did not have any job in the past.,SELECT * WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . FILTER(?T1_employee_id not in (?T22_employee_id)) .       {SELECT ?T22_employee_id WHERE { ?T22 a :job_history . ?T22 :job_history\#employee_id ?T22_employee_id .        }    } }
hr_1,"display the department ID, full name (first and last name), salary for those employees who is highest salary in every department.",SELECT ?T1_first_name ?T1_last_name ?T1_salary ?T1_department_id (max( ?T1_salary) as ?aggregation_T1_salary_5 ) WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#salary ?T1_salary .        } GROUP BY ?T1_department_id
hr_1,"What are the department ids, full names, and salaries for employees who make the most in their departments?",SELECT ?T1_first_name ?T1_last_name ?T1_salary ?T1_department_id (max( ?T1_salary) as ?aggregation_T1_salary_33 ) WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T1 :employees\#department_id ?T1_department_id . ?T1 :employees\#salary ?T1_salary .        } GROUP BY ?T1_department_id
hr_1,"display the first and last name, department, city, and state province for each employee.",SELECT ?T1_first_name ?T1_last_name ?T2_department_name ?T3_city ?T3_state_province WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :employees\#ref-department_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T2 :departments\#department_name ?T2_department_name . ?T3 :locations\#city ?T3_city . ?T3 :locations\#state_province ?T3_state_province . ?T3 a :locations . ?T2 :departments\#ref-location_id ?T3 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T2 :departments\#department_name ?T2_department_name . ?T3 :locations\#city ?T3_city . ?T3 :locations\#state_province ?T3_state_province .        }
hr_1,"display those employees who contain a letter z to their first name and also display their last name, city.","SELECT ?T1_first_name ?T1_last_name ?T2_city WHERE { ?T1 a :employees . ?T13 a :departments . ?T1 :employees\#ref-department_id ?T13 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T2 :locations\#city ?T2_city . ?T1 :employees\#first_name ?T1_first_name . ?T2 a :locations . ?T13 :departments\#ref-location_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T2 :locations\#city ?T2_city . ?T1 :employees\#first_name ?T1_first_name . FILTER(contains (?T1_first_name, 'z')) .        }"
hr_1,"display the department name, city, and state province for each department.",SELECT ?T1_department_name ?T2_city ?T2_state_province WHERE { ?T1 a :departments . ?T2 a :locations . ?T1 :departments\#ref-location_id ?T2 .  ?T1 :departments\#department_name ?T1_department_name . ?T2 :locations\#city ?T2_city . ?T2 :locations\#state_province ?T2_state_province .        }
hr_1,display the full name (first and last name ) of employee with ID and name of the country presently where (s)he is working.,SELECT ?T1_first_name ?T1_last_name ?T1_employee_id ?T2_country_name WHERE { ?T1 a :employees . ?T13 a :departments . ?T1 :employees\#ref-department_id ?T13 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :countries\#country_name ?T2_country_name . ?T14 a :locations . ?T13 :departments\#ref-location_id ?T14 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :countries\#country_name ?T2_country_name . ?T2 a :countries . ?T14 :locations\#ref-country_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :countries\#country_name ?T2_country_name .        }
hr_1,"display the full name (first and last name), and salary of those employees who working in any department located in London.",SELECT ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a :employees . ?T13 a :departments . ?T1 :employees\#ref-department_id ?T13 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T2 :locations\#city ?T2_city . ?T2 a :locations . ?T13 :departments\#ref-location_id ?T2 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#salary ?T1_salary . ?T2 :locations\#city ?T2_city . FILTER(?T2_city = 'London') .        }
music_1,What is the name of the song that was released in the most recent year?,SELECT ?T1_song_name ?T1_releasedate WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#releasedate ?T1_releasedate . ?T1 :song\#releasedate ?T1_releasedate .        }   ORDER BY DESC (?T1_releasedate) LIMIT 1
music_1,What is the name of the song that was released most recently?,SELECT ?T1_song_name ?T1_releasedate WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#releasedate ?T1_releasedate . ?T1 :song\#releasedate ?T1_releasedate .        }   ORDER BY DESC (?T1_releasedate) LIMIT 1
music_1,What is the id of the longest song?,SELECT ?T1_f_id WHERE { ?T1 a :files . ?T1 :files\#f_id ?T1_f_id . ?T1 :files\#duration ?T1_duration .        }   ORDER BY DESC (?T1_duration) LIMIT 1
music_1,Find the names of all English songs.,SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'english') .        }
music_1,What are the names of all songs in English?,SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'english') .        }
music_1,What are the id of songs whose format is mp3.,SELECT ?T1_f_id WHERE { ?T1 a :files . ?T1 :files\#f_id ?T1_f_id . ?T1 :files\#formats ?T1_formats . FILTER(?T1_formats = 'mp3') .        }
music_1,What are the id of all the files in mp3 format?,SELECT ?T1_f_id WHERE { ?T1 a :files . ?T1 :files\#f_id ?T1_f_id . ?T1 :files\#formats ?T1_formats . FILTER(?T1_formats = 'mp3') .        }
music_1,List the name and country of origin for all singers who have produced songs with rating above 9.,SELECT DISTINCT ?T1_artist_name ?T1_country WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . ?T2 :song\#rating ?T2_rating . FILTER(?T2_rating > 9) .        }
music_1,List the file size and format for all songs that have resolution lower than 800.,SELECT DISTINCT ?T1_file_size ?T1_formats WHERE { ?T1 a :files . ?T2 a :song . ?T2 :song\#ref-f_id ?T1 .  ?T1 :files\#file_size ?T1_file_size . ?T1 :files\#formats ?T1_formats . ?T2 :song\#resolution ?T2_resolution . FILTER(?T2_resolution < 800) .        }
music_1,What is the name of the artist who produced the shortest song?,SELECT ?T1_artist_name WHERE { ?T1 a :song . ?T2 a :files . ?T1 :song\#ref-f_id ?T2 .  ?T1 :song\#artist_name ?T1_artist_name . ?T2 :files\#duration ?T2_duration .        }   ORDER BY ASC (?T2_duration) LIMIT 1
music_1,What are the names of the artists who sang the shortest song?,SELECT ?T1_artist_name WHERE { ?T1 a :song . ?T2 a :files . ?T1 :song\#ref-f_id ?T2 .  ?T1 :song\#artist_name ?T1_artist_name . ?T2 :files\#duration ?T2_duration .        }   ORDER BY ASC (?T2_duration) LIMIT 1
music_1,What are the names and countries of origin for the artists who produced the top three highly rated songs.,SELECT ?T1_artist_name ?T1_country WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . ?T2 :song\#rating ?T2_rating .        }   ORDER BY DESC (?T2_rating) LIMIT 1
music_1,How many songs have 4 minute duration?,"SELECT (COUNT(*) as ?agg) WHERE{?t1 a :files . 
    ?t1 :files\#duration ?t1_duration .
    FILTER (contains(xsd:string(?t1_duration),'4:'))}"
music_1,What is the count of the songs that last approximately 4 minutes?,"SELECT (COUNT(*) as ?agg) WHERE{?t1 a :files . 
    ?t1 :files\#duration ?t1_duration .
    FILTER (contains(xsd:string(?t1_duration),'4:'))}"
music_1,How many artists are from Bangladesh?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'Bangladesh') .        }
music_1,How many Bangladeshi artists are listed?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'Bangladesh') .        }
music_1,What is the average rating of songs produced by female artists?,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_168 ) WHERE { ?T1 a :song . ?T2 a :artist . ?T1 :song\#ref-artist_name ?T2 .  ?T1 :song\#rating ?T1_rating . ?T2 :artist\#gender ?T2_gender . FILTER(?T2_gender = 'Female') .        }
music_1,What is the most popular file format?,SELECT ?T1_formats (count( *) as ?aggregation_all) WHERE { ?T1 a :files . ?T1 :files\#formats ?T1_formats .        } GROUP BY ?T1_formats  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,Find the names of the artists who are from UK and have produced English songs.,SELECT DISTINCT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'UK') . FILTER (?T1_artist_name in (?T2_artist_name)) .   ?T2 a :song . ?T2 :song\#artist_name ?T2_artist_name . ?T2 :song\#languages ?T2_languages .  FILTER(?T2_languages = 'english') .             }
music_1,What are the names of the artists that are from the UK and sang songs in English?,SELECT DISTINCT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'UK') . FILTER (?T1_artist_name in (?T2_artist_name)) .   ?T2 a :song . ?T2 :song\#artist_name ?T2_artist_name . ?T2 :song\#languages ?T2_languages .  FILTER(?T2_languages = 'english') .             }
music_1,Find the id of songs that are available in mp4 format and have resolution lower than 1000.,SELECT DISTINCT ?T1_f_id WHERE { ?T1 a :files . ?T1 :files\#f_id ?T1_f_id . ?T1 :files\#formats ?T1_formats . FILTER(?T1_formats = 'mp4') . FILTER (?T1_f_id in (?T2_f_id)) .   ?T2 a :song . ?T2 :song\#f_id ?T2_f_id . ?T2 :song\#resolution ?T2_resolution .  FILTER(?T2_resolution < 1000) .             }
music_1,What is the id of the files that are available in the format of mp4 and a resolution smaller than 1000?,SELECT DISTINCT ?T1_f_id WHERE { ?T1 a :files . ?T1 :files\#f_id ?T1_f_id . ?T1 :files\#formats ?T1_formats . FILTER(?T1_formats = 'mp4') . FILTER (?T1_f_id in (?T2_f_id)) .   ?T2 a :song . ?T2 :song\#f_id ?T2_f_id . ?T2 :song\#resolution ?T2_resolution .  FILTER(?T2_resolution < 1000) .             }
music_1,What is the average duration of songs that have mp3 format and resolution below 800?,SELECT (avg( ?T1_duration) as ?aggregation_T1_duration_153 ) WHERE { ?T1 a :files . ?T2 a :song . ?T2 :song\#ref-f_id ?T1 .  ?T1 :files\#duration ?T1_duration . ?T1 :files\#formats ?T1_formats . ?T2 :song\#resolution ?T2_resolution . FILTER(?T1_formats = 'mp3' && ?T2_resolution < 800) .        }
music_1,What is the average song duration for the songs that are in mp3 format and whose resolution below 800?,SELECT (avg( ?T1_duration) as ?aggregation_T1_duration_28 ) WHERE { ?T1 a :files . ?T2 a :song . ?T2 :song\#ref-f_id ?T1 .  ?T1 :files\#duration ?T1_duration . ?T1 :files\#formats ?T1_formats . ?T2 :song\#resolution ?T2_resolution . FILTER(?T1_formats = 'mp3' && ?T2_resolution < 800) .        }
music_1,What is the number of artists for each gender?,SELECT (count( *) as ?aggregation_all) ?T1_gender WHERE { ?T1 a :artist . ?T1 :artist\#gender ?T1_gender .        } GROUP BY ?T1_gender
music_1,How many artists are male and how many are female?,SELECT (count( *) as ?aggregation_all) ?T1_gender WHERE { ?T1 a :artist . ?T1 :artist\#gender ?T1_gender .        } GROUP BY ?T1_gender
music_1,What is the average rating of songs for each language?,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_14 ) ?T1_languages WHERE { ?T1 a :song . ?T1 :song\#rating ?T1_rating . ?T1 :song\#languages ?T1_languages .        } GROUP BY ?T1_languages
music_1,What is the average song rating for each language?,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_101 ) ?T1_languages WHERE { ?T1 a :song . ?T1 :song\#rating ?T1_rating . ?T1 :song\#languages ?T1_languages .        } GROUP BY ?T1_languages
music_1,Return the gender and name of artist who produced the song with the lowest resolution.,SELECT ?T1_gender ?T1_artist_name WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#gender ?T1_gender . ?T1 :artist\#artist_name ?T1_artist_name . ?T2 :song\#resolution ?T2_resolution .        }   ORDER BY ASC (?T2_resolution) LIMIT 1
music_1,"For each file format, return the number of artists who released songs in that format.",SELECT (count( *) as ?aggregation_all) ?T1_formats WHERE { ?T1 a :files . ?T1 :files\#formats ?T1_formats .        } GROUP BY ?T1_formats
music_1,How many songs were released for each format?,SELECT (count( *) as ?aggregation_all) ?T1_formats WHERE { ?T1 a :files . ?T1 :files\#formats ?T1_formats .        } GROUP BY ?T1_formats
music_1,Find the distinct names of all songs that have a higher resolution than some songs in English.,SELECT DISTINCT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#resolution ?T1_resolution . FILTER(?T1_resolution > (?T22_languages)) .       {SELECT (min( ?T22_resolution) as ?aggregation_T22_resolution_14 ) WHERE { ?T22 a :song . ?T22 :song\#resolution ?T22_resolution . ?T22 :song\#languages ?T22_languages . FILTER(?T22_languages = 'english') .        }    } }
music_1,What is the name and country of origin of the artist who released a song that has 'love' in its title?,"SELECT ?T1_artist_name ?T1_country WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . ?T2 :song\#song_name ?T2_song_name . FILTER(contains (?T2_song_name, 'love')) .        }"
music_1,List the name and gender for all artists who released songs in March.,"SELECT ?t1_artist_name ?t1_gender WHERE{?t1 a :artist . ?t2 a :song . ?t1 :artist\#artist_name ?t1_artist_name . ?t1 :artist\#gender ?t1_gender .?t1 :artist\#ref-artist_name ?t2 . ?t2 :song\#release_date ?t2_release_date . FILTER (contains(xsd:string(?t2_release_date),'03'))}"
music_1,"List the names of all genres in alphabetical oder, together with its ratings.",SELECT ?T1_g_name ?T1_rating WHERE { ?T1 a :genre . ?T1 :genre\#g_name ?T1_g_name . ?T1 :genre\#rating ?T1_rating . ?T1 :genre\#g_name ?T1_g_name .        }  ORDER BY ASC (?T1_g_name)
music_1,Give me a list of the names of all songs ordered by their resolution.,SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#resolution ?T1_resolution .        }  ORDER BY ASC (?T1_resolution)
music_1,List the names of all songs that have 4 minute duration or are in English.,"SELECT ?t2_song_name WHERE{    {    SELECT ?t2_song_name WHERE {?t1 a :files . ?t2 a :song . ?t1 :artist\#ref-f_id ?t2. ?t1 :artist\#duration ?t1_duration .?t1 :artist\#ref-artist_name ?t2 . FILTER (contains(xsd:string(?t1_duration),'4:'))}} UNION {SELECT ?t3_song_name     WHERE {?t3 a :song . ?t3 :song\#languages ?t3_languages . FILTER (?t3_languages ='english')}}}"
music_1,What is the language used most often in the songs?,SELECT ?T1_languages (count( *) as ?aggregation_all) WHERE { ?T1 a :song . ?T1 :song\#languages ?T1_languages .        } GROUP BY ?T1_languages  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,What are the languages that are used most often in songs?,SELECT ?T1_languages (count( *) as ?aggregation_all) WHERE { ?T1 a :song . ?T1 :song\#languages ?T1_languages .        } GROUP BY ?T1_languages  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,What are the names of artists who are Male and are from UK?,SELECT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . ?T1 :artist\#gender ?T1_gender . FILTER(?T1_country = 'UK' && ?T1_gender = 'Male') .        }
music_1,What are the names of all male British artists?,SELECT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . ?T1 :artist\#gender ?T1_gender . FILTER(?T1_country = 'UK' && ?T1_gender = 'Male') .        }
music_1,Find the names of songs whose genre is modern or language is English.,SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#genre_is ?T1_genre_is . ?T1 :song\#languages ?T1_languages . FILTER(?T1_genre_is = 'modern' || ?T1_languages = 'english') .        }
music_1,What are the names of the songs that are modern or sung in English?,SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song\#song_name ?T1_song_name . ?T1 :song\#genre_is ?T1_genre_is . ?T1 :song\#languages ?T1_languages . FILTER(?T1_genre_is = 'modern' || ?T1_languages = 'english') .        }
music_1,Return the names of songs for which format is mp3 and resolution is below 1000.,SELECT DISTINCT ?T1_song_name WHERE { ?T1 a :song . ?T2 a :files . ?T1 :song\#ref-f_id ?T2 .  ?T1 :song\#song_name ?T1_song_name . ?T2 :files\#formats ?T2_formats . FILTER(?T2_formats = 'mp3') . FILTER (?T1_song_name in (?T3_song_name)) .   ?T3 a :song . ?T3 :song\#song_name ?T3_song_name . ?T3 :song\#resolution ?T3_resolution .  FILTER(?T3_resolution < 1000) .             }
music_1,What are the names of all songs that are in mp3 format and have a resolution lower than 1000?,SELECT DISTINCT ?T1_song_name WHERE { ?T1 a :song . ?T2 a :files . ?T1 :song\#ref-f_id ?T2 .  ?T1 :song\#song_name ?T1_song_name . ?T2 :files\#formats ?T2_formats . FILTER(?T2_formats = 'mp3') . FILTER (?T1_song_name in (?T3_song_name)) .   ?T3 a :song . ?T3 :song\#song_name ?T3_song_name . ?T3 :song\#resolution ?T3_resolution .  FILTER(?T3_resolution < 1000) .             }
music_1,Return the names of singers who are from UK and released an English song.,SELECT DISTINCT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'UK') . FILTER (?T1_artist_name in (?T2_artist_name)) .   ?T2 a :artist . ?T3 a :song . ?T3 :song\#ref-artist_name ?T2 .  ?T2 :artist\#artist_name ?T2_artist_name . ?T3 :song\#languages ?T3_languages .  FILTER(?T3_languages = 'english') .             }
music_1,What are the names of all singers that are from the UK and released a song in English?,SELECT DISTINCT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'UK') . FILTER (?T1_artist_name in (?T2_artist_name)) .   ?T2 a :artist . ?T3 a :song . ?T3 :song\#ref-artist_name ?T2 .  ?T2 :artist\#artist_name ?T2_artist_name . ?T3 :song\#languages ?T3_languages .  FILTER(?T3_languages = 'english') .             }
music_1,What are the average rating and resolution of songs that are in Bangla?,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_122 ) (avg( ?T1_resolution) as ?aggregation_T1_resolution_42 ) WHERE { ?T1 a :song . ?T1 :song\#rating ?T1_rating . ?T1 :song\#resolution ?T1_resolution . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'bangla') .        }
music_1,What is the average rating and resolution of all bangla songs?,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_24 ) (avg( ?T1_resolution) as ?aggregation_T1_resolution_3 ) WHERE { ?T1 a :song . ?T1 :song\#rating ?T1_rating . ?T1 :song\#resolution ?T1_resolution . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'bangla') .        }
music_1,Find the names and number of works of all artists who have at least one English songs.,SELECT ?T1_artist_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T2 :song\#languages ?T2_languages . FILTER(?T2_languages = 'english') .        } GROUP BY ?T1_artist_name   HAVING(count( *)  >= 1)
music_1,Find the name and country of origin for all artists who have release at least one song of resolution above 900.,SELECT ?T1_artist_name ?T1_country WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . ?T2 :song\#resolution ?T2_resolution . FILTER(?T2_resolution > 900) .        } GROUP BY ?T1_artist_name ?T1_country   HAVING(count( *)  >= 1)
music_1,Find the names and number of works of the three artists who have produced the most songs.,SELECT ?T1_artist_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name .        } GROUP BY ?T1_artist_name  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,"What are the names of the three artists who have produced the most songs, and how many works did they produce?",SELECT ?T1_artist_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name .        } GROUP BY ?T1_artist_name  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,What country is the artist who made the fewest songs from?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY ASC (?aggregation_all) LIMIT 1
music_1,Find the top 3 artists who have the largest number of songs works whose language is Bangla.,SELECT ?T1_artist_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T2 :song\#languages ?T2_languages . FILTER(?T2_languages = 'bangla') .        } GROUP BY ?T1_artist_name  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,What are the top 3 artists with the largest number of songs in the language Bangla?,SELECT ?T1_artist_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :song\#ref-artist_name ?T1 .  ?T1 :artist\#artist_name ?T1_artist_name . ?T2 :song\#languages ?T2_languages . FILTER(?T2_languages = 'bangla') .        } GROUP BY ?T1_artist_name  ORDER BY DESC (?aggregation_all) LIMIT 1
music_1,"List the id, genre and artist name of English songs ordered by rating.",SELECT ?T1_f_id ?T1_genre_is ?T1_artist_name WHERE { ?T1 a :song . ?T1 :song\#f_id ?T1_f_id . ?T1 :song\#genre_is ?T1_genre_is . ?T1 :song\#artist_name ?T1_artist_name . ?T1 :song\#rating ?T1_rating . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'english') .        }  ORDER BY ASC (?T1_rating)
music_1,Find the names of the artists who have produced English songs but have never received rating higher than 8.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a :song . ?T1 :song\#artist_name ?T1_artist_name . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'english') .   }}  MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a :song . ?T2 :song\#artist_name ?T2_artist_name . ?T2 :song\#rating ?T2_rating . FILTER(?T2_rating > 8) .        }     } }
music_1,What are the names of the different artists that have produced a song in English but have never receieved a rating higher than 8?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a :song . ?T1 :song\#artist_name ?T1_artist_name . ?T1 :song\#languages ?T1_languages . FILTER(?T1_languages = 'english') .   }}  MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a :song . ?T2 :song\#artist_name ?T2_artist_name . ?T2 :song\#rating ?T2_rating . FILTER(?T2_rating > 8) .        }     } }
music_1,Find the names of the artists who are from Bangladesh and have never received rating higher than 7.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'Bangladesh') .   }}  MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a :song . ?T2 :song\#artist_name ?T2_artist_name . ?T2 :song\#rating ?T2_rating . FILTER(?T2_rating > 7) .        }     } }
music_1,What are the names of the different artists from Bangladesh who never received a rating higher than a 7?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\#artist_name ?T1_artist_name . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'Bangladesh') .   }}  MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a :song . ?T2 :song\#artist_name ?T2_artist_name . ?T2 :song\#rating ?T2_rating . FILTER(?T2_rating > 7) .        }     } }
baseball_1,what is the full name and id of the college with the largest number of baseball players?,SELECT ?T1_name_full (count( *) as ?aggregation_all) ?T1_college_id WHERE { ?T1 :college\#ref-player_college_id ?T2 .        } GROUP BY ?T1_name_full ?T1_college_id  ORDER BY DESC (?aggregation_all) LIMIT 1
baseball_1,Compute the average salary of the players in the team called 'Boston Red Stockings'.,SELECT (avg( ?T1_salary) as ?aggregation_T1_salary_40 ) WHERE { ?T1 :salary\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings') .        }
baseball_1,List the first and last name for players who participated in all star game in 1998.,SELECT ?T1_name_first ?T1_name_last WHERE { ?T2 :all_star\#ref-player_id ?T1 . FILTER(?T2_year = 1998) .        }
baseball_1,"What are the first name, last name and id of the player with the most all star game experiences? Also list the count.",SELECT ?T1_name_first (count( *) as ?aggregation_all) ?T1_name_last ?T1_player_id (count( *) as ?aggregation_all) WHERE { ?T2 :all_star\#ref-player_id ?T1 .        } GROUP BY ?T1_name_first ?T1_name_last ?T1_player_id  ORDER BY DESC (?aggregation_all) LIMIT 1
baseball_1,How many players enter hall of fame each year?,SELECT ?T1_yearid (count( *) as ?aggregation_all) WHERE { ?T1 a :hall_of_fame . ?T1 :hall_of_fame\#yearid ?T1_yearid .        } GROUP BY ?T1_yearid
