kg_name,question,query
flight_4,Find the names of the top 10 airlines that operate the most number of routes.,SELECT ?T1_name (count( *) as ?aggregation_all) ?T2_alid WHERE { ?T1 a :airlines . ?T2 a :routes . ?T2 :routes\#ref-alid ?T1 .  ?T1 :airlines\#name ?T1_name . ?T2 :routes\#alid ?T2_alid .        } GROUP BY ?T1_name ?T2_alid  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,"For the airline ids with the top 10 most routes operated, what are their names?",SELECT ?T1_name (count( *) as ?aggregation_all) ?T2_alid WHERE { ?T1 a :airlines . ?T2 a :routes . ?T2 :routes\#ref-alid ?T1 .  ?T1 :airlines\#name ?T1_name . ?T2 :routes\#alid ?T2_alid .        } GROUP BY ?T1_name ?T2_alid  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,Find the name and city of the airport which is the source for the most number of flight routes.,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_city ?T2_src_apid WHERE { ?T1 :airports\#ref-routes_id ?T2 .        } GROUP BY ?T1_name ?T1_city ?T2_src_apid  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What is the name and city of the airport from most of the routes start?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_city ?T2_src_apid WHERE { ?T1 :airports\#ref-routes_id ?T2 .        } GROUP BY ?T1_name ?T1_city ?T2_src_apid  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,Find the number of different airports which are the destinations of the American Airlines.,SELECT DISTINCT (count(DISTINCT ?T1_dst_apid) as ?aggregation_T1_dst_apid_178 ) WHERE { ?T1 a :routes . ?T2 a :airlines . ?T1 :routes\#ref-alid ?T2 .  ?T1 :routes\#dst_apid ?T1_dst_apid . ?T2 :airlines\#name ?T2_name . FILTER(?T2_name = 'American Airlines') .        }
flight_4,Which countries has the most number of airlines?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What is the name of the country with the most number of home airlines?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,Which countries has the most number of airlines whose active status is 'Y'?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country . ?T1 :airlines\#active ?T1_active . FILTER(?T1_active = 'Y') .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What are the countries with the most airlines whose active status is Y?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country . ?T1 :airlines\#active ?T1_active . FILTER(?T1_active = 'Y') .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,List all countries and their number of airlines in the descending order of number of airlines.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country .        } GROUP BY ?T1_country ORDER BY DESC ((count( *) as ?aggregation_all))
flight_4,How many airlines operate out of each country in descending order?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country .        } GROUP BY ?T1_country ORDER BY DESC ((count( *) as ?aggregation_all))
flight_4,How many airports are there per country? Order the countries by decreasing number of airports.,SELECT (count( *) as ?aggregation_all) ?T1_country WHERE { ?T1 a :airports . ?T1 :airports\#country ?T1_country .        } GROUP BY ?T1_country ORDER BY DESC ((count( *) as ?aggregation_all))
flight_4,How many airports are there per city in the United States? Order the cities by decreasing number of airports.,SELECT (count( *) as ?aggregation_all) ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'United States') .        } GROUP BY ?T1_city ORDER BY DESC ((count( *) as ?aggregation_all))
flight_4,How many airports are there per city in the US ordered from most to least?,SELECT (count( *) as ?aggregation_all) ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'United States') .        } GROUP BY ?T1_city ORDER BY DESC ((count( *) as ?aggregation_all))
flight_4,Return the cities with more than 3 airports in the United States.,SELECT ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'United States') .        } GROUP BY ?T1_city   HAVING(count( *)  > 3)
flight_4,How many cities are there that have more than 3 airports?,SELECT (count(*) as ?agg) WHERE {SELECT ?t1_city WHERE {?t1 a :airports .             ?t1 :airports\#city ?t1_city . }    GROUP BY ?t1_city     Having(?agg  >  3) }
flight_4,What is the count of cities with more than 3 airports?,SELECT (count(*) as ?agg) WHERE {SELECT ?t1_city WHERE {?t1 a :airports .             ?t1 :airports\#city ?t1_city . }    GROUP BY ?t1_city     Having(?agg  >  3) }
flight_4,List the cities which have more than one airport and number of airports.,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city .        } GROUP BY ?T1_city   HAVING(count( *)  > 1)
flight_4,List the cities which have more than 2 airports sorted by the number of airports.,SELECT ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city .        } GROUP BY ?T1_city ORDER BY ASC ((count( *) as ?aggregation_all))  HAVING(count( *)  > 2)
flight_4,What are the cities that have more than 2 airports sorted by number of airports?,SELECT ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city .        } GROUP BY ?T1_city ORDER BY ASC ((count( *) as ?aggregation_all))  HAVING(count( *)  > 2)
flight_4,Find the number of routes for each source airport and the airport name.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T2 :airports\#ref-routes_id ?T1 .        } GROUP BY ?T2_name
flight_4,"Find the number of routes and airport name for each source airport, order the results by decreasing number of routes.",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T2 :airports\#ref-routes_id ?T1 .        } GROUP BY ?T2_name ORDER BY DESC ((count( *) as ?aggregation_all))
flight_4,Find the average elevation of all airports for each country.,SELECT (avg( ?T1_elevation) as ?aggregation_T1_elevation_113 ) ?T1_country WHERE { ?T1 a :airports . ?T1 :airports\#elevation ?T1_elevation . ?T1 :airports\#country ?T1_country .        } GROUP BY ?T1_country
flight_4,Find the cities which have exactly two airports.,SELECT ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city .        } GROUP BY ?T1_city   HAVING(count( *)  = 2)
flight_4,What are the cities with exactly two airports?,SELECT ?T1_city WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city .        } GROUP BY ?T1_city   HAVING(count( *)  = 2)
flight_4,Find the number of routes with destination airports in Italy.,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :airports\#ref-routes_id ?T1 . FILTER(?T2_country = 'Italy') .        }
flight_4,What is the number of routes whose destinations are Italian airports?,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :airports\#ref-routes_id ?T1 . FILTER(?T2_country = 'Italy') .        }
flight_4,Return the number of routes with destination airport in Italy operated by the airline with name 'American Airlines'.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :routes . ?T3 a :airlines . ?T1 :routes\#ref-alid ?T3 .  ?T2 :airports\#country ?T2_country . ?T3 :airlines\#name ?T3_name . FILTER(?T2_country = 'Italy' && ?T3_name = 'American Airlines') .        }
flight_4,Find the number of routes that have destination John F Kennedy International Airport.,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :airports\#ref-routes_id ?T1 . FILTER(?T2_name = 'John F Kennedy International Airport') .        }
flight_4,Find the number of routes from the United States to Canada.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :routes . ?T1 :routes\#dst_apid ?T1_dst_apid . ?T1 :routes\#src_apid ?T1_src_apid . FILTER(?T1_dst_apid in (?T22_country) && ?T1_src_apid in (?T22_country)) .       {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\#apid ?T22_apid . ?T22 :airports\#country ?T22_country . FILTER(?T22_country = 'Canada') .        }    } {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\#apid ?T22_apid . ?T22 :airports\#country ?T22_country . FILTER(?T22_country = 'United States') .        }    } }
flight_4,How many routes go from the United States to Canada?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :routes . ?T1 :routes\#dst_apid ?T1_dst_apid . ?T1 :routes\#src_apid ?T1_src_apid . FILTER(?T1_dst_apid in (?T22_country) && ?T1_src_apid in (?T22_country)) .       {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\#apid ?T22_apid . ?T22 :airports\#country ?T22_country . FILTER(?T22_country = 'Canada') .        }    } {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\#apid ?T22_apid . ?T22 :airports\#country ?T22_country . FILTER(?T22_country = 'United States') .        }    } }
flight_4,What is the id of the routes whose source and destination airports are in the United States?,SELECT ?T1_rid WHERE { ?T1 a :routes . ?T1 :routes\#rid ?T1_rid . ?T1 :routes\#dst_apid ?T1_dst_apid . ?T1 :routes\#src_apid ?T1_src_apid . FILTER(?T1_dst_apid in (?T22_country) && ?T1_src_apid in (?T22_country)) .       {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\#apid ?T22_apid . ?T22 :airports\#country ?T22_country . FILTER(?T22_country = 'United States') .        }    } {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\#apid ?T22_apid . ?T22 :airports\#country ?T22_country . FILTER(?T22_country = 'United States') .        }    } }
flight_4,Find the name of airline which runs the most number of routes.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T2 a :routes . ?T2 :routes\#ref-alid ?T1 .  ?T1 :airlines\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What is the name of the airline with the most routes?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T2 a :routes . ?T2 :routes\#ref-alid ?T1 .  ?T1 :airlines\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,Find the busiest source airport that runs most number of routes in China.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 :airports\#ref-routes_id ?T2 . FILTER(?T1_country = 'China') .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What is the name of the airport with the most number of routes that start in China?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 :airports\#ref-routes_id ?T2 . FILTER(?T1_country = 'China') .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What is the name of the airport that is the destination of the most number of routes that start in China?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 :airports\#ref-routes_id ?T2 . FILTER(?T1_country = 'China') .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_orders,What is the id of the most recent order?,SELECT ?T1_order_id WHERE { ?T1 a :orders . ?T1 :orders\#order_id ?T1_order_id . ?T1 :orders\#date_order_placed ?T1_date_order_placed .        }   ORDER BY DESC (?T1_date_order_placed) LIMIT 1
tracking_orders,what are the order id and customer id of the oldest order?,SELECT ?T1_order_id ?T1_customer_id WHERE { ?T1 a :orders . ?T1 :orders\#order_id ?T1_order_id . ?T1 :orders\#customer_id ?T1_customer_id . ?T1 :orders\#date_order_placed ?T1_date_order_placed .        }   ORDER BY ASC (?T1_date_order_placed) LIMIT 1
tracking_orders,Find the id of the order whose shipment tracking number is '3452'.,SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :shipments\#order_id ?T1_order_id . ?T1 :shipments\#shipment_tracking_number ?T1_shipment_tracking_number . FILTER(?T1_shipment_tracking_number = 3452) .        }
tracking_orders,Find the ids of all the order items whose product id is 11.,SELECT ?T1_order_item_id WHERE { ?T1 a :order_items . ?T1 :order_items\#order_item_id ?T1_order_item_id . ?T1 :order_items\#product_id ?T1_product_id . FILTER(?T1_product_id = 11) .        }
tracking_orders,List the name of all the distinct customers who have orders with status 'Packing'.,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'Packing') .        }
tracking_orders,Find the details of all the distinct customers who have orders with status 'On Road'.,SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'On Road') .        }
tracking_orders,What are the distinct customers who have orders with status 'On Road'? Give me the customer details?,SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'On Road') .        }
tracking_orders,What is the name of the customer who has the most orders?,SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_orders,What is the customer id of the customer who has the most orders?,SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_orders,Give me a list of id and status of orders which belong to the customer named 'Jeramie'.,SELECT ?T1_order_id ?T1_order_status WHERE { ?T1 a :orders . ?T2 a :customers . ?T1 :orders\#ref-customer_id ?T2 .  ?T1 :orders\#order_id ?T1_order_id . ?T1 :orders\#order_status ?T1_order_status . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') .        }
tracking_orders,Find the dates of orders which belong to the customer named 'Jeramie'.,SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :customers . ?T1 :orders\#ref-customer_id ?T2 .  ?T1 :orders\#date_order_placed ?T1_date_order_placed . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') .        }
tracking_orders,What are the dates of the orders made by the customer named 'Jeramie'?,SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :customers . ?T1 :orders\#ref-customer_id ?T2 .  ?T1 :orders\#date_order_placed ?T1_date_order_placed . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') .        }
tracking_orders,Give me the names of customers who have placed orders between 2009-01-01 and 2010-01-01.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :orders\#date_order_placed ?T2_date_order_placed . ?T2 :orders\#date_order_placed ?T2_date_order_placed . FILTER(?T2_date_order_placed >= 2009-01-01 && ?T2_date_order_placed <= 2010-01-01) .        }
tracking_orders,Find the id of the customers who have order status both 'On Road' and 'Shipped'.,SELECT DISTINCT ?T1_customer_id WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_id ?T1_customer_id . ?T2 :orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'On Road') . FILTER (?T1_customer_id in (?T3_customer_id)) .   ?T3 a :customers . ?T4 a :orders . ?T4 :orders\#ref-customer_id ?T3 .  ?T3 :customers\#customer_id ?T3_customer_id . ?T4 :orders\#order_status ?T4_order_status .  FILTER(?T4_order_status = 'Shipped') .             }
tracking_orders,When was the order placed whose shipment tracking number is 3452? Give me the date.,SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :shipments . ?T2 :shipments\#ref-order_id ?T1 .  ?T1 :orders\#date_order_placed ?T1_date_order_placed . ?T2 :shipments\#shipment_tracking_number ?T2_shipment_tracking_number . FILTER(?T2_shipment_tracking_number = 3452) .        }
tracking_orders,What is the placement date of the order whose invoice number is 10?,SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :shipments . ?T2 :shipments\#ref-order_id ?T1 .  ?T1 :orders\#date_order_placed ?T1_date_order_placed . ?T2 :shipments\#invoice_number ?T2_invoice_number . FILTER(?T2_invoice_number = 10) .        }
tracking_orders,On what day was the order with invoice number 10 placed?,SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :shipments . ?T2 :shipments\#ref-order_id ?T1 .  ?T1 :orders\#date_order_placed ?T1_date_order_placed . ?T2 :shipments\#invoice_number ?T2_invoice_number . FILTER(?T2_invoice_number = 10) .        }
tracking_orders,List the count and id of each product in all the orders.,SELECT (count( *) as ?aggregation_all) ?T2_product_id WHERE { ?T13 a :order_items . ?T2 a :products . ?T13 :order_items\#ref-product_id ?T2 .  ?T2 :products\#product_id ?T2_product_id .        } GROUP BY ?T2_product_id
tracking_orders,List the name and count of each product in all orders.,SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T13 a :order_items . ?T13 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name
tracking_orders,Find the ids of orders which are shipped after 2000-01-01.,SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :shipments\#order_id ?T1_order_id . ?T1 :shipments\#shipment_date ?T1_shipment_date . FILTER(?T1_shipment_date > 2000-01-01) .        }
tracking_orders,Find the id of the order which is shipped most recently.,SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :shipments\#order_id ?T1_order_id . ?T1 :shipments\#shipment_date ?T1_shipment_date . FILTER(?T1_shipment_date = (?aggregation_T22_shipment_date_0)) .       {SELECT (max( ?T22_shipment_date) as ?aggregation_T22_shipment_date_0 ) WHERE { ?T22 a :shipments . ?T22 :shipments\#shipment_date ?T22_shipment_date .        }    } }
tracking_orders,Which order has the most recent shipment? Give me the order id.,SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :shipments\#order_id ?T1_order_id . ?T1 :shipments\#shipment_date ?T1_shipment_date . FILTER(?T1_shipment_date = (?aggregation_T22_shipment_date_86)) .       {SELECT (max( ?T22_shipment_date) as ?aggregation_T22_shipment_date_86 ) WHERE { ?T22 a :shipments . ?T22 :shipments\#shipment_date ?T22_shipment_date .        }    } }
tracking_orders,List the names of all distinct products in alphabetical order.,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_name ?T1_product_name .        }  ORDER BY ASC (?T1_product_name)
tracking_orders,List the ids of all distinct orders ordered by placed date.,SELECT DISTINCT ?T1_order_id ?T1_date_order_placed WHERE { ?T1 a :orders . ?T1 :orders\#order_id ?T1_order_id . ?T1 :orders\#date_order_placed ?T1_date_order_placed . ?T1 :orders\#date_order_placed ?T1_date_order_placed .        }  ORDER BY ASC (?T1_date_order_placed)
tracking_orders,What is the id of the order which has the most items?,SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :orders . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T1 .  ?T1 :orders\#order_id ?T1_order_id .        } GROUP BY ?T1_order_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_orders,What is the name of the customer who has the largest number of orders?,SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_orders,Find the invoice numbers which are created before 1989-09-03 or after 2007-12-25.,SELECT ?T1_invoice_number WHERE { ?T1 a :invoices . ?T1 :invoices\#invoice_number ?T1_invoice_number . ?T1 :invoices\#invoice_date ?T1_invoice_date . ?T1 :invoices\#invoice_date ?T1_invoice_date . FILTER(?T1_invoice_date < 1989-09-03 || ?T1_invoice_date > 2007-12-25) .        }
tracking_orders,Find the distinct details of invoices which are created before 1989-09-03 or after 2007-12-25.,SELECT DISTINCT ?T1_invoice_details WHERE { ?T1 a :invoices . ?T1 :invoices\#invoice_details ?T1_invoice_details . ?T1 :invoices\#invoice_date ?T1_invoice_date . ?T1 :invoices\#invoice_date ?T1_invoice_date . FILTER(?T1_invoice_date < 1989-09-03 || ?T1_invoice_date > 2007-12-25) .        }
tracking_orders,"For each customer who has at least two orders, find the customer name and number of orders made.",SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 2)
tracking_orders,Find the name of the customers who have at most two orders.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name   HAVING(count( *)  <= 2)
tracking_orders,What are the names of the customers who have made two or less orders?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name   HAVING(count( *)  <= 2)
tracking_orders,List the names of the customers who have once bought product 'food'.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :orders . ?T13 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T14 a :order_items . ?T14 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T14 :order_items\#ref-product_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'food') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)
tracking_orders,What are the names of the customers who bought product 'food' at least once?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :orders . ?T13 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T14 a :order_items . ?T14 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T14 :order_items\#ref-product_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'food') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)
tracking_orders,List the names of customers who have once canceled the purchase of the product 'food' (the item status is 'Cancel').,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T4 a :orders . ?T4 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_item_status ?T2_order_item_status . ?T3 :products\#product_name ?T3_product_name . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T4 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_item_status ?T2_order_item_status . ?T3 :products\#product_name ?T3_product_name . ?T3 a :products . ?T2 :order_items\#ref-product_id ?T3 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_item_status ?T2_order_item_status . ?T3 :products\#product_name ?T3_product_name . FILTER(?T2_order_item_status = 'Cancel' && ?T3_product_name = 'food') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)
tracking_orders,Which customers have ever canceled the purchase of the product 'food' (the item status is 'Cancel')?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T4 a :orders . ?T4 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_item_status ?T2_order_item_status . ?T3 :products\#product_name ?T3_product_name . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T4 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_item_status ?T2_order_item_status . ?T3 :products\#product_name ?T3_product_name . ?T3 a :products . ?T2 :order_items\#ref-product_id ?T3 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_item_status ?T2_order_item_status . ?T3 :products\#product_name ?T3_product_name . FILTER(?T2_order_item_status = 'Cancel' && ?T3_product_name = 'food') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 1)
architecture,How many architects are female?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :architect . ?T1 :architect\#gender ?T1_gender . FILTER(?T1_gender = 'female') .        }
architecture,"List the name, nationality and id of all male architects ordered by their names lexicographically.",SELECT ?T1_name ?T1_nationality ?T1_id WHERE { ?T1 a :architect . ?T1 :architect\#name ?T1_name . ?T1 :architect\#nationality ?T1_nationality . ?T1 :architect\#id ?T1_id . ?T1 :architect\#name ?T1_name . ?T1 :architect\#gender ?T1_gender . FILTER(?T1_gender = 'male') .        }  ORDER BY ASC (?T1_name)
architecture,What is the average length in feet of the bridges?,SELECT (avg( ?T1_length_feet) as ?aggregation_T1_length_feet_38 ) WHERE { ?T1 a :bridge . ?T1 :bridge\#length_feet ?T1_length_feet .        }
architecture,What are the names of the mills which are not located in 'Donceel'?,SELECT ?T1_name WHERE { ?T1 a :mill . ?T1 :mill\#name ?T1_name . ?T1 :mill\#location ?T1_location . FILTER(?T1_location != 'Donceel') .        }
architecture,What are the ids and names of the architects who built at least 3 bridges ?,SELECT ?T1_id ?T1_name WHERE { ?T1 a :architect . ?T2 a :bridge . ?T2 :bridge\#ref-architect_id ?T1 .  ?T1 :architect\#id ?T1_id . ?T1 :architect\#name ?T1_name .        } GROUP BY ?T1_id ?T1_name   HAVING(count( *)  >= 3)
architecture,"What is the id, name and nationality of the architect who built most mills?",SELECT ?T1_id (count( *) as ?aggregation_all) ?T1_name ?T1_nationality WHERE { ?T1 a :architect . ?T2 a :mill . ?T2 :mill\#ref-architect_id ?T1 .  ?T1 :architect\#id ?T1_id . ?T1 :architect\#name ?T1_name . ?T1 :architect\#nationality ?T1_nationality .        } GROUP BY ?T1_id ?T1_name ?T1_nationality  ORDER BY DESC (?aggregation_all) LIMIT 1
architecture,"What are the ids, names and genders of the architects who built two bridges or one mill?",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_id as ?col1) (?T1_name as ?col2) (?T1_gender as ?col3) WHERE { ?T1 a :architect . ?T2 a :bridge . ?T2 :bridge\#ref-architect_id ?T1 .  ?T1 :architect\#id ?T1_id . ?T1 :architect\#name ?T1_name . ?T1 :architect\#gender ?T1_gender .   }} UNION {SELECT (?T1_id as ?col1) (?T1_name as ?col2) (?T1_gender as ?col3) WHERE { ?T1 a :architect . ?T2 a :mill . ?T2 :mill\#ref-architect_id ?T1 .  ?T1 :architect\#id ?T1_id . ?T1 :architect\#name ?T1_name . ?T1 :architect\#gender ?T1_gender .        } GROUP BY ?T1_id ?T1_name ?T1_gender   HAVING(count( *)  = 1)  } } GROUP BY ?T1_id ?T1_name ?T1_gender   HAVING(count( *)  = 2)
architecture,What is the location of the bridge named 'Kolob Arch' or 'Rainbow Bridge'?,SELECT ?T1_location WHERE { ?T1 a :bridge . ?T1 :bridge\#location ?T1_location . ?T1 :bridge\#name ?T1_name . ?T1 :bridge\#name ?T1_name . FILTER(?T1_name = 'Kolob Arch' || ?T1_name = 'Rainbow Bridge') .        }
architecture,Which of the mill names contains the french word 'Moulin'?,"SELECT ?T1_name WHERE { ?T1 a :mill . ?T1 :mill\#name ?T1_name . ?T1 :mill\#name ?T1_name . FILTER(contains (?T1_name, 'Moulin')) .        }"
architecture,How many architects haven't built a mill before year 1850?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :architect . ?T1 :architect\#id ?T1_id . FILTER(?T1_id not in (?T22_built_year)) .       {SELECT ?T22_architect_id WHERE { ?T22 a :mill . ?T22 :mill\#architect_id ?T22_architect_id . ?T22 :mill\#built_year ?T22_built_year . FILTER(?T22_built_year < 1850) .        }    } }
architecture,"show the name of all bridges that was designed by american archtect, and sort the result by the bridge feet length.",SELECT ?T1_name WHERE { ?T1 a :bridge . ?T2 a :architect . ?T1 :bridge\#ref-architect_id ?T2 .  ?T1 :bridge\#name ?T1_name . ?T1 :bridge\#length_feet ?T1_length_feet . ?T2 :architect\#nationality ?T2_nationality . FILTER(?T2_nationality = 'American') .        }  ORDER BY ASC (?T1_length_feet)
culture_company,How many book clubs are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club .        }
culture_company,"show the titles, and authors or editors for all books made after the year 1989.",SELECT ?T1_book_title ?T1_author_or_editor WHERE { ?T1 a :book_club . ?T1 :book_club\#book_title ?T1_book_title . ?T1 :book_club\#author_or_editor ?T1_author_or_editor . ?T1 :book_club\#year ?T1_year . FILTER(?T1_year > 1989) .        }
culture_company,Show all distinct publishers for books.,SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .        }
culture_company,What are all the different book publishers?,SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .        }
culture_company,"Show the years, book titles, and publishers for all books, in descending order by year.",SELECT ?T1_year ?T1_book_title ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :book_club\#year ?T1_year . ?T1 :book_club\#book_title ?T1_book_title . ?T1 :book_club\#publisher ?T1_publisher . ?T1 :book_club\#year ?T1_year .        }  ORDER BY DESC (?T1_year)
culture_company,Show all publishers and the number of books for each publisher.,SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .        } GROUP BY ?T1_publisher
culture_company,How many books are there for each publisher?,SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .        } GROUP BY ?T1_publisher
culture_company,What is the publisher with most number of books?,SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .        } GROUP BY ?T1_publisher  ORDER BY DESC (?aggregation_all) LIMIT 1
culture_company,Show all book categories and the number of books in each category.,SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :book_club\#category ?T1_category .        } GROUP BY ?T1_category
culture_company,How many books fall into each category?,SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :book_club\#category ?T1_category .        } GROUP BY ?T1_category
