kg_name,question,query
scholar,who has written the most syntactic parsing papers ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_135 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_173 ))
scholar,who is the most published author in syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_67 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_0 ))
scholar,who has the most publications in syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_73 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_165 ))
scholar,who has written the most papers on syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_200 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_163 ))
scholar,List prominent scholars in syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_164 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_59 ))
scholar,who wrote the most papers on syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_133 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_34 ))
scholar,top syntactic parsing author,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_79 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_59 ))
scholar,top author in syntactic parsing,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_181 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_84 ))
scholar,who published the most in syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_112 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_90 ))
scholar,who published the most papers in syntactic parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_69 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'syntactic parsing') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_113 ))
scholar,How many citation noah a smith has ?,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_128 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,noah a smith citation count,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_60 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,how many citations does noah a smith have ?,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_30 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,number of citations of noah a smith,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_49 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,How many citations does noah a smith have,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_39 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,How many times was noah a smith cited ?,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_103 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,How many citations does noah a smith has ?,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_26 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'noah a smith') .        }
scholar,chi papers,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'chi') .        }
scholar,what papers did chi publish ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'chi') .        }
scholar,Has mirella lapata written any papers in 2016 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_148 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :author\#authorname ?T3_authorname . ?T1 :paper\#year ?T1_year . ?T3 a :author . ?T2 :writes\#ref-aid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :author\#authorname ?T3_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T3_authorname = 'mirella lapata' && ?T1_year = 2016) .        } GROUP BY ?T2_authorid
scholar,What papers has sharon goldwater written ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,What papers has written by sharon goldwater ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,what did sharon goldwater write ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,which papers has sharon goldwater written ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,What has sharon goldwater published ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,Does sharon goldwater have any papers published ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,What papers are authored by sharon goldwater ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,papers by sharon goldwater ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sharon goldwater') .        }
scholar,What was oren etzioni 's latest paper ?,SELECT DISTINCT ?T1_paperid ?T2_year WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T1 :writes\#ref-aid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'oren etzioni') .        }  ORDER BY DESC (?T2_year)
scholar,What is the latest paper by oren etzioni ?,SELECT DISTINCT ?T1_paperid ?T2_year WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T1 :writes\#ref-aid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'oren etzioni') .        }  ORDER BY DESC (?T2_year)
scholar,What is oren etzioni 's latest paper ?,SELECT DISTINCT ?T1_paperid ?T2_year WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T1 :writes\#ref-aid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'oren etzioni') .        }  ORDER BY DESC (?T2_year)
scholar,What are the latest papers by oren etzioni ?,SELECT DISTINCT ?T1_paperid ?T2_year WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T1 :writes\#ref-aid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'oren etzioni') .        }  ORDER BY DESC (?T2_year)
scholar,are there any monte carlo simulation papers since 2011 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T2_keyphrasename = 'monte carlo simulation' && ?T1_year > 2011) .        }
scholar,does ras bodik publish a lot ?,SELECT (count( ?T1_paperid) as ?aggregation_T1_paperid_160 ) WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ras bodik') .        }
scholar,How many papers did David M. Blei publish at AISTATS ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_180 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,How many papers does David M. Blei have in AISTATS ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_149 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,How many papers has David M. Blei published in AISTATS ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_125 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,how many papers does David M. Blei have at AISTATS,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_116 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,how many David M. Blei papers are in AISTATS ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_130 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,How many papers David M. Blei has in AISTATS ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_194 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,How many papers does David M. Blei have in AISTATS,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_197 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'David M. Blei' && ?T3_venuename = 'AISTATS') .        }
scholar,List all academic papers on machine networks for one shot learning,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#title ?T1_title . FILTER(?T1_title = 'machine networks for one shot learning') .        }
scholar,which EMNLP 2010 papers have the most citations ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_6 ) WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2010 && ?T3_venuename = 'EMNLP') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_3 ))
scholar,Which paper from EMNLP 2010 was cited most ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_156 ) WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2010 && ?T3_venuename = 'EMNLP') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_11 ))
scholar,most cited EMNLP 2010 papers,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_52 ) WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2010 && ?T3_venuename = 'EMNLP') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_150 ))
scholar,which EMNLP 2010 papers have been cited the most ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_7 ) WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2010 && ?T3_venuename = 'EMNLP') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_29 ))
scholar,What papers were published at CVPR in 2016 about Class consistent multi-modal fusion with binary features applied to RGB-D Object Dataset ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T1 :paper\#title ?T1_title . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_datasetname = 'RGB-D Object Dataset' && ?T1_title = 'Class consistent multi-modal fusion with binary features' && ?T1_year = 2016 && ?T3_venuename = 'CVPR') .        }
scholar,How many papers are in deep learning ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_2 ) WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }
scholar,How many papers are about deep learning ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_140 ) WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }
scholar,how many papers about deep learning ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_126 ) WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }
scholar,How many papers are related to deep learning ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_141 ) WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }
scholar,How many papers has Christopher D. Manning written ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_106 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
