kg_name,question,query
network_2,Which friend of Zach has the longest-lasting friendship?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#name ?T1_name . ?T1 :personfriend\#year ?T1_year . FILTER(?T1_name = 'Zach' && ?T1_year = (?T22_name)) .       {SELECT (max( ?T22_year) as ?aggregation_T22_year_38 ) WHERE { ?T22 a :personfriend . ?T22 :personfriend\#year ?T22_year . ?T22 :personfriend\#name ?T22_name . FILTER(?T22_name = 'Zach') .        }    } }
network_2,What is the age of the friend of Zach with longest year relationship?,SELECT ?T1_age WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#age ?T1_age . ?T2 :personfriend\#name ?T2_name . ?T2 :personfriend\#year ?T2_year . FILTER(?T2_name = 'Zach' && ?T2_year = (?T23_name)) .       {SELECT (max( ?T23_year) as ?aggregation_T23_year_54 ) WHERE { ?T23 a :personfriend . ?T23 :personfriend\#year ?T23_year . ?T23 :personfriend\#name ?T23_name . FILTER(?T23_name = 'Zach') .        }    } }
network_2,Find the name of persons who are friends with Alice for the shortest years.,SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T1 :personfriend\#name ?T1_name . ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#year ?T1_year . FILTER(?T1_friend = 'Alice' && ?T1_year = (?T22_friend)) .       {SELECT (min( ?T22_year) as ?aggregation_T22_year_55 ) WHERE { ?T22 a :personfriend . ?T22 :personfriend\#year ?T22_year . ?T22 :personfriend\#friend ?T22_friend . FILTER(?T22_friend = 'Alice') .        }    } }
network_2,"Find the name, age, and job title of persons who are friends with Alice for the longest years.",SELECT ?T1_name ?T1_age ?T1_job WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . ?T2 :personfriend\#friend ?T2_friend . ?T2 :personfriend\#year ?T2_year . FILTER(?T2_friend = 'Alice' && ?T2_year = (?T23_friend)) .       {SELECT (max( ?T23_year) as ?aggregation_T23_year_2 ) WHERE { ?T23 a :personfriend . ?T23 :personfriend\#year ?T23_year . ?T23 :personfriend\#friend ?T23_friend . FILTER(?T23_friend = 'Alice') .        }    } }
network_2,Who is the person that has no friend?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :personfriend . ?T2 :personfriend\#name ?T2_name .        }     } }
network_2,What are the names of all people who do not have friends?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :personfriend . ?T2 :personfriend\#name ?T2_name .        }     } }
network_2,Which person whose friends have the oldest average age?,SELECT ?T1_name (avg( ?T2_age) as ?aggregation_T2_age_105 ) WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T2 :person\#age ?T2_age . ?T2 :person\#age ?T2_age .        } GROUP BY ?T1_name  ORDER BY DESC ((avg( ?T2_age) as ?aggregation_T2_age_62 )) LIMIT 1
network_2,What is the total number of people who has no friend living in the city of Austin.,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_46 ) WHERE { ?T1 a :personfriend . ?T1 :personfriend\#name ?T1_name . ?T1 :personfriend\#friend ?T1_friend . FILTER(?T1_friend not in (?T22_city)) .       {SELECT ?T22_name WHERE { ?T22 a :person . ?T22 :person\#name ?T22_name . ?T22 :person\#city ?T22_city . FILTER(?T22_city = 'Austin') .        }    } }
network_2,What is the total number of people who have no friends living in Austin?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_93 ) WHERE { ?T1 a :personfriend . ?T1 :personfriend\#name ?T1_name . ?T1 :personfriend\#friend ?T1_friend . FILTER(?T1_friend not in (?T22_city)) .       {SELECT ?T22_name WHERE { ?T22 a :person . ?T22 :person\#name ?T22_name . ?T22 :person\#city ?T22_city . FILTER(?T22_city = 'Austin') .        }    } }
network_2,Find Alice's friends of friends.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T2 :person\#name ?T2_name . ?T1 :personfriend\#name ?T1_name . FILTER(?T2_name = 'Alice' && ?T1_name != 'Alice') .        }
network_2,What are the names of all of Alice's friends of friends?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T2 :person\#name ?T2_name . ?T1 :personfriend\#name ?T1_name . FILTER(?T2_name = 'Alice' && ?T1_name != 'Alice') .        }
decoration_competition,How many members are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member .        }
decoration_competition,List the names of members in ascending alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
decoration_competition,What are the names and countries of members?,SELECT ?T1_name ?T1_country WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#country ?T1_country .        }
decoration_competition,Show the names of members whose country is 'United States' or 'Canada'.,SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#country ?T1_country . ?T1 :member\#country ?T1_country . FILTER(?T1_country = 'United States' || ?T1_country = 'Canada') .        }
decoration_competition,Show the different countries and the number of members from each.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :member\#country ?T1_country .        } GROUP BY ?T1_country
decoration_competition,Show the most common country across members.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :member\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
decoration_competition,Which countries have more than two members?,SELECT ?T1_country WHERE { ?T1 a :member . ?T1 :member\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  > 2)
decoration_competition,Show the leader names and locations of colleges.,SELECT ?T1_leader_name ?T1_college_location WHERE { ?T1 a :college . ?T1 :college\#leader_name ?T1_leader_name . ?T1 :college\#college_location ?T1_college_location .        }
decoration_competition,Show the names of members and names of colleges they go to.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :member . ?T2 a :college . ?T1 :member\#ref-college_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :college\#name ?T2_name .        }
decoration_competition,Show the names of members and the locations of colleges they go to in ascending alphabetical order of member names.,SELECT ?T1_name ?T2_college_location WHERE { ?T1 a :member . ?T2 a :college . ?T1 :member\#ref-college_id ?T2 .  ?T1 :member\#name ?T1_name . ?T2 :college\#college_location ?T2_college_location . ?T1 :member\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
decoration_competition,Show the distinct leader names of colleges associated with members from country 'Canada'.,SELECT DISTINCT ?T1_leader_name WHERE { ?T1 a :college . ?T2 a :member . ?T2 :member\#ref-college_id ?T1 .  ?T1 :college\#leader_name ?T1_leader_name . ?T2 :member\#country ?T2_country . FILTER(?T2_country = 'Canada') .        }
decoration_competition,Show the names of members and the decoration themes they have.,SELECT ?T1_name ?T2_decoration_theme WHERE { ?T1 a :member . ?T2 a :round . ?T2 :round\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :round\#decoration_theme ?T2_decoration_theme .        }
decoration_competition,Show the names of members that have a rank in round higher than 3.,SELECT ?T1_name WHERE { ?T1 a :member . ?T2 a :round . ?T2 :round\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :round\#rank_in_round ?T2_rank_in_round . FILTER(?T2_rank_in_round > 3) .        }
decoration_competition,Show the names of members in ascending order of their rank in rounds.,SELECT ?T1_name WHERE { ?T1 a :member . ?T2 a :round . ?T2 :round\#ref-member_id ?T1 .  ?T1 :member\#name ?T1_name . ?T2 :round\#rank_in_round ?T2_rank_in_round .        }  ORDER BY ASC (?T2_rank_in_round)
decoration_competition,List the names of members who did not participate in any round.,SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :member\#name ?T1_name . ?T1 :member\#member_id ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) .       {SELECT ?T22_member_id WHERE { ?T22 a :round . ?T22 :round\#member_id ?T22_member_id .        }    } }
document_management,"Find the name and access counts of all documents, in alphabetic order of the document name.",SELECT ?T1_document_name ?T1_access_count WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#access_count ?T1_access_count . ?T1 :documents\#document_name ?T1_document_name .        }  ORDER BY ASC (?T1_document_name)
document_management,Find the types of documents with more than 4 documents.,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code   HAVING(count( *)  > 4)
document_management,What are the codes of types of documents of which there are for or more?,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code   HAVING(count( *)  > 4)
document_management,Find the total access count of all documents in the most popular document type.,SELECT (sum( ?T1_access_count) as ?aggregation_T1_access_count_176 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#access_count ?T1_access_count .        }   ORDER BY DESC (?aggregation_all) LIMIT 1
document_management,What is the total access count of documents that are of the most common document type?,SELECT (sum( ?T1_access_count) as ?aggregation_T1_access_count_63 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#access_count ?T1_access_count .        }   ORDER BY DESC (?aggregation_all) LIMIT 1
document_management,What is the average access count of documents?,SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_177 ) WHERE { ?T1 a :documents . ?T1 :documents\#access_count ?T1_access_count .        }
document_management,Find the average access count across all documents?,SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_13 ) WHERE { ?T1 a :documents . ?T1 :documents\#access_count ?T1_access_count .        }
document_management,What is the structure of the document with the least number of accesses?,SELECT ?T1_document_structure_description (count( *) as ?aggregation_all) WHERE { ?T1 a :document_structures . ?T2 a :documents . ?T2 :documents\#ref-document_structure_code ?T1 .  ?T1 :document_structures\#document_structure_description ?T1_document_structure_description .        } GROUP BY ?T1_document_structure_description  ORDER BY DESC (?aggregation_all) LIMIT 1
document_management,What is the type of the document named 'David CV'?,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code . ?T1 :documents\#document_name ?T1_document_name . FILTER(?T1_document_name = 'David CV') .        }
document_management,Find the list of documents that are both in the most three popular type and have the most three popular structure.,SELECT ?t1_document_name { ?t1 a :documents . ?t1 :documents\#document_name ?t1_document_name .  ?t1 :documents\#document_type_code ?t1_document_type_code . ?t1 :documents\#document_structure_code ?t1_document_structure_code . { SELECT ?t2_type_code (count(*) as ?agg) WHERE { ?t2 a :documents . ?t2 :documents\#document_type_code ?t2_document_type_code .} GROUP BY ?t2_type_code ORDER BY ?agg LIMIT 3 } { SELECT ?t3_structure_code (count(*) as ?agg) WHERE { ?t3 a :documents . ?t3 :documents\#document_structure_code ?t3_structure_code .} GROUP BY ?t3_structure_code ORDER BY ?agg LIMIT 3 } FILTER(?t1_document_type_code in (?t2_type_code)). FILTER(?document_structure_code in (?t3_structure_code)). } 
document_management,What are the names of documents that have both one of the three most common types and one of three most common structures?,SELECT ?t1_document_name { ?t1 a :documents . ?t1 :documents\#document_name ?t1_document_name .  ?t1 :documents\#document_type_code ?t1_document_type_code . ?t1 :documents\#document_structure_code ?t1_document_structure_code . { SELECT ?t2_type_code (count(*) as ?agg) WHERE { ?t2 a :documents . ?t2 :documents\#document_type_code ?t2_document_type_code .} GROUP BY ?t2_type_code ORDER BY ?agg LIMIT 3 } { SELECT ?t3_structure_code (count(*) as ?agg) WHERE { ?t3 a :documents . ?t3 :documents\#document_structure_code ?t3_structure_code .} GROUP BY ?t3_structure_code ORDER BY ?agg LIMIT 3 } FILTER(?t1_document_type_code in (?t2_type_code)). FILTER(?document_structure_code in (?t3_structure_code)). } 
document_management,What document types do have more than 10000 total access number.,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code . ?T1 :documents\#access_count ?T1_access_count .        } GROUP BY ?T1_document_type_code   HAVING(sum( ?T1_access_count)  > 10000)
document_management,What are all the section titles of the document named 'David CV'?,SELECT ?T1_section_title WHERE { ?T1 a :document_sections . ?T2 a :documents . ?T1 :document_sections\#ref-document_code ?T2 .  ?T1 :document_sections\#section_title ?T1_section_title . ?T2 :documents\#document_name ?T2_document_name . FILTER(?T2_document_name = 'David CV') .        }
document_management,Find all the name of documents without any sections.,SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_code ?T1_document_code . FILTER(?T1_document_code not in (?T22_document_code)) .       {SELECT ?T22_document_code WHERE { ?T22 a :document_sections . ?T22 :document_sections\#document_code ?T22_document_code .        }    } }
document_management,What are the names of documents that do not have any sections?,SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_code ?T1_document_code . FILTER(?T1_document_code not in (?T22_document_code)) .       {SELECT ?T22_document_code WHERE { ?T22 a :document_sections . ?T22 :document_sections\#document_code ?T22_document_code .        }    } }
document_management,List all the username and passwords of users with the most popular role.,SELECT ?T1_user_name (count( *) as ?aggregation_all) ?T1_password WHERE { ?T1 a :users . ?T1 :users\#user_name ?T1_user_name . ?T1 :users\#password ?T1_password .        } GROUP BY ?T1_user_name  ?T1_password  ORDER BY DESC (?aggregation_all) LIMIT 1
document_management,What are the usernames and passwords of users that have the most common role?,SELECT ?T1_user_name (count( *) as ?aggregation_all) ?T1_password WHERE { ?T1 a :users . ?T1 :users\#user_name ?T1_user_name . ?T1 :users\#password ?T1_password .        } GROUP BY ?T1_user_name  ?T1_password  ORDER BY DESC (?aggregation_all) LIMIT 1
document_management,Find the average access counts of documents with functional area 'Acknowledgement'.,SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_99 ) WHERE { ?T1 a :documents . ?T13 a :document_functional_areas . ?T13 :document_functional_areas\#ref-document_code ?T1 .  ?T1 :documents\#access_count ?T1_access_count . ?T2 :functional_areas\#functional_area_description ?T2_functional_area_description . ?T2 a :functional_areas . ?T13 :document_functional_areas\#ref-functional_area_code ?T2 .  ?T1 :documents\#access_count ?T1_access_count . ?T2 :functional_areas\#functional_area_description ?T2_functional_area_description . FILTER(?T2_functional_area_description = 'Acknowledgement') .        }
document_management,What are the average access counts of documents that have the functional area description 'Acknowledgement'?,SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_72 ) WHERE { ?T1 a :documents . ?T13 a :document_functional_areas . ?T13 :document_functional_areas\#ref-document_code ?T1 .  ?T1 :documents\#access_count ?T1_access_count . ?T2 :functional_areas\#functional_area_description ?T2_functional_area_description . ?T2 a :functional_areas . ?T13 :document_functional_areas\#ref-functional_area_code ?T2 .  ?T1 :documents\#access_count ?T1_access_count . ?T2 :functional_areas\#functional_area_description ?T2_functional_area_description . FILTER(?T2_functional_area_description = 'Acknowledgement') .        }
document_management,Find names of the document without any images.,SELECT distinct?col1 WHERE { { SELECT (?T1_document_name as ?col1) WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name .   }}  MINUS {SELECT (?T2_document_name as ?col1) WHERE { ?T2 a :documents . ?T2 :documents\#document_name ?T2_document_name .        }     } }
document_management,What are the names of documents that do not have any images?,SELECT distinct?col1 WHERE { { SELECT (?T1_document_name as ?col1) WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name .   }}  MINUS {SELECT (?T2_document_name as ?col1) WHERE { ?T2 a :documents . ?T2 :documents\#document_name ?T2_document_name .        }     } }
document_management,What is the name of the document with the most number of sections?,SELECT ?T1_document_name (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T2 a :document_sections . ?T2 :document_sections\#ref-document_code ?T1 .  ?T1 :documents\#document_name ?T1_document_name .        } GROUP BY ?T1_document_name  ORDER BY DESC (?aggregation_all) LIMIT 1
document_management,List all the document names which contains 'CV'.,"SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_name ?T1_document_name . FILTER(contains (?T1_document_name, 'CV')) .        }"
document_management,What are the names of documents that contain the substring 'CV'?,"SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_name ?T1_document_name . FILTER(contains (?T1_document_name, 'CV')) .        }"
document_management,How many users are logged in?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :users . ?T1 :users\#user_login ?T1_user_login . FILTER(?T1_user_login = 1) .        }
document_management,Find the description of the most popular role among the users that have logged in.,SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\#role_description ?T1_role_description . ?T1 :roles\#role_code ?T1_role_code . FILTER(?T1_role_code = (?T22_role_code)) .       {SELECT ?T22_role_code (count( *) as ?aggregation_all) WHERE { ?T22 a :users . ?T22 :users\#role_code ?T22_role_code . ?T22 :users\#user_login ?T22_user_login . FILTER(?T22_user_login = 1) .        } GROUP BY ?T22_role_code  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
document_management,Find the average access count of documents with the least popular structure.,SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_130 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#access_count ?T1_access_count .        }   ORDER BY ASC (?aggregation_all) LIMIT 1
document_management,What is the average access count of documents that have the least common structure?,SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_93 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#access_count ?T1_access_count .        }   ORDER BY ASC (?aggregation_all) LIMIT 1
document_management,List all the image name and URLs in the order of their names.,SELECT ?T1_image_name ?T1_image_url WHERE { ?T1 a :images . ?T1 :images\#image_name ?T1_image_name . ?T1 :images\#image_url ?T1_image_url . ?T1 :images\#image_name ?T1_image_name .        }  ORDER BY ASC (?T1_image_name)
document_management,Find the number of users in each role.,SELECT (count( *) as ?aggregation_all) ?T1_role_code WHERE { ?T1 a :users . ?T1 :users\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code
document_management,What document types have more than 2 corresponding documents?,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code   HAVING(count( *)  > 2)
company_office,How many companies are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :companies .        }
company_office,List the names of companies in descending order of market value.,SELECT ?T1_name WHERE { ?T1 a :companies . ?T1 :companies\#name ?T1_name . ?T1 :companies\#market_value_billion ?T1_market_value_billion .        }  ORDER BY DESC (?T1_market_value_billion)
company_office,What are the names of companies whose headquarters are not 'USA'?,SELECT ?T1_name WHERE { ?T1 a :companies . ?T1 :companies\#name ?T1_name . ?T1 :companies\#headquarters ?T1_headquarters . FILTER(?T1_headquarters != 'USA') .        }
company_office,List the name and assets of each company in ascending order of company name.,SELECT ?T1_name ?T1_assets_billion WHERE { ?T1 a :companies . ?T1 :companies\#name ?T1_name . ?T1 :companies\#assets_billion ?T1_assets_billion . ?T1 :companies\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
company_office,What are the average profits of companies?,SELECT (avg( ?T1_profits_billion) as ?aggregation_T1_profits_billion_166 ) WHERE { ?T1 a :companies . ?T1 :companies\#profits_billion ?T1_profits_billion .        }
company_office,Compute the average profits companies make.,SELECT (avg( ?T1_profits_billion) as ?aggregation_T1_profits_billion_38 ) WHERE { ?T1 a :companies . ?T1 :companies\#profits_billion ?T1_profits_billion .        }
company_office,What are the maximum and minimum sales of the companies whose industries are not 'Banking'.,SELECT (max( ?T1_sales_billion) as ?aggregation_T1_sales_billion_134 ) (min( ?T1_sales_billion) as ?aggregation_T1_sales_billion_73 ) WHERE { ?T1 a :companies . ?T1 :companies\#sales_billion ?T1_sales_billion . ?T1 :companies\#sales_billion ?T1_sales_billion . ?T1 :companies\#industry ?T1_industry . FILTER(?T1_industry != 'Banking') .        }
company_office,Find the maximum and minimum sales of the companies that are not in the 'Banking' industry.,SELECT (max( ?T1_sales_billion) as ?aggregation_T1_sales_billion_107 ) (min( ?T1_sales_billion) as ?aggregation_T1_sales_billion_129 ) WHERE { ?T1 a :companies . ?T1 :companies\#sales_billion ?T1_sales_billion . ?T1 :companies\#sales_billion ?T1_sales_billion . ?T1 :companies\#industry ?T1_industry . FILTER(?T1_industry != 'Banking') .        }
company_office,How many different industries are the companies in?,SELECT DISTINCT (count(DISTINCT ?T1_industry) as ?aggregation_T1_industry_104 ) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry .        }
company_office,Count the number of distinct company industries.,SELECT DISTINCT (count(DISTINCT ?T1_industry) as ?aggregation_T1_industry_26 ) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry .        }
company_office,List the names of buildings in descending order of building height.,SELECT ?T1_name WHERE { ?T1 a :buildings . ?T1 :buildings\#name ?T1_name . ?T1 :buildings\#height ?T1_height .        }  ORDER BY DESC (?T1_height)
company_office,Find the stories of the building with the largest height.,SELECT ?T1_stories WHERE { ?T1 a :buildings . ?T1 :buildings\#stories ?T1_stories . ?T1 :buildings\#height ?T1_height .        }   ORDER BY DESC (?T1_height) LIMIT 1
company_office,What is the stories of highest building?,SELECT ?T1_stories WHERE { ?T1 a :buildings . ?T1 :buildings\#stories ?T1_stories . ?T1 :buildings\#height ?T1_height .        }   ORDER BY DESC (?T1_height) LIMIT 1
company_office,List the name of a building along with the name of a company whose office is in the building.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :companies . ?T13 a :office_locations . ?T13 :office_locations\#ref-company_id ?T1 .  ?T1 :companies\#name ?T1_name . ?T2 :buildings\#name ?T2_name . ?T2 a :buildings . ?T13 :office_locations\#ref-building_id ?T2 .  ?T1 :companies\#name ?T1_name . ?T2 :buildings\#name ?T2_name .        }
company_office,Show the names of the buildings that have more than one company offices.,SELECT ?T1_name WHERE { ?T1 a :buildings . ?T2 a :office_locations . ?T2 :office_locations\#ref-building_id ?T1 .  ?T1 :buildings\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
company_office,Show the name of the building that has the most company offices.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :buildings . ?T2 a :office_locations . ?T2 :office_locations\#ref-building_id ?T1 .  ?T1 :buildings\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
company_office,"Please show the names of the buildings whose status is 'on-hold', in ascending order of stories.",SELECT ?T1_name WHERE { ?T1 a :buildings . ?T1 :buildings\#name ?T1_name . ?T1 :buildings\#stories ?T1_stories . ?T1 :buildings\#status ?T1_status . FILTER(?T1_status = 'on-hold') .        }  ORDER BY ASC (?T1_stories)
company_office,Please show each industry and the corresponding number of companies in that industry.,SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry .        } GROUP BY ?T1_industry
company_office,Please show the industries of companies in descending order of the number of companies.,SELECT ?T1_industry WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry .        } GROUP BY ?T1_industry ORDER BY DESC ((count( *) as ?aggregation_all))
company_office,List the industry shared by the most companies.,SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry .        } GROUP BY ?T1_industry  ORDER BY DESC (?aggregation_all) LIMIT 1
company_office,Which industry has the most companies?,SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry .        } GROUP BY ?T1_industry  ORDER BY DESC (?aggregation_all) LIMIT 1
company_office,List the names of buildings that have no company office.,SELECT ?T1_name WHERE { ?T1 a :buildings . ?T1 :buildings\#name ?T1_name . ?T1 :buildings\#id ?T1_id . FILTER(?T1_id not in (?T22_building_id)) .       {SELECT ?T22_building_id WHERE { ?T22 a :office_locations . ?T22 :office_locations\#building_id ?T22_building_id .        }    } }
company_office,Show the industries shared by companies whose headquarters are 'USA' and companies whose headquarters are 'China'.,SELECT DISTINCT ?T1_industry WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry . ?T1 :companies\#headquarters ?T1_headquarters . FILTER(?T1_headquarters = 'USA') . FILTER (?T1_industry in (?T2_industry)) .   ?T2 a :companies . ?T2 :companies\#industry ?T2_industry . ?T2 :companies\#headquarters ?T2_headquarters .  FILTER(?T2_headquarters = 'China') .             }
company_office,Which industries have both companies with headquarter in 'USA' and companies with headquarter in 'China'?,SELECT DISTINCT ?T1_industry WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry . ?T1 :companies\#headquarters ?T1_headquarters . FILTER(?T1_headquarters = 'USA') . FILTER (?T1_industry in (?T2_industry)) .   ?T2 a :companies . ?T2 :companies\#industry ?T2_industry . ?T2 :companies\#headquarters ?T2_headquarters .  FILTER(?T2_headquarters = 'China') .             }
company_office,"Find the number of companies whose industry is 'Banking' or 'Conglomerate',",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry . ?T1 :companies\#industry ?T1_industry . FILTER(?T1_industry = 'Banking' || ?T1_industry = 'Conglomerate') .        }
company_office,How many companies are in either 'Banking' industry or 'Conglomerate' industry?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :companies\#industry ?T1_industry . ?T1 :companies\#industry ?T1_industry . FILTER(?T1_industry = 'Banking' || ?T1_industry = 'Conglomerate') .        }
company_office,Show the headquarters shared by more than two companies.,SELECT ?T1_headquarters WHERE { ?T1 a :companies . ?T1 :companies\#headquarters ?T1_headquarters .        } GROUP BY ?T1_headquarters   HAVING(count( *)  > 2)
company_office,Which headquarter locations are used by more than 2 companies?,SELECT ?T1_headquarters WHERE { ?T1 a :companies . ?T1 :companies\#headquarters ?T1_headquarters .        } GROUP BY ?T1_headquarters   HAVING(count( *)  > 2)
solvency_ii,How many products are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products .        }
solvency_ii,List the name of products in ascending order of price.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        }  ORDER BY ASC (?T1_product_price)
solvency_ii,What are the names and type codes of products?,SELECT ?T1_product_name ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_type_code ?T1_product_type_code .        }
solvency_ii,Show the prices of the products named 'Dining' or 'Trading Policy'.,SELECT ?T1_product_price WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'Dining' || ?T1_product_name = 'Trading Policy') .        }
solvency_ii,What is the average price for products?,SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_189 ) WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price .        }
solvency_ii,What is the name of the product with the highest price?,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
solvency_ii,Show different type codes of products and the number of products with each type code.,SELECT ?T1_product_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code .        } GROUP BY ?T1_product_type_code
solvency_ii,Show the most common type code across products.,SELECT ?T1_product_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code .        } GROUP BY ?T1_product_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
solvency_ii,Show the product type codes that have at least two products.,SELECT ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code .        } GROUP BY ?T1_product_type_code   HAVING(count( *)  >= 2)
solvency_ii,Show the product type codes that have both products with price higher than 4500 and products with price lower than 3000.,SELECT DISTINCT ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price > 4500) . FILTER (?T1_product_type_code in (?T2_product_type_code)) .   ?T2 a :products . ?T2 :products\#product_type_code ?T2_product_type_code . ?T2 :products\#product_price ?T2_product_price .  FILTER(?T2_product_price < 3000) .             }
