kg_name,question,query
geo,what river is the longest one in the united states,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_25)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_25 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the longest river in the us,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_3)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_3 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the longest river,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_29)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_29 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the longest river in the united states,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_73)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_73 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what state has the city with the largest population,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_9)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_9 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what state has the largest city,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_195)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_195 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,which state has the largest city,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_44)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_44 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what state has the city with the most population,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_6)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_6 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the smallest city in the largest state,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?aggregation_T64_area_94) && ?T1_state_name in (?aggregation_T43_area_27)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_15 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_area_94)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_94)) .       {SELECT (max( ?T64_area) as ?aggregation_T64_area_94 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_27)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_27 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what state is the biggest,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_118)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_118 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the state with the largest area,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_153)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_153 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what state has the largest area,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_123)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_123 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the biggest state in continental us,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_33)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_33 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,state the state with the largest area,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_193)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_193 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the largest state in usa,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_188)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_188 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the biggest state,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_102)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_102 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the biggest state in the usa,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_84)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_84 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the largest state in the us,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_83)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_83 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the largest state,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_28)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_28 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what are the highest points of states surrounding mississippi,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'mississippi') .        }    } }
geo,what is the highest point in states bordering colorado,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'colorado') .        }    } }   ORDER BY DESC (?T1_highest_elevation) LIMIT 1
geo,what is the state with the lowest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_186)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_186 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the lowest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_167)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_167 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,which state has the lowest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_35)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_35 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,which state has the smallest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_90)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_90 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the sparsest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_108)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_108 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,which state has the sparsest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_72)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_72 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the least population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_176)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_176 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,which state has the least population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_63)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_63 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the smallest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_154)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_154 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,where is the highest point in texas,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
geo,what states have no bordering state,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name not in (?T22_state_name)) .       {SELECT ?T22_state_name WHERE { ?T22 a :border_info . ?T22 :border_info\#state_name ?T22_state_name .        }    } }
geo,what is the area of the state with the smallest population density,SELECT ?T1_area WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_174)) .       {SELECT (min( ?T22_density) as ?aggregation_T22_density_174 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,count the states which have elevations lower than what alabama has,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_78 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation < (?T22_state_name)) .       {SELECT ?T22_lowest_elevation WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation . ?T22 :highlow\#state_name ?T22_state_name . FILTER(?T22_state_name = 'alabama') .        }    } }
geo,how high is guadalupe peak,SELECT ?T1_highest_elevation WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . ?T1 :highlow\#highest_point ?T1_highest_point . FILTER(?T1_highest_point = 'guadalupe peak') .        }
geo,how high is the highest point in america,SELECT (max( ?T1_highest_elevation) as ?aggregation_T1_highest_elevation_140 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation .        }
geo,what is the highest elevation in the united states,SELECT (max( ?T1_highest_elevation) as ?aggregation_T1_highest_elevation_180 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation .        }
geo,what is the elevation of the highest point in the usa,SELECT (max( ?T1_highest_elevation) as ?aggregation_T1_highest_elevation_179 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation .        }
geo,what is the height of the highest point in the usa,SELECT (max( ?T1_highest_elevation) as ?aggregation_T1_highest_elevation_143 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation .        }
geo,how long is the rio grande river,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'rio grande') .        }
geo,how long is the longest river in texas,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_190 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what is the length of the longest river that runs through texas,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_92 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,how many capitals does rhode island have,SELECT (count( ?T1_capital) as ?aggregation_T1_capital_157 ) WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'rhode island') .        }
geo,how many cities are there in the united states,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_122 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name .        }
geo,how many cities does the usa have,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_77 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name .        }
geo,how many cities are there in the us,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_166 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name .        }
geo,how many cities are there in usa,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_52 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name .        }
geo,how many cities are there in us,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_43 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name .        }
geo,how many major cities are there,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_144 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population > 150000) .        }
geo,how many citizens does the biggest city have in the usa,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_173)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_173 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,how many colorado rivers are there,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_123 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'colorado') .        }
geo,how many rivers are called colorado,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_127 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'colorado') .        }
geo,what is the population of seattle washington,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_city_name = 'seattle' && ?T1_state_name = 'washington') .        }
geo,how many people live in the biggest city in alaska state,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'alaska') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_150 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'alaska') .        }    } }
geo,how large is the largest city in alaska,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'alaska') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_60 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'alaska') .        }    } }
geo,how many people live in the capital of texas,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = (?T22_state_name)) .       {SELECT ?T22_capital WHERE { ?T22 a :state . ?T22 :state\#capital ?T22_capital . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name = 'texas') .        }    } }
geo,how many people live in the united states,SELECT (sum( ?T1_population) as ?aggregation_T1_population_69 ) WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population .        }
geo,what is the combined population of all 50 states,SELECT (sum( ?T1_population) as ?aggregation_T1_population_175 ) WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population .        }
geo,how many states are in the usa,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_12 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,how many states are there,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_50 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,how many states are there in the usa,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_129 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,how many states does usa have,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_182 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,how many states are in the united states,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_158 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,how many states are there in united states,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_22 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,how many states border kentucky,SELECT (count( ?T1_border) as ?aggregation_T1_border_68 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'kentucky') .        }
geo,how many states does kentucky border,SELECT (count( ?T1_border) as ?aggregation_T1_border_191 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'kentucky') .        }
geo,kentucky borders how many states,SELECT (count( ?T1_border) as ?aggregation_T1_border_30 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'kentucky') .        }
geo,number of states bordering kentucky,SELECT (count( ?T1_border) as ?aggregation_T1_border_194 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'kentucky') .        }
geo,what is the number of neighboring states for kentucky,SELECT (count( ?T1_border) as ?aggregation_T1_border_141 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'kentucky') .        }
geo,how many states border the state with the largest population,SELECT (count( ?T1_border) as ?aggregation_T1_border_59 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_population_64)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_64)) .       {SELECT (max( ?T43_population) as ?aggregation_T43_population_64 ) WHERE { ?T43 a :state . ?T43 :state\#population ?T43_population .        }    } }    } }
geo,how many states do not have rivers,SELECT DISTINCT (count(DISTINCT ?T1_state_name) as ?aggregation_T1_state_name_114 ) WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name not in (?T22_traverse)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse .        }    } }
geo,how many states have a higher point than the highest point of the state with the largest capital city in the us,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_172 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation > (?aggregation_T85_population_33)) .       {SELECT ?T22_highest_elevation WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation . ?T22 :highlow\#state_name ?T22_state_name . FILTER(?T22_state_name = (?aggregation_T85_population_33)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#capital ?T43_capital . FILTER(?T43_capital = (?aggregation_T85_population_33)) .       {SELECT ?T64_city_name WHERE { ?T64 a :city . ?T64 :city\#city_name ?T64_city_name . ?T64 :city\#population ?T64_population . FILTER(?T64_population = (?aggregation_T85_population_33)) .       {SELECT (max( ?T85_population) as ?aggregation_T85_population_33 ) WHERE { ?T85 a :city . ?T85 :city\#population ?T85_population .        }    } }    } }    } }    } }
geo,name the major rivers in illinois,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length > 750 && ?T1_traverse = 'illinois') .        }
geo,through which states does the longest river in texas run,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?T22_traverse)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_18 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what are the capital city in texas,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
geo,what are the capitals of states that border texas,SELECT ?T1_capital WHERE { ?T1 a :state . ?T2 a :border_info . ?T2 :border_info\#ref-border ?T1 .  ?T1 :state\#capital ?T1_capital . ?T2 :border_info\#state_name ?T2_state_name . FILTER(?T2_state_name = 'texas') .        }
geo,what are the cities in states through which the mississippi runs,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_river_name)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#river_name ?T22_river_name . FILTER(?T22_river_name = 'mississippi') .        }    } }
geo,what are the cities of the state with the highest point,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_highest_elevation_99)) .       {SELECT ?T22_state_name WHERE { ?T22 a :highlow . ?T22 :highlow\#state_name ?T22_state_name . ?T22 :highlow\#highest_elevation ?T22_highest_elevation . FILTER(?T22_highest_elevation = (?aggregation_T43_highest_elevation_99)) .       {SELECT (max( ?T43_highest_elevation) as ?aggregation_T43_highest_elevation_99 ) WHERE { ?T43 a :highlow . ?T43 :highlow\#highest_elevation ?T43_highest_elevation .        }    } }    } }
geo,what are the highest points of all the states,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point .        }
geo,what are the major cities in kansas,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = 'kansas') .        }
geo,what are the major cities in states through which the mississippi runs,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name in (?T22_river_name)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#length ?T22_length . ?T22 :river\#river_name ?T22_river_name . FILTER(?T22_length > 750 && ?T22_river_name = 'mississippi') .        }    } }
geo,what are the major cities in the usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population > 150000) .        }
geo,what are the population densities of each us state,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density .        }
geo,what are the populations of states which border texas,SELECT ?T1_population WHERE { ?T1 a :state . ?T2 a :border_info . ?T2 :border_info\#ref-border ?T1 .  ?T1 :state\#population ?T1_population . ?T2 :border_info\#state_name ?T2_state_name . FILTER(?T2_state_name = 'texas') .        }
geo,what are the populations of the major cities of wisconsin,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = 'wisconsin') .        }
geo,what city has the most people,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_33)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_33 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what city in the united states has the highest population density,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_52)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_52 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the most populous city,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_86)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_86 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,which us city has the highest population density,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_200)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_200 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the biggest city in the usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_75)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_75 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,whats the largest city,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_157)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_157 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what city has the largest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_130)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_130 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the biggest city in the us,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_116)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_116 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the biggest city in usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_174)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_174 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
