kg_name,question,query
aircraft,What is the name of the aircraft that has won an award the most?,SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft  ORDER BY DESC (?aggregation_all) LIMIT 1
aircraft,List the names of aircrafts and the number of times it won matches.,SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft
aircraft,"For each aircraft that has won an award, what is its name and how many time has it won?",SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft
aircraft,List names of all pilot in descending order of age.,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
aircraft,What are the names of all pilots listed by descending age?,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
aircraft,List the names of aircrafts and that won matches at least twice.,SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft   HAVING(count( *)  >= 2)
aircraft,What are the names of all aircrafts that have won a match at least twice?,SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft   HAVING(count( *)  >= 2)
aircraft,List the names of aircrafts and that did not win any match.,SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T1 :aircraft\#aircraft ?T1_aircraft . ?T1 :aircraft\#aircraft_id ?T1_aircraft_id . FILTER(?T1_aircraft_id not in (?T22_winning_aircraft)) .       {SELECT ?T22_winning_aircraft WHERE { ?T22 a :match . ?T22 :match\#winning_aircraft ?T22_winning_aircraft .        }    } }
aircraft,What are the names of all aicrafts that have never won any match?,SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T1 :aircraft\#aircraft ?T1_aircraft . ?T1 :aircraft\#aircraft_id ?T1_aircraft_id . FILTER(?T1_aircraft_id not in (?T22_winning_aircraft)) .       {SELECT ?T22_winning_aircraft WHERE { ?T22 a :match . ?T22 :match\#winning_aircraft ?T22_winning_aircraft .        }    } }
aircraft,Show the names of aircrafts that are associated with both an airport named 'London Heathrow' and an airport named 'London Gatwick',SELECT DISTINCT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\#ref-aircraft_id ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft . ?T2 :airport\#airport_name ?T2_airport_name . ?T2 a :airport . ?T13 :airport_aircraft\#ref-airport_id ?T2 .  ?T1 :aircraft\#aircraft ?T1_aircraft . ?T2 :airport\#airport_name ?T2_airport_name . FILTER(?T2_airport_name = 'London Heathrow') . FILTER (?T1_aircraft in (?T3_aircraft)) .   ?T3 a :aircraft . ?T15 a :airport_aircraft . ?T15 :airport_aircraft\#ref-aircraft_id ?T3 .  ?T3 :aircraft\#aircraft ?T3_aircraft . ?T4 :airport\#airport_name ?T4_airport_name . ?T4 a :airport . ?T15 :airport_aircraft\#ref-airport_id ?T4 .  ?T3 :aircraft\#aircraft ?T3_aircraft . ?T4 :airport\#airport_name ?T4_airport_name .  FILTER(?T4_airport_name = 'London Gatwick') .             }
aircraft,Show all information on the airport that has the largest number of international passengers.,SELECT * WHERE { ?T1 a :airport . ?T1 :airport\#international_passengers ?T1_international_passengers .        }   ORDER BY DESC (?T1_international_passengers) LIMIT 1
aircraft,find the name and age of the pilot who has won the most number of times among the pilots who are younger than 30.,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_age WHERE { ?T1 a :pilot . ?T2 a :match . ?T2 :match\#ref-winning_pilot ?T1 .  ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . ?T1 :pilot\#age ?T1_age . FILTER(?T1_age < 30) .        } GROUP BY ?T1_name ?T1_age  ORDER BY DESC (?aggregation_all) LIMIT 1
aircraft,What is the name and age of the pilot younger than 30 who has won the most number of times?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_age WHERE { ?T1 a :pilot . ?T2 a :match . ?T2 :match\#ref-winning_pilot ?T1 .  ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . ?T1 :pilot\#age ?T1_age . FILTER(?T1_age < 30) .        } GROUP BY ?T1_name ?T1_age  ORDER BY DESC (?aggregation_all) LIMIT 1
aircraft,what is the name and age of the youngest winning pilot?,SELECT ?T1_name ?T1_age WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . ?T1 :pilot\#age ?T1_age .        }   ORDER BY ASC (?T1_age) LIMIT 1
aircraft,How old is the youngest winning pilot and what is their name?,SELECT ?T1_name ?T1_age WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . ?T1 :pilot\#age ?T1_age .        }   ORDER BY ASC (?T1_age) LIMIT 1
aircraft,find the name of pilots who did not win the matches held in the country of Australia.,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#pilot_id ?T1_pilot_id . FILTER(?T1_pilot_id not in (?T22_country)) .       {SELECT ?T22_winning_pilot WHERE { ?T22 a :match . ?T22 :match\#winning_pilot ?T22_winning_pilot . ?T22 :match\#country ?T22_country . FILTER(?T22_country = 'Australia') .        }    } }
local_govt_and_lot,How many residents does each property have? List property id and resident count.,SELECT ?T1_property_id (count( *) as ?aggregation_all) WHERE { ?T1 a :properties . ?T2 a :residents . ?T2 :residents\#ref-property_id ?T1 .  ?T1 :properties\#property_id ?T1_property_id .        } GROUP BY ?T1_property_id
local_govt_and_lot,"How many services has each resident requested? List the resident id, details, and the count in descending order of the count.",SELECT ?T1_resident_id ?T1_other_details (count( *) as ?aggregation_all) WHERE { ?T1 a :residents . ?T2 a :residents_services . ?T2 :residents_services\#ref-resident_id ?T1 .  ?T1 :residents\#resident_id ?T1_resident_id . ?T1 :residents\#other_details ?T1_other_details .        } GROUP BY ?T1_resident_id ?T1_other_details ORDER BY DESC ((count( *) as ?aggregation_all))
local_govt_and_lot,"What is the maximum number that a certain service is provided? List the service id, details and number.",SELECT ?T1_service_id (count( *) as ?aggregation_all) ?T1_service_details (count( *) as ?aggregation_all) WHERE { ?T1 a :services . ?T2 a :residents_services . ?T2 :residents_services\#ref-service_id ?T1 .  ?T1 :services\#service_id ?T1_service_id . ?T1 :services\#service_details ?T1_service_details .        } GROUP BY ?T1_service_id ?T1_service_details  ORDER BY DESC (?aggregation_all) LIMIT 1
local_govt_and_lot,"List the id and type of each thing, and the details of the organization that owns it.",SELECT ?T1_thing_id ?T1_type_of_thing_code ?T2_organization_details WHERE { ?T1 a :things . ?T2 a :organizations . ?T1 :things\#ref-organization_id ?T2 .  ?T1 :things\#thing_id ?T1_thing_id . ?T1 :things\#type_of_thing_code ?T1_type_of_thing_code . ?T2 :organizations\#organization_details ?T2_organization_details .        }
local_govt_and_lot,What are the id and details of the customers who have at least 3 events?,SELECT ?T1_customer_id ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :customer_events . ?T2 :customer_events\#ref-customer_id ?T1 .  ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_details ?T1_customer_details .        } GROUP BY ?T1_customer_id ?T1_customer_details   HAVING(count( *)  >= 3)
local_govt_and_lot,Which events have the number of notes between one and three? List the event id and the property id.,SELECT ?T1_customer_event_id ?T1_property_id WHERE { ?T1 a :customer_events . ?T2 a :customer_event_notes . ?T2 :customer_event_notes\#ref-customer_event_id ?T1 .  ?T1 :customer_events\#customer_event_id ?T1_customer_event_id . ?T1 :customer_events\#property_id ?T1_property_id .        } GROUP BY ?T1_customer_event_id ?T1_property_id   HAVING(count( *)  >= 1 && count( *)  <= 3)
local_govt_and_lot,What are the distinct id and type of the thing that has the status 'Close' or has a status record before the date '2017-06-19 02:59:21',SELECT DISTINCT ?T1_thing_id ?T1_type_of_thing_code WHERE { ?T1 a :things . ?T2 a :timed_status_of_things . ?T2 :timed_status_of_things\#ref-thing_id ?T1 .  ?T1 :things\#thing_id ?T1_thing_id . ?T1 :things\#type_of_thing_code ?T1_type_of_thing_code . ?T2 :timed_status_of_things\#status_of_thing_code ?T2_status_of_thing_code . ?T2 :timed_status_of_things\#date_and_date ?T2_date_and_date . FILTER(?T2_status_of_thing_code = 'Close' || ?T2_date_and_date < 2017-06-19 02:59:21) .        }
local_govt_and_lot,How many different status codes of things are there?,SELECT DISTINCT (count(DISTINCT ?T1_status_of_thing_code) as ?aggregation_T1_status_of_thing_code_75 ) WHERE { ?T1 a :timed_status_of_things . ?T1 :timed_status_of_things\#status_of_thing_code ?T1_status_of_thing_code .        }
local_govt_and_lot,Which organizations are not a parent organization of others? List the organization id.,SELECT distinct?col1 WHERE { { SELECT (?T1_organization_id as ?col1) WHERE { ?T1 a :organizations . ?T1 :organizations\#organization_id ?T1_organization_id .   }}  MINUS {SELECT (?T2_parent_organization_id as ?col1) WHERE { ?T2 a :organizations . ?T2 :organizations\#parent_organization_id ?T2_parent_organization_id .        }     } }
local_govt_and_lot,When is the last day any resident moved in?,SELECT (max( ?T1_date_moved_in) as ?aggregation_T1_date_moved_in_101 ) WHERE { ?T1 a :residents . ?T1 :residents\#date_moved_in ?T1_date_moved_in .        }
local_govt_and_lot,What are the resident details containing the substring 'Miss'?,"SELECT ?T1_other_details WHERE { ?T1 a :residents . ?T1 :residents\#other_details ?T1_other_details . ?T1 :residents\#other_details ?T1_other_details . FILTER(contains (?T1_other_details, 'Miss')) .        }"
local_govt_and_lot,List the customer event id and the corresponding move in date and property id.,SELECT ?T1_customer_event_id ?T1_date_moved_in ?T1_property_id WHERE { ?T1 a :customer_events . ?T1 :customer_events\#customer_event_id ?T1_customer_event_id . ?T1 :customer_events\#date_moved_in ?T1_date_moved_in . ?T1 :customer_events\#property_id ?T1_property_id .        }
local_govt_and_lot,How many customers did not have any event?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :customer_events . ?T22 :customer_events\#customer_id ?T22_customer_id .        }    } }
local_govt_and_lot,What are the distinct move in dates of the residents?,SELECT DISTINCT ?T1_date_moved_in WHERE { ?T1 a :residents . ?T1 :residents\#date_moved_in ?T1_date_moved_in .        }
school_player,How many schools are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :school .        }
school_player,List the locations of schools in ascending order of enrollment.,SELECT ?T1_location WHERE { ?T1 a :school . ?T1 :school\#location ?T1_location . ?T1 :school\#enrollment ?T1_enrollment .        }  ORDER BY ASC (?T1_enrollment)
school_player,List the locations of schools in descending order of founded year.,SELECT ?T1_location WHERE { ?T1 a :school . ?T1 :school\#location ?T1_location . ?T1 :school\#founded ?T1_founded .        }  ORDER BY DESC (?T1_founded)
school_player,What are the enrollments of schools whose denomination is not 'Catholic'?,SELECT ?T1_enrollment WHERE { ?T1 a :school . ?T1 :school\#enrollment ?T1_enrollment . ?T1 :school\#denomination ?T1_denomination . FILTER(?T1_denomination != 'Catholic') .        }
school_player,What is the average enrollment of schools?,SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_2 ) WHERE { ?T1 a :school . ?T1 :school\#enrollment ?T1_enrollment .        }
school_player,Take the average of the school enrollment.,SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_148 ) WHERE { ?T1 a :school . ?T1 :school\#enrollment ?T1_enrollment .        }
school_player,Find the team of each player and sort them in ascending alphabetical order.,SELECT ?T1_team WHERE { ?T1 a :player . ?T1 :player\#team ?T1_team . ?T1 :player\#team ?T1_team .        }  ORDER BY ASC (?T1_team)
school_player,How many different positions of players are there?,SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_136 ) WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position .        }
school_player,Count the number of distinct player positions.,SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_183 ) WHERE { ?T1 a :player . ?T1 :player\#position ?T1_position .        }
school_player,Find the team of the player of the highest age.,SELECT ?T1_team WHERE { ?T1 a :player . ?T1 :player\#team ?T1_team . ?T1 :player\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
school_player,Which team has the oldest player?,SELECT ?T1_team WHERE { ?T1 a :player . ?T1 :player\#team ?T1_team . ?T1 :player\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
school_player,What are the teams that have the 5 oldest players?,SELECT ?T1_team WHERE { ?T1 a :player . ?T1 :player\#team ?T1_team . ?T1 :player\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
school_player,"For each player, show the team and the location of school they belong to.",SELECT ?T1_team ?T2_location WHERE { ?T1 a :player . ?T2 a :school . ?T1 :player\#ref-school_id ?T2 .  ?T1 :player\#team ?T1_team . ?T2 :school\#location ?T2_location .        }
school_player,What are the team and the location of school each player belongs to?,SELECT ?T1_team ?T2_location WHERE { ?T1 a :player . ?T2 a :school . ?T1 :player\#ref-school_id ?T2 .  ?T1 :player\#team ?T1_team . ?T2 :school\#location ?T2_location .        }
school_player,Show the locations of schools that have more than 1 player.,SELECT ?T1_location WHERE { ?T1 a :school . ?T2 a :player . ?T2 :player\#ref-school_id ?T1 .  ?T1 :school\#location ?T1_location .        } GROUP BY ?T1_location   HAVING(count( *)  > 1)
school_player,Show the denomination of the school that has the most players.,SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T2 a :player . ?T2 :player\#ref-school_id ?T1 .  ?T1 :school\#denomination ?T1_denomination .        } GROUP BY ?T1_denomination  ORDER BY DESC (?aggregation_all) LIMIT 1
school_player,What is the denomination of the school the most players belong to?,SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T2 a :player . ?T2 :player\#ref-school_id ?T1 .  ?T1 :school\#denomination ?T1_denomination .        } GROUP BY ?T1_denomination  ORDER BY DESC (?aggregation_all) LIMIT 1
school_player,Show locations and nicknames of schools.,SELECT ?T1_location ?T2_nickname WHERE { ?T1 a :school . ?T2 a :school_details . ?T2 :school_details\#ref-school_id ?T1 .  ?T1 :school\#location ?T1_location . ?T2 :school_details\#nickname ?T2_nickname .        }
school_player,What are the location and nickname of each school?,SELECT ?T1_location ?T2_nickname WHERE { ?T1 a :school . ?T2 a :school_details . ?T2 :school_details\#ref-school_id ?T1 .  ?T1 :school\#location ?T1_location . ?T2 :school_details\#nickname ?T2_nickname .        }
school_player,Please show different denominations and the corresponding number of schools.,SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T1 :school\#denomination ?T1_denomination .        } GROUP BY ?T1_denomination
school_player,Please show different denominations and the corresponding number of schools in descending order.,SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T1 :school\#denomination ?T1_denomination .        } GROUP BY ?T1_denomination ORDER BY DESC ((count( *) as ?aggregation_all))
school_player,List the school color of the school that has the largest enrollment.,SELECT ?T1_school_colors WHERE { ?T1 a :school . ?T1 :school\#school_colors ?T1_school_colors . ?T1 :school\#enrollment ?T1_enrollment .        }   ORDER BY DESC (?T1_enrollment) LIMIT 1
school_player,What is the school color of the school with the largest enrollment?,SELECT ?T1_school_colors WHERE { ?T1 a :school . ?T1 :school\#school_colors ?T1_school_colors . ?T1 :school\#enrollment ?T1_enrollment .        }   ORDER BY DESC (?T1_enrollment) LIMIT 1
school_player,List the locations of schools that do not have any player.,SELECT ?T1_location WHERE { ?T1 a :school . ?T1 :school\#location ?T1_location . ?T1 :school\#school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) .       {SELECT ?T22_school_id WHERE { ?T22 a :player . ?T22 :player\#school_id ?T22_school_id .        }    } }
school_player,Show the denomination shared by schools founded before 1890 and schools founded after 1900,SELECT DISTINCT ?T1_denomination WHERE { ?T1 a :school . ?T1 :school\#denomination ?T1_denomination . ?T1 :school\#founded ?T1_founded . FILTER(?T1_founded < 1890) . FILTER (?T1_denomination in (?T2_denomination)) .   ?T2 a :school . ?T2 :school\#denomination ?T2_denomination . ?T2 :school\#founded ?T2_founded .  FILTER(?T2_founded > 1900) .             }
school_player,Show the nicknames of schools that are not in division 1.,SELECT ?T1_nickname WHERE { ?T1 a :school_details . ?T1 :school_details\#nickname ?T1_nickname . ?T1 :school_details\#division ?T1_division . FILTER(?T1_division != 'Division 1') .        }
school_player,What are the nicknames of schools whose division is not 1?,SELECT ?T1_nickname WHERE { ?T1 a :school_details . ?T1 :school_details\#nickname ?T1_nickname . ?T1 :school_details\#division ?T1_division . FILTER(?T1_division != 'Division 1') .        }
school_player,Show the denomination shared by more than one school.,SELECT ?T1_denomination WHERE { ?T1 a :school . ?T1 :school\#denomination ?T1_denomination .        } GROUP BY ?T1_denomination   HAVING(count( *)  > 1)
school_player,What are the denomination more than one school have?,SELECT ?T1_denomination WHERE { ?T1 a :school . ?T1 :school\#denomination ?T1_denomination .        } GROUP BY ?T1_denomination   HAVING(count( *)  > 1)
store_product,Find all the distinct district names ordered by city area in descending.,SELECT DISTINCT ?T1_district_name ?T1_city_area WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_area ?T1_city_area . ?T1 :district\#city_area ?T1_city_area .        }  ORDER BY DESC (?T1_city_area)
store_product,What are the different district names in order of descending city area?,SELECT DISTINCT ?T1_district_name ?T1_city_area WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_area ?T1_city_area . ?T1 :district\#city_area ?T1_city_area .        }  ORDER BY DESC (?T1_city_area)
store_product,Find the list of page size which have more than 3 product listed,SELECT ?T1_max_page_size WHERE { ?T1 a :product . ?T1 :product\#max_page_size ?T1_max_page_size .        } GROUP BY ?T1_max_page_size   HAVING(count( *)  > 3)
store_product,Find the name and population of district with population between 200000 and 2000000,SELECT ?T1_district_name ?T1_city_population WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_population ?T1_city_population . ?T1 :district\#city_population ?T1_city_population . FILTER(?T1_city_population >= 200000 && ?T1_city_population <= 2000000) .        }
store_product,Find the name all districts with city area greater than 10 or population larger than 100000,SELECT ?T1_district_name WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_area ?T1_city_area . ?T1 :district\#city_population ?T1_city_population . FILTER(?T1_city_area > 10 || ?T1_city_population > 100000) .        }
store_product,Which district has the largest population?,SELECT ?T1_district_name WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_population ?T1_city_population .        }   ORDER BY DESC (?T1_city_population) LIMIT 1
store_product,What is the name of the district with the most residents?,SELECT ?T1_district_name WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_population ?T1_city_population .        }   ORDER BY DESC (?T1_city_population) LIMIT 1
store_product,Which district has the least area?,SELECT ?T1_district_name WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_area ?T1_city_area .        }   ORDER BY ASC (?T1_city_area) LIMIT 1
store_product,What is the name of the district with the smallest area?,SELECT ?T1_district_name WHERE { ?T1 a :district . ?T1 :district\#district_name ?T1_district_name . ?T1 :district\#city_area ?T1_city_area .        }   ORDER BY ASC (?T1_city_area) LIMIT 1
store_product,Find the total population of the top 3 districts with the largest area.,SELECT (sum( ?T1_city_population) as ?aggregation_T1_city_population_178 ) WHERE { ?T1 a :district . ?T1 :district\#city_population ?T1_city_population . ?T1 :district\#city_area ?T1_city_area .        }   ORDER BY DESC (?T1_city_area) LIMIT 1
store_product,Find all types of store and number of them.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :store . ?T1 :store\#type ?T1_type .        } GROUP BY ?T1_type
store_product,Find the names of all stores in Khanewal District.,SELECT ?T1_store_name WHERE { ?T1 a :store . ?T13 a :store_district . ?T13 :store_district\#ref-store_id ?T1 .  ?T1 :store\#store_name ?T1_store_name . ?T2 :district\#district_name ?T2_district_name . ?T2 a :district . ?T13 :store_district\#ref-district_id ?T2 .  ?T1 :store\#store_name ?T1_store_name . ?T2 :district\#district_name ?T2_district_name . FILTER(?T2_district_name = 'Khanewal District') .        }
store_product,What are the names of all the stores located in Khanewal District?,SELECT ?T1_store_name WHERE { ?T1 a :store . ?T13 a :store_district . ?T13 :store_district\#ref-store_id ?T1 .  ?T1 :store\#store_name ?T1_store_name . ?T2 :district\#district_name ?T2_district_name . ?T2 a :district . ?T13 :store_district\#ref-district_id ?T2 .  ?T1 :store\#store_name ?T1_store_name . ?T2 :district\#district_name ?T2_district_name . FILTER(?T2_district_name = 'Khanewal District') .        }
store_product,Find all the stores in the district with the most population.,SELECT ?T1_store_name WHERE { ?T1 a :store . ?T2 a :store_district . ?T2 :store_district\#ref-store_id ?T1 .  ?T1 :store\#store_name ?T1_store_name . ?T2 :store_district\#district_id ?T2_district_id . FILTER(?T2_district_id = (?T23_city_population)) .       {SELECT ?T23_district_id WHERE { ?T23 a :district . ?T23 :district\#district_id ?T23_district_id . ?T23 :district\#city_population ?T23_city_population .        }   ORDER BY DESC (?T23_city_population) LIMIT 1 } }
store_product,Which city is the headquarter of the store named 'Blackville' in?,SELECT ?T1_headquartered_city WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\#ref-district_id ?T1 .  ?T1 :district\#headquartered_city ?T1_headquartered_city . ?T2 :store\#store_name ?T2_store_name . ?T2 a :store . ?T13 :store_district\#ref-store_id ?T2 .  ?T1 :district\#headquartered_city ?T1_headquartered_city . ?T2 :store\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Blackville') .        }
store_product,What city is the headquarter of the store Blackville?,SELECT ?T1_headquartered_city WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\#ref-district_id ?T1 .  ?T1 :district\#headquartered_city ?T1_headquartered_city . ?T2 :store\#store_name ?T2_store_name . ?T2 a :store . ?T13 :store_district\#ref-store_id ?T2 .  ?T1 :district\#headquartered_city ?T1_headquartered_city . ?T2 :store\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Blackville') .        }
store_product,Find the number of stores in each city.,SELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\#ref-district_id ?T1 .  ?T1 :district\#headquartered_city ?T1_headquartered_city .        } GROUP BY ?T1_headquartered_city
store_product,How many stores are headquarted in each city?,SELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\#ref-district_id ?T1 .  ?T1 :district\#headquartered_city ?T1_headquartered_city .        } GROUP BY ?T1_headquartered_city
store_product,What is the city with the most number of flagship stores?,SELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\#ref-district_id ?T1 .  ?T1 :district\#headquartered_city ?T1_headquartered_city .        } GROUP BY ?T1_headquartered_city  ORDER BY DESC (?aggregation_all) LIMIT 1
store_product,What is the average pages per minute color?,SELECT (avg( ?T1_pages_per_minute_color) as ?aggregation_T1_pages_per_minute_color_125 ) WHERE { ?T1 a :product . ?T1 :product\#pages_per_minute_color ?T1_pages_per_minute_color .        }
store_product,What is the average number of pages per minute color?,SELECT (avg( ?T1_pages_per_minute_color) as ?aggregation_T1_pages_per_minute_color_147 ) WHERE { ?T1 a :product . ?T1 :product\#pages_per_minute_color ?T1_pages_per_minute_color .        }
store_product,What products are available at store named 'Miramichi'?,SELECT ?T1_product WHERE { ?T1 a :product . ?T13 a :store_product . ?T13 :store_product\#ref-product_id ?T1 .  ?T1 :product\#product ?T1_product . ?T2 :store\#store_name ?T2_store_name . ?T2 a :store . ?T13 :store_product\#ref-store_id ?T2 .  ?T1 :product\#product ?T1_product . ?T2 :store\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Miramichi') .        }
store_product,What products are sold at the store named Miramichi?,SELECT ?T1_product WHERE { ?T1 a :product . ?T13 a :store_product . ?T13 :store_product\#ref-product_id ?T1 .  ?T1 :product\#product ?T1_product . ?T2 :store\#store_name ?T2_store_name . ?T2 a :store . ?T13 :store_product\#ref-store_id ?T2 .  ?T1 :product\#product ?T1_product . ?T2 :store\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Miramichi') .        }
store_product,Find products with max page size as 'A4' and pages per minute color smaller than 5.,SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product\#product ?T1_product . ?T1 :product\#max_page_size ?T1_max_page_size . ?T1 :product\#pages_per_minute_color ?T1_pages_per_minute_color . FILTER(?T1_max_page_size = 'A4' && ?T1_pages_per_minute_color < 5) .        }
store_product,Find all the product whose name contains the word 'Scanner'.,"SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product\#product ?T1_product . ?T1 :product\#product ?T1_product . FILTER(contains (?T1_product, 'Scanner')) .        }"
store_product,What are all of the products whose name includes the substring 'Scanner'?,"SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product\#product ?T1_product . ?T1 :product\#product ?T1_product . FILTER(contains (?T1_product, 'Scanner')) .        }"
store_product,Find the most prominent max page size among all the products.,SELECT ?T1_max_page_size (count( *) as ?aggregation_all) WHERE { ?T1 a :product . ?T1 :product\#max_page_size ?T1_max_page_size .        } GROUP BY ?T1_max_page_size  ORDER BY DESC (?aggregation_all) LIMIT 1
store_product,What is the most common maximum page size?,SELECT ?T1_max_page_size (count( *) as ?aggregation_all) WHERE { ?T1 a :product . ?T1 :product\#max_page_size ?T1_max_page_size .        } GROUP BY ?T1_max_page_size  ORDER BY DESC (?aggregation_all) LIMIT 1
store_product,Find the name of the products that are not using the most frequently-used max page size.,SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product\#product ?T1_product . ?T1 :product\#product ?T1_product . FILTER(?T1_product != (?T22_max_page_size)) .       {SELECT ?T22_max_page_size (count( *) as ?aggregation_all) WHERE { ?T22 a :product . ?T22 :product\#max_page_size ?T22_max_page_size .        } GROUP BY ?T22_max_page_size  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
store_product,Find the total population of the districts where the area is bigger than the average city area.,SELECT (sum( ?T1_city_population) as ?aggregation_T1_city_population_93 ) WHERE { ?T1 a :district . ?T1 :district\#city_population ?T1_city_population . ?T1 :district\#city_area ?T1_city_area . FILTER(?T1_city_area > (?aggregation_T22_city_area_13)) .       {SELECT (avg( ?T22_city_area) as ?aggregation_T22_city_area_13 ) WHERE { ?T22 a :district . ?T22 :district\#city_area ?T22_city_area .        }    } }
store_product,Find the names of districts where have both city mall and village store type stores.,SELECT DISTINCT ?T1_district_name WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\#ref-district_id ?T1 .  ?T1 :district\#district_name ?T1_district_name . ?T2 :store\#type ?T2_type . ?T2 a :store . ?T13 :store_district\#ref-store_id ?T2 .  ?T1 :district\#district_name ?T1_district_name . ?T2 :store\#type ?T2_type . FILTER(?T2_type = 'City Mall') . FILTER (?T1_district_name in (?T3_district_name)) .   ?T3 a :district . ?T15 a :store_district . ?T15 :store_district\#ref-district_id ?T3 .  ?T3 :district\#district_name ?T3_district_name . ?T4 :store\#type ?T4_type . ?T4 a :store . ?T15 :store_district\#ref-store_id ?T4 .  ?T3 :district\#district_name ?T3_district_name . ?T4 :store\#type ?T4_type .  FILTER(?T4_type = 'Village Store') .             }
soccer_2,What is the total enrollment number of all colleges?,SELECT (sum( ?T1_enr) as ?aggregation_T1_enr_77 ) WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr .        }
soccer_2,How many students are enrolled in college?,SELECT (sum( ?T1_enr) as ?aggregation_T1_enr_66 ) WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr .        }
soccer_2,What is the average enrollment number?,SELECT (avg( ?T1_enr) as ?aggregation_T1_enr_164 ) WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr .        }
soccer_2,How many colleges in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :college .        }
soccer_2,How many different colleges are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :college .        }
soccer_2,How many players have more than 1000 hours of training?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#hs ?T1_hs . FILTER(?T1_hs > 1000) .        }
soccer_2,How many different players trained for more than 1000 hours?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#hs ?T1_hs . FILTER(?T1_hs > 1000) .        }
soccer_2,How many colleges has more than 15000 students?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :college . ?T1 :college\#enr ?T1_enr . FILTER(?T1_enr > 15000) .        }
soccer_2,What is the average training hours of all players?,SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_50 ) WHERE { ?T1 a :player . ?T1 :player\#hs ?T1_hs .        }
soccer_2,How many hours do the players train on average?,SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_173 ) WHERE { ?T1 a :player . ?T1 :player\#hs ?T1_hs .        }
soccer_2,Find the name and training hours of players whose hours are below 1500.,SELECT ?T1_pname ?T1_hs WHERE { ?T1 a :player . ?T1 :player\#pname ?T1_pname . ?T1 :player\#hs ?T1_hs . ?T1 :player\#hs ?T1_hs . FILTER(?T1_hs < 1500) .        }
