kg_name,question,query
geo,what state bordering oklahoma has the largest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'oklahoma') .        }    } }   ORDER BY DESC (?T1_population) LIMIT 1
geo,what state contains the highest point of those the colorado river traverses,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?T43_river_name)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_33 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation . ?T22 :highlow\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_river_name)) .       {SELECT ?T43_traverse WHERE { ?T43 a :river . ?T43 :river\#traverse ?T43_traverse . ?T43 :river\#river_name ?T43_river_name . FILTER(?T43_river_name = 'colorado') .        }    } }    } }
geo,what state has the largest capital,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_15)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_15 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,which state 's capital city is the largest,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_7)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_7 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what state has the longest river,SELECT DISTINCT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_159)) .       {SELECT DISTINCT (max(DISTINCT ?T22_length) as ?aggregation_T22_length_159 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what state has the smallest urban population,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population .        } GROUP BY ?T1_state_name  ORDER BY ASC ((sum( ?T1_population) as ?aggregation_T1_population_196 )) LIMIT 1
geo,what states border states that border colorado,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'colorado') .        }    } }
geo,what states border texas and have a major river,SELECT ?T1_state_name WHERE { ?T1 a :border_info . ?T1 :border_info\#state_name ?T1_state_name . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_border = 'texas' && ?T1_state_name in (?T22_length)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#length ?T22_length . FILTER(?T22_length > 750) .        }    } }
geo,what states border the most populous state,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = (?aggregation_T43_population_35)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_35)) .       {SELECT (max( ?T43_population) as ?aggregation_T43_population_35 ) WHERE { ?T43 a :state . ?T43 :state\#population ?T43_population .        }    } }    } }
geo,what are the states that border the state with the greatest population,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = (?aggregation_T43_population_34)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_34)) .       {SELECT (max( ?T43_population) as ?aggregation_T43_population_34 ) WHERE { ?T43 a :state . ?T43 :state\#population ?T43_population .        }    } }    } }
geo,what states border the state with the smallest area,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = (?aggregation_T43_area_129)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_129)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_129 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,which states border the state with the smallest area,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = (?aggregation_T43_area_155)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_155)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_155 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what states contain at least one major rivers,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length > 750) .        }
geo,where are mountains,SELECT ?T1_state_name WHERE { ?T1 a :mountain . ?T1 :mountain\#state_name ?T1_state_name .        }
geo,where is the highest mountain of the united states,SELECT ?T1_state_name WHERE { ?T1 a :mountain . ?T1 :mountain\#state_name ?T1_state_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?aggregation_T22_mountain_altitude_165)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_165 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude .        }    } }
geo,which state has the highest peak in the country,SELECT ?T1_state_name WHERE { ?T1 a :mountain . ?T1 :mountain\#state_name ?T1_state_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?aggregation_T22_mountain_altitude_69)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_69 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude .        }    } }
geo,where is the smallest city,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_179)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_179 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,which is the density of the state that the largest river in the united states runs through,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_length_93)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#length ?T22_length . FILTER(?T22_length = (?aggregation_T43_length_93)) .       {SELECT (max( ?T43_length) as ?aggregation_T43_length_93 ) WHERE { ?T43 a :river . ?T43 :river\#length ?T43_length .        }    } }    } }
geo,which is the highest peak not in alaska,SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_name ?T1_mountain_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?T22_state_name)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_53 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude . ?T22 :mountain\#state_name ?T22_state_name . FILTER(?T22_state_name != 'alaska') .        }    } }
geo,which rivers do not run through tennessee,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name not in (?T22_traverse)) .       {SELECT ?T22_river_name WHERE { ?T22 a :river . ?T22 :river\#river_name ?T22_river_name . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'tennessee') .        }    } }
geo,which rivers do not run through usa,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#country_name ?T1_country_name . FILTER(?T1_country_name != 'usa') .        }
geo,which rivers run through states that border the state with the capital atlanta,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?T43_capital)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_capital)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#capital ?T43_capital . FILTER(?T43_capital = 'atlanta') .        }    } }    } }
geo,which state capital has the smallest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_57)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_57 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,which state has the highest elevation,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_14)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_14 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,which state has the highest point,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_78)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_78 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what state has the highest elevation,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_175)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_175 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,in which state does the highest point in usa exist,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_124)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_124 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what state has highest elevation,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_196)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_196 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the state with the highest elevation in the united states,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_71)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_71 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the state that contains the highest point,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_19)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_19 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what state contains the highest point in the us,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_166)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_166 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,which state has the lowest elevation,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_114)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_114 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,what is the name of the state with the lowest point,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_113)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_113 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,what is the state with the lowest point,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_122)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_122 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,which state has the lowest point that borders idaho,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_lowest_elevation = (?T43_state_name) && ?T1_state_name in (?T22_state_name)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_101 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation . ?T22 :highlow\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'idaho') .        }    } }    } {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'idaho') .        }    } }
geo,which state has the smallest average urban population,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population .        } GROUP BY ?T1_state_name  ORDER BY ASC ((avg( ?T1_population) as ?aggregation_T1_population_42 )) LIMIT 1
geo,which state is mount whitney in,SELECT ?T1_state_name WHERE { ?T1 a :mountain . ?T1 :mountain\#state_name ?T1_state_name . ?T1 :mountain\#mountain_name ?T1_mountain_name . FILTER(?T1_mountain_name = 'whitney') .        }
geo,which states have a river,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse .        }
geo,which states have a major city named austin,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_city_name = 'austin' && ?T1_population > 150000) .        }
geo,how many rivers do not traverse the state with the capital albany,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_124 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse not in (?T22_capital)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#capital ?T22_capital . FILTER(?T22_capital = 'albany') .        }    } }
geo,what is the shortest river in texas,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_135 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what are the major cities in the smallest state in the us,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = (?aggregation_T43_area_151)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_151)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_151 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the population of the capital of the largest state through which the mississippi runs,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = (?T44_river_name)) .       {SELECT ?T22_capital WHERE { ?T22 a :state . ?T22 :state\#capital ?T22_capital . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?T44_river_name)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_77 ) WHERE { ?T43 a :state . ?T44 a :river . ?T44 :river\#ref-traverse ?T43 .  ?T43 :state\#area ?T43_area . ?T44 :river\#river_name ?T44_river_name . FILTER(?T44_river_name = 'mississippi') .        }    } }    } }
geo,what is the shortest river in the usa,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_194)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_194 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the shortest river,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_24)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_24 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the shortest river in the us,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_66)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_66 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the shortest river in the united states,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_133)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_133 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,which is the shortest river,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_129)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_129 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the capital of the state that borders the state that borders texas,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T43_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'texas') .        }    } }    } }
geo,what is the smallest city of the smallest state in the us,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?aggregation_T64_area_109) && ?T1_state_name in (?aggregation_T43_area_11)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_42 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_area_109)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_109)) .       {SELECT (min( ?T64_area) as ?aggregation_T64_area_109 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_11)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_11 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what state is salem the capital of,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#capital ?T1_capital . FILTER(?T1_capital = 'salem') .        }
geo,what rivers flow through the state with the largest population,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?aggregation_T43_population_159)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_159)) .       {SELECT (max( ?T43_population) as ?aggregation_T43_population_159 ) WHERE { ?T43 a :state . ?T43 :state\#population ?T43_population .        }    } }    } }
geo,what is the largest state that borders the state with the highest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_area = (?aggregation_T85_population_136) && ?T1_state_name in (?aggregation_T64_population_35)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_111 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T85_population_136)) .       {SELECT ?T43_state_name WHERE { ?T43 a :border_info . ?T43 :border_info\#state_name ?T43_state_name . ?T43 :border_info\#border ?T43_border . FILTER(?T43_border in (?aggregation_T85_population_136)) .       {SELECT ?T64_state_name WHERE { ?T64 a :state . ?T64 :state\#state_name ?T64_state_name . ?T64 :state\#population ?T64_population . FILTER(?T64_population = (?aggregation_T85_population_136)) .       {SELECT (max( ?T85_population) as ?aggregation_T85_population_136 ) WHERE { ?T85 a :state . ?T85 :state\#population ?T85_population .        }    } }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :border_info . ?T22 :border_info\#state_name ?T22_state_name . ?T22 :border_info\#border ?T22_border . FILTER(?T22_border in (?aggregation_T64_population_35)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#population ?T43_population . FILTER(?T43_population = (?aggregation_T64_population_35)) .       {SELECT (max( ?T64_population) as ?aggregation_T64_population_35 ) WHERE { ?T64 a :state . ?T64 :state\#population ?T64_population .        }    } }    } }    } }
geo,how many rivers are there in us,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_64 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name .        }
geo,name the 50 capitals in the usa,SELECT DISTINCT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital .        }
geo,how many states have a city named springfield,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_121 ) WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'springfield') .        }
geo,how many states have a city called springfield,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_132 ) WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'springfield') .        }
geo,how many states have cities named springfield,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_151 ) WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'springfield') .        }
geo,how many states have cities or towns named springfield,SELECT (count( ?T1_state_name) as ?aggregation_T1_state_name_63 ) WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'springfield') .        }
geo,what state borders the state with the smallest population,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_population_3)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_3)) .       {SELECT (min( ?T43_population) as ?aggregation_T43_population_3 ) WHERE { ?T43 a :state . ?T43 :state\#population ?T43_population .        }    } }    } }
geo,how many major cities are in texas,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_113 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = 'texas') .        }
geo,how many big cities are in texas,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_61 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = 'texas') .        }
geo,how many major cities are there in texas,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_117 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = 'texas') .        }
geo,how high are the highest points of all the states,SELECT ?T1_highest_elevation WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation .        }
geo,how many states does the missouri run through,SELECT (count( ?T1_traverse) as ?aggregation_T1_traverse_59 ) WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'missouri') .        }
geo,how many states does the missouri river flow through,SELECT (count( ?T1_traverse) as ?aggregation_T1_traverse_194 ) WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'missouri') .        }
geo,how many states does the missouri river run through,SELECT (count( ?T1_traverse) as ?aggregation_T1_traverse_108 ) WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'missouri') .        }
geo,what is the longest river in the smallest state in the usa,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?aggregation_T64_area_191) && ?T1_traverse in (?aggregation_T43_area_100)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_127 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse in (?aggregation_T64_area_191)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_191)) .       {SELECT (min( ?T64_area) as ?aggregation_T64_area_191 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_100)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_100 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the average population per square km in pennsylvania,SELECT ?T1_population / ?T1_area WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'pennsylvania') .        }
geo,what states border states that border states that border florida,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T43_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'florida') .        }    } }    } }
geo,how many states border at least one other state,SELECT DISTINCT (count(DISTINCT ?T1_state_name) as ?aggregation_T1_state_name_198 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#state_name ?T1_state_name .        }
geo,what is the height of the highest mountain in texas,SELECT DISTINCT (max(DISTINCT ?T1_highest_elevation) as ?aggregation_T1_highest_elevation_35 ) WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
