kg_name,question,query
city_record,What is id of the city that hosted events in the most recent year?,SELECT ?T1_host_city WHERE { ?T1 a :hosting_city . ?T1 :hosting_city\#host_city ?T1_host_city . ?T1 :hosting_city\#year ?T1_year .        }   ORDER BY DESC (?T1_year) LIMIT 1
city_record,Find the match ids of the cities that hosted competition '1994 FIFA World Cup qualification'?,SELECT ?T1_match_id WHERE { ?T1 a :match . ?T1 :match\#match_id ?T1_match_id . ?T1 :match\#competition ?T1_competition . FILTER(?T1_competition = '1994 FIFA World Cup qualification') .        }
city_record,What is the match id of the competition called '1994 FIFA World Cup qualification'?,SELECT ?T1_match_id WHERE { ?T1 a :match . ?T1 :match\#match_id ?T1_match_id . ?T1 :match\#competition ?T1_competition . FILTER(?T1_competition = '1994 FIFA World Cup qualification') .        }
city_record,Find the cities which were once a host city after 2010?,SELECT ?T1_city WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :hosting_city\#ref-host_city ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :hosting_city\#year ?T2_year . FILTER(?T2_year > 2010) .        }
city_record,Which cities served as a host city after 2010?,SELECT ?T1_city WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :hosting_city\#ref-host_city ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :hosting_city\#year ?T2_year . FILTER(?T2_year > 2010) .        }
city_record,Which city has hosted the most events?,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :hosting_city\#ref-host_city ?T1 .  ?T1 :city\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1
city_record,What is the venue of the competition '1994 FIFA World Cup qualification' hosted by 'Nanjing ( Jiangsu )'?,SELECT ?T1_venue WHERE { ?T1 a :match . ?T13 a :hosting_city . ?T13 :hosting_city\#ref-match_id ?T1 .  ?T1 :match\#venue ?T1_venue . ?T2 :city\#city ?T2_city . ?T1 :match\#competition ?T1_competition . ?T2 a :city . ?T13 :hosting_city\#ref-host_city ?T2 .  ?T1 :match\#venue ?T1_venue . ?T2 :city\#city ?T2_city . ?T1 :match\#competition ?T1_competition . FILTER(?T2_city = 'Nanjing ( Jiangsu )' && ?T1_competition = '1994 FIFA World Cup qualification') .        }
city_record,Give me the temperature of Shanghai in January.,SELECT ?T1_jan WHERE { ?T1 a :temperature . ?T2 a :city . ?T1 :temperature\#ref-city_id ?T2 .  ?T1 :temperature\#jan ?T1_jan . ?T2 :city\#city ?T2_city . FILTER(?T2_city = 'Shanghai') .        }
city_record,What is the temperature of 'Shanghai' city in January?,SELECT ?T1_jan WHERE { ?T1 a :temperature . ?T2 a :city . ?T1 :temperature\#ref-city_id ?T2 .  ?T1 :temperature\#jan ?T1_jan . ?T2 :city\#city ?T2_city . FILTER(?T2_city = 'Shanghai') .        }
city_record,What is the host year of city 'Taizhou ( Zhejiang )'?,SELECT ?T1_year WHERE { ?T1 a :hosting_city . ?T2 a :city . ?T1 :hosting_city\#ref-host_city ?T2 .  ?T1 :hosting_city\#year ?T1_year . ?T2 :city\#city ?T2_city . FILTER(?T2_city = 'Taizhou ( Zhejiang )') .        }
city_record,IN which year did city 'Taizhou ( Zhejiang )' serve as a host city?,SELECT ?T1_year WHERE { ?T1 a :hosting_city . ?T2 a :city . ?T1 :hosting_city\#ref-host_city ?T2 .  ?T1 :hosting_city\#year ?T1_year . ?T2 :city\#city ?T2_city . FILTER(?T2_city = 'Taizhou ( Zhejiang )') .        }
city_record,Which three cities have the largest regional population?,SELECT ?T1_city WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population .        }   ORDER BY DESC (?T1_regional_population) LIMIT 1
city_record,What are the three largest cities in terms of regional population?,SELECT ?T1_city WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population .        }   ORDER BY DESC (?T1_regional_population) LIMIT 1
city_record,Which city has the lowest GDP? Please list the city name and its GDP.,SELECT ?T1_city ?T1_gdp WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#gdp ?T1_gdp . ?T1 :city\#gdp ?T1_gdp .        }   ORDER BY ASC (?T1_gdp) LIMIT 1
city_record,Which city has the highest temperature in February?,SELECT ?T1_city WHERE { ?T1 a :city . ?T2 a :temperature . ?T2 :temperature\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :temperature\#feb ?T2_feb .        }   ORDER BY DESC (?T2_feb) LIMIT 1
city_record,Give me a list of cities whose temperature in Mar is lower than that in July and which have also served as host cities?,"SELECT DISTINCT ?T1_city WHERE { ?T1 a :city . ?T2 a :temperature . ?T2 :temperature\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :temperature\#mar ?T2_mar . FILTER(?T2_mar < [0, 164, False]) . FILTER (?T1_city in (?T3_city)) .   ?T3 a :city . ?T3 :city\#city ?T3_city .              }"
city_record,Which cities have lower temperature in March than in July and have been once host cities?,"SELECT DISTINCT ?T1_city WHERE { ?T1 a :city . ?T2 a :temperature . ?T2 :temperature\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :temperature\#mar ?T2_mar . FILTER(?T2_mar < [0, 164, False]) . FILTER (?T1_city in (?T3_city)) .   ?T3 a :city . ?T3 :city\#city ?T3_city .              }"
city_record,Give me a list of cities whose temperature in Mar is lower than that in Dec and which have never been host cities.,"SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T2 a :temperature . ?T2 :temperature\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :temperature\#mar ?T2_mar . FILTER(?T2_mar < [0, 169, False]) .   }}  MINUS {SELECT (?T3_city as ?col1) WHERE { ?T3 a :city . ?T3 :city\#city ?T3_city .        }     } }"
city_record,Which cities have lower temperature in March than in Dec and have never served as host cities?,"SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T2 a :temperature . ?T2 :temperature\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :temperature\#mar ?T2_mar . FILTER(?T2_mar < [0, 169, False]) .   }}  MINUS {SELECT (?T3_city as ?col1) WHERE { ?T3 a :city . ?T3 :city\#city ?T3_city .        }     } }"
city_record,Please give me a list of cities whose regional population is over 10000000.,SELECT ?T1_city WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population . FILTER(?T1_regional_population > 10000000) .        }
city_record,Which cities have regional population above 10000000?,SELECT ?T1_city WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population . FILTER(?T1_regional_population > 10000000) .        }
city_record,Please give me a list of cities whose regional population is over 8000000 or under 5000000.,SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population . FILTER(?T1_regional_population > 10000000) .   }} UNION {SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population . FILTER(?T1_regional_population < 5000000) .        }      } }
city_record,Which cities have regional population above 8000000 or below 5000000?,SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population . FILTER(?T1_regional_population > 10000000) .   }} UNION {SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T1 :city\#city ?T1_city . ?T1 :city\#regional_population ?T1_regional_population . FILTER(?T1_regional_population < 5000000) .        }      } }
city_record,Find the number of matches in different competitions.,SELECT (count( *) as ?aggregation_all) ?T1_competition WHERE { ?T1 a :match . ?T1 :match\#competition ?T1_competition .        } GROUP BY ?T1_competition
city_record,List venues of all matches in the order of their dates starting from the most recent one.,SELECT ?T1_venue WHERE { ?T1 a :match . ?T1 :match\#venue ?T1_venue . ?T1 :match\#date ?T1_date .        }  ORDER BY DESC (?T1_date)
city_record,what is the GDP of the city with the largest population.,SELECT ?T1_gdp WHERE { ?T1 a :city . ?T1 :city\#gdp ?T1_gdp . ?T1 :city\#regional_population ?T1_regional_population .        }   ORDER BY DESC (?T1_regional_population) LIMIT 1
city_record,What are the GDP and population of the city that already served as a host more than once?,SELECT ?T1_gdp ?T1_regional_population WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :hosting_city\#ref-host_city ?T1 .  ?T1 :city\#gdp ?T1_gdp . ?T1 :city\#regional_population ?T1_regional_population .        } GROUP BY ?T1_gdp ?T1_regional_population   HAVING(count( *)  > 1)
e_government,"List every individual's first name, middle name and last name in alphabetical order by last name.",SELECT ?T1_individual_first_name ?T1_individual_middle_name ?T1_individual_last_name WHERE { ?T1 a :individuals . ?T1 :individuals\#individual_first_name ?T1_individual_first_name . ?T1 :individuals\#individual_middle_name ?T1_individual_middle_name . ?T1 :individuals\#individual_last_name ?T1_individual_last_name . ?T1 :individuals\#individual_last_name ?T1_individual_last_name .        }  ORDER BY ASC (?T1_individual_last_name)
e_government,List all the types of forms.,SELECT DISTINCT ?T1_form_type_code WHERE { ?T1 a :forms . ?T1 :forms\#form_type_code ?T1_form_type_code .        }
e_government,What are the different types of forms?,SELECT DISTINCT ?T1_form_type_code WHERE { ?T1 a :forms . ?T1 :forms\#form_type_code ?T1_form_type_code .        }
e_government,Find the name of the most popular party form.,SELECT ?T1_form_name (count( *) as ?aggregation_all) WHERE { ?T1 a :forms . ?T2 a :party_forms . ?T2 :party_forms\#ref-form_id ?T1 .  ?T1 :forms\#form_name ?T1_form_name .        } GROUP BY ?T1_form_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_government,What is the name of the party form that is most common?,SELECT ?T1_form_name (count( *) as ?aggregation_all) WHERE { ?T1 a :forms . ?T2 a :party_forms . ?T2 :party_forms\#ref-form_id ?T1 .  ?T1 :forms\#form_name ?T1_form_name .        } GROUP BY ?T1_form_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_government,Find the payment method and phone of the party with email 'enrico09@example.com'.,SELECT ?T1_payment_method_code ?T1_party_phone WHERE { ?T1 a :parties . ?T1 :parties\#payment_method_code ?T1_payment_method_code . ?T1 :parties\#party_phone ?T1_party_phone . ?T1 :parties\#party_email ?T1_party_email . FILTER(?T1_party_email = 'enrico09@example.com') .        }
e_government,Find the emails of parties with the most popular party form.,SELECT ?T1_party_email WHERE { ?T1 a :parties . ?T2 a :party_forms . ?T2 :party_forms\#ref-party_id ?T1 .  ?T1 :parties\#party_email ?T1_party_email . ?T2 :party_forms\#form_id ?T2_form_id . FILTER(?T2_form_id = (?T23_form_id)) .       {SELECT ?T23_form_id (count( *) as ?aggregation_all) WHERE { ?T23 a :party_forms . ?T23 :party_forms\#form_id ?T23_form_id .        } GROUP BY ?T23_form_id  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
e_government,List all the name of organizations in order of the date formed.,SELECT ?T1_organization_name WHERE { ?T1 a :organizations . ?T1 :organizations\#organization_name ?T1_organization_name . ?T1 :organizations\#date_formed ?T1_date_formed .        }  ORDER BY ASC (?T1_date_formed)
e_government,Find the name of the youngest organization.,SELECT ?T1_organization_name WHERE { ?T1 a :organizations . ?T1 :organizations\#organization_name ?T1_organization_name . ?T1 :organizations\#date_formed ?T1_date_formed .        }   ORDER BY DESC (?T1_date_formed) LIMIT 1
e_government,What is the name of the organization that was formed most recently?,SELECT ?T1_organization_name WHERE { ?T1 a :organizations . ?T1 :organizations\#organization_name ?T1_organization_name . ?T1 :organizations\#date_formed ?T1_date_formed .        }   ORDER BY DESC (?T1_date_formed) LIMIT 1
e_government,Find the last name of the latest contact individual of the organization 'Labour Party'.,SELECT ?T1_individual_last_name WHERE { ?T1 a :individuals . ?T2 a :organization_contact_individuals . ?T2 :organization_contact_individuals\#ref-individual_id ?T1 .  ?T1 :individuals\#individual_last_name ?T1_individual_last_name . ?T2 :organization_contact_individuals\#date_contact_to ?T2_date_contact_to . ?T3 :organizations\#organization_name ?T3_organization_name . ?T3 a :organizations . ?T2 :organization_contact_individuals\#ref-organization_id ?T3 .  ?T1 :individuals\#individual_last_name ?T1_individual_last_name . ?T2 :organization_contact_individuals\#date_contact_to ?T2_date_contact_to . ?T3 :organizations\#organization_name ?T3_organization_name . FILTER(?T3_organization_name = 'Labour Party') .        }   ORDER BY DESC (?T2_date_contact_to) LIMIT 1
e_government,Find the last name of the first ever contact person of the organization with the highest UK Vat number.,SELECT ?T1_individual_last_name WHERE { ?T1 a :individuals . ?T2 a :organization_contact_individuals . ?T2 :organization_contact_individuals\#ref-individual_id ?T1 .  ?T1 :individuals\#individual_last_name ?T1_individual_last_name . ?T2 :organization_contact_individuals\#date_contact_to ?T2_date_contact_to . ?T3 :organizations\#uk_vat_number ?T3_uk_vat_number . ?T3 a :organizations . ?T2 :organization_contact_individuals\#ref-organization_id ?T3 .  ?T1 :individuals\#individual_last_name ?T1_individual_last_name . ?T2 :organization_contact_individuals\#date_contact_to ?T2_date_contact_to . ?T3 :organizations\#uk_vat_number ?T3_uk_vat_number . FILTER(?T3_uk_vat_number = (?aggregation_T24_uk_vat_number_6)) .       {SELECT (max( ?T24_uk_vat_number) as ?aggregation_T24_uk_vat_number_6 ) WHERE { ?T24 a :organizations . ?T24 :organizations\#uk_vat_number ?T24_uk_vat_number .        }    } }   ORDER BY ASC (?T2_date_contact_to) LIMIT 1
e_government,How many services are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :services .        }
e_government,Find name of the services that has never been used.,SELECT distinct?col1 WHERE { { SELECT (?T1_service_name as ?col1) WHERE { ?T1 a :services . ?T1 :services\#service_name ?T1_service_name .   }}  MINUS {SELECT (?T2_service_name as ?col1) WHERE { ?T2 a :services . ?T2 :services\#service_name ?T2_service_name .        }     } }
e_government,What are the names of the services that have never been used?,SELECT distinct?col1 WHERE { { SELECT (?T1_service_name as ?col1) WHERE { ?T1 a :services . ?T1 :services\#service_name ?T1_service_name .   }}  MINUS {SELECT (?T2_service_name as ?col1) WHERE { ?T2 a :services . ?T2 :services\#service_name ?T2_service_name .        }     } }
e_government,Find the name of all the cities and states.,SELECT distinct?col1 WHERE { { SELECT (?T1_town_city as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#town_city ?T1_town_city .   }} UNION {SELECT (?T1_state_province_county as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county .        }      } }
e_government,What are the names of all cities and states?,SELECT distinct?col1 WHERE { { SELECT (?T1_town_city as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#town_city ?T1_town_city .   }} UNION {SELECT (?T1_state_province_county as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county .        }      } }
e_government,How many cities are there in state 'Colorado'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county . FILTER(?T1_state_province_county = 'Colorado') .        }
e_government,Find the payment method code used by more than 3 parties.,SELECT ?T1_payment_method_code WHERE { ?T1 a :parties . ?T1 :parties\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code   HAVING(count( *)  > 3)
e_government,Find the name of organizations whose names contain 'Party'.,"SELECT ?T1_organization_name WHERE { ?T1 a :organizations . ?T1 :organizations\#organization_name ?T1_organization_name . ?T1 :organizations\#organization_name ?T1_organization_name . FILTER(contains (?T1_organization_name, 'Party')) .        }"
e_government,What are the names of organizations that contain the word 'Party'?,"SELECT ?T1_organization_name WHERE { ?T1 a :organizations . ?T1 :organizations\#organization_name ?T1_organization_name . ?T1 :organizations\#organization_name ?T1_organization_name . FILTER(contains (?T1_organization_name, 'Party')) .        }"
e_government,How many distinct payment methods are used by parties?,SELECT DISTINCT (count(DISTINCT ?T1_payment_method_code) as ?aggregation_T1_payment_method_code_96 ) WHERE { ?T1 a :parties . ?T1 :parties\#payment_method_code ?T1_payment_method_code .        }
e_government,Count the number of different payment method codes used by parties.,SELECT DISTINCT (count(DISTINCT ?T1_payment_method_code) as ?aggregation_T1_payment_method_code_112 ) WHERE { ?T1 a :parties . ?T1 :parties\#payment_method_code ?T1_payment_method_code .        }
e_government,Return the party email that has used party services the greatest number of times.,SELECT ?T1_party_email (count( *) as ?aggregation_all) WHERE { ?T1 a :parties . ?T2 a :party_services . ?T2 :party_services\#ref-customer_id ?T1 .  ?T1 :parties\#party_email ?T1_party_email .        } GROUP BY ?T1_party_email  ORDER BY DESC (?aggregation_all) LIMIT 1
e_government,Which state can address '6862 Kaitlyn Knolls' possibly be in?,"SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county . ?T1 :addresses\#line_1_number_building ?T1_line_1_number_building . FILTER(contains (?T1_line_1_number_building, '6862 Kaitlyn Knolls')) .        }"
e_government,Return the name of the organization which has the most contact individuals.,SELECT ?T1_organization_name (count( *) as ?aggregation_all) WHERE { ?T1 a :organizations . ?T2 a :organization_contact_individuals . ?T2 :organization_contact_individuals\#ref-organization_id ?T1 .  ?T1 :organizations\#organization_name ?T1_organization_name .        } GROUP BY ?T1_organization_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_government,Find the last name of the individuals that have been contact individuals of an organization.,SELECT DISTINCT ?T1_individual_last_name WHERE { ?T1 a :individuals . ?T1 :individuals\#individual_last_name ?T1_individual_last_name .        }
school_bus,How many drivers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :driver .        }
school_bus,"Show the name, home city, and age for all drivers.",SELECT ?T1_name ?T1_home_city ?T1_age WHERE { ?T1 a :driver . ?T1 :driver\#name ?T1_name . ?T1 :driver\#home_city ?T1_home_city . ?T1 :driver\#age ?T1_age .        }
school_bus,Show the party and the number of drivers in each party.,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :driver . ?T1 :driver\#party ?T1_party .        } GROUP BY ?T1_party
school_bus,Show the name of drivers in descending order of age.,SELECT ?T1_name WHERE { ?T1 a :driver . ?T1 :driver\#name ?T1_name . ?T1 :driver\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
school_bus,Show all different home cities.,SELECT DISTINCT ?T1_home_city WHERE { ?T1 a :driver . ?T1 :driver\#home_city ?T1_home_city .        }
school_bus,Show the home city with the most number of drivers.,SELECT ?T1_home_city (count( *) as ?aggregation_all) WHERE { ?T1 a :driver . ?T1 :driver\#home_city ?T1_home_city .        } GROUP BY ?T1_home_city  ORDER BY DESC (?aggregation_all) LIMIT 1
school_bus,Show the party with drivers from Hartford and drivers older than 40.,SELECT ?T1_party WHERE { ?T1 a :driver . ?T1 :driver\#party ?T1_party . ?T1 :driver\#home_city ?T1_home_city . ?T1 :driver\#age ?T1_age . FILTER(?T1_home_city = 'Hartford' && ?T1_age > 40) .        }
school_bus,Show home city where at least two drivers older than 40 are from.,SELECT ?T1_home_city WHERE { ?T1 a :driver . ?T1 :driver\#home_city ?T1_home_city . ?T1 :driver\#age ?T1_age . FILTER(?T1_age > 40) .        } GROUP BY ?T1_home_city   HAVING(count( *)  >= 2)
school_bus,Show all home cities except for those having a driver older than 40.,SELECT distinct?col1 WHERE { { SELECT (?T1_home_city as ?col1) WHERE { ?T1 a :driver . ?T1 :driver\#home_city ?T1_home_city .   }}  MINUS {SELECT (?T2_home_city as ?col1) WHERE { ?T2 a :driver . ?T2 :driver\#home_city ?T2_home_city . ?T2 :driver\#age ?T2_age . FILTER(?T2_age > 40) .        }     } }
school_bus,Show the names of the drivers without a school bus.,SELECT ?T1_name WHERE { ?T1 a :driver . ?T1 :driver\#name ?T1_name . ?T1 :driver\#driver_id ?T1_driver_id . FILTER(?T1_driver_id not in (?T22_driver_id)) .       {SELECT ?T22_driver_id WHERE { ?T22 a :school_bus . ?T22 :school_bus\#driver_id ?T22_driver_id .        }    } }
school_bus,Show the types of schools that have two schools.,SELECT ?T1_type WHERE { ?T1 a :school . ?T1 :school\#type ?T1_type .        } GROUP BY ?T1_type   HAVING(count( *)  = 2)
school_bus,Show the school name and driver name for all school buses.,SELECT ?T1_school ?T2_name WHERE { ?T1 a :school . ?T13 a :school_bus . ?T13 :school_bus\#ref-school_id ?T1 .  ?T1 :school\#school ?T1_school . ?T2 :driver\#name ?T2_name . ?T2 a :driver . ?T13 :school_bus\#ref-driver_id ?T2 .  ?T1 :school\#school ?T1_school . ?T2 :driver\#name ?T2_name .        }
school_bus,Show the school name and type for schools without a school bus.,SELECT ?T1_school ?T1_type WHERE { ?T1 a :school . ?T1 :school\#school ?T1_school . ?T1 :school\#type ?T1_type . ?T1 :school\#school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) .       {SELECT ?T22_school_id WHERE { ?T22 a :school_bus . ?T22 :school_bus\#school_id ?T22_school_id .        }    } }
school_bus,Show the type of school and the number of buses for each type.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T2 a :school_bus . ?T2 :school_bus\#ref-school_id ?T1 .  ?T1 :school\#type ?T1_type .        } GROUP BY ?T1_type
school_bus,How many drivers are from Hartford city or younger than 40?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :driver . ?T1 :driver\#home_city ?T1_home_city . ?T1 :driver\#age ?T1_age . FILTER(?T1_home_city = 'Hartford' || ?T1_age < 40) .        }
school_bus,List names for drivers from Hartford city and younger than 40.,SELECT ?T1_name WHERE { ?T1 a :driver . ?T1 :driver\#name ?T1_name . ?T1 :driver\#home_city ?T1_home_city . ?T1 :driver\#age ?T1_age . FILTER(?T1_home_city = 'Hartford' && ?T1_age < 40) .        }
school_bus,find the name of driver who is driving the school bus with the longest working history.,SELECT ?T1_name WHERE { ?T1 a :driver . ?T2 a :school_bus . ?T2 :school_bus\#ref-driver_id ?T1 .  ?T1 :driver\#name ?T1_name . ?T2 :school_bus\#years_working ?T2_years_working .        }   ORDER BY DESC (?T2_years_working) LIMIT 1
flight_company,How many flights have a velocity larger than 200?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#velocity ?T1_velocity . FILTER(?T1_velocity > 200) .        }
flight_company,"List the vehicle flight number, date and pilot of all the flights, ordered by altitude.",SELECT ?T1_vehicle_flight_number ?T1_date ?T1_pilot WHERE { ?T1 a :flight . ?T1 :flight\#vehicle_flight_number ?T1_vehicle_flight_number . ?T1 :flight\#date ?T1_date . ?T1 :flight\#pilot ?T1_pilot . ?T1 :flight\#altitude ?T1_altitude .        }  ORDER BY ASC (?T1_altitude)
flight_company,"List the id, country, city and name of the airports ordered alphabetically by the name.",SELECT ?T1_id ?T1_country ?T1_city ?T1_name WHERE { ?T1 a :airport . ?T1 :airport\#id ?T1_id . ?T1 :airport\#country ?T1_country . ?T1 :airport\#city ?T1_city . ?T1 :airport\#name ?T1_name . ?T1 :airport\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
flight_company,What is maximum group equity shareholding of the companies?,SELECT (max( ?T1_group_equity_shareholding) as ?aggregation_T1_group_equity_shareholding_197 ) WHERE { ?T1 a :operate_company . ?T1 :operate_company\#group_equity_shareholding ?T1_group_equity_shareholding .        }
flight_company,What is the velocity of the pilot named 'Thompson'?,SELECT (avg( ?T1_velocity) as ?aggregation_T1_velocity_9 ) WHERE { ?T1 a :flight . ?T1 :flight\#velocity ?T1_velocity . ?T1 :flight\#pilot ?T1_pilot . FILTER(?T1_pilot = 'Thompson') .        }
flight_company,What are the names of the airports which are not in the country 'Iceland'?,SELECT ?T1_name WHERE { ?T1 a :airport . ?T1 :airport\#name ?T1_name . ?T1 :airport\#country ?T1_country . FILTER(?T1_country != 'Iceland') .        }
flight_company,"What is the id, name and IATA code of the airport that had most number of flights?",SELECT ?T1_id (count( *) as ?aggregation_all) ?T1_name ?T1_iata WHERE { ?T1 a :airport . ?T2 a :flight . ?T2 :flight\#ref-airport_id ?T1 .  ?T1 :airport\#id ?T1_id . ?T1 :airport\#name ?T1_name . ?T1 :airport\#iata ?T1_iata .        } GROUP BY ?T1_id ?T1_name ?T1_iata  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_company,How many airports haven't the pilot 'Thompson' driven an aircraft?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airport . ?T1 :airport\#id ?T1_id . FILTER(?T1_id not in (?T22_pilot)) .       {SELECT ?T22_airport_id WHERE { ?T22 a :flight . ?T22 :flight\#airport_id ?T22_airport_id . ?T22 :flight\#pilot ?T22_pilot . FILTER(?T22_pilot = 'Thompson') .        }    } }
flight_company,List the name of the pilots who have flied for both a company that mainly provide 'Cargo' services and a company that runs 'Catering services' activities.,SELECT DISTINCT ?T1_pilot WHERE { ?T1 a :flight . ?T2 a :operate_company . ?T1 :flight\#ref-company_id ?T2 .  ?T1 :flight\#pilot ?T1_pilot . ?T2 :operate_company\#principal_activities ?T2_principal_activities . FILTER(?T2_principal_activities = 'Cargo') . FILTER (?T1_pilot in (?T3_pilot)) .   ?T3 a :flight . ?T4 a :operate_company . ?T3 :flight\#ref-company_id ?T4 .  ?T3 :flight\#pilot ?T3_pilot . ?T4 :operate_company\#principal_activities ?T4_principal_activities .  FILTER(?T4_principal_activities = 'Catering services') .             }
flight_company,Which of the airport names contains the word 'international'?,"SELECT ?T1_name WHERE { ?T1 a :airport . ?T1 :airport\#name ?T1_name . ?T1 :airport\#name ?T1_name . FILTER(contains (?T1_name, 'international')) .        }"
flight_company,How many companies operates airlines in each airport?,SELECT ?T1_id (count( *) as ?aggregation_all) WHERE { ?T1 a :airport . ?T13 a :flight . ?T13 :flight\#ref-airport_id ?T1 .  ?T1 :airport\#id ?T1_id . ?T2 a :operate_company . ?T13 :flight\#ref-company_id ?T2 .  ?T1 :airport\#id ?T1_id .        } GROUP BY ?T1_id
flight_company,how many airports are there in each country?,SELECT (count( *) as ?aggregation_all) ?T1_country WHERE { ?T1 a :airport . ?T1 :airport\#country ?T1_country .        } GROUP BY ?T1_country
flight_company,which countries have more than 2 airports?,SELECT ?T1_country WHERE { ?T1 a :airport . ?T1 :airport\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  > 2)
flight_company,which pilot is in charge of the most number of flights?,SELECT ?T1_pilot (count( *) as ?aggregation_all) WHERE { ?T1 a :flight . ?T1 :flight\#pilot ?T1_pilot .        } GROUP BY ?T1_pilot  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_docs_and_epenses,How many accounts do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts .        }
cre_docs_and_epenses,Show all account ids and account details.,SELECT ?T1_account_id ?T1_account_details WHERE { ?T1 a :accounts . ?T1 :accounts\#account_id ?T1_account_id . ?T1 :accounts\#account_details ?T1_account_details .        }
cre_docs_and_epenses,What are the ids and details of all accounts?,SELECT ?T1_account_id ?T1_account_details WHERE { ?T1 a :accounts . ?T1 :accounts\#account_id ?T1_account_id . ?T1 :accounts\#account_details ?T1_account_details .        }
cre_docs_and_epenses,How many statements do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :statements .        }
cre_docs_and_epenses,List all statement ids and statement details.,SELECT ?T1_statement_id ?T1_statement_details WHERE { ?T1 a :statements . ?T1 :statements\#statement_id ?T1_statement_id . ?T1 :statements\#statement_details ?T1_statement_details .        }
cre_docs_and_epenses,What are the ids and details of all statements?,SELECT ?T1_statement_id ?T1_statement_details WHERE { ?T1 a :statements . ?T1 :statements\#statement_id ?T1_statement_id . ?T1 :statements\#statement_details ?T1_statement_details .        }
cre_docs_and_epenses,"Show statement id, statement detail, account detail for accounts.",SELECT ?T1_statement_id ?T2_statement_details ?T1_account_details WHERE { ?T1 a :accounts . ?T2 a :statements . ?T1 :accounts\#ref-statement_id ?T2 .  ?T1 :accounts\#statement_id ?T1_statement_id . ?T2 :statements\#statement_details ?T2_statement_details . ?T1 :accounts\#account_details ?T1_account_details .        }
cre_docs_and_epenses,Show all statement id and the number of accounts for each statement.,SELECT ?T1_statement_id (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T1 :accounts\#statement_id ?T1_statement_id .        } GROUP BY ?T1_statement_id
cre_docs_and_epenses,Show the statement id and the statement detail for the statement with most number of accounts.,SELECT ?T1_statement_id (count( *) as ?aggregation_all) ?T2_statement_details WHERE { ?T1 a :accounts . ?T2 a :statements . ?T1 :accounts\#ref-statement_id ?T2 .  ?T1 :accounts\#statement_id ?T1_statement_id . ?T2 :statements\#statement_details ?T2_statement_details .        } GROUP BY ?T1_statement_id ?T2_statement_details  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_docs_and_epenses,"List the document type code, document name, and document description for the document with name 'Noel CV' or name 'King Book'.",SELECT ?T1_document_type_code ?T1_document_name ?T1_document_description WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_description ?T1_document_description . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_name ?T1_document_name . FILTER(?T1_document_name = 'Noel CV' || ?T1_document_name = 'King Book') .        }
cre_docs_and_epenses,Show the ids and names of all documents.,SELECT ?T1_document_id ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_name ?T1_document_name .        }
cre_docs_and_epenses,What are the ids and names for each of the documents?,SELECT ?T1_document_id ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_name ?T1_document_name .        }
cre_docs_and_epenses,Find names and ids of all documents with document type code BK.,SELECT ?T1_document_name ?T1_document_id WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'BK') .        }
cre_docs_and_epenses,What are the names and ids of documents that have the type code BK?,SELECT ?T1_document_name ?T1_document_id WHERE { ?T1 a :documents . ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'BK') .        }
cre_docs_and_epenses,How many documents are with document type code BK for each product id?,SELECT (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a :documents . ?T1 :documents\#project_id ?T1_project_id . ?T1 :documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'BK') .        } GROUP BY ?T1_project_id
