kg_name,question,query
solvency_ii,Show the names of products and the number of events they are in.,SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :products_in_events\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name
solvency_ii,Show the names of products that are in at least two events.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :products_in_events\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name   HAVING(count( *)  >= 2)
solvency_ii,Show the names of products that are in at least two events in ascending alphabetical order of product name.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :products_in_events\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name ORDER BY ASC (?T1_product_name)  HAVING(count( *)  >= 2)
solvency_ii,List the names of products that are not in any event.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_id ?T1_product_id . FILTER(?T1_product_id not in (?T22_product_id)) .       {SELECT ?T22_product_id WHERE { ?T22 a :products_in_events . ?T22 :products_in_events\#product_id ?T22_product_id .        }    } }
entertainment_awards,How many artworks are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artwork .        }
entertainment_awards,List the name of artworks in ascending alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :artwork . ?T1 :artwork\#name ?T1_name . ?T1 :artwork\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
entertainment_awards,List the name of artworks whose type is not 'Program Talent Show'.,SELECT ?T1_name WHERE { ?T1 a :artwork . ?T1 :artwork\#name ?T1_name . ?T1 :artwork\#type ?T1_type . FILTER(?T1_type != 'Program Talent Show') .        }
entertainment_awards,What are the names and locations of festivals?,SELECT ?T1_festival_name ?T1_location WHERE { ?T1 a :festival_detail . ?T1 :festival_detail\#festival_name ?T1_festival_name . ?T1 :festival_detail\#location ?T1_location .        }
entertainment_awards,What are the names of festivals held in year 2007?,SELECT ?T1_festival_name WHERE { ?T1 a :festival_detail . ?T1 :festival_detail\#festival_name ?T1_festival_name . ?T1 :festival_detail\#year ?T1_year . FILTER(?T1_year = 2007) .        }
entertainment_awards,What is the average number of audience for festivals?,SELECT (avg( ?T1_num_of_audience) as ?aggregation_T1_num_of_audience_76 ) WHERE { ?T1 a :festival_detail . ?T1 :festival_detail\#num_of_audience ?T1_num_of_audience .        }
entertainment_awards,Show the names of the three most recent festivals.,SELECT ?T1_festival_name WHERE { ?T1 a :festival_detail . ?T1 :festival_detail\#festival_name ?T1_festival_name . ?T1 :festival_detail\#year ?T1_year .        }   ORDER BY DESC (?T1_year) LIMIT 1
entertainment_awards,"For each nomination, show the name of the artwork and name of the festival where it is nominated.",SELECT ?T1_name ?T2_festival_name WHERE { ?T1 a :artwork . ?T13 a :nomination . ?T13 :nomination\#ref-artwork_id ?T1 .  ?T1 :artwork\#name ?T1_name . ?T2 :festival_detail\#festival_name ?T2_festival_name . ?T2 a :festival_detail . ?T13 :nomination\#ref-festival_id ?T2 .  ?T1 :artwork\#name ?T1_name . ?T2 :festival_detail\#festival_name ?T2_festival_name .        }
entertainment_awards,Show distinct types of artworks that are nominated in festivals in 2007.,SELECT DISTINCT ?T1_type WHERE { ?T1 a :artwork . ?T13 a :nomination . ?T13 :nomination\#ref-artwork_id ?T1 .  ?T1 :artwork\#type ?T1_type . ?T2 :festival_detail\#year ?T2_year . ?T2 a :festival_detail . ?T13 :nomination\#ref-festival_id ?T2 .  ?T1 :artwork\#type ?T1_type . ?T2 :festival_detail\#year ?T2_year . FILTER(?T2_year = 2007) .        }
entertainment_awards,Show the names of artworks in ascending order of the year they are nominated in.,SELECT ?T1_name WHERE { ?T1 a :artwork . ?T13 a :nomination . ?T13 :nomination\#ref-artwork_id ?T1 .  ?T1 :artwork\#name ?T1_name . ?T2 :festival_detail\#year ?T2_year . ?T2 a :festival_detail . ?T13 :nomination\#ref-festival_id ?T2 .  ?T1 :artwork\#name ?T1_name . ?T2 :festival_detail\#year ?T2_year .        }  ORDER BY ASC (?T2_year)
entertainment_awards,Show the names of festivals that have nominated artworks of type 'Program Talent Show'.,SELECT ?T1_festival_name WHERE { ?T1 a :festival_detail . ?T13 a :nomination . ?T13 :nomination\#ref-festival_id ?T1 .  ?T1 :festival_detail\#festival_name ?T1_festival_name . ?T2 :artwork\#type ?T2_type . ?T2 a :artwork . ?T13 :nomination\#ref-artwork_id ?T2 .  ?T1 :festival_detail\#festival_name ?T1_festival_name . ?T2 :artwork\#type ?T2_type . FILTER(?T2_type = 'Program Talent Show') .        }
entertainment_awards,Show the ids and names of festivals that have at least two nominations for artworks.,SELECT ?T1_festival_id ?T2_festival_name WHERE { ?T1 a :nomination . ?T2 a :festival_detail . ?T1 :nomination\#ref-festival_id ?T2 .  ?T1 :nomination\#festival_id ?T1_festival_id . ?T2 :festival_detail\#festival_name ?T2_festival_name .        } GROUP BY ?T1_festival_id ?T2_festival_name   HAVING(count( *)  >= 2)
entertainment_awards,"Show the id, name of each festival and the number of artworks it has nominated.",SELECT ?T1_festival_id ?T2_festival_name (count( *) as ?aggregation_all) WHERE { ?T1 a :nomination . ?T2 a :festival_detail . ?T1 :nomination\#ref-festival_id ?T2 .  ?T1 :nomination\#festival_id ?T1_festival_id . ?T2 :festival_detail\#festival_name ?T2_festival_name .        } GROUP BY ?T1_festival_id ?T2_festival_name
entertainment_awards,Please show different types of artworks with the corresponding number of artworks of each type.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :artwork . ?T1 :artwork\#type ?T1_type .        } GROUP BY ?T1_type
entertainment_awards,List the most common type of artworks.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :artwork . ?T1 :artwork\#type ?T1_type .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
entertainment_awards,List the year in which there are more than one festivals.,SELECT ?T1_year WHERE { ?T1 a :festival_detail . ?T1 :festival_detail\#year ?T1_year .        } GROUP BY ?T1_year   HAVING(count( *)  > 1)
entertainment_awards,List the name of artworks that are not nominated.,SELECT ?T1_name WHERE { ?T1 a :artwork . ?T1 :artwork\#name ?T1_name . ?T1 :artwork\#artwork_id ?T1_artwork_id . FILTER(?T1_artwork_id not in (?T22_artwork_id)) .       {SELECT ?T22_artwork_id WHERE { ?T22 a :nomination . ?T22 :nomination\#artwork_id ?T22_artwork_id .        }    } }
entertainment_awards,Show the number of audience in year 2008 or 2010.,SELECT ?T1_num_of_audience WHERE { ?T1 a :festival_detail . ?T1 :festival_detail\#num_of_audience ?T1_num_of_audience . ?T1 :festival_detail\#year ?T1_year . ?T1 :festival_detail\#year ?T1_year . FILTER(?T1_year = 2008 || ?T1_year = 2010) .        }
customers_campaigns_ecommerce,How many premises are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :premises .        }
customers_campaigns_ecommerce,What are all the distinct premise types?,SELECT DISTINCT ?T1_premises_type WHERE { ?T1 a :premises . ?T1 :premises\#premises_type ?T1_premises_type .        }
customers_campaigns_ecommerce,Find the types and details for all premises and order by the premise type.,SELECT ?T1_premises_type ?T1_premise_details WHERE { ?T1 a :premises . ?T1 :premises\#premises_type ?T1_premises_type . ?T1 :premises\#premise_details ?T1_premise_details . ?T1 :premises\#premises_type ?T1_premises_type .        }  ORDER BY ASC (?T1_premises_type)
customers_campaigns_ecommerce,Show each premise type and the number of premises in that type.,SELECT ?T1_premises_type (count( *) as ?aggregation_all) WHERE { ?T1 a :premises . ?T1 :premises\#premises_type ?T1_premises_type .        } GROUP BY ?T1_premises_type
customers_campaigns_ecommerce,Show all distinct product categories along with the number of mailshots in each category.,SELECT ?T1_product_category (count( *) as ?aggregation_all) WHERE { ?T1 a :mailshot_campaigns . ?T1 :mailshot_campaigns\#product_category ?T1_product_category .        } GROUP BY ?T1_product_category
customers_campaigns_ecommerce,Show the name and phone of the customer without any mailshot.,SELECT ?T1_customer_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :mailshot_customers . ?T22 :mailshot_customers\#customer_id ?T22_customer_id .        }    } }
customers_campaigns_ecommerce,Show the name and phone for customers with a mailshot with outcome code 'No Response'.,SELECT ?T1_customer_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T2 a :mailshot_customers . ?T2 :mailshot_customers\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :mailshot_customers\#outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'No Response') .        }
customers_campaigns_ecommerce,Show the outcome code of mailshots along with the number of mailshots in each outcome code.,SELECT ?T1_outcome_code (count( *) as ?aggregation_all) WHERE { ?T1 a :mailshot_customers . ?T1 :mailshot_customers\#outcome_code ?T1_outcome_code .        } GROUP BY ?T1_outcome_code
customers_campaigns_ecommerce,Show the names of customers who have at least 2 mailshots with outcome code 'Order'.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :mailshot_customers . ?T2 :mailshot_customers\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :mailshot_customers\#outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'Order') .        } GROUP BY ?T1_customer_name   HAVING(count( *)  >= 2)
customers_campaigns_ecommerce,Show the names of customers who have the most mailshots.,SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :mailshot_customers . ?T2 :mailshot_customers\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_campaigns_ecommerce,What are the name and payment method of customers who have both mailshots in 'Order' outcome and mailshots in 'No Response' outcome.,SELECT DISTINCT ?T1_customer_name ?T1_payment_method WHERE { ?T1 a :customers . ?T2 a :mailshot_customers . ?T2 :mailshot_customers\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#payment_method ?T1_payment_method . ?T2 :mailshot_customers\#outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'Order') . FILTER (?T1_customer_name in (?T3_customer_name)) . FILTER (?T1_payment_method in (?T3_payment_method)) .   ?T3 a :customers . ?T4 a :mailshot_customers . ?T4 :mailshot_customers\#ref-customer_id ?T3 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T3 :customers\#payment_method ?T3_payment_method . ?T4 :mailshot_customers\#outcome_code ?T4_outcome_code .  FILTER(?T4_outcome_code = 'No Response') .             }
customers_campaigns_ecommerce,Show the premise type and address type code for all customer addresses.,SELECT ?T1_premises_type ?T2_address_type_code WHERE { ?T1 a :premises . ?T2 a :customer_addresses . ?T2 :customer_addresses\#ref-premise_id ?T1 .  ?T1 :premises\#premises_type ?T1_premises_type . ?T2 :customer_addresses\#address_type_code ?T2_address_type_code .        }
customers_campaigns_ecommerce,What are the distinct address type codes for all customer addresses?,SELECT DISTINCT ?T1_address_type_code WHERE { ?T1 a :customer_addresses . ?T1 :customer_addresses\#address_type_code ?T1_address_type_code .        }
customers_campaigns_ecommerce,Show the shipping charge and customer id for customer orders with order status Cancelled or Paid.,SELECT ?T1_order_shipping_charges ?T1_customer_id WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\#order_shipping_charges ?T1_order_shipping_charges . ?T1 :customer_orders\#customer_id ?T1_customer_id . ?T1 :customer_orders\#order_status_code ?T1_order_status_code . ?T1 :customer_orders\#order_status_code ?T1_order_status_code . FILTER(?T1_order_status_code = 'Cancelled' || ?T1_order_status_code = 'Paid') .        }
customers_campaigns_ecommerce,Show the names of customers having an order with shipping method FedEx and order status Paid.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :customer_orders\#shipping_method_code ?T2_shipping_method_code . ?T2 :customer_orders\#order_status_code ?T2_order_status_code . FILTER(?T2_shipping_method_code = 'FedEx' && ?T2_order_status_code = 'Paid') .        }
college_3,How many courses are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :course .        }
college_3,How many courses have more than 2 credits?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T1 :course\#credits ?T1_credits . FILTER(?T1_credits > 2) .        }
college_3,List all names of courses with 1 credit?,SELECT ?T1_cname WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#credits ?T1_credits . FILTER(?T1_credits = 1) .        }
college_3,What are the names of courses with 1 credit?,SELECT ?T1_cname WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#credits ?T1_credits . FILTER(?T1_credits = 1) .        }
college_3,Which courses are taught on days MTW?,SELECT ?T1_cname WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#days ?T1_days . FILTER(?T1_days = 'MTW') .        }
college_3,What are the course names for courses taught on MTW?,SELECT ?T1_cname WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#days ?T1_days . FILTER(?T1_days = 'MTW') .        }
college_3,What is the number of departments in Division 'AS'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\#division ?T1_division . FILTER(?T1_division = 'AS') .        }
college_3,How many departments are in the division AS?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\#division ?T1_division . FILTER(?T1_division = 'AS') .        }
college_3,What are the phones of departments in Room 268?,SELECT ?T1_dphone WHERE { ?T1 a :department . ?T1 :department\#dphone ?T1_dphone . ?T1 :department\#room ?T1_room . FILTER(?T1_room = '268') .        }
college_3,Find the number of students that have at least one grade 'B'.,SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_19 ) WHERE { ?T1 a :enrolled_in . ?T1 :enrolled_in\#stuid ?T1_stuid . ?T1 :enrolled_in\#grade ?T1_grade . FILTER(?T1_grade = 'B') .        }
college_3,How many students have had at least one 'B' grade?,SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_129 ) WHERE { ?T1 a :enrolled_in . ?T1 :enrolled_in\#stuid ?T1_stuid . ?T1 :enrolled_in\#grade ?T1_grade . FILTER(?T1_grade = 'B') .        }
college_3,Find the max and min grade point for all letter grade.,SELECT (max( ?T1_gradepoint) as ?aggregation_T1_gradepoint_67 ) (min( ?T1_gradepoint) as ?aggregation_T1_gradepoint_95 ) WHERE { ?T1 a :gradeconversion . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint .        }
college_3,What are the maximum and minumum grade points?,SELECT (max( ?T1_gradepoint) as ?aggregation_T1_gradepoint_136 ) (min( ?T1_gradepoint) as ?aggregation_T1_gradepoint_39 ) WHERE { ?T1 a :gradeconversion . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint .        }
college_3,Find the first names of students whose first names contain letter 'a'.,"SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#fname ?T1_fname . FILTER(contains (?T1_fname, 'a')) .        }"
college_3,What are the first names for students who have an 'a' in their first name?,"SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#fname ?T1_fname . FILTER(contains (?T1_fname, 'a')) .        }"
college_3,Find the first names and last names of male (sex is M) faculties who live in building NEB.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#sex ?T1_sex . ?T1 :faculty\#building ?T1_building . FILTER(?T1_sex = 'M' && ?T1_building = 'NEB') .        }
college_3,Find the rooms of faculties with rank professor who live in building NEB.,SELECT ?T1_room WHERE { ?T1 a :faculty . ?T1 :faculty\#room ?T1_room . ?T1 :faculty\#rank ?T1_rank . ?T1 :faculty\#building ?T1_building . FILTER(?T1_rank = 'Professor' && ?T1_building = 'NEB') .        }
college_3,Find the department name that is in Building 'Mergenthaler'.,SELECT ?T1_dname WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname . ?T1 :department\#building ?T1_building . FILTER(?T1_building = 'Mergenthaler') .        }
college_3,What is the name of the department in the Building Mergenthaler?,SELECT ?T1_dname WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname . ?T1 :department\#building ?T1_building . FILTER(?T1_building = 'Mergenthaler') .        }
college_3,List all information about courses sorted by credits in the ascending order.,SELECT * WHERE { ?T1 a :course . ?T1 :course\#credits ?T1_credits .        }  ORDER BY ASC (?T1_credits)
college_3,List the course name of courses sorted by credits.,SELECT ?T1_cname WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#credits ?T1_credits .        }  ORDER BY ASC (?T1_credits)
college_3,Find the first name of students in the descending order of age.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
college_3,Find the last name of female (sex is F) students in the descending order of age.,SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }  ORDER BY DESC (?T1_age)
college_3,Find the last names of faculties in building Barton in alphabetic order.,SELECT ?T1_lname WHERE { ?T1 a :faculty . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#building ?T1_building . FILTER(?T1_building = 'Barton') .        }  ORDER BY ASC (?T1_lname)
college_3,Find the first names of faculties of rank Professor in alphabetic order.,SELECT ?T1_fname WHERE { ?T1 a :faculty . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Professor') .        }  ORDER BY ASC (?T1_fname)
college_3,Find the name of the department that has the biggest number of students minored in?,SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :minor_in . ?T2 :minor_in\#ref-dno ?T1 .  ?T1 :department\#dname ?T1_dname .        } GROUP BY ?T1_dname  ORDER BY DESC (?aggregation_all) LIMIT 1
college_3,What is the name of the department with the most students minoring in it?,SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :minor_in . ?T2 :minor_in\#ref-dno ?T1 .  ?T1 :department\#dname ?T1_dname .        } GROUP BY ?T1_dname  ORDER BY DESC (?aggregation_all) LIMIT 1
college_3,Find the name of the department that has no students minored in?,SELECT distinct?col1 WHERE { { SELECT (?T1_dname as ?col1) WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname .   }}  MINUS {SELECT (?T2_dname as ?col1) WHERE { ?T2 a :department . ?T2 :department\#dname ?T2_dname .        }     } }
college_3,What is the name of the department htat has no students minoring in it?,SELECT distinct?col1 WHERE { { SELECT (?T1_dname as ?col1) WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname .   }}  MINUS {SELECT (?T2_dname as ?col1) WHERE { ?T2 a :department . ?T2 :department\#dname ?T2_dname .        }     } }
college_3,Find the name of the department that has the fewest members.,SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :member_of . ?T2 :member_of\#ref-dno ?T1 .  ?T1 :department\#dname ?T1_dname .        } GROUP BY ?T1_dname  ORDER BY ASC (?aggregation_all) LIMIT 1
college_3,What is the name of the department with the fewest members?,SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :member_of . ?T2 :member_of\#ref-dno ?T1 .  ?T1 :department\#dname ?T1_dname .        } GROUP BY ?T1_dname  ORDER BY ASC (?aggregation_all) LIMIT 1
college_3,Find the rank of the faculty that the fewest faculties belong to.,SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank .        } GROUP BY ?T1_rank  ORDER BY ASC (?aggregation_all) LIMIT 1
college_3,What is the least common faculty rank?,SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank .        } GROUP BY ?T1_rank  ORDER BY ASC (?aggregation_all) LIMIT 1
college_3,What are the first and last names of the instructors who teach the top 3 number of courses?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :course\#ref-instructor ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
college_3,What are the full names of the 3 instructors who teach the most courses?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :course\#ref-instructor ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
college_3,Which building does the instructor who teaches the most number of courses live in?,SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :course\#ref-instructor ?T1 .  ?T1 :faculty\#building ?T1_building .        } GROUP BY ?T1_building  ORDER BY DESC (?aggregation_all) LIMIT 1
college_3,What are the name of courses that have at least five enrollments?,SELECT ?T1_cname WHERE { ?T1 a :course . ?T2 a :enrolled_in . ?T2 :enrolled_in\#ref-cid ?T1 .  ?T1 :course\#cname ?T1_cname .        } GROUP BY ?T1_cname   HAVING(count( *)  >= 5)
college_3,Find the first name and last name of the instructor of course that has course name,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :course\#ref-instructor ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T2 :course\#cname ?T2_cname . FILTER(?T2_cname = 'COMPUTER LITERACY') .        }
college_3,Find the department name and room of the course INTRODUCTION TO COMPUTER SCIENCE.,SELECT ?T1_dname ?T1_room WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\#ref-dept_code ?T1 .  ?T1 :department\#dname ?T1_dname . ?T1 :department\#room ?T1_room . ?T2 :course\#cname ?T2_cname . FILTER(?T2_cname = 'INTRODUCTION TO COMPUTER SCIENCE') .        }
college_3,Find the student first and last names and grade points of all enrollments.,SELECT ?T1_fname ?T1_lname ?T2_gradepoint WHERE { ?T1 a :student . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :gradeconversion\#gradepoint ?T2_gradepoint . ?T2 a :gradeconversion . ?T13 :enrolled_in\#ref-grade ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :gradeconversion\#gradepoint ?T2_gradepoint .        }
college_3,What are the full names and gradepoints for all enrollments?,SELECT ?T1_fname ?T1_lname ?T2_gradepoint WHERE { ?T1 a :student . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :gradeconversion\#gradepoint ?T2_gradepoint . ?T2 a :gradeconversion . ?T13 :enrolled_in\#ref-grade ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :gradeconversion\#gradepoint ?T2_gradepoint .        }
college_3,Find the distinct student first names of all students that have grade point at least 3.8 in one course.,SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T2 :gradeconversion\#gradepoint ?T2_gradepoint . ?T2 a :gradeconversion . ?T13 :enrolled_in\#ref-grade ?T2 .  ?T1 :student\#fname ?T1_fname . ?T2 :gradeconversion\#gradepoint ?T2_gradepoint . FILTER(?T2_gradepoint >= 3.8) .        }
college_3,Find the full names of faculties who are members of department with department number 520.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :member_of . ?T2 :member_of\#ref-facid ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T2 :member_of\#dno ?T2_dno . FILTER(?T2_dno = 520) .        }
college_3,What are the first names and last names of the students that minor in the department with DNO 140.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T2 a :minor_in . ?T2 :minor_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :minor_in\#dno ?T2_dno . FILTER(?T2_dno = 140) .        }
college_3,What are the full names of students minoring in department 140?,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T2 a :minor_in . ?T2 :minor_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :minor_in\#dno ?T2_dno . FILTER(?T2_dno = 140) .        }
college_3,Find the last names of faculties who are members of computer science department.,SELECT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :member_of . ?T13 :member_of\#ref-facid ?T1 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :department\#dname ?T2_dname . ?T2 a :department . ?T13 :member_of\#ref-dno ?T2 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :department\#dname ?T2_dname . FILTER(?T2_dname = 'Computer Science') .        }
college_3,Find the average grade point of student whose last name is Smith.,SELECT (avg( ?T1_gradepoint) as ?aggregation_T1_gradepoint_8 ) WHERE { ?T1 a :gradeconversion . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-grade ?T1 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T13 :enrolled_in\#ref-stuid ?T2 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#lname ?T2_lname . FILTER(?T2_lname = 'Smith') .        }
college_3,What is the average gradepoint for students with the last name Smith?,SELECT (avg( ?T1_gradepoint) as ?aggregation_T1_gradepoint_113 ) WHERE { ?T1 a :gradeconversion . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-grade ?T1 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T13 :enrolled_in\#ref-stuid ?T2 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#lname ?T2_lname . FILTER(?T2_lname = 'Smith') .        }
college_3,What is the maximum and minimum grade point of students who live in NYC?,SELECT (max( ?T1_gradepoint) as ?aggregation_T1_gradepoint_156 ) (min( ?T1_gradepoint) as ?aggregation_T1_gradepoint_127 ) WHERE { ?T1 a :gradeconversion . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-grade ?T1 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#city_code ?T2_city_code . ?T2 a :student . ?T13 :enrolled_in\#ref-stuid ?T2 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#city_code ?T2_city_code . FILTER(?T2_city_code = 'NYC') .        }
college_3,Give the maximum and minimum gradepoints for students living in NYC?,SELECT (max( ?T1_gradepoint) as ?aggregation_T1_gradepoint_69 ) (min( ?T1_gradepoint) as ?aggregation_T1_gradepoint_140 ) WHERE { ?T1 a :gradeconversion . ?T13 a :enrolled_in . ?T13 :enrolled_in\#ref-grade ?T1 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#city_code ?T2_city_code . ?T2 a :student . ?T13 :enrolled_in\#ref-stuid ?T2 .  ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T1 :gradeconversion\#gradepoint ?T1_gradepoint . ?T2 :student\#city_code ?T2_city_code . FILTER(?T2_city_code = 'NYC') .        }
college_3,Find the names of courses that have either 3 credits or 1 credit but 4 hours.,SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#credits ?T1_credits . FILTER(?T1_credits = 3) .   }} UNION {SELECT (?T1_cname as ?col1) WHERE { ?T1 a :course . ?T1 :course\#cname ?T1_cname . ?T1 :course\#credits ?T1_credits . ?T1 :course\#hours ?T1_hours . FILTER(?T1_credits = 1 && ?T1_hours = '4') .        }      } }
college_3,Find the names of departments that are either in division AS or in division EN and in Building NEB.,SELECT distinct?col1 WHERE { { SELECT (?T1_dname as ?col1) WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname . ?T1 :department\#division ?T1_division . FILTER(?T1_division = 'AS') .   }} UNION {SELECT (?T1_dname as ?col1) WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname . ?T1 :department\#division ?T1_division . ?T1 :department\#building ?T1_building . FILTER(?T1_division = 'EN' && ?T1_building = 'NEB') .        }      } }
college_3,Find the first name of students not enrolled in any course.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid not in (?T22_stuid)) .       {SELECT ?T22_stuid WHERE { ?T22 a :enrolled_in . ?T22 :enrolled_in\#stuid ?T22_stuid .        }    } }
department_store,Give the ids of the three products purchased in the largest amounts.,SELECT ?T1_product_id WHERE { ?T1 a :product_suppliers . ?T1 :product_suppliers\#product_id ?T1_product_id . ?T1 :product_suppliers\#total_amount_purchased ?T1_total_amount_purchased .        }   ORDER BY DESC (?T1_total_amount_purchased) LIMIT 1
department_store,What are the product id and product type of the cheapest product?,SELECT ?T1_product_id ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :products\#product_id ?T1_product_id . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price .        }   ORDER BY ASC (?T1_product_price) LIMIT 1
department_store,Find the number of different product types.,SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_138 ) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code .        }
department_store,Count the number of distinct product types.,SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_149 ) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code .        }
department_store,Return the address of customer 10.,SELECT ?T1_address_details WHERE { ?T1 a :addresses . ?T2 a :customer_addresses . ?T2 :customer_addresses\#ref-address_id ?T1 .  ?T1 :addresses\#address_details ?T1_address_details . ?T2 :customer_addresses\#customer_id ?T2_customer_id . FILTER(?T2_customer_id = 10) .        }
department_store,What is the address for the customer with id 10?,SELECT ?T1_address_details WHERE { ?T1 a :addresses . ?T2 a :customer_addresses . ?T2 :customer_addresses\#ref-address_id ?T1 .  ?T1 :addresses\#address_details ?T1_address_details . ?T2 :customer_addresses\#customer_id ?T2_customer_id . FILTER(?T2_customer_id = 10) .        }
