kg_name,question,query
election,What is the zip code the county named 'Howard' is located in?,SELECT ?T1_zip_code WHERE { ?T1 a :county . ?T1 :county\#zip_code ?T1_zip_code . ?T1 :county\#county_name ?T1_county_name . FILTER(?T1_county_name = 'Howard') .        }
election,Show the delegate from district 1 in election.,SELECT ?T1_delegate WHERE { ?T1 a :election . ?T1 :election\#delegate ?T1_delegate . ?T1 :election\#district ?T1_district . FILTER(?T1_district = 1) .        }
election,Who is the delegate of district 1 in the elections?,SELECT ?T1_delegate WHERE { ?T1 a :election . ?T1 :election\#delegate ?T1_delegate . ?T1 :election\#district ?T1_district . FILTER(?T1_district = 1) .        }
election,Show the delegate and committee information of elections.,SELECT ?T1_delegate ?T1_committee WHERE { ?T1 a :election . ?T1 :election\#delegate ?T1_delegate . ?T1 :election\#committee ?T1_committee .        }
election,How many distinct governors are there?,SELECT DISTINCT (count(DISTINCT ?T1_governor) as ?aggregation_T1_governor_67 ) WHERE { ?T1 a :party . ?T1 :party\#governor ?T1_governor .        }
election,Count the number of distinct governors.,SELECT DISTINCT (count(DISTINCT ?T1_governor) as ?aggregation_T1_governor_29 ) WHERE { ?T1 a :party . ?T1 :party\#governor ?T1_governor .        }
election,Show the lieutenant governor and comptroller from the democratic party.,SELECT ?T1_lieutenant_governor ?T1_comptroller WHERE { ?T1 a :party . ?T1 :party\#lieutenant_governor ?T1_lieutenant_governor . ?T1 :party\#comptroller ?T1_comptroller . ?T1 :party\#party ?T1_party . FILTER(?T1_party = 'Democratic') .        }
election,In which distinct years was the governor 'Eliot Spitzer'?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :party . ?T1 :party\#year ?T1_year . ?T1 :party\#governor ?T1_governor . FILTER(?T1_governor = 'Eliot Spitzer') .        }
election,Show all the information about election.,SELECT * WHERE { ?T1 a :election .        }
election,Show the delegates and the names of county they belong to.,SELECT ?T1_delegate ?T2_county_name WHERE { ?T1 a :election . ?T2 a :county . ?T1 :election\#ref-district ?T2 .  ?T1 :election\#delegate ?T1_delegate . ?T2 :county\#county_name ?T2_county_name .        }
election,Find the delegates who are from counties with population below 100000.,SELECT ?T1_delegate WHERE { ?T1 a :election . ?T2 a :county . ?T1 :election\#ref-district ?T2 .  ?T1 :election\#delegate ?T1_delegate . ?T2 :county\#population ?T2_population . FILTER(?T2_population < 100000) .        }
election,Count the number of distinct delegates who are from counties with population above 50000.,SELECT DISTINCT (count(DISTINCT ?T1_delegate) as ?aggregation_T1_delegate_93 ) WHERE { ?T1 a :election . ?T2 a :county . ?T1 :election\#ref-district ?T2 .  ?T1 :election\#delegate ?T1_delegate . ?T2 :county\#population ?T2_population . FILTER(?T2_population > 50000) .        }
election,What are the names of the county that the delegates on 'Appropriations' committee belong to?,SELECT ?T1_county_name WHERE { ?T1 a :county . ?T2 a :election . ?T2 :election\#ref-district ?T1 .  ?T1 :county\#county_name ?T1_county_name . ?T2 :election\#committee ?T2_committee . FILTER(?T2_committee = 'Appropriations') .        }
election,Show the delegates and the names of the party they belong to.,SELECT ?T1_delegate ?T2_party WHERE { ?T1 a :election . ?T2 a :party . ?T1 :election\#ref-party ?T2 .  ?T1 :election\#delegate ?T1_delegate . ?T2 :party\#party ?T2_party .        }
election,Return all the committees that have delegates from Democratic party.,SELECT ?T1_committee WHERE { ?T1 a :election . ?T2 a :party . ?T1 :election\#ref-party ?T2 .  ?T1 :election\#committee ?T1_committee . ?T2 :party\#party ?T2_party . FILTER(?T2_party = 'Democratic') .        }
election,Which committees have delegates from the Democratic party?,SELECT ?T1_committee WHERE { ?T1 a :election . ?T2 a :party . ?T1 :election\#ref-party ?T2 .  ?T1 :election\#committee ?T1_committee . ?T2 :party\#party ?T2_party . FILTER(?T2_party = 'Democratic') .        }
election,Show the name of each county along with the corresponding number of delegates from that county.,SELECT ?T1_county_name (count( *) as ?aggregation_all) WHERE { ?T1 a :county . ?T2 a :election . ?T2 :election\#ref-district ?T1 .  ?T1 :county\#county_name ?T1_county_name .        } GROUP BY ?T1_county_name
election,Show the name of each party and the corresponding number of delegates from that party.,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :election . ?T2 :election\#ref-party ?T1 .  ?T1 :party\#party ?T1_party .        } GROUP BY ?T1_party
election,Return the names of all counties sorted by population in ascending order.,SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county\#county_name ?T1_county_name . ?T1 :county\#population ?T1_population .        }  ORDER BY ASC (?T1_population)
election,Return the names of all counties sorted by county name in descending alphabetical order.,SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county\#county_name ?T1_county_name . ?T1 :county\#county_name ?T1_county_name .        }  ORDER BY DESC (?T1_county_name)
election,Show the name of the county with the biggest population.,SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county\#county_name ?T1_county_name . ?T1 :county\#population ?T1_population .        }   ORDER BY DESC (?T1_population) LIMIT 1
election,Show the 3 counties with the smallest population.,SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county\#county_name ?T1_county_name . ?T1 :county\#population ?T1_population .        }   ORDER BY ASC (?T1_population) LIMIT 1
election,Show the names of counties that have at least two delegates.,SELECT ?T1_county_name WHERE { ?T1 a :county . ?T2 a :election . ?T2 :election\#ref-district ?T1 .  ?T1 :county\#county_name ?T1_county_name .        } GROUP BY ?T1_county_name   HAVING(count( *)  >= 2)
election,Show the name of the party that has at least two records.,SELECT ?T1_party WHERE { ?T1 a :party . ?T1 :party\#party ?T1_party .        } GROUP BY ?T1_party   HAVING(count( *)  >= 2)
election,Which party has two or more records?,SELECT ?T1_party WHERE { ?T1 a :party . ?T1 :party\#party ?T1_party .        } GROUP BY ?T1_party   HAVING(count( *)  >= 2)
election,Show the name of the party that has the most delegates.,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :election . ?T2 :election\#ref-party ?T1 .  ?T1 :party\#party ?T1_party .        } GROUP BY ?T1_party  ORDER BY DESC (?aggregation_all) LIMIT 1
election,Which party has the largest number of delegates?,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :election . ?T2 :election\#ref-party ?T1 .  ?T1 :party\#party ?T1_party .        } GROUP BY ?T1_party  ORDER BY DESC (?aggregation_all) LIMIT 1
election,Show the people that have been governor the most times.,SELECT ?T1_governor (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T1 :party\#governor ?T1_governor .        } GROUP BY ?T1_governor  ORDER BY DESC (?aggregation_all) LIMIT 1
election,Which people severed as governor most frequently?,SELECT ?T1_governor (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T1 :party\#governor ?T1_governor .        } GROUP BY ?T1_governor  ORDER BY DESC (?aggregation_all) LIMIT 1
election,Show the people that have been comptroller the most times and the corresponding number of times.,SELECT ?T1_comptroller (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T1 :party\#comptroller ?T1_comptroller .        } GROUP BY ?T1_comptroller  ORDER BY DESC (?aggregation_all) LIMIT 1
election,What are the names of parties that do not have delegates in election?,SELECT ?T1_party WHERE { ?T1 a :party . ?T1 :party\#party ?T1_party . ?T1 :party\#party_id ?T1_party_id . FILTER(?T1_party_id not in (?T22_party)) .       {SELECT ?T22_party WHERE { ?T22 a :election . ?T22 :election\#party ?T22_party .        }    } }
election,Which parties did not have any delegates in elections?,SELECT ?T1_party WHERE { ?T1 a :party . ?T1 :party\#party ?T1_party . ?T1 :party\#party_id ?T1_party_id . FILTER(?T1_party_id not in (?T22_party)) .       {SELECT ?T22_party WHERE { ?T22 a :election . ?T22 :election\#party ?T22_party .        }    } }
election,What are the names of parties that have both delegates on 'Appropriations' committee and,SELECT DISTINCT ?T1_party WHERE { ?T1 a :party . ?T2 a :election . ?T2 :election\#ref-party ?T1 .  ?T1 :party\#party ?T1_party . ?T2 :election\#committee ?T2_committee . FILTER(?T2_committee = 'Appropriations') . FILTER (?T1_party in (?T3_party)) .   ?T3 a :party . ?T4 a :election . ?T4 :election\#ref-party ?T3 .  ?T3 :party\#party ?T3_party . ?T4 :election\#committee ?T4_committee .  FILTER(?T4_committee = 'Economic Matters') .             }
election,Which parties have delegates in both the 'Appropriations' committee and the 'Economic Matters' committee?,SELECT DISTINCT ?T1_party WHERE { ?T1 a :party . ?T2 a :election . ?T2 :election\#ref-party ?T1 .  ?T1 :party\#party ?T1_party . ?T2 :election\#committee ?T2_committee . FILTER(?T2_committee = 'Appropriations') . FILTER (?T1_party in (?T3_party)) .   ?T3 a :party . ?T4 a :election . ?T4 :election\#ref-party ?T3 .  ?T3 :party\#party ?T3_party . ?T4 :election\#committee ?T4_committee .  FILTER(?T4_committee = 'Economic Matters') .             }
election,Which committees have delegates from both democratic party and liberal party?,SELECT DISTINCT ?T1_committee WHERE { ?T1 a :election . ?T2 a :party . ?T1 :election\#ref-party ?T2 .  ?T1 :election\#committee ?T1_committee . ?T2 :party\#party ?T2_party . FILTER(?T2_party = 'Democratic') . FILTER (?T1_committee in (?T3_committee)) .   ?T3 a :election . ?T4 a :party . ?T3 :election\#ref-party ?T4 .  ?T3 :election\#committee ?T3_committee . ?T4 :party\#party ?T4_party .  FILTER(?T4_party = 'Liberal') .             }
news_report,How many journalists are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist .        }
news_report,List the names of journalists in ascending order of years working.,SELECT ?T1_name WHERE { ?T1 a :journalist . ?T1 :journalist\#name ?T1_name . ?T1 :journalist\#years_working ?T1_years_working .        }  ORDER BY ASC (?T1_years_working)
news_report,What are the nationalities and ages of journalists?,SELECT ?T1_nationality ?T1_age WHERE { ?T1 a :journalist . ?T1 :journalist\#nationality ?T1_nationality . ?T1 :journalist\#age ?T1_age .        }
news_report,Show the names of journalists from 'England' or 'Wales'.,SELECT ?T1_name WHERE { ?T1 a :journalist . ?T1 :journalist\#name ?T1_name . ?T1 :journalist\#nationality ?T1_nationality . ?T1 :journalist\#nationality ?T1_nationality . FILTER(?T1_nationality = 'England' || ?T1_nationality = 'Wales') .        }
news_report,What is the average number of years spent working as a journalist?,SELECT (avg( ?T1_years_working) as ?aggregation_T1_years_working_141 ) WHERE { ?T1 a :journalist . ?T1 :journalist\#years_working ?T1_years_working .        }
news_report,Show the different nationalities and the number of journalists of each nationality.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist . ?T1 :journalist\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality
news_report,Show the most common nationality for journalists.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist . ?T1 :journalist\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality  ORDER BY DESC (?aggregation_all) LIMIT 1
news_report,Show the nations that have both journalists with more than 10 years of working and journalists with less than 3 years of working.,SELECT DISTINCT ?T1_nationality WHERE { ?T1 a :journalist . ?T1 :journalist\#nationality ?T1_nationality . ?T1 :journalist\#years_working ?T1_years_working . FILTER(?T1_years_working > 10) . FILTER (?T1_nationality in (?T2_nationality)) .   ?T2 a :journalist . ?T2 :journalist\#nationality ?T2_nationality . ?T2 :journalist\#years_working ?T2_years_working .  FILTER(?T2_years_working < 3) .             }
news_report,"Show the dates, places, and names of events in descending order of the attendance.",SELECT ?T1_date ?T1_name ?T1_venue WHERE { ?T1 a :event . ?T1 :event\#date ?T1_date . ?T1 :event\#name ?T1_name . ?T1 :event\#venue ?T1_venue . ?T1 :event\#event_attendance ?T1_event_attendance .        }  ORDER BY DESC (?T1_event_attendance)
news_report,Show the names of journalists and the dates of the events they reported.,SELECT ?T1_name ?T2_date WHERE { ?T1 a :journalist . ?T13 a :news_report . ?T13 :news_report\#ref-journalist_id ?T1 .  ?T1 :journalist\#name ?T1_name . ?T2 :event\#date ?T2_date . ?T2 a :event . ?T13 :news_report\#ref-event_id ?T2 .  ?T1 :journalist\#name ?T1_name . ?T2 :event\#date ?T2_date .        }
news_report,Show the names of journalists and the names of the events they reported in ascending order,SELECT ?T1_name ?T2_name WHERE { ?T1 a :journalist . ?T13 a :news_report . ?T13 :news_report\#ref-journalist_id ?T1 .  ?T1 :journalist\#name ?T1_name . ?T2 :event\#name ?T2_name . ?T2 :event\#event_attendance ?T2_event_attendance . ?T2 a :event . ?T13 :news_report\#ref-event_id ?T2 .  ?T1 :journalist\#name ?T1_name . ?T2 :event\#name ?T2_name . ?T2 :event\#event_attendance ?T2_event_attendance .        }  ORDER BY ASC (?T2_event_attendance)
news_report,Show the names of journalists and the number of events they reported.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist . ?T2 a :news_report . ?T2 :news_report\#ref-journalist_id ?T1 .  ?T1 :journalist\#name ?T1_name .        } GROUP BY ?T1_name
news_report,Show the names of journalists that have reported more than one event.,SELECT ?T1_name WHERE { ?T1 a :journalist . ?T2 a :news_report . ?T2 :news_report\#ref-journalist_id ?T1 .  ?T1 :journalist\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
news_report,List the names of journalists who have not reported any event.,SELECT ?T1_name WHERE { ?T1 a :journalist . ?T1 :journalist\#name ?T1_name . ?T1 :journalist\#journalist_id ?T1_journalist_id . FILTER(?T1_journalist_id not in (?T22_journalist_id)) .       {SELECT ?T22_journalist_id WHERE { ?T22 a :news_report . ?T22 :news_report\#journalist_id ?T22_journalist_id .        }    } }
news_report,what are the average and maximum attendances of all events?,SELECT (avg( ?T1_event_attendance) as ?aggregation_T1_event_attendance_63 ) (max( ?T1_event_attendance) as ?aggregation_T1_event_attendance_119 ) WHERE { ?T1 a :event . ?T1 :event\#event_attendance ?T1_event_attendance . ?T1 :event\#event_attendance ?T1_event_attendance .        }
news_report,Find the average age and experience working length of journalists working on different role type.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_20 ) (avg( ?T1_years_working) as ?aggregation_T1_years_working_114 ) ?T2_work_type WHERE { ?T1 a :journalist . ?T2 a :news_report . ?T2 :news_report\#ref-journalist_id ?T1 .  ?T1 :journalist\#age ?T1_age . ?T1 :journalist\#years_working ?T1_years_working . ?T2 :news_report\#work_type ?T2_work_type .        } GROUP BY ?T2_work_type
news_report,List the event venues and names that have the top 2 most number of people attended.,SELECT ?T1_venue ?T1_name WHERE { ?T1 a :event . ?T1 :event\#venue ?T1_venue . ?T1 :event\#name ?T1_name . ?T1 :event\#event_attendance ?T1_event_attendance .        }   ORDER BY DESC (?T1_event_attendance) LIMIT 1
restaurant_1,Show me all the restaurants.,SELECT ?T1_resname WHERE { ?T1 a :restaurant . ?T1 :restaurant\#resname ?T1_resname .        }
restaurant_1,What is the address of the restaurant Subway?,SELECT ?T1_address WHERE { ?T1 a :restaurant . ?T1 :restaurant\#address ?T1_address . ?T1 :restaurant\#resname ?T1_resname . FILTER(?T1_resname = 'Subway') .        }
restaurant_1,What is the rating of the restaurant Subway?,SELECT ?T1_rating WHERE { ?T1 a :restaurant . ?T1 :restaurant\#rating ?T1_rating . ?T1 :restaurant\#resname ?T1_resname . FILTER(?T1_resname = 'Subway') .        }
restaurant_1,List all restaurant types.,SELECT ?T1_restypename WHERE { ?T1 a :restaurant_type . ?T1 :restaurant_type\#restypename ?T1_restypename .        }
restaurant_1,What is the description of the restaurant type Sandwich?,SELECT ?T1_restypedescription WHERE { ?T1 a :restaurant_type . ?T1 :restaurant_type\#restypedescription ?T1_restypedescription . ?T1 :restaurant_type\#restypename ?T1_restypename . FILTER(?T1_restypename = 'Sandwich') .        }
restaurant_1,Which restaurants have highest rating? List the restaurant name and its rating.,SELECT ?T1_resname ?T1_rating WHERE { ?T1 a :restaurant . ?T1 :restaurant\#resname ?T1_resname . ?T1 :restaurant\#rating ?T1_rating . ?T1 :restaurant\#rating ?T1_rating .        }   ORDER BY DESC (?T1_rating) LIMIT 1
restaurant_1,What is the age of student Linda Smith?,SELECT ?T1_age WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . FILTER(?T1_fname = 'Linda' && ?T1_lname = 'Smith') .        }
restaurant_1,What is the gender of the student Linda Smith?,SELECT ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#sex ?T1_sex . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . FILTER(?T1_fname = 'Linda' && ?T1_lname = 'Smith') .        }
restaurant_1,List all students' first names and last names who majored in 600.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 600) .        }
restaurant_1,Which city does student Linda Smith live in?,SELECT ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\#city_code ?T1_city_code . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . FILTER(?T1_fname = 'Linda' && ?T1_lname = 'Smith') .        }
restaurant_1,Advisor 1121 has how many students?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor . FILTER(?T1_advisor = 1121) .        }
restaurant_1,Which Advisor has most of students? List advisor and the number of students.,SELECT ?T1_advisor (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#advisor ?T1_advisor . ?T1 :student\#advisor ?T1_advisor .        } GROUP BY ?T1_advisor  ORDER BY DESC ((count( ?T1_advisor) as ?aggregation_T1_advisor_153 )) LIMIT 1
restaurant_1,Which major has least number of students? List the major and the number of students.,SELECT ?T1_major (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major  ORDER BY ASC ((count( ?T1_major) as ?aggregation_T1_major_145 )) LIMIT 1
restaurant_1,Which major has between 2 and 30 number of students? List major and the number of students.,SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major . ?T1 :student\#major ?T1_major .        } GROUP BY ?T1_major   HAVING(count( ?T1_major) as ?aggregation_T1_major_37 ) >= 2 && count( ?T1_major) as ?aggregation_T1_major_37 ) <= 30)
restaurant_1,Which student's age is older than 18 and is majoring in 600? List each student's first and last name.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#major ?T1_major . FILTER(?T1_age > 18 && ?T1_major = 600) .        }
restaurant_1,List all female students age is older than 18 who is not majoring in 600. List students' first name and last name.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T1 :student\#age ?T1_age . ?T1 :student\#major ?T1_major . ?T1 :student\#sex ?T1_sex . FILTER(?T1_age > 18 && ?T1_major != 600 && ?T1_sex = 'F') .        }
restaurant_1,How many restaurant is the Sandwich type restaurant?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :type_of_restaurant . ?T2 a :restaurant_type . ?T13 :type_of_restaurant\#ref-restypeid ?T2 .  ?T2 :restaurant_type\#restypename ?T2_restypename . FILTER(?T2_restypename = 'Sandwich') .        }
restaurant_1,How long does student Linda Smith spend on the restaurant in total?,SELECT (sum( ?T1_spent) as ?aggregation_T1_spent_86 ) WHERE { ?T1 a :visits_restaurant . ?T2 a :student . ?T1 :visits_restaurant\#ref-stuid ?T2 .  ?T1 :visits_restaurant\#spent ?T1_spent . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }
restaurant_1,How many times has the student Linda Smith visited Subway?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :visits_restaurant . ?T2 a :student . ?T1 :visits_restaurant\#ref-stuid ?T2 .  ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T3 :restaurant\#resname ?T3_resname . ?T3 a :restaurant . ?T1 :visits_restaurant\#ref-resid ?T3 .  ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T3 :restaurant\#resname ?T3_resname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith' && ?T3_resname = 'Subway') .        }
restaurant_1,When did Linda Smith visit Subway?,SELECT ?T1_time WHERE { ?T1 a :visits_restaurant . ?T2 a :student . ?T1 :visits_restaurant\#ref-stuid ?T2 .  ?T1 :visits_restaurant\#time ?T1_time . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T3 :restaurant\#resname ?T3_resname . ?T3 a :restaurant . ?T1 :visits_restaurant\#ref-resid ?T3 .  ?T1 :visits_restaurant\#time ?T1_time . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T3 :restaurant\#resname ?T3_resname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith' && ?T3_resname = 'Subway') .        }
restaurant_1,At which restaurant did the students spend the least amount of time? List restaurant and the time students spent on in total.,SELECT ?T1_resname (sum( ?T2_spent) as ?aggregation_T2_spent_120 ) WHERE { ?T1 a :restaurant . ?T2 a :visits_restaurant . ?T2 :visits_restaurant\#ref-resid ?T1 .  ?T1 :restaurant\#resname ?T1_resname . ?T2 :visits_restaurant\#spent ?T2_spent . ?T2 :visits_restaurant\#spent ?T2_spent .        } GROUP BY ?T1_resname  ORDER BY ASC ((sum( ?T2_spent) as ?aggregation_T2_spent_17 )) LIMIT 1
restaurant_1,Which student visited restaurant most often? List student's first name and last name.,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :visits_restaurant . ?T2 :visits_restaurant\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
customer_deliveries,Find the ids of orders whose status is 'Success'.,SELECT ?T1_actual_order_id WHERE { ?T1 a :actual_orders . ?T1 :actual_orders\#actual_order_id ?T1_actual_order_id . ?T1 :actual_orders\#order_status_code ?T1_order_status_code . FILTER(?T1_order_status_code = 'Success') .        }
customer_deliveries,Find the name and price of the product that has been ordered the greatest number of times.,SELECT ?T1_product_name (count( *) as ?aggregation_all) ?T1_product_price WHERE { ?T1 a :products . ?T2 a :regular_order_products . ?T2 :regular_order_products\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_name ?T1_product_price  ORDER BY DESC (?aggregation_all) LIMIT 1
customer_deliveries,How many different payment methods are there?,SELECT DISTINCT (count(DISTINCT ?T1_payment_method) as ?aggregation_T1_payment_method_103 ) WHERE { ?T1 a :customers . ?T1 :customers\#payment_method ?T1_payment_method .        }
customer_deliveries,Show the details of all trucks in the order of their license number.,SELECT ?T1_truck_details WHERE { ?T1 a :trucks . ?T1 :trucks\#truck_details ?T1_truck_details . ?T1 :trucks\#truck_licence_number ?T1_truck_licence_number .        }  ORDER BY ASC (?T1_truck_licence_number)
customer_deliveries,Find the name of the most expensive product.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
customer_deliveries,Find the names of customers who are not living in the state of California.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name .   }}  MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :customers . ?T3 a :addresses . ?T2 :customers\#ref-address_id ?T3 .  ?T2 :customers\#customer_name ?T2_customer_name . ?T3 :addresses\#state_province_county ?T3_state_province_county . FILTER(?T3_state_province_county = 'California') .        }     } }
customer_deliveries,List the names and emails of customers who payed by Visa card.,SELECT ?T1_customer_email ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_email ?T1_customer_email . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#payment_method ?T1_payment_method . FILTER(?T1_payment_method = 'Visa') .        }
customer_deliveries,Find the names and phone numbers of customers living in California state.,SELECT ?T1_customer_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\#ref-address_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :addresses\#state_province_county ?T2_state_province_county . FILTER(?T2_state_province_county = 'California') .        }
customer_deliveries,Find the states which do not have any employee in their record.,SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county . ?T1 :addresses\#address_id ?T1_address_id . FILTER(?T1_address_id not in (?T22_employee_address_id)) .       {SELECT ?T22_employee_address_id WHERE { ?T22 a :employees . ?T22 :employees\#employee_address_id ?T22_employee_address_id .        }    } }
customer_deliveries,"List the names, phone numbers, and emails of all customers sorted by their dates of becoming customers.",SELECT ?T1_customer_name ?T1_customer_phone ?T1_customer_email WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#customer_email ?T1_customer_email . ?T1 :customers\#date_became_customer ?T1_date_became_customer .        }  ORDER BY ASC (?T1_date_became_customer)
customer_deliveries,Find the name of the first 5 customers.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#date_became_customer ?T1_date_became_customer .        }   ORDER BY ASC (?T1_date_became_customer) LIMIT 1
customer_deliveries,Find the payment method that is used most frequently.,SELECT ?T1_payment_method (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#payment_method ?T1_payment_method .        } GROUP BY ?T1_payment_method  ORDER BY DESC (?aggregation_all) LIMIT 1
customer_deliveries,List the names of all routes in alphabetic order.,SELECT ?T1_route_name WHERE { ?T1 a :delivery_routes . ?T1 :delivery_routes\#route_name ?T1_route_name . ?T1 :delivery_routes\#route_name ?T1_route_name .        }  ORDER BY ASC (?T1_route_name)
customer_deliveries,Find the name of route that has the highest number of deliveries.,SELECT ?T1_route_name (count( *) as ?aggregation_all) WHERE { ?T1 a :delivery_routes . ?T2 a :delivery_route_locations . ?T2 :delivery_route_locations\#ref-route_id ?T1 .  ?T1 :delivery_routes\#route_name ?T1_route_name .        } GROUP BY ?T1_route_name  ORDER BY DESC (?aggregation_all) LIMIT 1
customer_deliveries,List the state names and the number of customers living in each state.,SELECT ?T1_state_province_county (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :customer_addresses . ?T2 :customer_addresses\#ref-address_id ?T1 .  ?T1 :addresses\#state_province_county ?T1_state_province_county .        } GROUP BY ?T1_state_province_county
icfp_1,How many authors are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :authors .        }
icfp_1,How many institutions are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :inst .        }
icfp_1,How many papers are published in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :papers .        }
icfp_1,What are the titles of papers published by 'Jeremy Gibbons'?,SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\#ref-authid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . FILTER(?T2_fname = 'Jeremy' && ?T2_lname = 'Gibbons') .        }
icfp_1,How many papers have 'Atsushi Ohori' published?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . FILTER(?T1_fname = 'Atsushi' && ?T1_lname = 'Ohori') .        }
icfp_1,How many papers are 'Atsushi Ohori' the author of?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . FILTER(?T1_fname = 'Atsushi' && ?T1_lname = 'Ohori') .        }
icfp_1,What is the name of the institution that 'Matthias Blume' belongs to?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :inst . ?T13 a :authorship . ?T13 :authorship\#ref-instid ?T1 .  ?T1 :inst\#name ?T1_name . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\#ref-authid ?T2 .  ?T1 :inst\#name ?T1_name . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . FILTER(?T2_fname = 'Matthias' && ?T2_lname = 'Blume') .        }
icfp_1,Which institution does 'Katsuhiro Ueno' belong to?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :inst . ?T13 a :authorship . ?T13 :authorship\#ref-instid ?T1 .  ?T1 :inst\#name ?T1_name . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\#ref-authid ?T2 .  ?T1 :inst\#name ?T1_name . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . FILTER(?T2_fname = 'Katsuhiro' && ?T2_lname = 'Ueno') .        }
icfp_1,What is the name of the institution the author 'Katsuhiro Ueno' belongs to?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :inst . ?T13 a :authorship . ?T13 :authorship\#ref-instid ?T1 .  ?T1 :inst\#name ?T1_name . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\#ref-authid ?T2 .  ?T1 :inst\#name ?T1_name . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . FILTER(?T2_fname = 'Katsuhiro' && ?T2_lname = 'Ueno') .        }
icfp_1,Who belong to the institution 'University of Oxford'? Show the first names and last names.,SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\#ref-authid ?T1 .  ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'University of Oxford') .        }
icfp_1,What are the last names of the author of the paper titled 'Binders Unbound'?,SELECT ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\#ref-authid ?T1 .  ?T1 :authors\#lname ?T1_lname . ?T2 :papers\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\#ref-paperid ?T2 .  ?T1 :authors\#lname ?T1_lname . ?T2 :papers\#title ?T2_title . FILTER(?T2_title = 'Binders Unbound') .        }
