kg_name,question,query
culture_company,List categories that have at least two books after year 1989.,SELECT ?T1_category WHERE { ?T1 a :book_club . ?T1 :book_club\#category ?T1_category . ?T1 :book_club\#year ?T1_year . FILTER(?T1_year > 1989) .        } GROUP BY ?T1_category   HAVING(count( *)  >= 2)
culture_company,Show publishers with a book published in 1989 and a book in 1990.,SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher . ?T1 :book_club\#year ?T1_year . FILTER(?T1_year = 1989) . FILTER (?T1_publisher in (?T2_publisher)) .   ?T2 a :book_club . ?T2 :book_club\#publisher ?T2_publisher . ?T2 :book_club\#year ?T2_year .  FILTER(?T2_year = 1990) .             }
culture_company,What are the publishers who have published a book in both 1989 and 1990?,SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher . ?T1 :book_club\#year ?T1_year . FILTER(?T1_year = 1989) . FILTER (?T1_publisher in (?T2_publisher)) .   ?T2 a :book_club . ?T2 :book_club\#publisher ?T2_publisher . ?T2 :book_club\#year ?T2_year .  FILTER(?T2_year = 1990) .             }
culture_company,Show all publishers which do not have a book in 1989.,SELECT distinct?col1 WHERE { { SELECT (?T1_publisher as ?col1) WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .   }}  MINUS {SELECT (?T2_publisher as ?col1) WHERE { ?T2 a :book_club . ?T2 :book_club\#publisher ?T2_publisher . ?T2 :book_club\#year ?T2_year . FILTER(?T2_year = 1989) .        }     } }
culture_company,Which publishers did not publish a book in 1989?,SELECT distinct?col1 WHERE { { SELECT (?T1_publisher as ?col1) WHERE { ?T1 a :book_club . ?T1 :book_club\#publisher ?T1_publisher .   }}  MINUS {SELECT (?T2_publisher as ?col1) WHERE { ?T2 a :book_club . ?T2 :book_club\#publisher ?T2_publisher . ?T2 :book_club\#year ?T2_year . FILTER(?T2_year = 1989) .        }     } }
culture_company,"Show all movie titles, years, and directors, ordered by budget.",SELECT ?T1_title ?T1_year ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#year ?T1_year . ?T1 :movie\#director ?T1_director . ?T1 :movie\#budget_million ?T1_budget_million .        }  ORDER BY ASC (?T1_budget_million)
culture_company,How many movie directors are there?,SELECT DISTINCT (count(DISTINCT ?T1_director) as ?aggregation_T1_director_190 ) WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director .        }
culture_company,Count the number of different directors.,SELECT DISTINCT (count(DISTINCT ?T1_director) as ?aggregation_T1_director_87 ) WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director .        }
culture_company,Return the title and director of the movie released in the year 2000 or earlier that had the highest worldwide gross.,SELECT ?T1_title ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#director ?T1_director . ?T1 :movie\#gross_worldwide ?T1_gross_worldwide . ?T1 :movie\#year ?T1_year . FILTER(?T1_year <= 2000) .        }   ORDER BY DESC (?T1_gross_worldwide) LIMIT 1
culture_company,Show all director names who have a movie in both year 1999 and 2000.,SELECT DISTINCT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director . ?T1 :movie\#year ?T1_year . FILTER(?T1_year = 2000) . FILTER (?T1_director in (?T2_director)) .   ?T2 a :movie . ?T2 :movie\#director ?T2_director . ?T2 :movie\#year ?T2_year .  FILTER(?T2_year = 1999) .             }
culture_company,Which directors had a movie both in the year 1999 and 2000?,SELECT DISTINCT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director . ?T1 :movie\#year ?T1_year . FILTER(?T1_year = 2000) . FILTER (?T1_director in (?T2_director)) .   ?T2 a :movie . ?T2 :movie\#director ?T2_director . ?T2 :movie\#year ?T2_year .  FILTER(?T2_year = 1999) .             }
culture_company,Show all director names who have a movie in the year 1999 or 2000.,SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director . ?T1 :movie\#year ?T1_year . ?T1 :movie\#year ?T1_year . FILTER(?T1_year = 1999 || ?T1_year = 2000) .        }
culture_company,Which directors had a movie in either 1999 or 2000?,SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director . ?T1 :movie\#year ?T1_year . ?T1 :movie\#year ?T1_year . FILTER(?T1_year = 1999 || ?T1_year = 2000) .        }
culture_company,"What is the average, maximum, and minimum budget for all movies before 2000.",SELECT (avg( ?T1_budget_million) as ?aggregation_T1_budget_million_117 ) (max( ?T1_budget_million) as ?aggregation_T1_budget_million_159 ) (min( ?T1_budget_million) as ?aggregation_T1_budget_million_37 ) WHERE { ?T1 a :movie . ?T1 :movie\#budget_million ?T1_budget_million . ?T1 :movie\#budget_million ?T1_budget_million . ?T1 :movie\#budget_million ?T1_budget_million . ?T1 :movie\#year ?T1_year . FILTER(?T1_year < 2000) .        }
culture_company,"Return the average, maximum, and minimum budgets in millions for movies made before the year 2000.",SELECT (avg( ?T1_budget_million) as ?aggregation_T1_budget_million_74 ) (max( ?T1_budget_million) as ?aggregation_T1_budget_million_22 ) (min( ?T1_budget_million) as ?aggregation_T1_budget_million_44 ) WHERE { ?T1 a :movie . ?T1 :movie\#budget_million ?T1_budget_million . ?T1 :movie\#budget_million ?T1_budget_million . ?T1 :movie\#budget_million ?T1_budget_million . ?T1 :movie\#year ?T1_year . FILTER(?T1_year < 2000) .        }
culture_company,List all company names with a book published by Alyson.,SELECT ?T1_company_name WHERE { ?T1 a :culture_company . ?T2 a :book_club . ?T1 :culture_company\#ref-book_club_id ?T2 .  ?T1 :culture_company\#company_name ?T1_company_name . ?T2 :book_club\#publisher ?T2_publisher . FILTER(?T2_publisher = 'Alyson') .        }
culture_company,What are all the company names that have a book published by Alyson?,SELECT ?T1_company_name WHERE { ?T1 a :culture_company . ?T2 a :book_club . ?T1 :culture_company\#ref-book_club_id ?T2 .  ?T1 :culture_company\#company_name ?T1_company_name . ?T2 :book_club\#publisher ?T2_publisher . FILTER(?T2_publisher = 'Alyson') .        }
culture_company,Show the movie titles and book titles for all companies in China.,SELECT ?T1_title ?T2_book_title WHERE { ?T1 a :movie . ?T3 a :culture_company . ?T3 :culture_company\#ref-movie_id ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :book_club\#book_title ?T2_book_title . ?T3 :culture_company\#incorporated_in ?T3_incorporated_in . ?T2 a :book_club . ?T3 :culture_company\#ref-book_club_id ?T2 .  ?T1 :movie\#title ?T1_title . ?T2 :book_club\#book_title ?T2_book_title . ?T3 :culture_company\#incorporated_in ?T3_incorporated_in . FILTER(?T3_incorporated_in = 'China') .        }
culture_company,Show all company names with a movie directed in year 1999.,SELECT ?T1_company_name WHERE { ?T1 a :culture_company . ?T2 a :movie . ?T1 :culture_company\#ref-movie_id ?T2 .  ?T1 :culture_company\#company_name ?T1_company_name . ?T2 :movie\#year ?T2_year . FILTER(?T2_year = 1999) .        }
geo,what is the biggest city in wyoming,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_179 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what wyoming city has the largest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_176 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what is the largest city in wyoming,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_60 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,where is the most populated area of wyoming,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_68 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,which city in wyoming has the largest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_42 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what cities in wyoming have the highest number of citizens,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_102 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what cities in wyoming have the highest populations,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_24 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what is the most populous city in wyoming,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_48 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what is the largest city in wyoming by population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_112 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what is the largest city of wyoming,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_156 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what is the city in wyoming with the largest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'wyoming') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_7 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,which rivers run through the state with the largest city in the us,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?aggregation_T43_population_59)) .       {SELECT ?T22_state_name WHERE { ?T22 a :city . ?T22 :city\#state_name ?T22_state_name . ?T22 :city\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_59)) .       {SELECT (max( ?T43_population) as ?aggregation_T43_population_59 ) WHERE { ?T43 a :city . ?T43 :city\#population ?T43_population .        }    } }    } }
geo,how big is new mexico,SELECT ?T1_area WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'new mexico') .        }
geo,how many people live in california,SELECT ?T1_population WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'california') .        }
geo,what state has the smallest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_34)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_34 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the least populous state,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_158)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_158 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the state with the lowest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_198)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_198 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,give me the cities in texas,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
geo,what is the area of the state with the capital albany,SELECT ?T1_area WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area . ?T1 :state\#capital ?T1_capital . FILTER(?T1_capital = 'albany') .        }
geo,give me the lakes in california,SELECT ?T1_lake_name WHERE { ?T1 a :lake . ?T1 :lake\#lake_name ?T1_lake_name . ?T1 :lake\#state_name ?T1_state_name . FILTER(?T1_state_name = 'california') .        }
geo,name the major lakes in michigan,SELECT ?T1_lake_name WHERE { ?T1 a :lake . ?T1 :lake\#lake_name ?T1_lake_name . ?T1 :lake\#area ?T1_area . ?T1 :lake\#state_name ?T1_state_name . FILTER(?T1_area > 750 && ?T1_state_name = 'michigan') .        }
geo,what are the states,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name .        }
geo,which states do ohio river flow through,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#river_name ?T1_river_name . FILTER(?T1_river_name = 'ohio') .        }
geo,what state has the largest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_161)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_161 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the most populous state,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_116)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_116 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what state is the largest in population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_112)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_112 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,which state has the biggest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_176)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_176 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,which state has the greatest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_82)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_82 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,which state has the most population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_164)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_164 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what state has the most people,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_179)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_179 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,which state has the most people,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_135)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_135 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the most populous state in the us,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_69)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_69 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what state has the highest population,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_195)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_195 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the lowest elevation in pennsylvania,SELECT ?T1_lowest_elevation WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name = 'pennsylvania') .        }
geo,what is the highest point in each state whose lowest point is sea level,SELECT ?T1_highest_point ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = 0) .        }
geo,what is the length of the longest river in the usa,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_127)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_127 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,how long is the longest river in the usa,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_75)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_75 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the longest river flowing through texas,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_101 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what is the largest river in texas state,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_43 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what is the longest river in texas,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_35 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what is the biggest river in texas,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_106 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what is the longest river that flows through texas,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_184 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,what are the biggest rivers in texas,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T22_traverse) && ?T1_traverse = 'texas') .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_160 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse = 'texas') .        }    } }
geo,how many rivers are in idaho,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_30 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,give me the number of rivers in idaho,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_21 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,how many rivers does idaho have,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_32 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,how many rivers are there in idaho,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_153 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,how many rivers run through idaho,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_81 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,how many rivers are found in idaho,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_140 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,how many rivers in idaho,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_47 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'idaho') .        }
geo,what states neighbor kentucky,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'kentucky') .        }
geo,name all the rivers in illinois,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = 'illinois') .        }
geo,what state is springfield in,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'springfield') .        }
geo,what is the population of the state with the largest area,SELECT ?T1_population WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_194)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_194 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the population of the largest state,SELECT ?T1_population WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_59)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_59 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,how many people live in boulder,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'boulder') .        }
geo,what is the smallest city in alaska,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'alaska') .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_120 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'alaska') .        }    } }
geo,which states lie on the largest river in the united states,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_145)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_145 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,which states does the longest river run through,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_198)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_198 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,which state has the longest river,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_38)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_38 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,which states does the longest river cross,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_43)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_43 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the population density of the state with the smallest area,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_105)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_105 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the population density of the smallest state,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_84)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_84 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,which states have points higher than the highest point in colorado,SELECT ?T1_state_name WHERE { ?T1 a :highlow . ?T1 :highlow\#state_name ?T1_state_name . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation > (?T22_state_name)) .       {SELECT ?T22_highest_elevation WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation . ?T22 :highlow\#state_name ?T22_state_name . FILTER(?T22_state_name = 'colorado') .        }    } }
geo,what is the highest elevation in delaware,SELECT ?T1_highest_elevation WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name = 'delaware') .        }
geo,give me the longest river that passes through the us,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_112)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_112 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,which is the longest river in usa,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_53)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_53 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the longest river in america,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_128)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_128 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,name the longest river in us,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_159)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_159 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
