kg_name,question,query
academic,return me the number of papers by ' H. V. Jagadish ' on VLDB conference after 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_184 ) WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T3 a :conference . ?T1 :publication\#ref-cid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'VLDB' && ?T1_year > 2000) .        }
academic,return me the number of keywords .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_140 ) WHERE { ?T1 a :keyword . ?T1 :keyword\#keyword ?T1_keyword .        }
academic,return me the number of keywords in Databases area .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_171 ) WHERE { ?T1 a :keyword . ?T13 a :domain_keyword . ?T13 :domain_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :domain\#name ?T2_name . ?T2 a :domain . ?T13 :domain_keyword\#ref-did ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :domain\#name ?T2_name . FILTER(?T2_name = 'Databases') .        }
academic,return me the number of papers which contain the keyword ' Natural Language ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_130 ) WHERE { ?T1 a :publication . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :keyword\#keyword ?T2_keyword . ?T2 a :keyword . ?T13 :publication_keyword\#ref-kid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :keyword\#keyword ?T2_keyword . FILTER(?T2_keyword = 'Natural Language') .        }
academic,return me the number of the keywords of ' Making database systems usable ' .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_180 ) WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T2 a :publication . ?T13 :publication_keyword\#ref-pid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . FILTER(?T2_title = 'Making database systems usable') .        }
academic,return me the number of the keywords related to ' H. V. Jagadish ' .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_187 ) WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T14 a :publication . ?T13 :publication_keyword\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T15 a :writes . ?T15 :writes\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the number of keywords in VLDB conference .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_124 ) WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T14 a :publication . ?T13 :publication_keyword\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T2 a :conference . ?T14 :publication\#ref-cid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the number of keywords in PVLDB .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_69 ) WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T14 a :publication . ?T13 :publication_keyword\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T2 a :journal . ?T14 :publication\#ref-jid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the number of keywords in the papers of ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_keyword) as ?aggregation_T1_keyword_22 ) WHERE { ?T2 :organization\#ref-keyword_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me the number of the papers of ' H. V. Jagadish ' containing keyword ' User Study ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_58 ) WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T15 a :domain_author . ?T15 :domain_author\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T16 a :domain . ?T15 :domain_author\#ref-did ?T16 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T17 a :domain_keyword . ?T17 :domain_keyword\#ref-did ?T16 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T17 :domain_keyword\#ref-kid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_keyword = 'User Study') .        }
academic,return me the number of papers in PVLDB containing keyword ' Keyword search ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_144 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T14 :publication_keyword\#ref-kid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T2_name = 'PVLDB' && ?T3_keyword = 'Keyword search') .        }
academic,return me the number of papers in VLDB conference containing keyword ' Information Retrieval ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_88 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T14 :publication_keyword\#ref-kid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T2_name = 'VLDB' && ?T3_keyword = 'Information Retrieval') .        }
academic,return me the number of authors who have papers containing keyword ' Relational Database ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_186 ) WHERE { ?T1 a :author . ?T13 a :domain_author . ?T13 :domain_author\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T14 a :domain . ?T13 :domain_author\#ref-did ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T15 a :domain_keyword . ?T15 :domain_keyword\#ref-did ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T2 a :keyword . ?T15 :domain_keyword\#ref-kid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . FILTER(?T2_keyword = 'Relational Database') .        }
academic,return me the total citations of the papers containing keyword ' Natural Language ',SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_123 ) WHERE { ?T1 a :publication . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :keyword\#keyword ?T2_keyword . ?T2 a :keyword . ?T13 :publication_keyword\#ref-kid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :keyword\#keyword ?T2_keyword . FILTER(?T2_keyword = 'Natural Language') .        }
academic,return me the number of the organizations .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_87 ) WHERE { ?T1 a :organization . ?T1 :organization\#name ?T1_name .        }
academic,return me the number of the organizations in ' North America ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_196 ) WHERE { ?T1 a :organization . ?T1 :organization\#name ?T1_name . ?T1 :organization\#continent ?T1_continent . FILTER(?T1_continent = 'North America') .        }
academic,return me the number of organizations in Databases area .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_200 ) WHERE { ?T1 :organization\#ref-domain_id ?T2 . FILTER(?T2_name = 'Databases') .        }
academic,return me the number of organizations in Databases area located in ' North America ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_42 ) WHERE { ?T1 :organization\#ref-domain_id ?T2 . FILTER(?T2_name = 'Databases' && ?T1_continent = 'North America') .        }
academic,return me the number of papers in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_149 ) WHERE { ?T2 :organization\#ref-publication_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me the number of papers in ' University of Michigan ' in Databases area .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_118 ) WHERE { ?T1 a :publication . ?T14 a :domain_publication . ?T14 :domain_publication\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T2 a :domain . ?T14 :domain_publication\#ref-did ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'Databases' && ?T3_name = 'University of Michigan') .        }
academic,return me the number of papers after 2000 in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_194 ) WHERE { ?T2 :organization\#ref-publication_id ?T1 . FILTER(?T2_name = 'University of Michigan' && ?T1_year > 2000) .        }
academic,return me the number of papers in VLDB conference in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_169 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'VLDB' && ?T3_name = 'University of Michigan') .        }
academic,return me the number of papers in PVLDB in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_13 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'PVLDB' && ?T3_name = 'University of Michigan') .        }
academic,return me the number of papers in PVLDB after 2000 in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_91 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T3_name = 'University of Michigan' && ?T1_year > 2000) .        }
academic,return me the total citations of the papers in ' University of Michigan ' .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_58 ) WHERE { ?T2 :organization\#ref-publication_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me the number of researchers in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_171 ) WHERE { ?T2 :organization\#ref-author_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me the number of researchers in Databases area in ' University of Michigan ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_38 ) WHERE { ?T1 a :author . ?T14 a :domain_author . ?T14 :domain_author\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T2 a :domain . ?T14 :domain_author\#ref-did ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'Databases' && ?T3_name = 'University of Michigan') .        }
academic,return me the number of authors who have papers in PVLDB .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_83 ) WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T14 a :publication . ?T13 :writes\#ref-pid ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T2 a :journal . ?T14 :publication\#ref-jid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the number of authors who have papers in the VLDB conference .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_152 ) WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T14 a :publication . ?T13 :writes\#ref-pid ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T2 a :conference . ?T14 :publication\#ref-cid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the number of papers published on PVLDB before 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_168 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_year < 2000) .        }
academic,return me the number of papers published in the VLDB conference before 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_93 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_year < 2000) .        }
academic,return me the total citations of all the papers in PVLDB .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_72 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the citations of each paper in PVLDB .,SELECT ?T1_citation_num WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the total citations of papers in PVLDB in 2005 .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_40 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_year = 2005) .        }
academic,return me the total citations of papers in PVLDB before 2005 .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_23 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_year < 2005) .        }
academic,return me the total citations of papers in PVLDB in each year .,SELECT ?T1_year (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_169 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#year ?T1_year . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        } GROUP BY ?T1_year
academic,return me the number of papers published in PVLDB in each year .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_59 ) ?T1_year WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        } GROUP BY ?T1_year
academic,return me the total citations of all the papers in the VLDB conference .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_196 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the citations of each paper in the VLDB conference .,SELECT ?T1_citation_num WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the total citations of papers in the VLDB conference in 2005 .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_21 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_year = 2005) .        }
academic,return me the total citations of papers in the VLDB conference before 2005 .,SELECT (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_92 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_year < 2005) .        }
academic,return me the total citations of papers in the VLDB conference in each year .,SELECT ?T1_year (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_154 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#year ?T1_year . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        } GROUP BY ?T1_year
academic,return me the number of papers published in the VLDB conference in each year .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_4 ) ?T1_year WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        } GROUP BY ?T1_year
academic,return me the authors who have cooperated both with ' H. V. Jagadish ' and ' Divesh Srivastava ' .,SELECT ?T1_name WHERE { ?T1 a :author . ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . FILTER(?T1_name = 'H. V. Jagadish' && ?T1_name = 'Divesh Srivastava') .        }
academic,return me the authors who have cooperated with ' H. V. Jagadish ' after 2000 .,SELECT ?T1_name WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . ?T2 :publication\#year ?T2_year . ?T2 a :publication . ?T13 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . ?T2 :publication\#year ?T2_year . FILTER(?T1_name = 'H. V. Jagadish' && ?T2_year > 2000) .        }
academic,return me the papers written by ' H. V. Jagadish ' and ' Divesh Srivastava ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Divesh Srivastava') .        }
academic,return me the papers written by ' H. V. Jagadish ' and ' Yunyao Li ' after 2005 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Yunyao Li' && ?T1_year > 2005) .        }
academic,return me the papers written by ' H. V. Jagadish ' and ' Yunyao Li ' on PVLDB .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Yunyao Li' && ?T3_name = 'PVLDB') .        }
academic,return me the papers written by ' H. V. Jagadish ' and ' Yunyao Li ' on PVLDB after 2005 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Yunyao Li' && ?T3_name = 'PVLDB' && ?T1_year > 2005) .        }
academic,return me the authors who have cooperated with ' H. V. Jagadish ' .,SELECT ?T1_name WHERE { ?T1 a :author . ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . FILTER(?T1_name = 'H. V. Jagadish') .        }
academic,return me the number of papers written by ' H. V. Jagadish ' and ' Divesh Srivastava ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_94 ) WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Divesh Srivastava') .        }
academic,return me the number of papers written by ' H. V. Jagadish ' and ' Divesh Srivastava ' before 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_136 ) WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Divesh Srivastava' && ?T1_year < 2000) .        }
academic,"return me the number of papers written by ' H. V. Jagadish ' , ' Yunyao Li ' , and ' Cong Yu ' .",SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_114 ) WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'Cong Yu' && ?T2_name = 'H. V. Jagadish' && ?T2_name = 'Yunyao Li') .        }
academic,return me the number of authors who have cooperated with ' H. V. Jagadish ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_192 ) WHERE { ?T1 a :author . ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . FILTER(?T1_name = 'H. V. Jagadish') .        }
academic,return me the number of authors who have cited the papers by ' H. V. Jagadish ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_187 ) WHERE { ?T1 a :author . ?T1 :author\#name ?T1_name . ?T1 :author\#name ?T1_name . FILTER(?T1_name = 'H. V. Jagadish') .        }
academic,return me the papers written by ' H. V. Jagadish ' and ' Divesh Srivastava ' with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'H. V. Jagadish' && ?T2_name = 'Divesh Srivastava' && ?T1_citation_num > 200) .        }
academic,return me the author who has the most number of papers containing keyword ' Relational Database ' .,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T2 a :publication . ?T14 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T15 a :publication_keyword . ?T15 :publication_keyword\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T15 :publication_keyword\#ref-kid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T3_keyword = 'Relational Database') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_72 )) LIMIT 1
academic,return me the conference that has the most number of papers containing keyword ' Relational Database ' .,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :conference . ?T2 a :publication . ?T2 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T2 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T14 :publication_keyword\#ref-kid ?T3 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T3_keyword = 'Relational Database') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_43 )) LIMIT 1
academic,return me the journal that has the most number of papers containing keyword ' Relational Database ' .,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :journal . ?T2 a :publication . ?T2 :publication\#ref-jid ?T1 .  ?T1 :journal\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T2 .  ?T1 :journal\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T14 :publication_keyword\#ref-kid ?T3 .  ?T1 :journal\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T3_keyword = 'Relational Database') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_5 )) LIMIT 1
academic,"return me the keyword, which have been contained by the most number of papers in VLDB conference .",SELECT ?T1_keyword (count( *) as ?aggregation_all) WHERE { ?T1 a :keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :conference\#name ?T3_name . ?T2 a :publication . ?T14 :publication_keyword\#ref-pid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :conference\#name ?T3_name . ?T3 a :conference . ?T2 :publication\#ref-cid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :conference\#name ?T3_name . FILTER(?T3_name = 'VLDB') .        } GROUP BY ?T1_keyword  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_80 )) LIMIT 1
academic,"return me the keyword, which have been contained by the most number of papers in PVLDB .",SELECT ?T1_keyword (count( *) as ?aggregation_all) WHERE { ?T1 a :keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :journal\#name ?T3_name . ?T2 a :publication . ?T14 :publication_keyword\#ref-pid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :journal\#name ?T3_name . ?T3 a :journal . ?T2 :publication\#ref-jid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :journal\#name ?T3_name . FILTER(?T3_name = 'PVLDB') .        } GROUP BY ?T1_keyword  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_20 )) LIMIT 1
academic,"return me the keyword, which have been contained by the most number of papers by ' H. V. Jagadish ' .",SELECT ?T1_keyword (count( *) as ?aggregation_all) WHERE { ?T1 a :keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T2 a :publication . ?T14 :publication_keyword\#ref-pid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T15 a :writes . ?T15 :writes\#ref-pid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T3 a :author . ?T15 :writes\#ref-aid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . FILTER(?T3_name = 'H. V. Jagadish') .        } GROUP BY ?T1_keyword  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_66 )) LIMIT 1
