kg_name,question,query
bike_1,Return the unique name for stations that have ever had 7 bikes available.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T2 :status\#bikes_available ?T2_bikes_available . FILTER(?T2_bikes_available = 7) .        }
bike_1,What are the different names for each station that has ever had 7 bikes available?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T2 :status\#bikes_available ?T2_bikes_available . FILTER(?T2_bikes_available = 7) .        }
bike_1,Which start station had the most trips starting from August? Give me the name and id of the station.,"SELECT ?T1_start_station_name (count( *) as ?aggregation_all) ?T1_start_station_id WHERE { ?T1 a :trip . ?T1 :trip\#start_station_name ?T1_start_station_name . ?T1 :trip\#start_station_id ?T1_start_station_id . ?T1 :trip\#start_date ?T1_start_date . FILTER(contains (?T1_start_date, '8/')) .        } GROUP BY ?T1_start_station_name  ?T1_start_station_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
bike_1,What are the start station's name and id for the one that had the most start trips in August?,"SELECT ?T1_start_station_name (count( *) as ?aggregation_all) ?T1_start_station_id WHERE { ?T1 a :trip . ?T1 :trip\#start_station_name ?T1_start_station_name . ?T1 :trip\#start_station_id ?T1_start_station_id . ?T1 :trip\#start_date ?T1_start_date . FILTER(contains (?T1_start_date, '8/')) .        } GROUP BY ?T1_start_station_name  ?T1_start_station_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
bike_1,Which bike traveled the most often in zip code 94002?,SELECT ?T1_bike_id (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T1 :trip\#bike_id ?T1_bike_id . ?T1 :trip\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94002') .        } GROUP BY ?T1_bike_id  ORDER BY DESC (?aggregation_all) LIMIT 1
bike_1,What is the id of the bike that traveled the most in 94002?,SELECT ?T1_bike_id (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T1 :trip\#bike_id ?T1_bike_id . ?T1 :trip\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94002') .        } GROUP BY ?T1_bike_id  ORDER BY DESC (?aggregation_all) LIMIT 1
bike_1,How many days had both mean humidity above 50 and mean visibility above 8?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\#mean_humidity ?T1_mean_humidity . ?T1 :weather\#mean_visibility_miles ?T1_mean_visibility_miles . FILTER(?T1_mean_humidity > 50 && ?T1_mean_visibility_miles > 8) .        }
bike_1,What is the number of days that had an average humity above 50 and an average visibility above 8?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\#mean_humidity ?T1_mean_humidity . ?T1 :weather\#mean_visibility_miles ?T1_mean_visibility_miles . FILTER(?T1_mean_humidity > 50 && ?T1_mean_visibility_miles > 8) .        }
bike_1,"What is the latitude, longitude, city of the station from which the shortest trip started?",SELECT ?T1_lat ?T1_long ?T1_city WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\#ref-id ?T2 .  ?T1 :station\#lat ?T1_lat . ?T1 :station\#long ?T1_long . ?T1 :station\#city ?T1_city . ?T2 :trip\#duration ?T2_duration .        }   ORDER BY ASC (?T2_duration) LIMIT 1
bike_1,"What is the latitude, longitude, and city of the station from which the trip with smallest duration started?",SELECT ?T1_lat ?T1_long ?T1_city WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\#ref-id ?T2 .  ?T1 :station\#lat ?T1_lat . ?T1 :station\#long ?T1_long . ?T1 :station\#city ?T1_city . ?T2 :trip\#duration ?T2_duration .        }   ORDER BY ASC (?T2_duration) LIMIT 1
bike_1,What are the ids of stations that are located in San Francisco and have average bike availability above 10.,SELECT DISTINCT ?T1_id WHERE { ?T1 a :station . ?T1 :station\#id ?T1_id . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'San Francisco') . FILTER (?T1_id in (?T2_station_id)) .   ?T2 a :status . ?T2 :status\#station_id ?T2_station_id . ?T2 :status\#bikes_available ?T2_bikes_available .     GROUP BY ?T2_station_id   HAVING(avg( ?T2_bikes_available)  > 10)      }
bike_1,What are the ids of the stations in San Francisco that normally have more than 10 bikes available?,SELECT DISTINCT ?T1_id WHERE { ?T1 a :station . ?T1 :station\#id ?T1_id . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'San Francisco') . FILTER (?T1_id in (?T2_station_id)) .   ?T2 a :status . ?T2 :status\#station_id ?T2_station_id . ?T2 :status\#bikes_available ?T2_bikes_available .     GROUP BY ?T2_station_id   HAVING(avg( ?T2_bikes_available)  > 10)      }
bike_1,What are the names and ids of stations that had more than 14 bikes available on average or were installed in December?,"SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_id as ?col2) WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T1 :station\#id ?T1_id . ?T2 :status\#bikes_available ?T2_bikes_available .   }} UNION {SELECT (?T1_name as ?col1) (?T1_id as ?col2) WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#id ?T1_id . ?T1 :station\#installation_date ?T1_installation_date . FILTER(contains (?T1_installation_date, '12')) .        }      } } GROUP BY ?T1_name ?T1_id   HAVING(avg( ?T2_bikes_available)  > 14)"
bike_1,What are the names and ids of all stations that have more than 14 bikes available on average or had bikes installed in December?,"SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_id as ?col2) WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T1 :station\#id ?T1_id . ?T2 :status\#bikes_available ?T2_bikes_available .   }} UNION {SELECT (?T1_name as ?col1) (?T1_id as ?col2) WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#id ?T1_id . ?T1 :station\#installation_date ?T1_installation_date . FILTER(contains (?T1_installation_date, '12')) .        }      } } GROUP BY ?T1_name ?T1_id   HAVING(avg( ?T2_bikes_available)  > 14)"
bike_1,What is the 3 most common cloud cover rates in the region of zip code 94107?,SELECT ?T1_cloud_cover (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\#cloud_cover ?T1_cloud_cover . ?T1 :weather\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94107') .        } GROUP BY ?T1_cloud_cover  ORDER BY DESC (?aggregation_all) LIMIT 1
bike_1,What are the 3 most common cloud covers in the zip code of 94107?,SELECT ?T1_cloud_cover (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\#cloud_cover ?T1_cloud_cover . ?T1 :weather\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94107') .        } GROUP BY ?T1_cloud_cover  ORDER BY DESC (?aggregation_all) LIMIT 1
bike_1,What is the zip code in which the average mean sea level pressure is the lowest?,SELECT ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_sea_level_pressure_inches ?T1_mean_sea_level_pressure_inches .        } GROUP BY ?T1_zip_code  ORDER BY ASC ((avg( ?T1_mean_sea_level_pressure_inches) as ?aggregation_T1_mean_sea_level_pressure_inches_81 )) LIMIT 1
bike_1,What is the zip code that has the lowest average mean sea level pressure?,SELECT ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_sea_level_pressure_inches ?T1_mean_sea_level_pressure_inches .        } GROUP BY ?T1_zip_code  ORDER BY ASC ((avg( ?T1_mean_sea_level_pressure_inches) as ?aggregation_T1_mean_sea_level_pressure_inches_142 )) LIMIT 1
bike_1,What is the average bike availability in stations that are not located in Palo Alto?,SELECT (avg( ?T1_bikes_available) as ?aggregation_T1_bikes_available_113 ) WHERE { ?T1 a :status . ?T1 :status\#bikes_available ?T1_bikes_available . ?T1 :status\#station_id ?T1_station_id . FILTER(?T1_station_id not in (?T22_city)) .       {SELECT ?T22_id WHERE { ?T22 a :station . ?T22 :station\#id ?T22_id . ?T22 :station\#city ?T22_city . FILTER(?T22_city = 'Palo Alto') .        }    } }
bike_1,What is the average bike availablility for stations not in Palo Alto?,SELECT (avg( ?T1_bikes_available) as ?aggregation_T1_bikes_available_192 ) WHERE { ?T1 a :status . ?T1 :status\#bikes_available ?T1_bikes_available . ?T1 :status\#station_id ?T1_station_id . FILTER(?T1_station_id not in (?T22_city)) .       {SELECT ?T22_id WHERE { ?T22 a :station . ?T22 :station\#id ?T22_id . ?T22 :station\#city ?T22_city . FILTER(?T22_city = 'Palo Alto') .        }    } }
bike_1,What is the average longitude of stations that never had bike availability more than 10?,SELECT (avg( ?T1_long) as ?aggregation_T1_long_143 ) WHERE { ?T1 a :station . ?T1 :station\#long ?T1_long . ?T1 :station\#id ?T1_id . FILTER(?T1_id not in (?T22_station_id)) .       {SELECT ?T22_station_id WHERE { ?T22 a :status . ?T22 :status\#station_id ?T22_station_id . ?T22 :status\#bikes_available ?T22_bikes_available .        } GROUP BY ?T22_station_id   HAVING(max( ?T22_bikes_available)  > 10)} }
bike_1,What is the mean longitude for all stations that have never had more than 10 bikes available?,SELECT (avg( ?T1_long) as ?aggregation_T1_long_110 ) WHERE { ?T1 a :station . ?T1 :station\#long ?T1_long . ?T1 :station\#id ?T1_id . FILTER(?T1_id not in (?T22_station_id)) .       {SELECT ?T22_station_id WHERE { ?T22 a :status . ?T22 :status\#station_id ?T22_station_id . ?T22 :status\#bikes_available ?T22_bikes_available .        } GROUP BY ?T22_station_id   HAVING(max( ?T22_bikes_available)  > 10)} }
bike_1,When and in what zip code did max temperature reach 80?,SELECT ?T1_date ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . FILTER(?T1_max_temperature_f >= 80) .        }
bike_1,What zip codes have a station with a max temperature greater than or equal to 80 and when did it reach that temperature?,SELECT ?T1_date ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . FILTER(?T1_max_temperature_f >= 80) .        }
bike_1,Give me ids for all the trip that took place in a zip code area with average mean temperature above 60.,SELECT ?T1_id WHERE { ?T2 :weather\#ref-trip_id ?T1 .        } GROUP BY ?T1_id   HAVING(avg( ?T2_mean_temperature_f)  > 60)
bike_1,"For each zip code, find the ids of all trips that have a higher average mean temperature above 60?",SELECT ?T1_id WHERE { ?T2 :weather\#ref-trip_id ?T1 .        } GROUP BY ?T1_id   HAVING(avg( ?T2_mean_temperature_f)  > 60)
bike_1,"For each zip code, return how many times max wind speed reached 25?",SELECT ?T1_zip_code (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#max_wind_speed_mph ?T1_max_wind_speed_mph . FILTER(?T1_max_wind_speed_mph >= 25) .        } GROUP BY ?T1_zip_code
bike_1,"For each zip code, how many times has the maximum wind speed reached 25 mph?",SELECT ?T1_zip_code (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#max_wind_speed_mph ?T1_max_wind_speed_mph . FILTER(?T1_max_wind_speed_mph >= 25) .        } GROUP BY ?T1_zip_code
bike_1,On which day and in which zip code was the min dew point lower than any day in zip code 94107?,SELECT ?T1_date ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#min_dew_point_f ?T1_min_dew_point_f . FILTER(?T1_min_dew_point_f < (?T22_zip_code)) .       {SELECT (min( ?T22_min_dew_point_f) as ?aggregation_T22_min_dew_point_f_171 ) WHERE { ?T22 a :weather . ?T22 :weather\#min_dew_point_f ?T22_min_dew_point_f . ?T22 :weather\#zip_code ?T22_zip_code . FILTER(?T22_zip_code = '94107') .        }    } }
bike_1,"Which days had a minimum dew point smaller than any day in zip code 94107, and in which zip codes were those measurements taken?",SELECT ?T1_date ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#min_dew_point_f ?T1_min_dew_point_f . FILTER(?T1_min_dew_point_f < (?T22_zip_code)) .       {SELECT (min( ?T22_min_dew_point_f) as ?aggregation_T22_min_dew_point_f_126 ) WHERE { ?T22 a :weather . ?T22 :weather\#min_dew_point_f ?T22_min_dew_point_f . ?T22 :weather\#zip_code ?T22_zip_code . FILTER(?T22_zip_code = '94107') .        }    } }
bike_1,"For each trip, return its ending station's installation date.",SELECT ?T1_id ?T2_installation_date WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T1 :trip\#id ?T1_id . ?T2 :station\#installation_date ?T2_installation_date .        }
bike_1,What is the installation date for each ending station on all the trips?,SELECT ?T1_id ?T2_installation_date WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T1 :trip\#id ?T1_id . ?T2 :station\#installation_date ?T2_installation_date .        }
bike_1,Which trip started from the station with the largest dock count? Give me the trip id.,SELECT ?T1_id WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T1 :trip\#id ?T1_id . ?T2 :station\#dock_count ?T2_dock_count .        }   ORDER BY DESC (?T2_dock_count) LIMIT 1
bike_1,What is the id of the trip that started from the station with the highest dock count?,SELECT ?T1_id WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T1 :trip\#id ?T1_id . ?T2 :station\#dock_count ?T2_dock_count .        }   ORDER BY DESC (?T2_dock_count) LIMIT 1
bike_1,Count the number of trips that did not end in San Francisco city.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T2 :station\#city ?T2_city . FILTER(?T2_city != 'San Francisco') .        }
bike_1,How many trips did not end in San Francisco?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T2 :station\#city ?T2_city . FILTER(?T2_city != 'San Francisco') .        }
bike_1,"In zip code 94107, on which day neither Fog nor Rain was not observed?",SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#events ?T1_events . ?T1 :weather\#events ?T1_events . FILTER(?T1_zip_code = '94107' && ?T1_events != 'Fog' && ?T1_events != 'Rain') .        }
bike_1,On which day has it neither been foggy nor rained in the zip code of 94107?,SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#events ?T1_events . ?T1 :weather\#events ?T1_events . FILTER(?T1_zip_code = '94107' && ?T1_events != 'Fog' && ?T1_events != 'Rain') .        }
bike_1,What are the ids of stations that have latitude above 37.4 and never had bike availability below 7?,SELECT distinct?col1 WHERE { { SELECT (?T1_id as ?col1) WHERE { ?T1 a :station . ?T1 :station\#id ?T1_id . ?T1 :station\#lat ?T1_lat . FILTER(?T1_lat > 37.4) .   }}  MINUS {SELECT (?T2_station_id as ?col1) WHERE { ?T2 a :status . ?T2 :status\#station_id ?T2_station_id . ?T2 :status\#bikes_available ?T2_bikes_available .        } GROUP BY ?T2_station_id   HAVING(min( ?T2_bikes_available)  < 7) } }
bike_1,What are the ids of all stations that have a latitude above 37.4 and have never had less than 7 bikes available?,SELECT distinct?col1 WHERE { { SELECT (?T1_id as ?col1) WHERE { ?T1 a :station . ?T1 :station\#id ?T1_id . ?T1 :station\#lat ?T1_lat . FILTER(?T1_lat > 37.4) .   }}  MINUS {SELECT (?T2_station_id as ?col1) WHERE { ?T2 a :status . ?T2 :status\#station_id ?T2_station_id . ?T2 :status\#bikes_available ?T2_bikes_available .        } GROUP BY ?T2_station_id   HAVING(min( ?T2_bikes_available)  < 7) } }
bike_1,What are names of stations that have average bike availability above 10 and are not located in San Jose city?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T2 :status\#bikes_available ?T2_bikes_available .   }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T3 a :station . ?T3 :station\#name ?T3_name . ?T3 :station\#city ?T3_city . FILTER(?T3_city = 'San Jose') .        }     } } GROUP BY ?T1_name   HAVING(avg( ?T2_bikes_available)  > 10)
bike_1,What are the names of all stations that have more than 10 bikes available and are not located in San Jose?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T2 :status\#bikes_available ?T2_bikes_available .   }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T3 a :station . ?T3 :station\#name ?T3_name . ?T3 :station\#city ?T3_city . FILTER(?T3_city = 'San Jose') .        }     } } GROUP BY ?T1_name   HAVING(avg( ?T2_bikes_available)  > 10)
bike_1,"What are the name, latitude, and city of the station with the lowest latitude?",SELECT ?T1_name ?T1_lat ?T1_city WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#lat ?T1_lat . ?T1 :station\#city ?T1_city . ?T1 :station\#lat ?T1_lat .        }   ORDER BY ASC (?T1_lat) LIMIT 1
bike_1,"What is the name, latitude, and city of the station that is located the furthest South?",SELECT ?T1_name ?T1_lat ?T1_city WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#lat ?T1_lat . ?T1 :station\#city ?T1_city . ?T1 :station\#lat ?T1_lat .        }   ORDER BY ASC (?T1_lat) LIMIT 1
bike_1,"What are the date, mean temperature and mean humidity for the top 3 days with the largest max gust speeds?",SELECT ?T1_date ?T1_mean_temperature_f ?T1_mean_humidity WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#mean_temperature_f ?T1_mean_temperature_f . ?T1 :weather\#mean_humidity ?T1_mean_humidity . ?T1 :weather\#max_gust_speed_mph ?T1_max_gust_speed_mph .        }   ORDER BY DESC (?T1_max_gust_speed_mph) LIMIT 1
bike_1,"What is the date, average temperature and mean humidity for the days with the 3 largest maximum gust speeds?",SELECT ?T1_date ?T1_mean_temperature_f ?T1_mean_humidity WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#mean_temperature_f ?T1_mean_temperature_f . ?T1 :weather\#mean_humidity ?T1_mean_humidity . ?T1 :weather\#max_gust_speed_mph ?T1_max_gust_speed_mph .        }   ORDER BY DESC (?T1_max_gust_speed_mph) LIMIT 1
bike_1,List the name and the number of stations for all the cities that have at least 15 stations.,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city .        } GROUP BY ?T1_city   HAVING(count( *)  >= 15)
bike_1,What is the name of every city that has at least 15 stations and how many stations does it have?,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city .        } GROUP BY ?T1_city   HAVING(count( *)  >= 15)
bike_1,Find the ids and names of stations from which at least 200 trips started.,SELECT ?T1_start_station_id ?T1_start_station_name WHERE { ?T1 a :trip . ?T1 :trip\#start_station_id ?T1_start_station_id . ?T1 :trip\#start_station_name ?T1_start_station_name .        } GROUP BY ?T1_start_station_id  ?T1_start_station_name   HAVING(count( *)  >= 200)
bike_1,What are the ids and names of all start stations that were the beginning of at least 200 trips?,SELECT ?T1_start_station_id ?T1_start_station_name WHERE { ?T1 a :trip . ?T1 :trip\#start_station_id ?T1_start_station_id . ?T1 :trip\#start_station_name ?T1_start_station_name .        } GROUP BY ?T1_start_station_id  ?T1_start_station_name   HAVING(count( *)  >= 200)
bike_1,Find the zip code in which the average mean visibility is lower than 10.,SELECT ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_visibility_miles ?T1_mean_visibility_miles .        } GROUP BY ?T1_zip_code   HAVING(avg( ?T1_mean_visibility_miles)  < 10)
bike_1,List all the cities in a decreasing order of each city's stations' highest latitude.,SELECT ?T1_city WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city . ?T1 :station\#lat ?T1_lat .        } GROUP BY ?T1_city ORDER BY DESC ((max( ?T1_lat) as ?aggregation_T1_lat_31 ))
bike_1,"For each city, list their names in decreasing order by their highest station latitude.",SELECT ?T1_city WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city . ?T1 :station\#lat ?T1_lat .        } GROUP BY ?T1_city ORDER BY DESC ((max( ?T1_lat) as ?aggregation_T1_lat_126 ))
bike_1,What are the dates that had the top 5 cloud cover rates? Also tell me the cloud cover rate.,SELECT ?T1_date ?T1_cloud_cover WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#cloud_cover ?T1_cloud_cover . ?T1 :weather\#cloud_cover ?T1_cloud_cover .        }   ORDER BY DESC (?T1_cloud_cover) LIMIT 1
bike_1,What are the dates that have the 5 highest cloud cover rates and what are the rates?,SELECT ?T1_date ?T1_cloud_cover WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#cloud_cover ?T1_cloud_cover . ?T1 :weather\#cloud_cover ?T1_cloud_cover .        }   ORDER BY DESC (?T1_cloud_cover) LIMIT 1
bike_1,What are the ids and durations of the trips with the top 3 durations?,SELECT ?T1_id ?T1_duration WHERE { ?T1 a :trip . ?T1 :trip\#id ?T1_id . ?T1 :trip\#duration ?T1_duration . ?T1 :trip\#duration ?T1_duration .        }   ORDER BY DESC (?T1_duration) LIMIT 1
bike_1,What are the ids of the trips that lasted the longest and how long did they last?,SELECT ?T1_id ?T1_duration WHERE { ?T1 a :trip . ?T1 :trip\#id ?T1_id . ?T1 :trip\#duration ?T1_duration . ?T1 :trip\#duration ?T1_duration .        }   ORDER BY DESC (?T1_duration) LIMIT 1
bike_1,"For each station, return its longitude and the average duration of trips that started from the station.",SELECT ?T1_name ?T1_long (avg( ?T2_duration) as ?aggregation_T2_duration_32 ) WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\#ref-id ?T2 .  ?T1 :station\#name ?T1_name . ?T1 :station\#long ?T1_long . ?T2 :trip\#duration ?T2_duration .        } GROUP BY ?T1_name ?T1_long
bike_1,"For each start station id, what is its name, longitude and average duration of trips started there?",SELECT ?T1_name ?T1_long (avg( ?T2_duration) as ?aggregation_T2_duration_106 ) WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\#ref-id ?T2 .  ?T1 :station\#name ?T1_name . ?T1 :station\#long ?T1_long . ?T2 :trip\#duration ?T2_duration .        } GROUP BY ?T1_name ?T1_long
bike_1,"For each station, find its latitude and the minimum duration of trips that ended at the station.",SELECT ?T1_name ?T1_lat (min( ?T2_duration) as ?aggregation_T2_duration_167 ) WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\#ref-id ?T2 .  ?T1 :station\#name ?T1_name . ?T1 :station\#lat ?T1_lat . ?T2 :trip\#duration ?T2_duration .        } GROUP BY ?T1_name ?T1_lat
bike_1,"For each end station id, what is its name, latitude, and minimum duration for trips ended there?",SELECT ?T1_name ?T1_lat (min( ?T2_duration) as ?aggregation_T2_duration_12 ) WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\#ref-id ?T2 .  ?T1 :station\#name ?T1_name . ?T1 :station\#lat ?T1_lat . ?T2 :trip\#duration ?T2_duration .        } GROUP BY ?T1_name ?T1_lat
bike_1,List all the distinct stations from which a trip of duration below 100 started.,SELECT DISTINCT ?T1_start_station_name WHERE { ?T1 a :trip . ?T1 :trip\#start_station_name ?T1_start_station_name . ?T1 :trip\#duration ?T1_duration . FILTER(?T1_duration < 100) .        }
bike_1,What are all the different start station names for a trip that lasted less than 100?,SELECT DISTINCT ?T1_start_station_name WHERE { ?T1 a :trip . ?T1 :trip\#start_station_name ?T1_start_station_name . ?T1 :trip\#duration ?T1_duration . FILTER(?T1_duration < 100) .        }
bike_1,Find all the zip codes in which the max dew point have never reached 70.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_zip_code as ?col1) WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code .   }}  MINUS {SELECT DISTINCT (?T2_zip_code as ?col1) WHERE { ?T2 a :weather . ?T2 :weather\#zip_code ?T2_zip_code . ?T2 :weather\#max_dew_point_f ?T2_max_dew_point_f . FILTER(?T2_max_dew_point_f >= 70) .        }     } }
bike_1,What are all the different zip codes that have a maximum dew point that was always below 70?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_zip_code as ?col1) WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code .   }}  MINUS {SELECT DISTINCT (?T2_zip_code as ?col1) WHERE { ?T2 a :weather . ?T2 :weather\#zip_code ?T2_zip_code . ?T2 :weather\#max_dew_point_f ?T2_max_dew_point_f . FILTER(?T2_max_dew_point_f >= 70) .        }     } }
bike_1,Find the id for the trips that lasted at least as long as the average duration of trips in zip code 94103.,SELECT ?T1_id WHERE { ?T1 a :trip . ?T1 :trip\#id ?T1_id . ?T1 :trip\#duration ?T1_duration . FILTER(?T1_duration >= (?T22_zip_code)) .       {SELECT (avg( ?T22_duration) as ?aggregation_T22_duration_176 ) WHERE { ?T22 a :trip . ?T22 :trip\#duration ?T22_duration . ?T22 :trip\#zip_code ?T22_zip_code . FILTER(?T22_zip_code = '94103') .        }    } }
bike_1,What are the ids of all trips that had a duration as long as the average trip duration in the zip code 94103?,SELECT ?T1_id WHERE { ?T1 a :trip . ?T1 :trip\#id ?T1_id . ?T1 :trip\#duration ?T1_duration . FILTER(?T1_duration >= (?T22_zip_code)) .       {SELECT (avg( ?T22_duration) as ?aggregation_T22_duration_77 ) WHERE { ?T22 a :trip . ?T22 :trip\#duration ?T22_duration . ?T22 :trip\#zip_code ?T22_zip_code . FILTER(?T22_zip_code = '94103') .        }    } }
bike_1,What are the dates in which the mean sea level pressure was between 30.3 and 31?,SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#mean_sea_level_pressure_inches ?T1_mean_sea_level_pressure_inches . FILTER(?T1_mean_sea_level_pressure_inches >= 30.3 && ?T1_mean_sea_level_pressure_inches <= 31) .        }
bike_1,What are the dates that have an average sea level pressure between 30.3 and 31?,SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#mean_sea_level_pressure_inches ?T1_mean_sea_level_pressure_inches . FILTER(?T1_mean_sea_level_pressure_inches >= 30.3 && ?T1_mean_sea_level_pressure_inches <= 31) .        }
bike_1,Find the day in which the difference between the max temperature and min temperature was the smallest. Also report the difference.,SELECT ?T1_date ?T1_max_temperature_f - ?T1_min_temperature_f WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . ?T1 :weather\#min_temperature_f ?T1_min_temperature_f . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . ?T1 :weather\#min_temperature_f ?T1_min_temperature_f .        }   ORDER BY ASC (?T1_max_temperature_f - ?T1_min_temperature_f) LIMIT 1
bike_1,"What are the days that had the smallest temperature range, and what was that range?",SELECT ?T1_date ?T1_max_temperature_f - ?T1_min_temperature_f WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . ?T1 :weather\#min_temperature_f ?T1_min_temperature_f . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . ?T1 :weather\#min_temperature_f ?T1_min_temperature_f .        }   ORDER BY ASC (?T1_max_temperature_f - ?T1_min_temperature_f) LIMIT 1
bike_1,What are the id and name of the stations that have ever had more than 12 bikes available?,SELECT DISTINCT ?T1_id ?T1_name WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#id ?T1_id . ?T1 :station\#name ?T1_name . ?T2 :status\#bikes_available ?T2_bikes_available . FILTER(?T2_bikes_available > 12) .        }
bike_1,What are the different ids and names of the stations that have had more than 12 bikes available?,SELECT DISTINCT ?T1_id ?T1_name WHERE { ?T1 a :station . ?T2 a :status . ?T2 :status\#ref-station_id ?T1 .  ?T1 :station\#id ?T1_id . ?T1 :station\#name ?T1_name . ?T2 :status\#bikes_available ?T2_bikes_available . FILTER(?T2_bikes_available > 12) .        }
bike_1,Give me the zip code where the average mean humidity is below 70 and at least 100 trips took place.,SELECT DISTINCT ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_humidity ?T1_mean_humidity . FILTER (?T1_zip_code in (?T2_zip_code)) .   ?T2 a :trip . ?T2 :trip\#zip_code ?T2_zip_code .     GROUP BY ?T2_zip_code   HAVING(count( *)  >= 100)      } GROUP BY ?T1_zip_code   HAVING(avg( ?T1_mean_humidity)  < 70)
bike_1,What are the zip codes that have an average mean humidity below 70 and had at least 100 trips come through there?,SELECT DISTINCT ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_humidity ?T1_mean_humidity . FILTER (?T1_zip_code in (?T2_zip_code)) .   ?T2 a :trip . ?T2 :trip\#zip_code ?T2_zip_code .     GROUP BY ?T2_zip_code   HAVING(count( *)  >= 100)      } GROUP BY ?T1_zip_code   HAVING(avg( ?T1_mean_humidity)  < 70)
bike_1,What are the names of stations that are located in Palo Alto city but have never been the ending point of trips more than 100 times?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'Palo Alto') .   }}  MINUS {SELECT (?T2_end_station_name as ?col1) WHERE { ?T2 a :trip . ?T2 :trip\#end_station_name ?T2_end_station_name .        } GROUP BY ?T2_end_station_name   HAVING(count( *)  > 100) } }
bike_1,How many trips started from Mountain View city and ended at Palo Alto city?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T2 :station\#city ?T2_city . ?T2 :station\#city ?T2_city . FILTER(?T2_city = 'Mountain View' && ?T2_city = 'Palo Alto') .        }
bike_1,How many trips stated from  a station in Mountain View and ended at one in Palo Alto?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\#ref-id ?T1 .  ?T2 :station\#city ?T2_city . ?T2 :station\#city ?T2_city . FILTER(?T2_city = 'Mountain View' && ?T2_city = 'Palo Alto') .        }
bike_1,What is the average latitude and longitude of the starting points of all trips?,SELECT (avg( ?T1_lat) as ?aggregation_T1_lat_27 ) (avg( ?T1_long) as ?aggregation_T1_long_5 ) WHERE { ?T1 a :station . ?T1 :station\#lat ?T1_lat . ?T1 :station\#long ?T1_long .        }
bike_1,What is the average latitude and longitude of all starting stations for the trips?,SELECT (avg( ?T1_lat) as ?aggregation_T1_lat_133 ) (avg( ?T1_long) as ?aggregation_T1_long_99 ) WHERE { ?T1 a :station . ?T1 :station\#lat ?T1_lat . ?T1 :station\#long ?T1_long .        }
book_2,How many books are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :book .        }
book_2,List the writers of the books in ascending alphabetical order.,SELECT ?T1_writer WHERE { ?T1 a :book . ?T1 :book\#writer ?T1_writer . ?T1 :book\#writer ?T1_writer .        }  ORDER BY ASC (?T1_writer)
book_2,List the titles of the books in ascending order of issues.,SELECT ?T1_title WHERE { ?T1 a :book . ?T1 :book\#title ?T1_title . ?T1 :book\#issues ?T1_issues .        }  ORDER BY ASC (?T1_issues)
book_2,What are the titles of the books whose writer is not 'Elaine Lee'?,SELECT ?T1_title WHERE { ?T1 a :book . ?T1 :book\#title ?T1_title . ?T1 :book\#writer ?T1_writer . FILTER(?T1_writer != 'Elaine Lee') .        }
book_2,What are the title and issues of the books?,SELECT ?T1_title ?T1_issues WHERE { ?T1 a :book . ?T1 :book\#title ?T1_title . ?T1 :book\#issues ?T1_issues .        }
book_2,What are the dates of publications in descending order of price?,SELECT ?T1_publication_date WHERE { ?T1 a :publication . ?T1 :publication\#publication_date ?T1_publication_date . ?T1 :publication\#price ?T1_price .        }  ORDER BY DESC (?T1_price)
