kg_name,question,query
icfp_1,"Find the first and last name of the author(s) who wrote the paper 'Nameless, Painless'.","SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\#ref-authid ?T1 .  ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T2 :papers\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\#ref-paperid ?T2 .  ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T2 :papers\#title ?T2_title . FILTER(?T2_title = 'Nameless ,  Painless') .        }"
icfp_1,"What are the first and last name of the author who published the paper titled 'Nameless, Painless'?","SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\#ref-authid ?T1 .  ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T2 :papers\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\#ref-paperid ?T2 .  ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T2 :papers\#title ?T2_title . FILTER(?T2_title = 'Nameless ,  Painless') .        }"
icfp_1,What are the papers published under the institution 'Indiana University'?,SELECT DISTINCT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'Indiana University') .        }
icfp_1,Which papers were written by authors from the institution 'Google'?,SELECT DISTINCT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'Google') .        }
icfp_1,How many papers are published by the institution 'Tokohu University'?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_169 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'Tokohu University') .        }
icfp_1,Find the number of papers published by authors from the institution 'Tokohu University'.,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_91 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'Tokohu University') .        }
icfp_1,Find the number of papers published by the institution 'University of Pennsylvania'.,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_48 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'University of Pennsylvania') .        }
icfp_1,How many papers are written by authors from the institution 'University of Pennsylvania'?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_160 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#name ?T2_name . FILTER(?T2_name = 'University of Pennsylvania') .        }
icfp_1,Which papers have 'Stephanie Weirich' as an author?,SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\#ref-authid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :authors\#fname ?T2_fname . ?T2 :authors\#lname ?T2_lname . FILTER(?T2_fname = 'Stephanie' && ?T2_lname = 'Weirich') .        }
icfp_1,Which paper is published in an institution in 'USA' and have 'Turon' as its second author?,SELECT ?T1_title WHERE { ?T1 a :papers . ?T3 a :authorship . ?T3 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#country ?T2_country . ?T3 :authorship\#authorder ?T3_authorder . ?T4 :authors\#lname ?T4_lname . ?T2 a :inst . ?T3 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#country ?T2_country . ?T3 :authorship\#authorder ?T3_authorder . ?T4 :authors\#lname ?T4_lname . ?T4 a :authors . ?T3 :authorship\#ref-authid ?T4 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#country ?T2_country . ?T3 :authorship\#authorder ?T3_authorder . ?T4 :authors\#lname ?T4_lname . FILTER(?T2_country = 'USA' && ?T3_authorder = 2 && ?T4_lname = 'Turon') .        }
icfp_1,Find the titles of papers whose first author is affiliated with an institution in the country 'Japan' and has last name 'Ohori'?,SELECT ?T1_title WHERE { ?T1 a :papers . ?T3 a :authorship . ?T3 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#country ?T2_country . ?T3 :authorship\#authorder ?T3_authorder . ?T4 :authors\#lname ?T4_lname . ?T2 a :inst . ?T3 :authorship\#ref-instid ?T2 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#country ?T2_country . ?T3 :authorship\#authorder ?T3_authorder . ?T4 :authors\#lname ?T4_lname . ?T4 a :authors . ?T3 :authorship\#ref-authid ?T4 .  ?T1 :papers\#title ?T1_title . ?T2 :inst\#country ?T2_country . ?T3 :authorship\#authorder ?T3_authorder . ?T4 :authors\#lname ?T4_lname . FILTER(?T2_country = 'Japan' && ?T3_authorder = 1 && ?T4_lname = 'Ohori') .        }
icfp_1,What is the last name of the author that has published the most papers?,SELECT ?T1_lname (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :authors\#lname ?T1_lname .        } GROUP BY ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
icfp_1,Retrieve the country that has published the most papers.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :inst . ?T1 :inst\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
icfp_1,Find the name of the organization that has published the largest number of papers.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :inst . ?T1 :inst\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
icfp_1,Find the titles of the papers that contain the word 'ML'.,"SELECT ?T1_title WHERE { ?T1 a :papers . ?T1 :papers\#title ?T1_title . ?T1 :papers\#title ?T1_title . FILTER(contains (?T1_title, 'ML')) .        }"
icfp_1,Which paper's title contains the word 'Database'?,"SELECT ?T1_title WHERE { ?T1 a :papers . ?T1 :papers\#title ?T1_title . ?T1 :papers\#title ?T1_title . FILTER(contains (?T1_title, 'Database')) .        }"
icfp_1,Find the first names of all the authors who have written a paper with title containing the word 'Functional'.,"SELECT ?T1_fname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :authorship\#ref-authid ?T1 .  ?T1 :authors\#fname ?T1_fname . ?T2 :papers\#title ?T2_title . ?T2 a :papers . ?T13 :authorship\#ref-paperid ?T2 .  ?T1 :authors\#fname ?T1_fname . ?T2 :papers\#title ?T2_title . FILTER(contains (?T2_title, 'Functional')) .        }"
icfp_1,Retrieve the title of the paper that has the largest number of authors.,SELECT ?T1_title WHERE { ?T1 a :papers . ?T2 a :authorship . ?T2 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :authorship\#authorder ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_27)) .       {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_27 ) WHERE { ?T23 a :authorship . ?T23 :authorship\#authorder ?T23_authorder .        }    } }
icfp_1,Which paper has the most authors? Give me the paper title.,SELECT ?T1_title WHERE { ?T1 a :papers . ?T2 a :authorship . ?T2 :authorship\#ref-paperid ?T1 .  ?T1 :papers\#title ?T1_title . ?T2 :authorship\#authorder ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_51)) .       {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_51 ) WHERE { ?T23 a :authorship . ?T23 :authorship\#authorder ?T23_authorder .        }    } }
icfp_1,What is the first name of the author with last name 'Ueno'?,SELECT ?T1_fname WHERE { ?T1 a :authors . ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . FILTER(?T1_lname = 'Ueno') .        }
icfp_1,Find the last name of the author with first name 'Amal'.,SELECT ?T1_lname WHERE { ?T1 a :authors . ?T1 :authors\#lname ?T1_lname . ?T1 :authors\#fname ?T1_fname . FILTER(?T1_fname = 'Amal') .        }
icfp_1,Find the first names of all the authors ordered in alphabetical order.,SELECT ?T1_fname WHERE { ?T1 a :authors . ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#fname ?T1_fname .        }  ORDER BY ASC (?T1_fname)
icfp_1,Retrieve all the last names of authors in alphabetical order.,SELECT ?T1_lname WHERE { ?T1 a :authors . ?T1 :authors\#lname ?T1_lname . ?T1 :authors\#lname ?T1_lname .        }  ORDER BY ASC (?T1_lname)
icfp_1,Retrieve all the first and last names of authors in the alphabetical order of last names.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T1 :authors\#fname ?T1_fname . ?T1 :authors\#lname ?T1_lname . ?T1 :authors\#lname ?T1_lname .        }  ORDER BY ASC (?T1_lname)
sakila_1,How many different last names do the actors and actresses have?,SELECT DISTINCT (count(DISTINCT ?T1_last_name) as ?aggregation_T1_last_name_161 ) WHERE { ?T1 a :actor . ?T1 :actor\#last_name ?T1_last_name .        }
sakila_1,Count the number of different last names actors have.,SELECT DISTINCT (count(DISTINCT ?T1_last_name) as ?aggregation_T1_last_name_154 ) WHERE { ?T1 a :actor . ?T1 :actor\#last_name ?T1_last_name .        }
sakila_1,What is the most popular first name of the actors?,SELECT ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a :actor . ?T1 :actor\#first_name ?T1_first_name .        } GROUP BY ?T1_first_name  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,What is the most popular full name of the actors?,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name WHERE { ?T1 a :actor . ?T1 :actor\#first_name ?T1_first_name . ?T1 :actor\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name  ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,Which districts have at least two addresses?,SELECT ?T1_district WHERE { ?T1 a :address . ?T1 :address\#district ?T1_district .        } GROUP BY ?T1_district   HAVING(count( *)  >= 2)
sakila_1,Give the phone and postal code corresponding to the address '1031 Daugavpils Parkway'.,SELECT ?T1_phone ?T1_postal_code WHERE { ?T1 a :address . ?T1 :address\#phone ?T1_phone . ?T1 :address\#postal_code ?T1_postal_code . ?T1 :address\#address ?T1_address . FILTER(?T1_address = '1031 Daugavpils Parkway') .        }
sakila_1,"Which city has the most addresses? List the city name, number of addresses, and city id.",SELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) ?T2_city_id WHERE { ?T1 a :city . ?T2 a :address . ?T2 :address\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :address\#city_id ?T2_city_id .        } GROUP BY ?T1_city ?T2_city_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,"What are the city name, id, and number of addresses corresponding to the city with the most addressed?",SELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) ?T2_city_id WHERE { ?T1 a :city . ?T2 a :address . ?T2 :address\#ref-city_id ?T1 .  ?T1 :city\#city ?T1_city . ?T2 :address\#city_id ?T2_city_id .        } GROUP BY ?T1_city ?T2_city_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,How many addresses are in the district of California?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :address . ?T1 :address\#district ?T1_district . FILTER(?T1_district = 'California') .        }
sakila_1,Which film is rented at a fee of 0.99 and has less than 3 in the inventory? List the film title and id.,SELECT DISTINCT ?T1_title ?T1_film_id WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id . ?T1 :film\#rental_rate ?T1_rental_rate . FILTER(?T1_rental_rate = 0.99) . FILTER (?T1_title in (?T2_title)) . FILTER (?T1_film_id in (?T2_film_id)) .   ?T2 a :film . ?T3 a :inventory . ?T3 :inventory\#ref-film_id ?T2 .  ?T2 :film\#title ?T2_title . ?T2 :film\#film_id ?T2_film_id .     GROUP BY ?T2_title ?T2_film_id   HAVING(count( *)  < 3)      }
sakila_1,What are the title and id of the film which has a rental rate of 0.99 and an inventory of below 3?,SELECT DISTINCT ?T1_title ?T1_film_id WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id . ?T1 :film\#rental_rate ?T1_rental_rate . FILTER(?T1_rental_rate = 0.99) . FILTER (?T1_title in (?T2_title)) . FILTER (?T1_film_id in (?T2_film_id)) .   ?T2 a :film . ?T3 a :inventory . ?T3 :inventory\#ref-film_id ?T2 .  ?T2 :film\#title ?T2_title . ?T2 :film\#film_id ?T2_film_id .     GROUP BY ?T2_title ?T2_film_id   HAVING(count( *)  < 3)      }
sakila_1,How many cities are in Australia?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :country . ?T1 :city\#ref-country_id ?T2 .  ?T2 :country\#country ?T2_country . FILTER(?T2_country = 'Australia') .        }
sakila_1,Which countries have at least 3 cities?,SELECT ?T1_country WHERE { ?T1 a :country . ?T2 a :city . ?T2 :city\#ref-country_id ?T1 .  ?T1 :country\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  >= 3)
sakila_1,What are the countries that contain 3 or more cities?,SELECT ?T1_country WHERE { ?T1 a :country . ?T2 a :city . ?T2 :city\#ref-country_id ?T1 .  ?T1 :country\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  >= 3)
sakila_1,Find all the payment dates for the payments with an amount larger than 10 and the payments handled by a staff person with the first name Elsa.,SELECT distinct?col1 WHERE { { SELECT (?T1_payment_date as ?col1) WHERE { ?T1 a :payment . ?T1 :payment\#payment_date ?T1_payment_date . ?T1 :payment\#amount ?T1_amount . FILTER(?T1_amount > 10) .   }} UNION {SELECT (?T1_payment_date as ?col1) WHERE { ?T1 a :payment . ?T13 a :customer . ?T1 :payment\#ref-customer_id ?T13 .  ?T1 :payment\#payment_date ?T1_payment_date . ?T2 :staff\#first_name ?T2_first_name . ?T14 a :address . ?T13 :customer\#ref-address_id ?T14 .  ?T1 :payment\#payment_date ?T1_payment_date . ?T2 :staff\#first_name ?T2_first_name . ?T2 a :staff . ?T2 :staff\#ref-address_id ?T14 .  ?T1 :payment\#payment_date ?T1_payment_date . ?T2 :staff\#first_name ?T2_first_name . FILTER(?T2_first_name = 'Elsa') .        }      } }
sakila_1,How many customers have an active value of 1?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customer . ?T1 :customer\#active ?T1_active . FILTER(?T1_active = 1) .        }
sakila_1,Which film has the highest rental rate? And what is the rate?,SELECT ?T1_title ?T1_rental_rate WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#rental_rate ?T1_rental_rate . ?T1 :film\#rental_rate ?T1_rental_rate .        }   ORDER BY DESC (?T1_rental_rate) LIMIT 1
sakila_1,"Which film has the most number of actors or actresses? List the film name, film id and description.",SELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id ?T1_description WHERE { ?T1 a :film . ?T2 a :film_actor . ?T2 :film_actor\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id . ?T1 :film\#description ?T1_description .        } GROUP BY ?T1_title ?T1_film_id ?T1_description  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,"What are the title, id, and description of the movie with the greatest number of actors?",SELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id ?T1_description WHERE { ?T1 a :film . ?T2 a :film_actor . ?T2 :film_actor\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id . ?T1 :film\#description ?T1_description .        } GROUP BY ?T1_title ?T1_film_id ?T1_description  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,"Which film actor (actress) starred the most films? List his or her first name, last name and actor id.",SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name ?T1_actor_id WHERE { ?T1 a :actor . ?T2 a :film_actor . ?T2 :film_actor\#ref-actor_id ?T1 .  ?T1 :actor\#first_name ?T1_first_name . ?T1 :actor\#last_name ?T1_last_name . ?T1 :actor\#actor_id ?T1_actor_id .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_actor_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,Which film actors (actresses) played a role in more than 30 films? List his or her first name and last name.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :actor . ?T2 a :film_actor . ?T2 :film_actor\#ref-actor_id ?T1 .  ?T1 :actor\#first_name ?T1_first_name . ?T1 :actor\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 30)
sakila_1,What are the full names of actors who had roles in more than 30 films?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :actor . ?T2 a :film_actor . ?T2 :film_actor\#ref-actor_id ?T1 .  ?T1 :actor\#first_name ?T1_first_name . ?T1 :actor\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 30)
sakila_1,Which store owns most items?,SELECT ?T1_store_id (count( *) as ?aggregation_all) WHERE { ?T1 a :inventory . ?T1 :inventory\#store_id ?T1_store_id .        } GROUP BY ?T1_store_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,What is the id of the store that has the most items in inventory?,SELECT ?T1_store_id (count( *) as ?aggregation_all) WHERE { ?T1 a :inventory . ?T1 :inventory\#store_id ?T1_store_id .        } GROUP BY ?T1_store_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,What is the total amount of all payments?,SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_36 ) WHERE { ?T1 a :payment . ?T1 :payment\#amount ?T1_amount .        }
sakila_1,Return the sum of all payment amounts.,SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_135 ) WHERE { ?T1 a :payment . ?T1 :payment\#amount ?T1_amount .        }
sakila_1,"Which customer, who has made at least one payment, has spent the least money? List his or her first name, last name, and the id.",SELECT ?T1_first_name ?T1_last_name ?T1_customer_id WHERE { ?T1 a :customer . ?T2 a :payment . ?T2 :payment\#ref-customer_id ?T1 .  ?T1 :customer\#first_name ?T1_first_name . ?T1 :customer\#last_name ?T1_last_name . ?T1 :customer\#customer_id ?T1_customer_id . ?T2 :payment\#amount ?T2_amount .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_customer_id  ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_81 )) LIMIT 1
sakila_1,What is the full name and id of the customer who has the lowest total amount of payment?,SELECT ?T1_first_name ?T1_last_name ?T1_customer_id WHERE { ?T1 a :customer . ?T2 a :payment . ?T2 :payment\#ref-customer_id ?T1 .  ?T1 :customer\#first_name ?T1_first_name . ?T1 :customer\#last_name ?T1_last_name . ?T1 :customer\#customer_id ?T1_customer_id . ?T2 :payment\#amount ?T2_amount .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_customer_id  ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_116 )) LIMIT 1
sakila_1,What is the genre name of the film HUNGER ROOF?,SELECT ?T1_name WHERE { ?T1 a :category . ?T13 a :film_category . ?T13 :film_category\#ref-category_id ?T1 .  ?T1 :category\#name ?T1_name . ?T2 :film\#title ?T2_title . ?T2 a :film . ?T13 :film_category\#ref-film_id ?T2 .  ?T1 :category\#name ?T1_name . ?T2 :film\#title ?T2_title . FILTER(?T2_title = 'HUNGER ROOF') .        }
sakila_1,"How many films are there in each category? List the genre name, genre id and the count.",SELECT ?T1_name ?T2_category_id (count( *) as ?aggregation_all) WHERE { ?T1 a :category . ?T2 a :film_category . ?T2 :film_category\#ref-category_id ?T1 .  ?T1 :category\#name ?T1_name . ?T2 :film_category\#category_id ?T2_category_id .        } GROUP BY ?T1_name ?T2_category_id
sakila_1,"What are the names and ids of the different categories, and how many films are in each?",SELECT ?T1_name ?T2_category_id (count( *) as ?aggregation_all) WHERE { ?T1 a :category . ?T2 a :film_category . ?T2 :film_category\#ref-category_id ?T1 .  ?T1 :category\#name ?T1_name . ?T2 :film_category\#category_id ?T2_category_id .        } GROUP BY ?T1_name ?T2_category_id
sakila_1,Which film has the most copies in the inventory? List both title and id.,SELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id WHERE { ?T1 a :film . ?T2 a :inventory . ?T2 :inventory\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id .        } GROUP BY ?T1_title ?T1_film_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,What is the title and id of the film that has the greatest number of copies in inventory?,SELECT ?T1_title (count( *) as ?aggregation_all) ?T1_film_id WHERE { ?T1 a :film . ?T2 a :inventory . ?T2 :inventory\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id .        } GROUP BY ?T1_title ?T1_film_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,What is the film title and inventory id of the item in the inventory which was rented most frequently?,SELECT ?T1_title (count( *) as ?aggregation_all) ?T2_inventory_id WHERE { ?T1 a :film . ?T2 a :inventory . ?T2 :inventory\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T2 :inventory\#inventory_id ?T2_inventory_id .        } GROUP BY ?T1_title ?T2_inventory_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,How many languages are in these films?,SELECT DISTINCT (count(DISTINCT ?T1_language_id) as ?aggregation_T1_language_id_7 ) WHERE { ?T1 a :film . ?T1 :film\#language_id ?T1_language_id .        }
sakila_1,Count the number of different languages in these films.,SELECT DISTINCT (count(DISTINCT ?T1_language_id) as ?aggregation_T1_language_id_177 ) WHERE { ?T1 a :film . ?T1 :film\#language_id ?T1_language_id .        }
sakila_1,What are all the movies rated as R? List the titles.,SELECT ?T1_title WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#rating ?T1_rating . FILTER(?T1_rating = 'R') .        }
sakila_1,Where is store 1 located?,SELECT ?T1_address WHERE { ?T1 a :address . ?T2 a :store . ?T2 :store\#ref-address_id ?T1 .  ?T1 :address\#address ?T1_address . ?T2 :store\#store_id ?T2_store_id . FILTER(?T2_store_id = 1) .        }
sakila_1,Which staff handled least number of payments? List the full name and the id.,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name ?T1_staff_id WHERE { ?T1 a :staff . ?T13 a :address . ?T1 :staff\#ref-address_id ?T13 .  ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . ?T1 :staff\#staff_id ?T1_staff_id . ?T14 a :customer . ?T14 :customer\#ref-address_id ?T13 .  ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . ?T1 :staff\#staff_id ?T1_staff_id .        } GROUP BY ?T1_first_name ?T1_last_name ?T1_staff_id  ORDER BY ASC (?aggregation_all) LIMIT 1
sakila_1,Which language does the film AIRPORT POLLOCK use? List the language name.,SELECT ?T1_name WHERE { ?T1 :language\#ref-film_id ?T2 . FILTER(?T2_title = 'AIRPORT POLLOCK') .        }
sakila_1,What is the name of the language that the film 'AIRPORT POLLOCK' is in?,SELECT ?T1_name WHERE { ?T1 :language\#ref-film_id ?T2 . FILTER(?T2_title = 'AIRPORT POLLOCK') .        }
sakila_1,How many stores are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :store .        }
sakila_1,How many kinds of different ratings are listed?,SELECT DISTINCT (count(DISTINCT ?T1_rating) as ?aggregation_T1_rating_23 ) WHERE { ?T1 a :film . ?T1 :film\#rating ?T1_rating .        }
sakila_1,Count the number of different film ratings.,SELECT DISTINCT (count(DISTINCT ?T1_rating) as ?aggregation_T1_rating_16 ) WHERE { ?T1 a :film . ?T1 :film\#rating ?T1_rating .        }
sakila_1,Which movies have 'Deleted Scenes' as a substring in the special feature?,"SELECT ?T1_title WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#special_features ?T1_special_features . FILTER(contains (?T1_special_features, 'Deleted Scenes')) .        }"
sakila_1,How many items in inventory does store 1 have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :inventory . ?T1 :inventory\#store_id ?T1_store_id . FILTER(?T1_store_id = 1) .        }
sakila_1,When did the first payment happen?,SELECT ?T1_payment_date WHERE { ?T1 a :payment . ?T1 :payment\#payment_date ?T1_payment_date . ?T1 :payment\#payment_date ?T1_payment_date .        }   ORDER BY ASC (?T1_payment_date) LIMIT 1
sakila_1,What was the date of the earliest payment?,SELECT ?T1_payment_date WHERE { ?T1 a :payment . ?T1 :payment\#payment_date ?T1_payment_date . ?T1 :payment\#payment_date ?T1_payment_date .        }   ORDER BY ASC (?T1_payment_date) LIMIT 1
sakila_1,Return the address and email of the customer with the first name Linda.,SELECT ?T1_address ?T2_email WHERE { ?T1 a :address . ?T2 a :customer . ?T2 :customer\#ref-address_id ?T1 .  ?T1 :address\#address ?T1_address . ?T2 :customer\#email ?T2_email . ?T2 :customer\#first_name ?T2_first_name . FILTER(?T2_first_name = 'LINDA') .        }
sakila_1,"Find all the films longer than 100 minutes, or rated PG, except those who cost more than 200 for replacement. List the titles.",SELECT distinct?col1 WHERE { { SELECT (?T1_title as ?col1) WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#length ?T1_length . ?T1 :film\#rating ?T1_rating . FILTER(?T1_length > 100 || ?T1_rating = 'PG') .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :film . ?T2 :film\#title ?T2_title . ?T2 :film\#replacement_cost ?T2_replacement_cost . FILTER(?T2_replacement_cost > 200) .        }     } }
sakila_1,Return the full name of the customer who made the first rental.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customer . ?T2 a :rental . ?T2 :rental\#ref-customer_id ?T1 .  ?T1 :customer\#first_name ?T1_first_name . ?T1 :customer\#last_name ?T1_last_name . ?T2 :rental\#rental_date ?T2_rental_date .        }   ORDER BY ASC (?T2_rental_date) LIMIT 1
sakila_1,Return the full name of the staff who provided a customer with the first name April and the last name Burns with a film rental.,SELECT DISTINCT ?T1_first_name ?T1_last_name WHERE { ?T1 a :staff . ?T13 a :address . ?T1 :staff\#ref-address_id ?T13 .  ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . ?T2 :customer\#first_name ?T2_first_name . ?T2 :customer\#last_name ?T2_last_name . ?T2 a :customer . ?T2 :customer\#ref-address_id ?T13 .  ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . ?T2 :customer\#first_name ?T2_first_name . ?T2 :customer\#last_name ?T2_last_name . FILTER(?T2_first_name = 'APRIL' && ?T2_last_name = 'BURNS') .        }
sakila_1,Which store has most the customers?,SELECT ?T1_store_id (count( *) as ?aggregation_all) WHERE { ?T1 a :customer . ?T1 :customer\#store_id ?T1_store_id .        } GROUP BY ?T1_store_id  ORDER BY DESC (?aggregation_all) LIMIT 1
sakila_1,What is the largest payment amount?,SELECT ?T1_amount WHERE { ?T1 a :payment . ?T1 :payment\#amount ?T1_amount . ?T1 :payment\#amount ?T1_amount .        }   ORDER BY DESC (?T1_amount) LIMIT 1
sakila_1,Where does the staff member with the first name Elsa live?,SELECT ?T1_address WHERE { ?T1 a :address . ?T2 a :staff . ?T2 :staff\#ref-address_id ?T1 .  ?T1 :address\#address ?T1_address . ?T2 :staff\#first_name ?T2_first_name . FILTER(?T2_first_name = 'Elsa') .        }
sakila_1,Return the first names of customers who did not rented a film after the date '2005-08-23 02:06:01'.,SELECT ?T1_first_name WHERE { ?T1 a :customer . ?T1 :customer\#first_name ?T1_first_name . ?T1 :customer\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_rental_date)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :rental . ?T22 :rental\#customer_id ?T22_customer_id . ?T22 :rental\#rental_date ?T22_rental_date . FILTER(?T22_rental_date > 2005-08-23 02:06:01) .        }    } }
loan_1,How many bank branches are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :bank .        }
loan_1,How many customers are there?,SELECT (sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_191 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        }
loan_1,What is the total number of customers across banks?,SELECT (sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_124 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        }
loan_1,Find the number of customers in the banks at New York City.,SELECT (sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_57 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers . ?T1 :bank\#city ?T1_city . FILTER(?T1_city = 'New York City') .        }
loan_1,What is the total number of customers who use banks in New York City?,SELECT (sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_59 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers . ?T1 :bank\#city ?T1_city . FILTER(?T1_city = 'New York City') .        }
loan_1,Find the average number of customers in all banks of Utah state.,SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_51 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers . ?T1 :bank\#state ?T1_state . FILTER(?T1_state = 'Utah') .        }
loan_1,Find the average number of customers cross all banks.,SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_144 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        }
loan_1,What is the average number of bank customers?,SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_138 ) WHERE { ?T1 a :bank . ?T1 :bank\#no_of_customers ?T1_no_of_customers .        }
loan_1,Find the city and state of the bank branch named morningside.,SELECT ?T1_city ?T1_state WHERE { ?T1 a :bank . ?T1 :bank\#city ?T1_city . ?T1 :bank\#state ?T1_state . ?T1 :bank\#bname ?T1_bname . FILTER(?T1_bname = 'morningside') .        }
loan_1,What city and state is the bank with the name morningside in?,SELECT ?T1_city ?T1_state WHERE { ?T1 a :bank . ?T1 :bank\#city ?T1_city . ?T1 :bank\#state ?T1_state . ?T1 :bank\#bname ?T1_bname . FILTER(?T1_bname = 'morningside') .        }
loan_1,Find the branch names of banks in the New York state.,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bank\#bname ?T1_bname . ?T1 :bank\#state ?T1_state . FILTER(?T1_state = 'New York') .        }
loan_1,What are the names of banks in the state of New York?,SELECT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bank\#bname ?T1_bname . ?T1 :bank\#state ?T1_state . FILTER(?T1_state = 'New York') .        }
loan_1,List the name of all customers sorted by their account balance in ascending order.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :customer\#cust_name ?T1_cust_name . ?T1 :customer\#acc_bal ?T1_acc_bal .        }  ORDER BY ASC (?T1_acc_bal)
loan_1,List the name of all different customers who have some loan sorted by their total loan amount.,SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_cust_name ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_11 ))
loan_1,"What are the names of the different customers who have taken out a loan, ordered by the total amount that they have taken?",SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\#ref-cust_id ?T1 .  ?T1 :customer\#cust_name ?T1_cust_name . ?T2 :loan\#amount ?T2_amount .        } GROUP BY ?T1_cust_name ORDER BY ASC ((sum( ?T2_amount) as ?aggregation_T2_amount_0 ))
