kg_name,question,query
customers_and_invoices,"What are the ids, names, dates of opening, and other details for accounts corresponding to the customer with the first name 'Meaghan'?",SELECT ?T1_account_id ?T1_date_account_opened ?T1_account_name ?T1_other_account_details WHERE { ?T1 a :accounts . ?T2 a :customers . ?T1 :accounts\#ref-customer_id ?T2 .  ?T1 :accounts\#account_id ?T1_account_id . ?T1 :accounts\#date_account_opened ?T1_date_account_opened . ?T1 :accounts\#account_name ?T1_account_name . ?T1 :accounts\#other_account_details ?T1_other_account_details . ?T2 :customers\#customer_first_name ?T2_customer_first_name . FILTER(?T2_customer_first_name = 'Meaghan') .        }
customers_and_invoices,Show the account name and other account detail for all accounts by the customer with first name Meaghan and last name Keeling.,SELECT ?T1_account_name ?T1_other_account_details WHERE { ?T1 a :accounts . ?T2 a :customers . ?T1 :accounts\#ref-customer_id ?T2 .  ?T1 :accounts\#account_name ?T1_account_name . ?T1 :accounts\#other_account_details ?T1_other_account_details . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . FILTER(?T2_customer_first_name = 'Meaghan' && ?T2_customer_last_name = 'Keeling') .        }
customers_and_invoices,Show the first name and last name for the customer with account name 900.,SELECT ?T1_customer_first_name ?T1_customer_last_name WHERE { ?T1 a :customers . ?T2 a :accounts . ?T2 :accounts\#ref-customer_id ?T1 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T2 :accounts\#account_name ?T2_account_name . FILTER(?T2_account_name = '900') .        }
customers_and_invoices,What are the full names of customers with the account name 900?,SELECT ?T1_customer_first_name ?T1_customer_last_name WHERE { ?T1 a :customers . ?T2 a :accounts . ?T2 :accounts\#ref-customer_id ?T1 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T2 :accounts\#account_name ?T2_account_name . FILTER(?T2_account_name = '900') .        }
customers_and_invoices,How many customers don't have an account?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :accounts . ?T22 :accounts\#customer_id ?T22_customer_id .        }    } }
customers_and_invoices,"Show the unique first names, last names, and phone numbers for all customers with any account.",SELECT DISTINCT ?T1_customer_first_name ?T1_customer_last_name ?T1_phone_number WHERE { ?T1 a :customers . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T1 :customers\#phone_number ?T1_phone_number .        }
customers_and_invoices,Show customer ids who don't have an account.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_id as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id .   }}  MINUS {SELECT (?T2_customer_id as ?col1) WHERE { ?T2 a :accounts . ?T2 :accounts\#customer_id ?T2_customer_id .        }     } }
customers_and_invoices,What are the customer ids for customers who do not have an account?,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_id as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id .   }}  MINUS {SELECT (?T2_customer_id as ?col1) WHERE { ?T2 a :accounts . ?T2 :accounts\#customer_id ?T2_customer_id .        }     } }
customers_and_invoices,How many accounts does each customer have? List the number and customer id.,SELECT (count( *) as ?aggregation_all) ?T1_customer_id WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id
customers_and_invoices,"What is the customer id, first and last name with most number of accounts.",SELECT ?T1_customer_id (count( *) as ?aggregation_all) ?T2_customer_first_name ?T2_customer_last_name WHERE { ?T1 a :accounts . ?T2 a :customers . ?T1 :accounts\#ref-customer_id ?T2 .  ?T1 :accounts\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        } GROUP BY ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_invoices,"Show id, first name and last name for all customers and the number of accounts.",SELECT ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T2 a :customers . ?T1 :accounts\#ref-customer_id ?T2 .  ?T1 :accounts\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        } GROUP BY ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name
customers_and_invoices,Show first name and id for all customers with at least 2 accounts.,SELECT ?T1_customer_first_name ?T2_customer_id WHERE { ?T1 a :customers . ?T2 a :accounts . ?T2 :accounts\#ref-customer_id ?T1 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T2 :accounts\#customer_id ?T2_customer_id .        } GROUP BY ?T1_customer_first_name ?T2_customer_id   HAVING(count( *)  >= 2)
customers_and_invoices,Show the number of customers for each gender.,SELECT ?T1_gender (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#gender ?T1_gender .        } GROUP BY ?T1_gender
customers_and_invoices,How many customers are there of each gender?,SELECT ?T1_gender (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#gender ?T1_gender .        } GROUP BY ?T1_gender
customers_and_invoices,How many transactions do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions .        }
customers_and_invoices,How many transaction does each account have? Show the number and account id.,SELECT (count( *) as ?aggregation_all) ?T1_account_id WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#account_id ?T1_account_id .        } GROUP BY ?T1_account_id
customers_and_invoices,How many transaction does account with name 337 have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T2 a :accounts . ?T1 :financial_transactions\#ref-account_id ?T2 .  ?T2 :accounts\#account_name ?T2_account_name . FILTER(?T2_account_name = '337') .        }
customers_and_invoices,Show ids for all transactions whose amounts are greater than the average.,SELECT ?T1_transaction_id WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_id ?T1_transaction_id . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount . FILTER(?T1_transaction_amount > (?aggregation_T22_transaction_amount_107)) .       {SELECT (avg( ?T22_transaction_amount) as ?aggregation_T22_transaction_amount_107 ) WHERE { ?T22 a :financial_transactions . ?T22 :financial_transactions\#transaction_amount ?T22_transaction_amount .        }    } }
customers_and_invoices,Show the transaction types and the total amount of transactions.,SELECT ?T1_transaction_type (sum( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_102 ) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount .        } GROUP BY ?T1_transaction_type
customers_and_invoices,What are total transaction amounts for each transaction type?,SELECT ?T1_transaction_type (sum( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_162 ) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount .        } GROUP BY ?T1_transaction_type
customers_and_invoices,"Show the account name, id and the number of transactions for each account.",SELECT ?T1_account_name ?T2_account_id (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T2 a :financial_transactions . ?T2 :financial_transactions\#ref-account_id ?T1 .  ?T1 :accounts\#account_name ?T1_account_name . ?T2 :financial_transactions\#account_id ?T2_account_id .        } GROUP BY ?T1_account_name ?T2_account_id
customers_and_invoices,Show the account id with most number of transactions.,SELECT ?T1_account_id (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#account_id ?T1_account_id .        } GROUP BY ?T1_account_id  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_invoices,What is the id of the account with the most transactions?,SELECT ?T1_account_id (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#account_id ?T1_account_id .        } GROUP BY ?T1_account_id  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_invoices,Show the account id and name with at least 4 transactions.,SELECT ?T1_account_id ?T2_account_name WHERE { ?T1 a :financial_transactions . ?T2 a :accounts . ?T1 :financial_transactions\#ref-account_id ?T2 .  ?T1 :financial_transactions\#account_id ?T1_account_id . ?T2 :accounts\#account_name ?T2_account_name .        } GROUP BY ?T1_account_id ?T2_account_name   HAVING(count( *)  >= 4)
customers_and_invoices,What are the ids and names of accounts with 4 or more transactions?,SELECT ?T1_account_id ?T2_account_name WHERE { ?T1 a :financial_transactions . ?T2 a :accounts . ?T1 :financial_transactions\#ref-account_id ?T2 .  ?T1 :financial_transactions\#account_id ?T1_account_id . ?T2 :accounts\#account_name ?T2_account_name .        } GROUP BY ?T1_account_id ?T2_account_name   HAVING(count( *)  >= 4)
customers_and_invoices,Show all product sizes.,SELECT DISTINCT ?T1_product_size WHERE { ?T1 a :products . ?T1 :products\#product_size ?T1_product_size .        }
customers_and_invoices,What are the different product sizes?,SELECT DISTINCT ?T1_product_size WHERE { ?T1 a :products . ?T1 :products\#product_size ?T1_product_size .        }
customers_and_invoices,Show all product colors.,SELECT DISTINCT ?T1_product_color WHERE { ?T1 a :products . ?T1 :products\#product_color ?T1_product_color .        }
customers_and_invoices,What are the different product colors?,SELECT DISTINCT ?T1_product_color WHERE { ?T1 a :products . ?T1 :products\#product_color ?T1_product_color .        }
customers_and_invoices,Show the invoice number and the number of transactions for each invoice.,SELECT ?T1_invoice_number (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#invoice_number ?T1_invoice_number .        } GROUP BY ?T1_invoice_number
customers_and_invoices,How many transactions correspond to each invoice number?,SELECT ?T1_invoice_number (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#invoice_number ?T1_invoice_number .        } GROUP BY ?T1_invoice_number
customers_and_invoices,How many invoices do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices .        }
customers_and_invoices,Show invoice dates and order id and details for all invoices.,SELECT ?T1_invoice_date ?T1_order_id ?T2_order_details WHERE { ?T1 a :invoices . ?T2 a :orders . ?T1 :invoices\#ref-order_id ?T2 .  ?T1 :invoices\#invoice_date ?T1_invoice_date . ?T1 :invoices\#order_id ?T1_order_id . ?T2 :orders\#order_details ?T2_order_details .        }
customers_and_invoices,Show the order ids and the number of invoices for each order.,SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#order_id ?T1_order_id .        } GROUP BY ?T1_order_id
customers_and_invoices,How many invoices correspond to each order id?,SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#order_id ?T1_order_id .        } GROUP BY ?T1_order_id
customers_and_invoices,What is the order id and order details for the order more than two invoices.,SELECT ?T1_order_id ?T1_order_details WHERE { ?T1 a :orders . ?T2 a :invoices . ?T2 :invoices\#ref-order_id ?T1 .  ?T1 :orders\#order_id ?T1_order_id . ?T1 :orders\#order_details ?T1_order_details .        } GROUP BY ?T1_order_id ?T1_order_details   HAVING(count( *)  > 2)
customers_and_invoices,"Return the last name, id and phone number of the customer who has made the greatest number of orders.",SELECT ?T1_customer_last_name (count( *) as ?aggregation_all) ?T2_customer_id ?T1_phone_number WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T2 :orders\#customer_id ?T2_customer_id . ?T1 :customers\#phone_number ?T1_phone_number .        } GROUP BY ?T1_customer_last_name ?T2_customer_id ?T1_phone_number  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_invoices,Show all product names without an order.,SELECT distinct?col1 WHERE { { SELECT (?T1_product_name as ?col1) WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name .   }}  MINUS {SELECT (?T2_product_name as ?col1) WHERE { ?T2 a :products . ?T2 :products\#product_name ?T2_product_name .        }     } }
customers_and_invoices,What are the names of products that have never been ordered?,SELECT distinct?col1 WHERE { { SELECT (?T1_product_name as ?col1) WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name .   }}  MINUS {SELECT (?T2_product_name as ?col1) WHERE { ?T2 a :products . ?T2 :products\#product_name ?T2_product_name .        }     } }
customers_and_invoices,Show all product names and the total quantity ordered for each product name.,SELECT ?T1_product_name (sum( ?T2_product_quantity) as ?aggregation_T2_product_quantity_178 ) WHERE { ?T1 a :products . ?T2 a :order_items . ?T2 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :order_items\#product_quantity ?T2_product_quantity .        } GROUP BY ?T1_product_name
customers_and_invoices,"What are the different product names, and what is the sum of quantity ordered for each product?",SELECT ?T1_product_name (sum( ?T2_product_quantity) as ?aggregation_T2_product_quantity_162 ) WHERE { ?T1 a :products . ?T2 a :order_items . ?T2 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :order_items\#product_quantity ?T2_product_quantity .        } GROUP BY ?T1_product_name
customers_and_invoices,Show the order ids and the number of items in each order.,SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_id ?T1_order_id .        } GROUP BY ?T1_order_id
customers_and_invoices,How many order items correspond to each order id?,SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_id ?T1_order_id .        } GROUP BY ?T1_order_id
customers_and_invoices,Show the product ids and the number of unique orders containing each product.,SELECT DISTINCT ?T1_product_id (count(DISTINCT ?T1_order_id) as ?aggregation_T1_order_id_42 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#product_id ?T1_product_id . ?T1 :order_items\#order_id ?T1_order_id .        } GROUP BY ?T1_product_id
customers_and_invoices,How many distinct order ids correspond to each product?,SELECT DISTINCT ?T1_product_id (count(DISTINCT ?T1_order_id) as ?aggregation_T1_order_id_147 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#product_id ?T1_product_id . ?T1 :order_items\#order_id ?T1_order_id .        } GROUP BY ?T1_product_id
customers_and_invoices,Show all product names and the number of customers having an order on each product.,SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :order_items . ?T2 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name
customers_and_invoices,Show order ids and the number of products in each order.,SELECT DISTINCT ?T1_order_id (count(DISTINCT ?T1_product_id) as ?aggregation_T1_product_id_15 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_id ?T1_order_id . ?T1 :order_items\#product_id ?T1_product_id .        } GROUP BY ?T1_order_id
customers_and_invoices,How many different products correspond to each order id?,SELECT DISTINCT ?T1_order_id (count(DISTINCT ?T1_product_id) as ?aggregation_T1_product_id_197 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_id ?T1_order_id . ?T1 :order_items\#product_id ?T1_product_id .        } GROUP BY ?T1_order_id
customers_and_invoices,Show order ids and the total quantity in each order.,SELECT ?T1_order_id (sum( ?T1_product_quantity) as ?aggregation_T1_product_quantity_2 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_id ?T1_order_id . ?T1 :order_items\#product_quantity ?T1_product_quantity .        } GROUP BY ?T1_order_id
customers_and_invoices,"Give the order ids for all orders, as well as the total product quantity in each.",SELECT ?T1_order_id (sum( ?T1_product_quantity) as ?aggregation_T1_product_quantity_170 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_id ?T1_order_id . ?T1 :order_items\#product_quantity ?T1_product_quantity .        } GROUP BY ?T1_order_id
customers_and_invoices,How many products were not included in any order?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_id ?T1_product_id . FILTER(?T1_product_id not in (?T22_product_id)) .       {SELECT ?T22_product_id WHERE { ?T22 a :order_items . ?T22 :order_items\#product_id ?T22_product_id .        }    } }
wedding,How many churches opened before 1850 are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :church . ?T1 :church\#open_date ?T1_open_date . FILTER(?T1_open_date < 1850) .        }
wedding,"Show the name, open date, and organizer for all churches.",SELECT ?T1_name ?T1_open_date ?T1_organized_by WHERE { ?T1 a :church . ?T1 :church\#name ?T1_name . ?T1 :church\#open_date ?T1_open_date . ?T1 :church\#organized_by ?T1_organized_by .        }
wedding,List all church names in descending order of opening date.,SELECT ?T1_name WHERE { ?T1 a :church . ?T1 :church\#name ?T1_name . ?T1 :church\#open_date ?T1_open_date .        }  ORDER BY DESC (?T1_open_date)
wedding,Show the opening year in whcih at least two churches opened.,SELECT ?T1_open_date WHERE { ?T1 a :church . ?T1 :church\#open_date ?T1_open_date .        } GROUP BY ?T1_open_date   HAVING(count( *)  >= 2)
wedding,Show the organizer and name for churches that opened between 1830 and 1840.,SELECT ?T1_organized_by ?T1_name WHERE { ?T1 a :church . ?T1 :church\#organized_by ?T1_organized_by . ?T1 :church\#name ?T1_name . ?T1 :church\#open_date ?T1_open_date . FILTER(?T1_open_date >= 1830 && ?T1_open_date <= 1840) .        }
wedding,Show all opening years and the number of churches that opened in that year.,SELECT ?T1_open_date (count( *) as ?aggregation_all) WHERE { ?T1 a :church . ?T1 :church\#open_date ?T1_open_date .        } GROUP BY ?T1_open_date
wedding,Show the name and opening year for three churches that opened most recently.,SELECT ?T1_name ?T1_open_date WHERE { ?T1 a :church . ?T1 :church\#name ?T1_name . ?T1 :church\#open_date ?T1_open_date . ?T1 :church\#open_date ?T1_open_date .        }   ORDER BY DESC (?T1_open_date) LIMIT 1
wedding,How many female people are older than 30 in our record?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#is_male ?T1_is_male . ?T1 :people\#age ?T1_age . FILTER(?T1_is_male = 'F' && ?T1_age > 30) .        }
wedding,Show the country where people older than 30 and younger than 25 are from.,SELECT DISTINCT ?T1_country WHERE { ?T1 a :people . ?T1 :people\#country ?T1_country . ?T1 :people\#age ?T1_age . FILTER(?T1_age < 25) . FILTER (?T1_country in (?T2_country)) .   ?T2 a :people . ?T2 :people\#country ?T2_country . ?T2 :people\#age ?T2_age .  FILTER(?T2_age > 30) .             }
wedding,"Show the minimum, maximum, and average age for all people.",SELECT (min( ?T1_age) as ?aggregation_T1_age_121 ) (max( ?T1_age) as ?aggregation_T1_age_13 ) (avg( ?T1_age) as ?aggregation_T1_age_30 ) WHERE { ?T1 a :people . ?T1 :people\#age ?T1_age . ?T1 :people\#age ?T1_age . ?T1 :people\#age ?T1_age .        }
wedding,Show the name and country for all people whose age is smaller than the average.,SELECT ?T1_name ?T1_country WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#country ?T1_country . ?T1 :people\#age ?T1_age . FILTER(?T1_age < (?aggregation_T22_age_199)) .       {SELECT (avg( ?T22_age) as ?aggregation_T22_age_199 ) WHERE { ?T22 a :people . ?T22 :people\#age ?T22_age .        }    } }
wedding,Show the pair of male and female names in all weddings after year 2014,SELECT ?T1_name ?T1_name WHERE { ?T1 a :people . ?T2 a :wedding . ?T2 :wedding\#ref-female_id ?T1 .  ?T1 :people\#name ?T1_name . ?T1 :people\#name ?T1_name . ?T2 :wedding\#year ?T2_year . FILTER(?T2_year > 2014) .        }
wedding,Show the name and age for all male people who don't have a wedding.,SELECT ?T1_name ?T1_age WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#age ?T1_age . ?T1 :people\#is_male ?T1_is_male . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_is_male = 'T' && ?T1_people_id not in (?T22_male_id)) .       {SELECT ?T22_male_id WHERE { ?T22 a :wedding . ?T22 :wedding\#male_id ?T22_male_id .        }    } }
wedding,Show all church names except for those that had a wedding in year 2015.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :church . ?T1 :church\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :church . ?T3 a :wedding . ?T3 :wedding\#ref-church_id ?T2 .  ?T2 :church\#name ?T2_name . ?T3 :wedding\#year ?T3_year . FILTER(?T3_year = 2015) .        }     } }
wedding,Show all church names that have hosted least two weddings.,SELECT ?T1_name WHERE { ?T1 a :church . ?T2 a :wedding . ?T2 :wedding\#ref-church_id ?T1 .  ?T1 :church\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
wedding,Show the names for all females from Canada having a wedding in year 2016.,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :wedding . ?T2 :wedding\#ref-female_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :wedding\#year ?T2_year . ?T1 :people\#is_male ?T1_is_male . ?T1 :people\#country ?T1_country . FILTER(?T2_year = 2016 && ?T1_is_male = 'F' && ?T1_country = 'Canada') .        }
wedding,How many weddings are there in year 2016?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :wedding . ?T1 :wedding\#year ?T1_year . FILTER(?T1_year = 2016) .        }
wedding,Show the church names for the weddings of all people older than 30.,SELECT ?T1_name WHERE { ?T1 a :church . ?T13 a :wedding . ?T13 :wedding\#ref-church_id ?T1 .  ?T1 :church\#name ?T1_name . ?T2 :people\#age ?T2_age . ?T2 :people\#age ?T2_age . ?T2 a :people . ?T13 :wedding\#ref-female_id ?T2 .  ?T1 :church\#name ?T1_name . ?T2 :people\#age ?T2_age . ?T2 :people\#age ?T2_age . FILTER(?T2_age > 30 || ?T2_age > 30) .        }
wedding,Show all countries and the number of people from each country.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#country ?T1_country .        } GROUP BY ?T1_country
wedding,How many churches have a wedding in year 2016?,SELECT DISTINCT (count(DISTINCT ?T1_church_id) as ?aggregation_T1_church_id_183 ) WHERE { ?T1 a :wedding . ?T1 :wedding\#church_id ?T1_church_id . ?T1 :wedding\#year ?T1_year . FILTER(?T1_year = 2016) .        }
theme_gallery,How many artists do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist .        }
theme_gallery,"Show all artist name, age, and country ordered by the yeared they joined.",SELECT ?T1_name ?T1_age ?T1_country WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#age ?T1_age . ?T1 :artist\#country ?T1_country . ?T1 :artist\#year_join ?T1_year_join .        }  ORDER BY ASC (?T1_year_join)
theme_gallery,What are all distinct country for artists?,SELECT DISTINCT ?T1_country WHERE { ?T1 a :artist . ?T1 :artist\#country ?T1_country .        }
theme_gallery,Show all artist names and the year joined who are not from United States.,SELECT ?T1_name ?T1_year_join WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#year_join ?T1_year_join . ?T1 :artist\#country ?T1_country . FILTER(?T1_country != 'United States') .        }
theme_gallery,What are the names and year of joining for artists that do not have the country 'United States'?,SELECT ?T1_name ?T1_year_join WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#year_join ?T1_year_join . ?T1 :artist\#country ?T1_country . FILTER(?T1_country != 'United States') .        }
theme_gallery,How many artists are above age 46 and joined after 1990?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age . ?T1 :artist\#year_join ?T1_year_join . FILTER(?T1_age > 46 && ?T1_year_join > 1990) .        }
theme_gallery,What is the average and minimum age of all artists from United States.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_93 ) (min( ?T1_age) as ?aggregation_T1_age_161 ) WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age . ?T1 :artist\#age ?T1_age . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'United States') .        }
theme_gallery,Return the average and minimum ages across artists from the United States.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_31 ) (min( ?T1_age) as ?aggregation_T1_age_91 ) WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age . ?T1 :artist\#age ?T1_age . ?T1 :artist\#country ?T1_country . FILTER(?T1_country = 'United States') .        }
theme_gallery,What is the name of the artist who joined latest?,SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#year_join ?T1_year_join .        }   ORDER BY DESC (?T1_year_join) LIMIT 1
theme_gallery,How many exhibition are there in year 2005 or after?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :exhibition . ?T1 :exhibition\#year ?T1_year . FILTER(?T1_year >= 2005) .        }
theme_gallery,Show theme and year for all exhibitions with ticket prices lower than 15.,SELECT ?T1_theme ?T1_year WHERE { ?T1 a :exhibition . ?T1 :exhibition\#theme ?T1_theme . ?T1 :exhibition\#year ?T1_year . ?T1 :exhibition\#ticket_price ?T1_ticket_price . FILTER(?T1_ticket_price < 15) .        }
theme_gallery,Show all artist names and the number of exhibitions for each artist.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :exhibition\#ref-artist_id ?T1 .  ?T1 :artist\#name ?T1_name .        } GROUP BY ?T1_name
theme_gallery,How many exhibitions has each artist had?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :exhibition\#ref-artist_id ?T1 .  ?T1 :artist\#name ?T1_name .        } GROUP BY ?T1_name
theme_gallery,Return the name and country corresponding to the artist who has had the most exhibitions.,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_country WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :exhibition\#ref-artist_id ?T1 .  ?T1 :artist\#name ?T1_name . ?T1 :artist\#country ?T1_country .        } GROUP BY ?T1_name ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
theme_gallery,Show names for artists without any exhibition.,SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#artist_id ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) .       {SELECT ?T22_artist_id WHERE { ?T22 a :exhibition . ?T22 :exhibition\#artist_id ?T22_artist_id .        }    } }
theme_gallery,What are the names of artists that have not had any exhibitions?,SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name . ?T1 :artist\#artist_id ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) .       {SELECT ?T22_artist_id WHERE { ?T22 a :exhibition . ?T22 :exhibition\#artist_id ?T22_artist_id .        }    } }
theme_gallery,Return the names of artists and the themes of their exhibitions that had a ticket price higher than average.,SELECT ?T1_theme ?T2_name WHERE { ?T1 a :exhibition . ?T2 a :artist . ?T1 :exhibition\#ref-artist_id ?T2 .  ?T1 :exhibition\#theme ?T1_theme . ?T2 :artist\#name ?T2_name . ?T1 :exhibition\#ticket_price ?T1_ticket_price . FILTER(?T1_ticket_price > (?aggregation_T23_ticket_price_15)) .       {SELECT (avg( ?T23_ticket_price) as ?aggregation_T23_ticket_price_15 ) WHERE { ?T23 a :exhibition . ?T23 :exhibition\#ticket_price ?T23_ticket_price .        }    } }
theme_gallery,"Show the average, minimum, and maximum ticket prices for exhibitions for all years before 2009.",SELECT (avg( ?T1_ticket_price) as ?aggregation_T1_ticket_price_28 ) (min( ?T1_ticket_price) as ?aggregation_T1_ticket_price_134 ) (max( ?T1_ticket_price) as ?aggregation_T1_ticket_price_156 ) WHERE { ?T1 a :exhibition . ?T1 :exhibition\#ticket_price ?T1_ticket_price . ?T1 :exhibition\#ticket_price ?T1_ticket_price . ?T1 :exhibition\#ticket_price ?T1_ticket_price . ?T1 :exhibition\#year ?T1_year . FILTER(?T1_year < 2009) .        }
theme_gallery,Show theme and year for all exhibitions in an descending order of ticket price.,SELECT ?T1_theme ?T1_year WHERE { ?T1 a :exhibition . ?T1 :exhibition\#theme ?T1_theme . ?T1 :exhibition\#year ?T1_year . ?T1 :exhibition\#ticket_price ?T1_ticket_price .        }  ORDER BY DESC (?T1_ticket_price)
theme_gallery,"Return the themes, dates, and attendance for exhibitions that happened in 2004.",SELECT ?T1_theme ?T2_date ?T2_attendance WHERE { ?T1 a :exhibition . ?T2 a :exhibition_record . ?T2 :exhibition_record\#ref-exhibition_id ?T1 .  ?T1 :exhibition\#theme ?T1_theme . ?T2 :exhibition_record\#date ?T2_date . ?T2 :exhibition_record\#attendance ?T2_attendance . ?T1 :exhibition\#year ?T1_year . FILTER(?T1_year = 2004) .        }
theme_gallery,Show all artist names who didn't have an exhibition in 2004.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :artist . ?T3 a :exhibition . ?T3 :exhibition\#ref-artist_id ?T2 .  ?T2 :artist\#name ?T2_name . ?T3 :exhibition\#year ?T3_year . FILTER(?T3_year = 2004) .        }     } }
theme_gallery,What are the names of artists who did not have an exhibition in 2004?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :artist . ?T3 a :exhibition . ?T3 :exhibition\#ref-artist_id ?T2 .  ?T2 :artist\#name ?T2_name . ?T3 :exhibition\#year ?T3_year . FILTER(?T3_year = 2004) .        }     } }
theme_gallery,Show the theme for exhibitions with both records of an attendance below 100 and above 500.,SELECT DISTINCT ?T1_theme WHERE { ?T1 a :exhibition . ?T2 a :exhibition_record . ?T2 :exhibition_record\#ref-exhibition_id ?T1 .  ?T1 :exhibition\#theme ?T1_theme . ?T2 :exhibition_record\#attendance ?T2_attendance . FILTER(?T2_attendance < 100) . FILTER (?T1_theme in (?T3_theme)) .   ?T3 a :exhibition . ?T4 a :exhibition_record . ?T4 :exhibition_record\#ref-exhibition_id ?T3 .  ?T3 :exhibition\#theme ?T3_theme . ?T4 :exhibition_record\#attendance ?T4_attendance .  FILTER(?T4_attendance > 500) .             }
theme_gallery,Count the number of exhibitions that have had an attendnance of over 100 or a ticket prices under 10.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :exhibition_record . ?T2 a :exhibition . ?T1 :exhibition_record\#ref-exhibition_id ?T2 .  ?T1 :exhibition_record\#attendance ?T1_attendance . ?T2 :exhibition\#ticket_price ?T2_ticket_price . FILTER(?T1_attendance > 100 || ?T2_ticket_price < 10) .        }
