kg_name,question,query
formula_1,What is the id and first name of all the drivers who participated in the Australian Grand Prix and the Chinese Grand Prix?,SELECT DISTINCT ?T1_driverid ?T2_forename WHERE { ?T1 a :results . ?T2 a :drivers . ?T1 :results\#ref-driverid ?T2 .  ?T1 :results\#driverid ?T1_driverid . ?T2 :drivers\#forename ?T2_forename . ?T3 :races\#name ?T3_name . ?T14 a :qualifying . ?T14 :qualifying\#ref-driverid ?T2 .  ?T1 :results\#driverid ?T1_driverid . ?T2 :drivers\#forename ?T2_forename . ?T3 :races\#name ?T3_name . ?T3 a :races . ?T14 :qualifying\#ref-raceid ?T3 .  ?T1 :results\#driverid ?T1_driverid . ?T2 :drivers\#forename ?T2_forename . ?T3 :races\#name ?T3_name . FILTER(?T3_name = 'Australian Grand Prix') . FILTER (?T1_driverid in (?T4_driverid)) . FILTER (?T2_forename in (?T5_forename)) .   ?T4 a :results . ?T5 a :drivers . ?T4 :results\#ref-driverid ?T5 .  ?T4 :results\#driverid ?T4_driverid . ?T5 :drivers\#forename ?T5_forename . ?T6 :races\#name ?T6_name . ?T17 a :qualifying . ?T17 :qualifying\#ref-driverid ?T5 .  ?T4 :results\#driverid ?T4_driverid . ?T5 :drivers\#forename ?T5_forename . ?T6 :races\#name ?T6_name . ?T6 a :races . ?T17 :qualifying\#ref-raceid ?T6 .  ?T4 :results\#driverid ?T4_driverid . ?T5 :drivers\#forename ?T5_forename . ?T6 :races\#name ?T6_name .  FILTER(?T6_name = 'Chinese Grand Prix') .             }
formula_1,What are the forenames and surnames of drivers who participated in the races named Australian Grand Prix but not the races named Chinese Grand Prix?,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_forename as ?col1) (?T1_surname as ?col2) WHERE { ?T1 a :drivers . ?T13 a :qualifying . ?T13 :qualifying\#ref-driverid ?T1 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T2 :races\#name ?T2_name . ?T2 a :races . ?T13 :qualifying\#ref-raceid ?T2 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T2 :races\#name ?T2_name . FILTER(?T2_name = 'Australian Grand Prix') .   }}  MINUS {SELECT (?T3_forename as ?col1) (?T3_surname as ?col2) WHERE { ?T3 a :drivers . ?T15 a :qualifying . ?T15 :qualifying\#ref-driverid ?T3 .  ?T3 :drivers\#forename ?T3_forename . ?T3 :drivers\#surname ?T3_surname . ?T4 :races\#name ?T4_name . ?T4 a :races . ?T15 :qualifying\#ref-raceid ?T4 .  ?T3 :drivers\#forename ?T3_forename . ?T3 :drivers\#surname ?T3_surname . ?T4 :races\#name ?T4_name . FILTER(?T4_name = 'Chinese Grand Prix') .        }     } }
formula_1,What are the first and last names of all drivers who participated in the Australian Grand Prix but not the Chinese Grand Prix?,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_forename as ?col1) (?T1_surname as ?col2) WHERE { ?T1 a :drivers . ?T13 a :qualifying . ?T13 :qualifying\#ref-driverid ?T1 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T2 :races\#name ?T2_name . ?T2 a :races . ?T13 :qualifying\#ref-raceid ?T2 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T2 :races\#name ?T2_name . FILTER(?T2_name = 'Australian Grand Prix') .   }}  MINUS {SELECT (?T3_forename as ?col1) (?T3_surname as ?col2) WHERE { ?T3 a :drivers . ?T15 a :qualifying . ?T15 :qualifying\#ref-driverid ?T3 .  ?T3 :drivers\#forename ?T3_forename . ?T3 :drivers\#surname ?T3_surname . ?T4 :races\#name ?T4_name . ?T4 a :races . ?T15 :qualifying\#ref-raceid ?T4 .  ?T3 :drivers\#forename ?T3_forename . ?T3 :drivers\#surname ?T3_surname . ?T4 :races\#name ?T4_name . FILTER(?T4_name = 'Chinese Grand Prix') .        }     } }
formula_1,What are the numbers of constructors for different nationalities?,SELECT (count( *) as ?aggregation_all) ?T1_nationality WHERE { ?T1 a :constructors . ?T1 :constructors\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality
formula_1,What are the numbers of races for each constructor id?,SELECT (count( *) as ?aggregation_all) ?T1_constructorid WHERE { ?T1 a :constructorstandings . ?T1 :constructorstandings\#constructorid ?T1_constructorid .        } GROUP BY ?T1_constructorid
formula_1,What are the names of the races held after 2017 in Spain?,SELECT ?T1_name WHERE { ?T1 a :races . ?T2 a :circuits . ?T1 :races\#ref-circuitid ?T2 .  ?T1 :races\#name ?T1_name . ?T2 :circuits\#country ?T2_country . ?T1 :races\#year ?T1_year . FILTER(?T2_country = 'Spain' && ?T1_year > 2017) .        }
formula_1,What are the names of all races held after 2000 in Spain?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :races . ?T2 a :circuits . ?T1 :races\#ref-circuitid ?T2 .  ?T1 :races\#name ?T1_name . ?T2 :circuits\#country ?T2_country . ?T1 :races\#year ?T1_year . FILTER(?T2_country = 'Spain' && ?T1_year > 2000) .        }
formula_1,Find the distinct driver id and the stop number of all drivers that have a shorter pit stop duration than some drivers in the race with id 841.,SELECT DISTINCT ?T1_driverid ?T1_stop WHERE { ?T1 a :pitstops . ?T1 :pitstops\#driverid ?T1_driverid . ?T1 :pitstops\#stop ?T1_stop . ?T1 :pitstops\#duration ?T1_duration . FILTER(?T1_duration < (?T22_raceid)) .       {SELECT (max( ?T22_duration) as ?aggregation_T22_duration_76 ) WHERE { ?T22 a :pitstops . ?T22 :pitstops\#duration ?T22_duration . ?T22 :pitstops\#raceid ?T22_raceid . FILTER(?T22_raceid = 841) .        }    } }
formula_1,List the forenames of all distinct drivers in alphabetical order?,SELECT DISTINCT ?T1_forename WHERE { ?T1 a :drivers . ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#forename ?T1_forename .        }  ORDER BY ASC (?T1_forename)
formula_1,List the names of all distinct races in reversed  lexicographic order?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#name ?T1_name .        }  ORDER BY DESC (?T1_name)
formula_1,What are the names of races held between 2009 and 2011?,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#year ?T1_year . FILTER(?T1_year >= 2009 && ?T1_year <= 2011) .        }
formula_1,What are the names of all races held between 2009 and 2011?,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#year ?T1_year . FILTER(?T1_year >= 2009 && ?T1_year <= 2011) .        }
formula_1,What are the names of races held after 12:00:00 or before 09:00:00?,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#time ?T1_time . ?T1 :races\#time ?T1_time . FILTER(?T1_time > '12:00:00' || ?T1_time < '09:00:00') .        }
formula_1,"What are the drivers' first, last names and id who had more than 8 pit stops or participated in more than 5 race results?",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_forename as ?col1) (?T1_surname as ?col2) (?T1_driverid as ?col3) WHERE { ?T1 a :drivers . ?T2 a :pitstops . ?T2 :pitstops\#ref-driverid ?T1 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#driverid ?T1_driverid .   }} UNION {SELECT (?T1_forename as ?col1) (?T1_surname as ?col2) (?T1_driverid as ?col3) WHERE { ?T1 a :drivers . ?T2 a :results . ?T2 :results\#ref-driverid ?T1 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#driverid ?T1_driverid .        } GROUP BY ?T1_forename ?T1_surname ?T1_driverid   HAVING(count( *)  > 5)  } } GROUP BY ?T1_forename ?T1_surname ?T1_driverid   HAVING(count( *)  > 8)
formula_1,"What are the drivers' first names,last names, and ids for all those that had more than 8 stops or participated in more than 5 races?",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_forename as ?col1) (?T1_surname as ?col2) (?T1_driverid as ?col3) WHERE { ?T1 a :drivers . ?T2 a :pitstops . ?T2 :pitstops\#ref-driverid ?T1 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#driverid ?T1_driverid .   }} UNION {SELECT (?T1_forename as ?col1) (?T1_surname as ?col2) (?T1_driverid as ?col3) WHERE { ?T1 a :drivers . ?T2 a :results . ?T2 :results\#ref-driverid ?T1 .  ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#driverid ?T1_driverid .        } GROUP BY ?T1_forename ?T1_surname ?T1_driverid   HAVING(count( *)  > 5)  } } GROUP BY ?T1_forename ?T1_surname ?T1_driverid   HAVING(count( *)  > 8)
formula_1,What are the drivers' last names and id who had 11 pit stops and participated in more than 5 race results?,SELECT DISTINCT ?T1_surname ?T1_driverid WHERE { ?T1 a :drivers . ?T2 a :pitstops . ?T2 :pitstops\#ref-driverid ?T1 .  ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#driverid ?T1_driverid . FILTER (?T1_surname in (?T3_surname)) . FILTER (?T1_driverid in (?T3_driverid)) .   ?T3 a :drivers . ?T4 a :results . ?T4 :results\#ref-driverid ?T3 .  ?T3 :drivers\#surname ?T3_surname . ?T3 :drivers\#driverid ?T3_driverid .     GROUP BY ?T3_surname ?T3_driverid   HAVING(count( *)  > 5)      } GROUP BY ?T1_surname ?T1_driverid   HAVING(count( *)  = 11)
formula_1,What are the last names and ids of all drivers who had 11 pit stops and participated in more than 5 races?,SELECT DISTINCT ?T1_surname ?T1_driverid WHERE { ?T1 a :drivers . ?T2 a :pitstops . ?T2 :pitstops\#ref-driverid ?T1 .  ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#driverid ?T1_driverid . FILTER (?T1_surname in (?T3_surname)) . FILTER (?T1_driverid in (?T3_driverid)) .   ?T3 a :drivers . ?T4 a :results . ?T4 :results\#ref-driverid ?T3 .  ?T3 :drivers\#surname ?T3_surname . ?T3 :drivers\#driverid ?T3_driverid .     GROUP BY ?T3_surname ?T3_driverid   HAVING(count( *)  > 5)      } GROUP BY ?T1_surname ?T1_driverid   HAVING(count( *)  = 11)
formula_1,What is the id and last name of the driver who participated in the most races after 2010?,SELECT ?T1_driverid (count( *) as ?aggregation_all) ?T1_surname WHERE { ?T1 a :drivers . ?T2 a :results . ?T2 :results\#ref-driverid ?T1 .  ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#surname ?T1_surname . ?T3 :races\#year ?T3_year . ?T3 a :races . ?T2 :results\#ref-raceid ?T3 .  ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#surname ?T1_surname . ?T3 :races\#year ?T3_year . FILTER(?T3_year > 2010) .        } GROUP BY ?T1_driverid ?T1_surname  ORDER BY DESC (?aggregation_all) LIMIT 1
formula_1,What are the names of circuits that belong to UK or Malaysia?,SELECT ?T1_name WHERE { ?T1 a :circuits . ?T1 :circuits\#name ?T1_name . ?T1 :circuits\#country ?T1_country . ?T1 :circuits\#country ?T1_country . FILTER(?T1_country = 'UK' || ?T1_country = 'Malaysia') .        }
formula_1,What are the names of all the circuits that are in the UK or Malaysia?,SELECT ?T1_name WHERE { ?T1 a :circuits . ?T1 :circuits\#name ?T1_name . ?T1 :circuits\#country ?T1_country . ?T1 :circuits\#country ?T1_country . FILTER(?T1_country = 'UK' || ?T1_country = 'Malaysia') .        }
formula_1,Find the id and location of circuits that belong to France or Belgium?,SELECT ?T1_circuitid ?T1_location WHERE { ?T1 a :circuits . ?T1 :circuits\#circuitid ?T1_circuitid . ?T1 :circuits\#location ?T1_location . ?T1 :circuits\#country ?T1_country . ?T1 :circuits\#country ?T1_country . FILTER(?T1_country = 'France' || ?T1_country = 'Belgium') .        }
formula_1,What are the ids and locations of all circuits in France or Belgium?,SELECT ?T1_circuitid ?T1_location WHERE { ?T1 a :circuits . ?T1 :circuits\#circuitid ?T1_circuitid . ?T1 :circuits\#location ?T1_location . ?T1 :circuits\#country ?T1_country . ?T1 :circuits\#country ?T1_country . FILTER(?T1_country = 'France' || ?T1_country = 'Belgium') .        }
formula_1,What is the average fastest lap speed in race named 'Monaco Grand Prix' in 2008 ?,SELECT (avg( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_49 ) WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T1 :results\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\#year ?T2_year . ?T2 :races\#name ?T2_name . FILTER(?T2_year = 2008 && ?T2_name = 'Monaco Grand Prix') .        }
formula_1,What is the average fastest lap speed for the Monaco Grand Prix in 2008?,SELECT (avg( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_103 ) WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T1 :results\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\#year ?T2_year . ?T2 :races\#name ?T2_name . FILTER(?T2_year = 2008 && ?T2_name = 'Monaco Grand Prix') .        }
formula_1,What is the maximum fastest lap speed in the Monaco Grand Prix in 2008?,SELECT (max( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_74 ) WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T1 :results\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\#year ?T2_year . ?T2 :races\#name ?T2_name . FILTER(?T2_year = 2008 && ?T2_name = 'Monaco Grand Prix') .        }
formula_1,What are the maximum fastest lap speed in races held after 2004 grouped by race name and ordered by year?,SELECT (max( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_181 ) ?T2_name ?T2_year WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T1 :results\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\#name ?T2_name . ?T2 :races\#year ?T2_year . ?T2 :races\#year ?T2_year . ?T2 :races\#year ?T2_year . FILTER(?T2_year > 2014) .        } GROUP BY ?T2_name ?T2_year ORDER BY ASC (?T2_year)
formula_1,"For each race name, What is the maximum fastest lap speed for races after 2004 ordered by year?",SELECT (max( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_37 ) ?T2_name ?T2_year WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T1 :results\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\#name ?T2_name . ?T2 :races\#year ?T2_year . ?T2 :races\#year ?T2_year . ?T2 :races\#year ?T2_year . FILTER(?T2_year > 2014) .        } GROUP BY ?T2_name ?T2_year ORDER BY ASC (?T2_year)
formula_1,"What is the average fastest lap speed for races held after 2004, for each race, ordered by year?",SELECT (avg( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_7 ) ?T2_name ?T2_year WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T1 :results\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\#name ?T2_name . ?T2 :races\#year ?T2_year . ?T2 :races\#year ?T2_year . ?T2 :races\#year ?T2_year . FILTER(?T2_year > 2014) .        } GROUP BY ?T2_name ?T2_year ORDER BY ASC (?T2_year)
formula_1,"Find the id, forename and number of races of all drivers who have at least participated in two races?",SELECT ?T1_driverid ?T1_forename (count( *) as ?aggregation_all) WHERE { ?T1 a :drivers . ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#forename ?T1_forename .        } GROUP BY ?T1_forename   HAVING(count( *)  >= 2)
formula_1,"What is the id, forename, and number of races for all drivers that have participated in at least 2 races?",SELECT ?T1_driverid ?T1_forename (count( *) as ?aggregation_all) WHERE { ?T1 a :drivers . ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#forename ?T1_forename .        } GROUP BY ?T1_forename   HAVING(count( *)  >= 2)
formula_1,Find the id and surname of the driver who participated the most number of races?,SELECT ?T1_driverid (count( *) as ?aggregation_all) ?T1_surname WHERE { ?T1 a :drivers . ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#surname ?T1_surname .        } GROUP BY ?T1_driverid  ?T1_surname  ORDER BY DESC (?aggregation_all) LIMIT 1
formula_1,What are the ids and last names of all drivers who participated in the most races?,SELECT ?T1_driverid (count( *) as ?aggregation_all) ?T1_surname WHERE { ?T1 a :drivers . ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#surname ?T1_surname .        } GROUP BY ?T1_driverid  ?T1_surname  ORDER BY DESC (?aggregation_all) LIMIT 1
machine_repair,How many technicians are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :technician .        }
machine_repair,What is the number of technicians?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :technician .        }
machine_repair,List the names of technicians in ascending order of age.,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#age ?T1_age .        }  ORDER BY ASC (?T1_age)
machine_repair,What are the names of the technicians by ascending order of age?,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#age ?T1_age .        }  ORDER BY ASC (?T1_age)
machine_repair,What are the team and starting year of technicians?,SELECT ?T1_team ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team . ?T1 :technician\#starting_year ?T1_starting_year .        }
machine_repair,What is the team and starting year for each technician?,SELECT ?T1_team ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team . ?T1 :technician\#starting_year ?T1_starting_year .        }
machine_repair,List the name of technicians whose team is not 'NYY'.,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#team ?T1_team . FILTER(?T1_team != 'NYY') .        }
machine_repair,What is the name of the technician whose team is not 'NYY'?,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#team ?T1_team . FILTER(?T1_team != 'NYY') .        }
machine_repair,Show the name of technicians aged either 36 or 37,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#age ?T1_age . ?T1 :technician\#age ?T1_age . FILTER(?T1_age = 36 || ?T1_age = 37) .        }
machine_repair,What are the names of the technicians aged either 36 or 37?,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#age ?T1_age . ?T1 :technician\#age ?T1_age . FILTER(?T1_age = 36 || ?T1_age = 37) .        }
machine_repair,What is the starting year of the oldest technicians?,SELECT ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :technician\#starting_year ?T1_starting_year . ?T1 :technician\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
machine_repair,What is the starting year for the oldest technician?,SELECT ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :technician\#starting_year ?T1_starting_year . ?T1 :technician\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
machine_repair,Show different teams of technicians and the number of technicians in each team.,SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team .        } GROUP BY ?T1_team
machine_repair,Please show the team that has the most number of technicians.,SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team .        } GROUP BY ?T1_team  ORDER BY DESC (?aggregation_all) LIMIT 1
machine_repair,What are the teams with the most technicians?,SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team .        } GROUP BY ?T1_team  ORDER BY DESC (?aggregation_all) LIMIT 1
machine_repair,Show the team that have at least two technicians.,SELECT ?T1_team WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team .        } GROUP BY ?T1_team   HAVING(count( *)  >= 2)
machine_repair,What is the team with at least 2 technicians?,SELECT ?T1_team WHERE { ?T1 a :technician . ?T1 :technician\#team ?T1_team .        } GROUP BY ?T1_team   HAVING(count( *)  >= 2)
machine_repair,Show names of technicians and series of machines they are assigned to repair.,SELECT ?T1_name ?T2_machine_series WHERE { ?T1 a :technician . ?T13 a :repair_assignment . ?T13 :repair_assignment\#ref-technician_id ?T1 .  ?T1 :technician\#name ?T1_name . ?T2 :machine\#machine_series ?T2_machine_series . ?T2 a :machine . ?T13 :repair_assignment\#ref-machine_id ?T2 .  ?T1 :technician\#name ?T1_name . ?T2 :machine\#machine_series ?T2_machine_series .        }
machine_repair,Show names of technicians in ascending order of quality rank of the machine they are assigned.,SELECT ?T1_name WHERE { ?T1 a :technician . ?T13 a :repair_assignment . ?T13 :repair_assignment\#ref-technician_id ?T1 .  ?T1 :technician\#name ?T1_name . ?T2 :machine\#quality_rank ?T2_quality_rank . ?T2 a :machine . ?T13 :repair_assignment\#ref-machine_id ?T2 .  ?T1 :technician\#name ?T1_name . ?T2 :machine\#quality_rank ?T2_quality_rank .        }  ORDER BY ASC (?T2_quality_rank)
machine_repair,Show names of technicians who are assigned to repair machines with value point more than 70.,SELECT ?T1_name WHERE { ?T1 a :technician . ?T13 a :repair_assignment . ?T13 :repair_assignment\#ref-technician_id ?T1 .  ?T1 :technician\#name ?T1_name . ?T2 :machine\#value_points ?T2_value_points . ?T2 a :machine . ?T13 :repair_assignment\#ref-machine_id ?T2 .  ?T1 :technician\#name ?T1_name . ?T2 :machine\#value_points ?T2_value_points . FILTER(?T2_value_points > 70) .        }
machine_repair,Show names of technicians and the number of machines they are assigned to repair.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T2 a :repair_assignment . ?T2 :repair_assignment\#ref-technician_id ?T1 .  ?T1 :technician\#name ?T1_name .        } GROUP BY ?T1_name
machine_repair,List the names of technicians who have not been assigned to repair machines.,SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :technician\#name ?T1_name . ?T1 :technician\#technician_id ?T1_technician_id . FILTER(?T1_technician_id not in (?T22_technician_id)) .       {SELECT ?T22_technician_id WHERE { ?T22 a :repair_assignment . ?T22 :repair_assignment\#technician_id ?T22_technician_id .        }    } }
machine_repair,Show the starting years shared by technicians from team 'CLE' and 'CWS'.,SELECT DISTINCT ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :technician\#starting_year ?T1_starting_year . ?T1 :technician\#team ?T1_team . FILTER(?T1_team = 'CLE') . FILTER (?T1_starting_year in (?T2_starting_year)) .   ?T2 a :technician . ?T2 :technician\#starting_year ?T2_starting_year . ?T2 :technician\#team ?T2_team .  FILTER(?T2_team = 'CWS') .             }
machine_repair,What are the starting years shared by the technicians from the team 'CLE' or 'CWS'?,SELECT DISTINCT ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :technician\#starting_year ?T1_starting_year . ?T1 :technician\#team ?T1_team . FILTER(?T1_team = 'CLE') . FILTER (?T1_starting_year in (?T2_starting_year)) .   ?T2 a :technician . ?T2 :technician\#starting_year ?T2_starting_year . ?T2 :technician\#team ?T2_team .  FILTER(?T2_team = 'CWS') .             }
entrepreneur,How many entrepreneurs are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :entrepreneur .        }
entrepreneur,List the companies of entrepreneurs in descending order of money requested.,SELECT ?T1_company WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#company ?T1_company . ?T1 :entrepreneur\#money_requested ?T1_money_requested .        }  ORDER BY DESC (?T1_money_requested)
entrepreneur,List the companies and the investors of entrepreneurs.,SELECT ?T1_company ?T1_investor WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#company ?T1_company . ?T1 :entrepreneur\#investor ?T1_investor .        }
entrepreneur,What is the average money requested by all entrepreneurs?,SELECT (avg( ?T1_money_requested) as ?aggregation_T1_money_requested_147 ) WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#money_requested ?T1_money_requested .        }
entrepreneur,Return the average money requested across all entrepreneurs.,SELECT (avg( ?T1_money_requested) as ?aggregation_T1_money_requested_164 ) WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#money_requested ?T1_money_requested .        }
entrepreneur,What are the names of people in ascending order of weight?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#weight ?T1_weight .        }  ORDER BY ASC (?T1_weight)
entrepreneur,What are the names of entrepreneurs?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name .        }
entrepreneur,What are the names of entrepreneurs whose investor is not 'Rachel Elnaugh'?,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :entrepreneur . ?T2 :entrepreneur\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :entrepreneur\#investor ?T2_investor . FILTER(?T2_investor != 'Rachel Elnaugh') .        }
entrepreneur,What is the weight of the shortest person?,SELECT ?T1_weight WHERE { ?T1 a :people . ?T1 :people\#weight ?T1_weight . ?T1 :people\#height ?T1_height .        }   ORDER BY ASC (?T1_height) LIMIT 1
entrepreneur,What is the name of the entrepreneur with the greatest weight?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#weight ?T1_weight .        }   ORDER BY DESC (?T1_weight) LIMIT 1
entrepreneur,Give the total money requested by entrepreneurs who are taller than 1.85.,SELECT (sum( ?T1_money_requested) as ?aggregation_T1_money_requested_78 ) WHERE { ?T1 a :entrepreneur . ?T2 a :people . ?T1 :entrepreneur\#ref-people_id ?T2 .  ?T1 :entrepreneur\#money_requested ?T1_money_requested . ?T2 :people\#height ?T2_height . FILTER(?T2_height > 1.85) .        }
entrepreneur,What are the dates of birth of entrepreneurs with investor 'Simon Woodroffe' or 'Peter Jones'?,SELECT ?T1_date_of_birth WHERE { ?T1 a :people . ?T2 a :entrepreneur . ?T2 :entrepreneur\#ref-people_id ?T1 .  ?T1 :people\#date_of_birth ?T1_date_of_birth . ?T2 :entrepreneur\#investor ?T2_investor . ?T2 :entrepreneur\#investor ?T2_investor . FILTER(?T2_investor = 'Simon Woodroffe' || ?T2_investor = 'Peter Jones') .        }
entrepreneur,"Return the weights of entrepreneurs, ordered descending by amount of money requested.",SELECT ?T1_weight WHERE { ?T1 a :people . ?T2 a :entrepreneur . ?T2 :entrepreneur\#ref-people_id ?T1 .  ?T1 :people\#weight ?T1_weight . ?T2 :entrepreneur\#money_requested ?T2_money_requested .        }  ORDER BY DESC (?T2_money_requested)
entrepreneur,How many entrepreneurs correspond to each investor?,SELECT ?T1_investor (count( *) as ?aggregation_all) WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#investor ?T1_investor .        } GROUP BY ?T1_investor
entrepreneur,Return the investor who have invested in the greatest number of entrepreneurs.,SELECT ?T1_investor (count( *) as ?aggregation_all) WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#investor ?T1_investor .        } GROUP BY ?T1_investor  ORDER BY DESC (?aggregation_all) LIMIT 1
entrepreneur,Return the investors who have invested in two or more entrepreneurs.,SELECT ?T1_investor WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#investor ?T1_investor .        } GROUP BY ?T1_investor   HAVING(count( *)  >= 2)
entrepreneur,List the names of people that are not entrepreneurs.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) .       {SELECT ?T22_people_id WHERE { ?T22 a :entrepreneur . ?T22 :entrepreneur\#people_id ?T22_people_id .        }    } }
entrepreneur,What are the names of people who are not entrepreneurs?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) .       {SELECT ?T22_people_id WHERE { ?T22 a :entrepreneur . ?T22 :entrepreneur\#people_id ?T22_people_id .        }    } }
entrepreneur,Show the investors shared by entrepreneurs that requested more than 140000 and entrepreneurs that requested less than 120000.,SELECT DISTINCT ?T1_investor WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#investor ?T1_investor . ?T1 :entrepreneur\#money_requested ?T1_money_requested . FILTER(?T1_money_requested > 140000) . FILTER (?T1_investor in (?T2_investor)) .   ?T2 a :entrepreneur . ?T2 :entrepreneur\#investor ?T2_investor . ?T2 :entrepreneur\#money_requested ?T2_money_requested .  FILTER(?T2_money_requested < 120000) .             }
entrepreneur,How many distinct companies are there?,SELECT DISTINCT (count(DISTINCT ?T1_company) as ?aggregation_T1_company_175 ) WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#company ?T1_company .        }
entrepreneur,Count the number of different companies.,SELECT DISTINCT (count(DISTINCT ?T1_company) as ?aggregation_T1_company_75 ) WHERE { ?T1 a :entrepreneur . ?T1 :entrepreneur\#company ?T1_company .        }
entrepreneur,Show the company of the tallest entrepreneur.,SELECT ?T1_company WHERE { ?T1 a :entrepreneur . ?T2 a :people . ?T1 :entrepreneur\#ref-people_id ?T2 .  ?T1 :entrepreneur\#company ?T1_company . ?T2 :people\#height ?T2_height .        }   ORDER BY DESC (?T2_height) LIMIT 1
perpetrator,How many perpetrators are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :perpetrator .        }
perpetrator,List the date of perpetrators in descending order of the number of people killed.,SELECT ?T1_date WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#date ?T1_date . ?T1 :perpetrator\#killed ?T1_killed .        }  ORDER BY DESC (?T1_killed)
perpetrator,List the number of people injured by perpetrators in ascending order.,SELECT ?T1_injured WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#injured ?T1_injured . ?T1 :perpetrator\#injured ?T1_injured .        }  ORDER BY ASC (?T1_injured)
perpetrator,What is the average number of people injured by all perpetrators?,SELECT (avg( ?T1_injured) as ?aggregation_T1_injured_19 ) WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#injured ?T1_injured .        }
perpetrator,What is the location of the perpetrator with the largest kills.,SELECT ?T1_location WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#location ?T1_location . ?T1 :perpetrator\#killed ?T1_killed .        }   ORDER BY DESC (?T1_killed) LIMIT 1
perpetrator,What are the names of people in ascending order of height?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#height ?T1_height .        }  ORDER BY ASC (?T1_height)
perpetrator,What are the names of perpetrators?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name .        }
perpetrator,What are the names of perpetrators whose country is not 'China'?,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :perpetrator\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :perpetrator\#country ?T2_country . FILTER(?T2_country != 'China') .        }
perpetrator,What is the total kills of the perpetrators with height more than 1.84.,SELECT (sum( ?T1_killed) as ?aggregation_T1_killed_124 ) WHERE { ?T1 a :perpetrator . ?T2 a :people . ?T1 :perpetrator\#ref-people_id ?T2 .  ?T1 :perpetrator\#killed ?T1_killed . ?T2 :people\#height ?T2_height . FILTER(?T2_height > 1.84) .        }
perpetrator,What are the names of perpetrators in country 'China' or 'Japan'?,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :perpetrator\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :perpetrator\#country ?T2_country . ?T2 :perpetrator\#country ?T2_country . FILTER(?T2_country = 'China' || ?T2_country = 'Japan') .        }
perpetrator,What are the countries of perpetrators? Show each country and the corresponding number of perpetrators there.,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#country ?T1_country .        } GROUP BY ?T1_country
perpetrator,What is the country that has the most perpetrators?,SELECT ?T1_country (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1
perpetrator,What are the countries that have at least two perpetrators?,SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  >= 2)
perpetrator,List the names of perpetrators in descending order of the year.,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :perpetrator\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :perpetrator\#year ?T2_year .        }  ORDER BY DESC (?T2_year)
