[
    {
        "kg_name": "apartment_rentals",
        "question": "What are dates of birth of all the guests whose gender is 'Male'?",
        "query": "SELECT ?T1_date_of_birth WHERE { ?T1 a :guests . ?T1 :guests\\#date_of_birth ?T1_date_of_birth . ?T1 :guests\\#gender_code ?T1_gender_code . FILTER(?T1_gender_code = 'Male') .        }"
    },
    {
        "kg_name": "game_injury",
        "question": "Which stadium name contains the substring 'Bank'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :stadium\\#name ?T1_name . ?T1 :stadium\\#name ?T1_name . FILTER(contains (?T1_name, 'Bank')) .        }"
    },
    {
        "kg_name": "college_2",
        "question": "Find the title of courses that have two prerequisites?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :course . ?T2 a :prereq . ?T2 :prereq\\#ref-course_id ?T1 .  ?T1 :course\\#title ?T1_title .        } GROUP BY ?T1_title   HAVING(count( *)  = 2)"
    },
    {
        "kg_name": "college_2",
        "question": "What are the titles for courses with two prerequisites?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :course . ?T2 a :prereq . ?T2 :prereq\\#ref-course_id ?T1 .  ?T1 :course\\#title ?T1_title .        } GROUP BY ?T1_title   HAVING(count( *)  = 2)"
    },
    {
        "kg_name": "college_2",
        "question": "What are the names of the 3 departments with the most courses?",
        "query": "SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T1 :course\\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "Find the name of the department that offers the highest total credits?",
        "query": "SELECT ?T1_dept_name WHERE { ?T1 a :course . ?T1 :course\\#dept_name ?T1_dept_name . ?T1 :course\\#credits ?T1_credits .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T1_credits) as ?aggregation_T1_credits_103 )) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "What is the name of the department with the most credits?",
        "query": "SELECT ?T1_dept_name WHERE { ?T1 a :course . ?T1 :course\\#dept_name ?T1_dept_name . ?T1 :course\\#credits ?T1_credits .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T1_credits) as ?aggregation_T1_credits_53 )) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "What are the names of instructors who advise more than one student?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :instructor . ?T2 a :advisor . ?T2 :advisor\\#ref-i_id ?T1 .  ?T1 :instructor\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)"
    },
    {
        "kg_name": "college_2",
        "question": "Find the name of the students who have more than one advisor?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :student . ?T2 a :advisor . ?T2 :advisor\\#ref-s_id ?T1 .  ?T1 :student\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)"
    },
    {
        "kg_name": "college_2",
        "question": "What are the names of students who have more than one advisor?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :student . ?T2 a :advisor . ?T2 :advisor\\#ref-s_id ?T1 .  ?T1 :student\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)"
    },
    {
        "kg_name": "college_2",
        "question": "Which year had the greatest number of courses?",
        "query": "SELECT ?T1_year (count( *) as ?aggregation_all) WHERE { ?T1 a :section . ?T1 :section\\#year ?T1_year .        } GROUP BY ?T1_year  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "What is the year and semester with the most courses?",
        "query": "SELECT ?T1_semester (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 a :section . ?T1 :section\\#semester ?T1_semester . ?T1 :section\\#year ?T1_year .        } GROUP BY ?T1_semester  ?T1_year  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "Find the name of department has the highest amount of students?",
        "query": "SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "What is the name of the deparment with the highest enrollment?",
        "query": "SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "Which semeseter and year had the fewest students?",
        "query": "SELECT ?T1_semester (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 a :takes . ?T1 :takes\\#semester ?T1_semester . ?T1 :takes\\#year ?T1_year .        } GROUP BY ?T1_semester  ?T1_year  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "Which department has the highest average instructor salary?",
        "query": "SELECT ?T1_dept_name WHERE { ?T1 a :instructor . ?T1 :instructor\\#dept_name ?T1_dept_name . ?T1 :instructor\\#salary ?T1_salary .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((avg( ?T1_salary) as ?aggregation_T1_salary_18 )) LIMIT 1"
    },
    {
        "kg_name": "college_2",
        "question": "What are the names of students who haven't taken any Biology courses?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :student . ?T1 :student\\#name ?T1_name . ?T1 :student\\#id ?T1_id . FILTER(?T1_id not in (?T23_dept_name)) .       {SELECT ?T22_id WHERE { ?T22 a :takes . ?T34 a :section . ?T22 :takes\\#ref-course_id ?T34 .  ?T22 :takes\\#id ?T22_id . ?T23 :course\\#dept_name ?T23_dept_name . ?T23 a :course . ?T34 :section\\#ref-course_id ?T23 .  ?T22 :takes\\#id ?T22_id . ?T23 :course\\#dept_name ?T23_dept_name . FILTER(?T23_dept_name = 'Biology') .        }    } }"
    },
    {
        "kg_name": "college_2",
        "question": "What are the names of all instructors with names that include 'dar'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\\#name ?T1_name . ?T1 :instructor\\#name ?T1_name . FILTER(contains (?T1_name, 'dar')) .        }"
    },
    {
        "kg_name": "insurance_and_eclaims",
        "question": "What is the description of the claim status 'Open'?",
        "query": "SELECT ?T1_claim_status_description WHERE { ?T1 a :claims_processing_stages . ?T1 :claims_processing_stages\\#claim_status_description ?T1_claim_status_description . ?T1 :claims_processing_stages\\#claim_status_name ?T1_claim_status_name . FILTER(?T1_claim_status_name = 'Open') .        }"
    },
    {
        "kg_name": "customers_and_invoices",
        "question": "What is the id of the account with the most transactions?",
        "query": "SELECT ?T1_account_id (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\\#account_id ?T1_account_id .        } GROUP BY ?T1_account_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "epinions_1",
        "question": "Find the number of items without any review.",
        "query": "SELECT (COUNT(?T1_i_id) as ?aggregation_all) WHERE { ?T1 a :item . ?T1 :item//i_id ?T1_i_id . FILTER NOT EXISTS { ?T22 a :review . ?T22 :review//i_id ?T22_i_id . FILTER (?T1_i_id = ?T22_i_id) } }"
    },
    {
        "kg_name": "riding_club",
        "question": "How many gold medals has the club with the most coaches won?",
        "query": "SELECT ?T1_club_id (count( *) as ?aggregation_all) ?T1_gold WHERE { ?T1 a :match_result . ?T13 a :club . ?T1 :match_result\\#ref-club_id ?T13 .  ?T1 :match_result\\#club_id ?T1_club_id . ?T1 :match_result\\#gold ?T1_gold .        } GROUP BY ?T1_club_id ?T1_gold  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "gymnast",
        "question": "What are the names of gymnasts whose hometown is not 'Santo Domingo'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\\#name ?T1_name . ?T1 :people\\#hometown ?T1_hometown . FILTER(?T1_hometown != 'Santo Domingo') .        }"
    },
    {
        "kg_name": "browser_web",
        "question": "Which accelerator name contains substring 'Opera'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :web_client_accelerator . ?T1 :web_client_accelerator\\#name ?T1_name . ?T1 :web_client_accelerator\\#name ?T1_name . FILTER(contains (?T1_name, 'Opera')) .        }"
    },
    {
        "kg_name": "wrestler",
        "question": "What are the elimination moves of wrestlers whose team is 'Team Orton'?",
        "query": "SELECT ?T1_elimination_move WHERE { ?T1 a :elimination . ?T1 :elimination\\#elimination_move ?T1_elimination_move . ?T1 :elimination\\#team ?T1_team . FILTER(?T1_team = 'Team Orton') .        }"
    },
    {
        "kg_name": "school_finance",
        "question": "How many donors have endowment for school named 'Glenn'?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_donator_name) as ?aggregation_T1_donator_name_106 ) WHERE { ?T1 a :endowment . ?T2 a :school . ?T1 :endowment\\#ref-school_id ?T2 .  ?T1 :endowment\\#donator_name ?T1_donator_name . ?T2 :school\\#school_name ?T2_school_name . FILTER(?T2_school_name = 'Glenn') .        }"
    },
    {
        "kg_name": "school_finance",
        "question": "What is the total budget amount for school 'Glenn' in all years?",
        "query": "SELECT (sum( ?T1_budgeted) as ?aggregation_T1_budgeted_113 ) WHERE { ?T1 a :budget . ?T2 a :school . ?T1 :budget\\#ref-school_id ?T2 .  ?T1 :budget\\#budgeted ?T1_budgeted . ?T2 :school\\#school_name ?T2_school_name . FILTER(?T2_school_name = 'Glenn') .        }"
    },
    {
        "kg_name": "cinema",
        "question": "What is total number of show times per dat for each cinema?",
        "query": "SELECT ?T1_name (sum( ?T2_show_times_per_day) as ?aggregation_T2_show_times_per_day_3 ) WHERE { ?T1 a :cinema . ?T2 a :schedule . ?T2 :schedule\\#ref-cinema_id ?T1 .  ?T1 :cinema\\#name ?T1_name . ?T2 :schedule\\#show_times_per_day ?T2_show_times_per_day .        } GROUP BY ?T1_name"
    },
    {
        "kg_name": "cinema",
        "question": "What are the title and maximum price of each film?",
        "query": "SELECT ?T1_title (max( ?T2_price) as ?aggregation_T2_price_20 ) WHERE { ?T1 a :film . ?T2 a :schedule . ?T2 :schedule\\#ref-film_id ?T1 .  ?T1 :film\\#title ?T1_title . ?T2 :schedule\\#price ?T2_price .        } GROUP BY ?T1_title"
    },
    {
        "kg_name": "party_people",
        "question": "What are the names of members who are not in charge of any events?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_member_name as ?col1) WHERE { ?T1 a :member . ?T1 :member\\#member_name ?T1_member_name .   }}  MINUS {SELECT (?T2_member_name as ?col1) WHERE { ?T2 a :member . ?T2 :member\\#member_name ?T2_member_name .        }     } }"
    },
    {
        "kg_name": "local_govt_in_alabama",
        "question": "What is the id of the event with the most participants?",
        "query": "SELECT ?T1_event_id (count( *) as ?aggregation_all) WHERE { ?T1 a :participants_in_events . ?T1 :participants_in_events\\#event_id ?T1_event_id .        } GROUP BY ?T1_event_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "formula_1",
        "question": "What is the average fastest lap speed for the Monaco Grand Prix in 2008?",
        "query": "SELECT (avg( ?T1_fastestlapspeed) as ?aggregation_T1_fastestlapspeed_103 ) WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\\#ref-raceid ?T2 .  ?T1 :results\\#fastestlapspeed ?T1_fastestlapspeed . ?T2 :races\\#year ?T2_year . ?T2 :races\\#name ?T2_name . FILTER(?T2_year = 2008 && ?T2_name = 'Monaco Grand Prix') .        }"
    },
    {
        "kg_name": "perpetrator",
        "question": "What are the names of perpetrators whose country is not 'China'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :perpetrator\\#ref-people_id ?T1 .  ?T1 :people\\#name ?T1_name . ?T2 :perpetrator\\#country ?T2_country . FILTER(?T2_country != 'China') .        }"
    },
    {
        "kg_name": "perpetrator",
        "question": "What are the names of perpetrators in country 'China' or 'Japan'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :perpetrator\\#ref-people_id ?T1 .  ?T1 :people\\#name ?T1_name . ?T2 :perpetrator\\#country ?T2_country . ?T2 :perpetrator\\#country ?T2_country . FILTER(?T2_country = 'China' || ?T2_country = 'Japan') .        }"
    },
    {
        "kg_name": "csu_1",
        "question": "What is the campus fee of 'San Jose State University' in year 1996?",
        "query": "SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\\#ref-campus ?T2 .  ?T1 :csu_fees\\#campusfee ?T1_campusfee . ?T2 :campuses\\#campus ?T2_campus . ?T1 :csu_fees\\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 1996) .        }"
    },
    {
        "kg_name": "csu_1",
        "question": "What is the campus fee of 'San Francisco State University' in year 1996?",
        "query": "SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\\#ref-campus ?T2 .  ?T1 :csu_fees\\#campusfee ?T1_campusfee . ?T2 :campuses\\#campus ?T2_campus . ?T1 :csu_fees\\#year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 1996) .        }"
    },
    {
        "kg_name": "csu_1",
        "question": "Which year has the most degrees conferred?",
        "query": "SELECT ?T1_year WHERE { ?T1 a :degrees . ?T1 :degrees\\#year ?T1_year . ?T1 :degrees\\#degrees ?T1_degrees .        } GROUP BY ?T1_year  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_125 )) LIMIT 1"
    },
    {
        "kg_name": "csu_1",
        "question": "In what year was the most degrees conferred?",
        "query": "SELECT ?T1_year WHERE { ?T1 a :degrees . ?T1 :degrees\\#year ?T1_year . ?T1 :degrees\\#degrees ?T1_degrees .        } GROUP BY ?T1_year  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_129 )) LIMIT 1"
    },
    {
        "kg_name": "csu_1",
        "question": "Which campus has the most degrees conferred in all times?",
        "query": "SELECT ?T1_campus WHERE { ?T1 a :degrees . ?T1 :degrees\\#campus ?T1_campus . ?T1 :degrees\\#degrees ?T1_degrees .        } GROUP BY ?T1_campus  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_56 )) LIMIT 1"
    },
    {
        "kg_name": "csu_1",
        "question": "What campus has the most degrees  conferrred over its entire existence?",
        "query": "SELECT ?T1_campus WHERE { ?T1 a :degrees . ?T1 :degrees\\#campus ?T1_campus . ?T1 :degrees\\#degrees ?T1_degrees .        } GROUP BY ?T1_campus  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_190 )) LIMIT 1"
    },
    {
        "kg_name": "csu_1",
        "question": "How many degrees were conferred in 'San Jose State University' in 2000?",
        "query": "SELECT ?T1_degrees WHERE { ?T1 a :degrees . ?T2 a :campuses . ?T1 :degrees\\#ref-campus ?T2 .  ?T1 :degrees\\#degrees ?T1_degrees . ?T2 :campuses\\#campus ?T2_campus . ?T1 :degrees\\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 2000) .        }"
    },
    {
        "kg_name": "csu_1",
        "question": "What is the campus fee of 'San Francisco State University' in year 2000?",
        "query": "SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\\#ref-campus ?T2 .  ?T1 :csu_fees\\#campusfee ?T1_campusfee . ?T2 :campuses\\#campus ?T2_campus . ?T1 :csu_fees\\#year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 2000) .        }"
    },
    {
        "kg_name": "candidate_poll",
        "question": "What is the sex of the candidate who had the highest unsure rate?",
        "query": "SELECT ?T1_sex WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\\#ref-people_id ?T1 .  ?T1 :people\\#sex ?T1_sex . ?T2 :candidate\\#unsure_rate ?T2_unsure_rate .        } GROUP BY ?T1_sex  ORDER BY DESC ((avg( ?T2_unsure_rate) as ?aggregation_T2_unsure_rate_64 )) LIMIT 1"
    },
    {
        "kg_name": "movie_1",
        "question": "What is the id of the reviewer whose name includes the word 'Mike'?",
        "query": "SELECT ?T1_rid WHERE { ?T1 a :reviewer . ?T1 :reviewer\\#rid ?T1_rid . ?T1 :reviewer\\#name ?T1_name . FILTER(contains (?T1_name, 'Mike')) .        }"
    },
    {
        "kg_name": "movie_1",
        "question": "What are the names of all reviewers that have rated 3 or more movies?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :reviewer . ?T2 a :rating . ?T2 :rating\\#ref-rid ?T1 .  ?T1 :reviewer\\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 3)"
    },
    {
        "kg_name": "movie_1",
        "question": "What is the name of the movie that is rated by most of times?",
        "query": "SELECT ?T1_title (count( *) as ?aggregation_all) ?T2_mid WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\\#ref-mid ?T1 .  ?T1 :movie\\#title ?T1_title . ?T2 :rating\\#mid ?T2_mid .        } GROUP BY ?T1_title ?T2_mid  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "movie_1",
        "question": "What is the name of the movie that has been reviewed the most?",
        "query": "SELECT ?T1_title (count( *) as ?aggregation_all) ?T2_mid WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\\#ref-mid ?T1 .  ?T1 :movie\\#title ?T1_title . ?T2 :rating\\#mid ?T2_mid .        } GROUP BY ?T1_title ?T2_mid  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "inn_1",
        "question": "Which room has the highest rate? List the room's full name, rate, check in and check out date.",
        "query": "SELECT ?T2_roomname ?T1_rate ?T1_checkin ?T1_checkout WHERE { ?T1 a :reservations . ?T2 a :rooms .  ?T1 :reservations\\#ref-room ?T2 .  ?T2 :rooms\\#roomname ?T2_roomname . ?T1 :reservations\\#rate ?T1_rate . ?T1 :reservations\\#checkin ?T1_checkin . ?T1 :reservations\\#checkout ?T1_checkout .        }   ORDER BY DESC (?T1_rate) LIMIT 1"
    },
    {
        "kg_name": "inn_1",
        "question": "What kind of decor has the least number of reservations?",
        "query": "SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\\#decor ?T1_decor . ?T1 :rooms\\#decor ?T1_decor .        } GROUP BY ?T1_decor  ORDER BY ASC ((count( ?T1_decor) as ?aggregation_T1_decor_76 )) LIMIT 1"
    },
    {
        "kg_name": "inn_1",
        "question": "What is the least popular kind of decor?",
        "query": "SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\\#decor ?T1_decor . ?T1 :rooms\\#decor ?T1_decor .        } GROUP BY ?T1_decor  ORDER BY ASC ((count( ?T1_decor) as ?aggregation_T1_decor_0 )) LIMIT 1"
    },
    {
        "kg_name": "inn_1",
        "question": "List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reservations . ?T1 :reservations\\#adults ?T1_adults . ?T1 :reservations\\#kids ?T1_kids . ?T2 a :rooms . ?T1 :reservations\\#ref-room ?T2 .  ?T2 :rooms\\#maxoccupancy ?T2_maxoccupancy . BIND(?T1_adults +?T1_kids as ?total) FILTER(?T2_maxoccupancy = ?total) . }"
    },
    {
        "kg_name": "party_host",
        "question": "List the names of hosts who did not serve as a host of any party in our record.",
        "query": "SELECT ?T1_name WHERE { ?T1 a :host . ?T1 :host\\#name ?T1_name . ?T1 :host\\#host_id ?T1_host_id .     FILTER NOT EXISTS { ?T22 a :party_host . ?T22 :party_host\\#host_id ?T22_host_id . FILTER(?T1_host_id = ?T22_host_id) . } }  "
    },
    {
        "kg_name": "storm_record",
        "question": "What are the names of storms that did not affect two or more regions?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :storm . ?T1 :storm\\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :storm . ?T3 a :affected_region . ?T3 :affected_region\\#ref-storm_id ?T2 .  ?T2 :storm\\#name ?T2_name .        } GROUP BY ?T2_name   HAVING(count( *)  >= 2) } }"
    },
    {
        "kg_name": "election",
        "question": "What is the zip code the county named 'Howard' is located in?",
        "query": "SELECT ?T1_zip_code WHERE { ?T1 a :county . ?T1 :county\\#zip_code ?T1_zip_code . ?T1 :county\\#county_name ?T1_county_name . FILTER(?T1_county_name = 'Howard') .        }"
    },
    {
        "kg_name": "election",
        "question": "In which distinct years was the governor 'Eliot Spitzer'?",
        "query": "SELECT DISTINCT ?T1_year WHERE { ?T1 a :party . ?T1 :party\\#year ?T1_year . ?T1 :party\\#governor ?T1_governor . FILTER(?T1_governor = 'Eliot Spitzer') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "What are the titles of papers published by 'Jeremy Gibbons'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\\#ref-authid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . FILTER(?T2_fname = 'Jeremy' && ?T2_lname = 'Gibbons') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "How many papers have 'Atsushi Ohori' published?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . FILTER(?T1_fname = 'Atsushi' && ?T1_lname = 'Ohori') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "How many papers are 'Atsushi Ohori' the author of?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . FILTER(?T1_fname = 'Atsushi' && ?T1_lname = 'Ohori') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "What is the name of the institution that 'Matthias Blume' belongs to?",
        "query": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :inst . ?T13 a :authorship . ?T13 :authorship\\#ref-instid ?T1 .  ?T1 :inst\\#name ?T1_name . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\\#ref-authid ?T2 .  ?T1 :inst\\#name ?T1_name . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . FILTER(?T2_fname = 'Matthias' && ?T2_lname = 'Blume') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "Which institution does 'Katsuhiro Ueno' belong to?",
        "query": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :inst . ?T13 a :authorship . ?T13 :authorship\\#ref-instid ?T1 .  ?T1 :inst\\#name ?T1_name . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\\#ref-authid ?T2 .  ?T1 :inst\\#name ?T1_name . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . FILTER(?T2_fname = 'Katsuhiro' && ?T2_lname = 'Ueno') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "Which papers were written by authors from the institution 'Google'?",
        "query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'Google') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "How many papers are published by the institution 'Tokohu University'?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_169 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . ?T2 a :inst . ?T13 :authorship\\#ref-instid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :inst\\#name ?T2_name . FILTER(?T2_name = 'Tokohu University') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "Which papers have 'Stephanie Weirich' as an author?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :authorship\\#ref-paperid ?T1 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . ?T2 a :authors . ?T13 :authorship\\#ref-authid ?T2 .  ?T1 :papers\\#title ?T1_title . ?T2 :authors\\#fname ?T2_fname . ?T2 :authors\\#lname ?T2_lname . FILTER(?T2_fname = 'Stephanie' && ?T2_lname = 'Weirich') .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "What is the last name of the author that has published the most papers?",
        "query": "SELECT ?T1_lname (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :authors\\#lname ?T1_lname .        } GROUP BY ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "icfp_1",
        "question": "Which paper's title contains the word 'Database'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :papers . ?T1 :papers\\#title ?T1_title . ?T1 :papers\\#title ?T1_title . FILTER(contains (?T1_title, 'Database')) .        }"
    },
    {
        "kg_name": "icfp_1",
        "question": "What is the first name of the author with last name 'Ueno'?",
        "query": "SELECT ?T1_fname WHERE { ?T1 a :authors . ?T1 :authors\\#fname ?T1_fname . ?T1 :authors\\#lname ?T1_lname . FILTER(?T1_lname = 'Ueno') .        }"
    },
    {
        "kg_name": "sakila_1",
        "question": "What is the most popular first name of the actors?",
        "query": "SELECT ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a :actor . ?T1 :actor\\#first_name ?T1_first_name .        } GROUP BY ?T1_first_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "sakila_1",
        "question": "What is the most popular full name of the actors?",
        "query": "SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name WHERE { ?T1 a :actor . ?T1 :actor\\#first_name ?T1_first_name . ?T1 :actor\\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name  ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "sakila_1",
        "question": "Which countries have at least 3 cities?",
        "query": "SELECT ?T1_country WHERE { ?T1 a :country . ?T2 a :city . ?T2 :city\\#ref-country_id ?T1 .  ?T1 :country\\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  >= 3)"
    },
    {
        "kg_name": "sakila_1",
        "question": "What are the countries that contain 3 or more cities?",
        "query": "SELECT ?T1_country WHERE { ?T1 a :country . ?T2 a :city . ?T2 :city\\#ref-country_id ?T1 .  ?T1 :country\\#country ?T1_country .        } GROUP BY ?T1_country   HAVING(count( *)  >= 3)"
    },
    {
        "kg_name": "sakila_1",
        "question": "What are the full names of actors who had roles in more than 30 films?",
        "query": "SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :actor . ?T2 a :film_actor . ?T2 :film_actor\\#ref-actor_id ?T1 .  ?T1 :actor\\#first_name ?T1_first_name . ?T1 :actor\\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 30)"
    },
    {
        "kg_name": "sakila_1",
        "question": "Which store owns most items?",
        "query": "SELECT ?T1_store_id (count( *) as ?aggregation_all) WHERE { ?T1 a :inventory . ?T1 :inventory\\#store_id ?T1_store_id .        } GROUP BY ?T1_store_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "sakila_1",
        "question": "What is the id of the store that has the most items in inventory?",
        "query": "SELECT ?T1_store_id (count( *) as ?aggregation_all) WHERE { ?T1 a :inventory . ?T1 :inventory\\#store_id ?T1_store_id .        } GROUP BY ?T1_store_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "sakila_1",
        "question": "Which store has most the customers?",
        "query": "SELECT ?T1_store_id (count( *) as ?aggregation_all) WHERE { ?T1 a :customer . ?T1 :customer\\#store_id ?T1_store_id .        } GROUP BY ?T1_store_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "loan_1",
        "question": "What are the names of customers who do not have saving accounts?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\\#cust_name ?T1_cust_name .   }}  MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T2 :customer\\#cust_name ?T2_cust_name . ?T2 :customer\\#acc_type ?T2_acc_type . FILTER(?T2_acc_type = 'saving') .        }     } }"
    },
    {
        "kg_name": "loan_1",
        "question": "What are the names of customers who have not taken a Mortage loan?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :customer\\#cust_name ?T1_cust_name .   }}  MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T3 a :loan . ?T3 :loan\\#ref-cust_id ?T2 .  ?T2 :customer\\#cust_name ?T2_cust_name . ?T3 :loan\\#loan_type ?T3_loan_type . FILTER(?T3_loan_type = 'Mortgages') .        }     } }"
    },
    {
        "kg_name": "loan_1",
        "question": "What is the name of the customer who has greatest total loan amount?",
        "query": "SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :loan\\#ref-cust_id ?T1 .  ?T1 :customer\\#cust_name ?T1_cust_name . ?T2 :loan\\#amount ?T2_amount .        } GROUP BY ?T1_cust_name  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_108 )) LIMIT 1"
    },
    {
        "kg_name": "loan_1",
        "question": "Which state has the greatest total number of bank customers?",
        "query": "SELECT ?T1_state WHERE { ?T1 a :bank . ?T1 :bank\\#state ?T1_state . ?T1 :bank\\#no_of_customers ?T1_no_of_customers .        } GROUP BY ?T1_state  ORDER BY DESC ((sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_8 )) LIMIT 1"
    },
    {
        "kg_name": "loan_1",
        "question": "What is the name of the bank branch that has lent the greatest amount?",
        "query": "SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :loan\\#ref-branch_id ?T1 .  ?T1 :bank\\#bname ?T1_bname . ?T2 :loan\\#amount ?T2_amount .        } GROUP BY ?T1_bname  ORDER BY DESC ((sum( ?T2_amount) as ?aggregation_T2_amount_149 )) LIMIT 1"
    },
    {
        "kg_name": "behavior_monitoring",
        "question": "What is the email of the student with first name 'Emma' and last name 'Rohan'?",
        "query": "SELECT ?T1_email_address WHERE { ?T1 a :students . ?T1 :students\\#email_address ?T1_email_address . ?T1 :students\\#first_name ?T1_first_name . ?T1 :students\\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Emma' && ?T1_last_name = 'Rohan') .        }"
    },
    {
        "kg_name": "behavior_monitoring",
        "question": "What is the gender of the teacher with last name 'Medhurst'?",
        "query": "SELECT ?T1_gender WHERE { ?T1 a :teachers . ?T1 :teachers\\#gender ?T1_gender . ?T1 :teachers\\#last_name ?T1_last_name . FILTER(?T1_last_name = 'Medhurst') .        }"
    }
]