[
    {
        "kg_name": "farm",
        "question": "What are the hosts of competitions whose theme is not 'Aliens'?",
        "query": "SELECT ?T1_hosts WHERE { ?T1 a :farm_competition . ?T1 :farm_competition\\#hosts ?T1_hosts . ?T1 :farm_competition\\#theme ?T1_theme . FILTER(?T1_theme != 'Aliens') .        }"
    },
    {
        "kg_name": "student_assessment",
        "question": "which course has most number of registered students?",
        "query": "SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\\#ref-course_id ?T1 .  ?T1 :courses\\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "student_assessment",
        "question": "What is the name of the course with the most registered students?",
        "query": "SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\\#ref-course_id ?T1 .  ?T1 :courses\\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "student_assessment",
        "question": "What is detail of the student who registered the most number of courses?",
        "query": "SELECT ?T1_student_details (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\\#ref-student_id ?T1 .  ?T1 :students\\#student_details ?T1_student_details .        } GROUP BY ?T1_student_details  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "student_assessment",
        "question": "Find id of candidates whose assessment code is 'Pass'?",
        "query": "SELECT ?T1_candidate_id WHERE { ?T1 a :candidate_assessments . ?T1 :candidate_assessments\\#candidate_id ?T1_candidate_id . ?T1 :candidate_assessments\\#asessment_outcome_code ?T1_asessment_outcome_code . FILTER(?T1_asessment_outcome_code = 'Pass') .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What are the dates with a maximum temperature higher than 85?",
        "query": "SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\\#date ?T1_date . ?T1 :weather\\#max_temperature_f ?T1_max_temperature_f . FILTER(?T1_max_temperature_f > 85) .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What are the names of stations that have latitude lower than 37.5?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :station . ?T1 :station\\#name ?T1_name . ?T1 :station\\#lat ?T1_lat . FILTER(?T1_lat < 37.5) .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What are the names of all stations with a latitude smaller than 37.5?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :station . ?T1 :station\\#name ?T1_name . ?T1 :station\\#lat ?T1_lat . FILTER(?T1_lat < 37.5) .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the average latitude and longitude in San Jose?",
        "query": "SELECT (avg( ?T1_lat) as ?aggregation_T1_lat_10 ) (avg( ?T1_long) as ?aggregation_T1_long_163 ) WHERE { ?T1 a :station . ?T1 :station\\#lat ?T1_lat . ?T1 :station\\#long ?T1_long . ?T1 :station\\#city ?T1_city . FILTER(?T1_city = 'San Jose') .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the id of the trip that has the shortest duration?",
        "query": "SELECT ?T1_id WHERE { ?T1 a :trip . ?T1 :trip\\#id ?T1_id . ?T1 :trip\\#duration ?T1_duration .        }   ORDER BY ASC (?T1_duration) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the id of the shortest trip?",
        "query": "SELECT ?T1_id WHERE { ?T1 a :trip . ?T1 :trip\\#id ?T1_id . ?T1 :trip\\#duration ?T1_duration .        }   ORDER BY ASC (?T1_duration) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the total and maximum duration of trips with bike id 636?",
        "query": "SELECT (sum( ?T1_duration) as ?aggregation_T1_duration_74 ) (max( ?T1_duration) as ?aggregation_T1_duration_0 ) WHERE { ?T1 a :trip . ?T1 :trip\\#duration ?T1_duration . ?T1 :trip\\#duration ?T1_duration . ?T1 :trip\\#bike_id ?T1_bike_id . FILTER(?T1_bike_id = 636) .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the total and maximum duration for all trips with the bike id 636?",
        "query": "SELECT (sum( ?T1_duration) as ?aggregation_T1_duration_140 ) (max( ?T1_duration) as ?aggregation_T1_duration_51 ) WHERE { ?T1 a :trip . ?T1 :trip\\#duration ?T1_duration . ?T1 :trip\\#duration ?T1_duration . ?T1 :trip\\#bike_id ?T1_bike_id . FILTER(?T1_bike_id = 636) .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "How many different bike ids are there?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_bike_id) as ?aggregation_T1_bike_id_11 ) WHERE { ?T1 a :trip . ?T1 :trip\\#bike_id ?T1_bike_id .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the number of distinct cities the stations are located at?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_21 ) WHERE { ?T1 a :station . ?T1 :station\\#city ?T1_city .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "How many different cities have these stations?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_188 ) WHERE { ?T1 a :station . ?T1 :station\\#city ?T1_city .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "How many stations does Mountain View city has?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\\#city ?T1_city . FILTER(?T1_city = 'Mountain View') .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "How many stations are in Mountain View?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\\#city ?T1_city . FILTER(?T1_city = 'Mountain View') .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "Which bike traveled the most often in zip code 94002?",
        "query": "SELECT ?T1_bike_id (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T1 :trip\\#bike_id ?T1_bike_id . ?T1 :trip\\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94002') .        } GROUP BY ?T1_bike_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the id of the bike that traveled the most in 94002?",
        "query": "SELECT ?T1_bike_id (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T1 :trip\\#bike_id ?T1_bike_id . ?T1 :trip\\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94002') .        } GROUP BY ?T1_bike_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "What are the 3 most common cloud covers in the zip code of 94107?",
        "query": "SELECT ?T1_cloud_cover (count( *) as ?aggregation_all) WHERE { ?T1 a :weather . ?T1 :weather\\#cloud_cover ?T1_cloud_cover . ?T1 :weather\\#zip_code ?T1_zip_code . FILTER(?T1_zip_code = '94107') .        } GROUP BY ?T1_cloud_cover  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the zip code that has the lowest average mean sea level pressure?",
        "query": "SELECT ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\\#zip_code ?T1_zip_code . ?T1 :weather\\#mean_sea_level_pressure_inches ?T1_mean_sea_level_pressure_inches .        } GROUP BY ?T1_zip_code  ORDER BY ASC ((avg( ?T1_mean_sea_level_pressure_inches) as ?aggregation_T1_mean_sea_level_pressure_inches_142 )) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the average bike availablility for stations not in Palo Alto?",
        "query": "SELECT (avg( ?T1_bikes_available) as ?aggregation_T1_bikes_available_192 ) WHERE { ?T1 a :status . ?T1 :status\\#bikes_available ?T1_bikes_available . ?T1 :status\\#station_id ?T1_station_id . FILTER(?T1_station_id not in (?T22_city)) .       {SELECT ?T22_id WHERE { ?T22 a :station . ?T22 :station\\#id ?T22_id . ?T22 :station\\#city ?T22_city . FILTER(?T22_city = 'Palo Alto') .        }    } }"
    },
    {
        "kg_name": "bike_1",
        "question": "When and in what zip code did max temperature reach 80?",
        "query": "SELECT ?T1_date ?T1_zip_code WHERE { ?T1 a :weather . ?T1 :weather\\#date ?T1_date . ?T1 :weather\\#zip_code ?T1_zip_code . ?T1 :weather\\#max_temperature_f ?T1_max_temperature_f . FILTER(?T1_max_temperature_f >= 80) .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What is the installation date for each ending station on all the trips?",
        "query": "SELECT ?T1_id ?T2_installation_date WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\\#ref-id ?T1 .  ?T1 :trip\\#id ?T1_id . ?T2 :station\\#installation_date ?T2_installation_date .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "How many trips did not end in San Francisco?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :trip . ?T2 a :station . ?T2 :station\\#ref-id ?T1 .  ?T2 :station\\#city ?T2_city . FILTER(?T2_city != 'San Francisco') .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "On which day has it neither been foggy nor rained in the zip code of 94107?",
        "query": "SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\\#date ?T1_date . ?T1 :weather\\#zip_code ?T1_zip_code . ?T1 :weather\\#events ?T1_events . ?T1 :weather\\#events ?T1_events . FILTER(?T1_zip_code = '94107' && ?T1_events != 'Fog' && ?T1_events != 'Rain') .        }"
    },
    {
        "kg_name": "bike_1",
        "question": "What are the ids and durations of the trips with the top 3 durations?",
        "query": "SELECT ?T1_id ?T1_duration WHERE { ?T1 a :trip . ?T1 :trip\\#id ?T1_id . ?T1 :trip\\#duration ?T1_duration . ?T1 :trip\\#duration ?T1_duration .        }   ORDER BY DESC (?T1_duration) LIMIT 1"
    },
    {
        "kg_name": "bike_1",
        "question": "For each station, find its latitude and the minimum duration of trips that ended at the station.",
        "query": "SELECT ?T1_name ?T1_lat (min( ?T2_duration) as ?aggregation_T2_duration_167 ) WHERE { ?T1 a :station . ?T2 a :trip . ?T1 :station\\#id ?id . ?T2 :trip\\#end_station_id ?id . ?T2 :trip\\#end_station_id ?T2_end_station_id . ?T1 :station\\#name ?T1_name . ?T1 :station\\#lat ?T1_lat . ?T2 :trip\\#duration ?T2_duration .        } GROUP BY ?T2_end_station_id ?T1_name ?T1_lat"
    },
    {
        "kg_name": "book_2",
        "question": "What are the titles of the books whose writer is not 'Elaine Lee'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :book . ?T1 :book\\#title ?T1_title . ?T1 :book\\#writer ?T1_writer . FILTER(?T1_writer != 'Elaine Lee') .        }"
    },
    {
        "kg_name": "musical",
        "question": "What are the names of musicals with nominee 'Bob Fosse'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :musical . ?T1 :musical\\#name ?T1_name . ?T1 :musical\\#nominee ?T1_nominee . FILTER(?T1_nominee = 'Bob Fosse') .        }"
    },
    {
        "kg_name": "product_catalog",
        "question": "What is the attribute data type of the attribute with name 'Green'?",
        "query": "SELECT ?T1_attribute_data_type WHERE { ?T1 a :attribute_definitions . ?T1 :attribute_definitions\\#attribute_data_type ?T1_attribute_data_type . ?T1 :attribute_definitions\\#attribute_name ?T1_attribute_name . FILTER(?T1_attribute_name = 'Green') .        }"
    },
    {
        "kg_name": "product_catalog",
        "question": "Which catalog publishers have substring 'Murray' in their names?",
        "query": "SELECT DISTINCT ?T1_catalog_publisher WHERE { ?T1 a :catalogs . ?T1 :catalogs\\#catalog_publisher ?T1_catalog_publisher . ?T1 :catalogs\\#catalog_publisher ?T1_catalog_publisher . FILTER(contains (?T1_catalog_publisher, 'Murray')) .        }"
    },
    {
        "kg_name": "allergy_1",
        "question": "Which city does the student whose last name is 'Kim' live in?",
        "query": "SELECT ?T1_city_code WHERE { ?T1 a :student . ?T1 :student\\#city_code ?T1_city_code . ?T1 :student\\#lname ?T1_lname . FILTER(?T1_lname = 'Kim') .        }"
    },
    {
        "kg_name": "store_1",
        "question": "How many tracks does each genre have and what are the names of the top 5?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :genres . ?T2 a :tracks . ?T2 :tracks\\#ref-genre_id ?T1 .  ?T1 :genres\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "store_1",
        "question": "What is the full name of the employee who has the most customers?",
        "query": "SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name WHERE { ?T1 a :employees . ?T2 a :customers . ?T2 :customers\\#ref-support_rep_id ?T1 .  ?T1 :employees\\#first_name ?T1_first_name . ?T1 :employees\\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "store_1",
        "question": "What is the composer who created the track 'Fast As a Shark'?",
        "query": "SELECT ?T1_composer WHERE { ?T1 a :tracks . ?T1 :tracks\\#composer ?T1_composer . ?T1 :tracks\\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }"
    },
    {
        "kg_name": "store_1",
        "question": "What are the names of the albums that have more than 10 tracks?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\\#title ?T1_title . ?T1 :albums\\#id ?T1_id .        } GROUP BY ?T1_title   HAVING(count( ?T1_id) as ?aggregation_T1_id_137 ) > 10)"
    },
    {
        "kg_name": "store_1",
        "question": "What are the names of all playlists that have more than 100 tracks?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :playlists . ?T2 a :playlist_tracks . ?T2 :playlist_tracks\\#ref-playlist_id ?T1 .  ?T1 :playlists\\#name ?T1_name . ?T2 :playlist_tracks\\#track_id ?T2_track_id .        } GROUP BY ?T1_name   HAVING(count( ?T2_track_id) as ?aggregation_T2_track_id_30 ) > 100)"
    },
    {
        "kg_name": "store_1",
        "question": "What are the tracks that Dean Peeters bought?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :tracks . ?T13 a :invoice_lines . ?T13 :invoice_lines\\#ref-track_id ?T1 .  ?T1 :tracks\\#name ?T1_name . ?T2 :customers\\#first_name ?T2_first_name . ?T2 :customers\\#last_name ?T2_last_name . ?T14 a :invoices . ?T13 :invoice_lines\\#ref-invoice_id ?T14 .  ?T1 :tracks\\#name ?T1_name . ?T2 :customers\\#first_name ?T2_first_name . ?T2 :customers\\#last_name ?T2_last_name . ?T2 a :customers . ?T14 :invoices\\#ref-customer_id ?T2 .  ?T1 :tracks\\#name ?T1_name . ?T2 :customers\\#first_name ?T2_first_name . ?T2 :customers\\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Daan' && ?T2_last_name = 'Peeters') .        }"
    },
    {
        "kg_name": "store_1",
        "question": "What is the unit price of the tune 'Fast As a Shark'?",
        "query": "SELECT ?T1_unit_price WHERE { ?T1 a :tracks . ?T1 :tracks\\#unit_price ?T1_unit_price . ?T1 :tracks\\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }"
    },
    {
        "kg_name": "customers_card_transactions",
        "question": "What are the full names of customers who do not have any accounts?",
        "query": "SELECT distinct?col1?col2 WHERE { { SELECT (?T1_customer_first_name as ?col1) (?T1_customer_last_name as ?col2) WHERE { ?T1 a :customers . ?T1 :customers\\#customer_first_name ?T1_customer_first_name . ?T1 :customers\\#customer_last_name ?T1_customer_last_name .   }}  MINUS {SELECT (?T2_customer_first_name as ?col1) (?T2_customer_last_name as ?col2) WHERE { ?T2 a :customers . ?T2 :customers\\#customer_first_name ?T2_customer_first_name . ?T2 :customers\\#customer_last_name ?T2_customer_last_name .        }     } }"
    },
    {
        "kg_name": "customers_card_transactions",
        "question": "What are the ids and full names of customers who hold two or more cards?",
        "query": "SELECT ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name WHERE { ?T1 a :customers_cards . ?T13 a :financial_transactions . ?T13 :financial_transactions\\#ref-card_id ?T1 .  ?T1 :customers_cards\\#customer_id ?T1_customer_id . ?T2 :customers\\#customer_first_name ?T2_customer_first_name . ?T2 :customers\\#customer_last_name ?T2_customer_last_name . ?T14 a :accounts . ?T13 :financial_transactions\\#ref-account_id ?T14 .  ?T1 :customers_cards\\#customer_id ?T1_customer_id . ?T2 :customers\\#customer_first_name ?T2_customer_first_name . ?T2 :customers\\#customer_last_name ?T2_customer_last_name . ?T2 a :customers . ?T14 :accounts\\#ref-customer_id ?T2 .  ?T1 :customers_cards\\#customer_id ?T1_customer_id . ?T2 :customers\\#customer_first_name ?T2_customer_first_name . ?T2 :customers\\#customer_last_name ?T2_customer_last_name .        } GROUP BY ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name   HAVING(count( *)  >= 2)"
    },
    {
        "kg_name": "chinook_1",
        "question": "What are the titles of albums by the artist 'AC/DC'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :album . ?T2 a :artist . ?T1 :album\\#ref-artistid ?T2 .  ?T1 :album\\#title ?T1_title . ?T2 :artist\\#name ?T2_name . FILTER(?T2_name = 'AC/DC') .        }"
    },
    {
        "kg_name": "chinook_1",
        "question": "Hom many albums does the artist 'Metallica' have?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :album . ?T2 a :artist . ?T1 :album\\#ref-artistid ?T2 .  ?T2 :artist\\#name ?T2_name . FILTER(?T2_name = 'Metallica') .        }"
    },
    {
        "kg_name": "chinook_1",
        "question": "Which artist does the album 'Balls to the Wall' belong to?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\\#ref-artistid ?T1 .  ?T1 :artist\\#name ?T1_name . ?T2 :album\\#title ?T2_title . FILTER(?T2_title = 'Balls to the Wall') .        }"
    },
    {
        "kg_name": "chinook_1",
        "question": "Which artist has the most albums?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\\#ref-artistid ?T1 .  ?T1 :artist\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "chinook_1",
        "question": "What is the name of the artist with the greatest number of albums?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :album . ?T2 :album\\#ref-artistid ?T1 .  ?T1 :artist\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "chinook_1",
        "question": "What is the name of the most common genre in all tracks?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :genre . ?T2 a :track . ?T2 :track\\#ref-genreid ?T1 .  ?T1 :genre\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "chinook_1",
        "question": "What is the least common media type in all tracks?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :mediatype . ?T2 a :track . ?T2 :track\\#ref-mediatypeid ?T1 .  ?T1 :mediatype\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "chinook_1",
        "question": "What is the name of the media type that is least common across all tracks?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :mediatype . ?T2 a :track . ?T2 :track\\#ref-mediatypeid ?T1 .  ?T1 :mediatype\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "chinook_1",
        "question": "How many customers have email that contains 'gmail.com'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customer . ?T1 :customer\\#email ?T1_email . FILTER(contains (?T1_email, 'gmail.com')) .        }"
    },
    {
        "kg_name": "chinook_1",
        "question": "What are the last names of employees who serve at most 20 customers?",
        "query": "SELECT ?T1_lastname WHERE { ?T1 a :customer . ?T2 a :employee . ?T1 :customer\\#ref-supportrepid ?T2 .  ?T1 :customer\\#lastname ?T1_lastname .        } GROUP BY ?T1_lastname   HAVING(count( *)  <= 20)"
    },
    {
        "kg_name": "chinook_1",
        "question": "Find the names of artists that do not have any albums.",
        "query": "SELECT distinct ?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist\\#name ?T1_name . }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T2 a :album . ?T3 a :artist . ?T3 :artist\\#name ?T3_name . ?T2 :album\\#ref-artistid ?T3 . } } }"
    },
    {
        "kg_name": "insurance_fnol",
        "question": "What are the customer phone numbers under the policy 'Life Insurance'?",
        "query": "SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :available_policies\\#customer_phone ?T1_customer_phone . ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . FILTER(?T1_policy_type_code = 'Life Insurance') .        }"
    },
    {
        "kg_name": "insurance_fnol",
        "question": "How many policies are listed for the customer named 'Dayana Robel'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :customers_policies\\#ref-customer_id ?T2 .  ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') .        }"
    },
    {
        "kg_name": "insurance_fnol",
        "question": "What are all the policy types of the customer named 'Dayana Robel'?",
        "query": "SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :customers_policies\\#ref-policy_id ?T1 .  ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customers_policies\\#ref-customer_id ?T2 .  ?T1 :available_policies\\#policy_type_code ?T1_policy_type_code . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') .        }"
    },
    {
        "kg_name": "insurance_fnol",
        "question": "What are the IDs of customers who have 'Diana' in part of their names?",
        "query": "SELECT ?T1_customer_id WHERE { ?T1 a :customers . ?T1 :customers\\#customer_id ?T1_customer_id . ?T1 :customers\\#customer_name ?T1_customer_name . FILTER(contains (?T1_customer_name, 'Diana')) .        }"
    },
    {
        "kg_name": "medicine_enzyme_interaction",
        "question": "Which enzyme names have the substring 'ALA'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\\#name ?T1_name . ?T1 :enzyme\\#name ?T1_name . FILTER(contains (?T1_name, 'ALA')) .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "List all schools and their nicknames in the order of founded year.",
        "query": "SELECT ?T1_school ?T1_nickname WHERE { ?T1 a :university . ?T1 :university\\#school ?T1_school . ?T1 :university\\#nickname ?T1_nickname . ?T1 :university\\#founded ?T1_founded .        }  ORDER BY ASC (?T1_founded)"
    },
    {
        "kg_name": "university_basketball",
        "question": "List all public schools and their locations.",
        "query": "SELECT ?T1_school ?T1_location WHERE { ?T1 a :university . ?T1 :university\\#school ?T1_school . ?T1 :university\\#location ?T1_location . ?T1 :university\\#affiliation ?T1_affiliation . FILTER(?T1_affiliation = 'Public') .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the founded year for the school with the largest enrollment.",
        "query": "SELECT ?T1_founded WHERE { ?T1 a :university . ?T1 :university\\#founded ?T1_founded . ?T1 :university\\#enrollment ?T1_enrollment .        }   ORDER BY DESC (?T1_enrollment) LIMIT 1"
    },
    {
        "kg_name": "university_basketball",
        "question": "Find the founded year of the newest non public school.",
        "query": "SELECT ?T1_founded WHERE { ?T1 a :university . ?T1 :university\\#founded ?T1_founded . ?T1 :university\\#founded ?T1_founded . ?T1 :university\\#affiliation ?T1_affiliation . FILTER(?T1_affiliation != 'Public') .        }   ORDER BY DESC (?T1_founded) LIMIT 1"
    },
    {
        "kg_name": "university_basketball",
        "question": "Count the number of schools that have had basketball matches.",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_school_id) as ?aggregation_T1_school_id_1 ) WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\\#school_id ?T1_school_id .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the highest acc percent across all basketball matches.",
        "query": "SELECT ?T1_acc_percent WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\\#acc_percent ?T1_acc_percent . ?T1 :basketball_match\\#acc_percent ?T1_acc_percent .        }   ORDER BY DESC (?T1_acc_percent) LIMIT 1"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the primary conference of the school with the lowest acc percentage score.",
        "query": "SELECT ?T1_primary_conference WHERE { ?T1 a :university . ?T2 a :basketball_match . ?T2 :basketball_match\\#ref-school_id ?T1 .  ?T1 :university\\#primary_conference ?T1_primary_conference . ?T2 :basketball_match\\#acc_percent ?T2_acc_percent .        }   ORDER BY ASC (?T2_acc_percent) LIMIT 1"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the name of the team and the acc during the regular season for the school that was founded the earliest.",
        "query": "SELECT ?T1_team_name ?T1_acc_regular_season WHERE { ?T1 a :basketball_match . ?T2 a :university . ?T1 :basketball_match\\#ref-school_id ?T2 .  ?T1 :basketball_match\\#team_name ?T1_team_name . ?T1 :basketball_match\\#acc_regular_season ?T1_acc_regular_season . ?T2 :university\\#founded ?T2_founded .        }   ORDER BY ASC (?T2_founded) LIMIT 1"
    },
    {
        "kg_name": "university_basketball",
        "question": "Find the location and all games score of the school that has Clemson as its team name.",
        "query": "SELECT ?T1_all_games ?T2_location WHERE { ?T1 a :basketball_match . ?T2 a :university . ?T1 :basketball_match\\#ref-school_id ?T2 .  ?T1 :basketball_match\\#all_games ?T1_all_games . ?T2 :university\\#location ?T2_location . ?T1 :basketball_match\\#team_name ?T1_team_name . FILTER(?T1_team_name = 'Clemson') .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the average enrollment of universities founded before 1850.",
        "query": "SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_72 ) WHERE { ?T1 a :university . ?T1 :university\\#enrollment ?T1_enrollment . ?T1 :university\\#founded ?T1_founded . FILTER(?T1_founded < 1850) .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Show the enrollment and primary_conference of the oldest college.",
        "query": "SELECT ?T1_enrollment ?T1_primary_conference WHERE { ?T1 a :university . ?T1 :university\\#enrollment ?T1_enrollment . ?T1 :university\\#primary_conference ?T1_primary_conference . ?T1 :university\\#founded ?T1_founded .        }   ORDER BY ASC (?T1_founded) LIMIT 1"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the total and minimum enrollments across all schools.",
        "query": "SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_151 ) (min( ?T1_enrollment) as ?aggregation_T1_enrollment_49 ) WHERE { ?T1 a :university . ?T1 :university\\#enrollment ?T1_enrollment . ?T1 :university\\#enrollment ?T1_enrollment .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Find the total student enrollment for different affiliation type schools.",
        "query": "SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_8 ) ?T1_affiliation WHERE { ?T1 a :university . ?T1 :university\\#enrollment ?T1_enrollment . ?T1 :university\\#affiliation ?T1_affiliation .        } GROUP BY ?T1_affiliation"
    },
    {
        "kg_name": "university_basketball",
        "question": "Find the schools that were either founded after 1850 or public.",
        "query": "SELECT ?T1_school WHERE { ?T1 a :university . ?T1 :university\\#school ?T1_school . ?T1 :university\\#founded ?T1_founded . ?T1 :university\\#affiliation ?T1_affiliation . FILTER(?T1_founded > 1850 || ?T1_affiliation = 'Public') .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Find how many different affiliation types there are.",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_affiliation) as ?aggregation_T1_affiliation_176 ) WHERE { ?T1 a :university . ?T1 :university\\#affiliation ?T1_affiliation .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Count the number of different affiliation types.",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_affiliation) as ?aggregation_T1_affiliation_30 ) WHERE { ?T1 a :university . ?T1 :university\\#affiliation ?T1_affiliation .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "Find the number of universities that have over a 20000 enrollment size for each affiliation type.",
        "query": "SELECT (count( *) as ?aggregation_all) ?T1_affiliation WHERE { ?T1 a :university . ?T1 :university\\#affiliation ?T1_affiliation . ?T1 :university\\#enrollment ?T1_enrollment . FILTER(?T1_enrollment > 20000) .        } GROUP BY ?T1_affiliation"
    },
    {
        "kg_name": "university_basketball",
        "question": "Return the maximum enrollment across all schools.",
        "query": "SELECT (max( ?T1_enrollment) as ?aggregation_T1_enrollment_104 ) WHERE { ?T1 a :university . ?T1 :university\\#enrollment ?T1_enrollment .        }"
    },
    {
        "kg_name": "university_basketball",
        "question": "List all information regarding the basketball match.",
        "query": "SELECT * WHERE { ?T1 a :basketball_match .        }"
    },
    {
        "kg_name": "election_representative",
        "question": "What are the names of representatives whose party is not 'Republican'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :representative . ?T1 :representative\\#name ?T1_name . ?T1 :representative\\#party ?T1_party . FILTER(?T1_party != 'Republican') .        }"
    },
    {
        "kg_name": "apartment_rentals",
        "question": "What are the building full names that contain the word 'court'?",
        "query": "SELECT ?T1_building_full_name WHERE { ?T1 a :apartment_buildings . ?T1 :apartment_buildings\\#building_full_name ?T1_building_full_name . ?T1 :apartment_buildings\\#building_full_name ?T1_building_full_name . FILTER(contains (?T1_building_full_name, 'court')) .        }"
    },
    {
        "kg_name": "apartment_rentals",
        "question": "What is the average number of rooms of apartments with type code 'Studio'?",
        "query": "SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_168 ) WHERE { ?T1 a :apartments . ?T1 :apartments\\#room_count ?T1_room_count . ?T1 :apartments\\#apt_type_code ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Studio') .        }"
    }
]