kg_name,question,query
scholar,What are recent papers on deep learning ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
scholar,What years did Pedro Domingos publish papers in ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Pedro Domingos') .        }
scholar,In what years did Pedro Domingos publish a paper ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Pedro Domingos') .        }
scholar,jamie callan 's publications by year,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'jamie callan') .        }  ORDER BY ASC (?T1_year)
scholar,How many papers does jamie callan publish each year ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_72 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'jamie callan') .        } GROUP BY ?T1_year
scholar,number of papers by year from jamie callan,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_172 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'jamie callan') .        } GROUP BY ?T1_year
scholar,how many papers jamie callan published each year ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_37 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'jamie callan') .        } GROUP BY ?T1_year
scholar,What papers cite Daniel Jurafsky ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniel Jurafsky') .        }
scholar,Which papers cite Daniel Jurafsky ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniel Jurafsky') .        }
scholar,journal papers for instance segmentation,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#journalid ?T1_journalid . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#journalid ?T1_journalid . FILTER(?T2_keyphrasename = 'instance segmentation' && ?T1_journalid >= 0) .        }
scholar,who has the most papers in semantic parsing after 2005 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_1 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T3_keyphrasename = 'semantic parsing' && ?T1_year > 2005) .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_169 ))
scholar,who has written the most papers on semantic parsing since 2005 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_60 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T3_keyphrasename = 'semantic parsing' && ?T1_year > 2005) .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_60 ))
scholar,who published the most in semantic parsing after 2005 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_185 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T3_keyphrasename = 'semantic parsing' && ?T1_year > 2005) .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_124 ))
scholar,How many citations does Dan Makumbi 's Genetic Identity paper have ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_5 ) WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\#ref-citedpaperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T16 a :paperkeyphrase . ?T16 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T16 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Dan Makumbi' && ?T3_keyphrasename = 'Genetic Identity') .        }
scholar,what topics does oren etzioni write about most ?,SELECT DISTINCT (count(DISTINCT ?T1_keyphraseid) as ?aggregation_T1_keyphraseid_72 ) ?T1_keyphraseid WHERE { ?T1 a :paperkeyphrase . ?T13 a :paper . ?T1 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'oren etzioni') .        } GROUP BY ?T1_keyphraseid ORDER BY DESC ((count( ?T1_keyphraseid) as ?aggregation_T1_keyphraseid_61 ))
scholar,How many papers related to deep learning cited the dataset ImageNet ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_176 ) WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_datasetname = 'ImageNet' && ?T3_keyphrasename = 'deep learning') .        }
scholar,most cited papers on parsing,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_9 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_170 ))
scholar,parsing top papers,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_36 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_9 ))
scholar,List top papers for parsing,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_196 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_12 ))
scholar,parsing papers that have the most citations,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_141 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_9 ))
scholar,What is the paper about parsing of the most citation ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_156 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_192 ))
scholar,Paper on parsing with most citations,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_119 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_116 ))
scholar,parsing papers with most citations,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_190 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_158 ))
scholar,most cited parsing papers,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_130 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_83 ))
scholar,what are the parsing papers that have the most citations ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_98 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_63 ))
scholar,highly cited parsing papers,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_143 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_76 ))
scholar,most cited papers for parsing,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_62 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_98 ))
scholar,Most cited papers on parsing,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_161 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_101 ))
scholar,What paper did Michael Armstrong write in the 90s ?,"SELECT DISTINCT ?T1_year ?T2_paperid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :writes\#paperid ?T2_paperid . ?T3 :author\#authorname ?T3_authorname . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T3 a :author . ?T2 :writes\#ref-aid ?T3 .  ?T1 :paper\#year ?T1_year . ?T2 :writes\#paperid ?T2_paperid . ?T3 :author\#authorname ?T3_authorname . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . FILTER(contains (?T3_authorname, 'Michael Armstrong') && ?T1_year >= 1990 && ?T1_year <= 1999) .        }"
scholar,What is the most cited paper by ohad shamir ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_16 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ohad shamir') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_40 ))
scholar,What is the highest cited paper by ohad shamir ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_46 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ohad shamir') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_98 ))
scholar,What is the most cited paper of ohad shamir ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_3 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ohad shamir') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_92 ))
scholar,What is ohad shamir 's highest cited paper ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_173 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ohad shamir') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_149 ))
scholar,What paper by ohad shamir has the most citation ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_114 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ohad shamir') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_59 ))
scholar,what is ohad shamir 's most cited paper ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_164 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ohad shamir') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_65 ))
scholar,How many papers did michael i. jordan publish in 2016 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_14 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T3 a :paper . ?T1 :writes\#ref-paperid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . FILTER(?T2_authorname = 'michael i. jordan' && ?T3_year = 2016) .        }
scholar,How many papers does michael i. jordan have in 2016 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_181 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T3 a :paper . ?T1 :writes\#ref-paperid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . FILTER(?T2_authorname = 'michael i. jordan' && ?T3_year = 2016) .        }
scholar,How many papers did michael i. jordan publish in 2016,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_153 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T3 a :paper . ?T1 :writes\#ref-paperid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . FILTER(?T2_authorname = 'michael i. jordan' && ?T3_year = 2016) .        }
