kg_name,question,query
cinema,What is the location with the most cinemas opened in year 2010 or later?,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#openning_year ?T1_openning_year . FILTER(?T1_openning_year >= 2010) .        } GROUP BY ?T1_location  ORDER BY DESC (?aggregation_all) LIMIT 1
cinema,Show all the locations with at least two cinemas with capacity above 300.,SELECT ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#capacity ?T1_capacity . FILTER(?T1_capacity > 300) .        } GROUP BY ?T1_location   HAVING(count( *)  >= 2)
cinema,Which locations have 2 or more cinemas with capacity over 300?,SELECT ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#capacity ?T1_capacity . FILTER(?T1_capacity > 300) .        } GROUP BY ?T1_location   HAVING(count( *)  >= 2)
cinema,Show the title and director for all films.,SELECT ?T1_title ?T1_directed_by WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#directed_by ?T1_directed_by .        }
cinema,What are the title and director of each film?,SELECT ?T1_title ?T1_directed_by WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#directed_by ?T1_directed_by .        }
cinema,Show all directors.,SELECT DISTINCT ?T1_directed_by WHERE { ?T1 a :film . ?T1 :film\#directed_by ?T1_directed_by .        }
cinema,Who are all the directors?,SELECT DISTINCT ?T1_directed_by WHERE { ?T1 a :film . ?T1 :film\#directed_by ?T1_directed_by .        }
cinema,List all directors along with the number of films directed by each director.,SELECT ?T1_directed_by (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\#directed_by ?T1_directed_by .        } GROUP BY ?T1_directed_by
cinema,What is total number of show times per dat for each cinema?,SELECT ?T1_name (sum( ?T2_show_times_per_day) as ?aggregation_T2_show_times_per_day_3 ) WHERE { ?T1 a :cinema . ?T2 a :schedule . ?T2 :schedule\#ref-cinema_id ?T1 .  ?T1 :cinema\#name ?T1_name . ?T2 :schedule\#show_times_per_day ?T2_show_times_per_day .        } GROUP BY ?T1_name
cinema,What are the title and maximum price of each film?,SELECT ?T1_title (max( ?T2_price) as ?aggregation_T2_price_20 ) WHERE { ?T1 a :film . ?T2 a :schedule . ?T2 :schedule\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T2 :schedule\#price ?T2_price .        } GROUP BY ?T1_title
cinema,Give me the title and highest price for each film.,SELECT ?T1_title (max( ?T2_price) as ?aggregation_T2_price_122 ) WHERE { ?T1 a :film . ?T2 a :schedule . ?T2 :schedule\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T2 :schedule\#price ?T2_price .        } GROUP BY ?T1_title
cinema,"Show cinema name, film title, date, and price for each record in schedule.",SELECT ?T1_name ?T2_title ?T3_date ?T3_price WHERE { ?T1 a :cinema . ?T3 a :schedule . ?T3 :schedule\#ref-cinema_id ?T1 .  ?T1 :cinema\#name ?T1_name . ?T2 :film\#title ?T2_title . ?T3 :schedule\#date ?T3_date . ?T3 :schedule\#price ?T3_price . ?T2 a :film . ?T3 :schedule\#ref-film_id ?T2 .  ?T1 :cinema\#name ?T1_name . ?T2 :film\#title ?T2_title . ?T3 :schedule\#date ?T3_date . ?T3 :schedule\#price ?T3_price .        }
cinema,What are the title and director of the films without any schedule?,SELECT ?T1_title ?T1_directed_by WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#directed_by ?T1_directed_by . ?T1 :film\#film_id ?T1_film_id . FILTER(?T1_film_id not in (?T22_film_id)) .       {SELECT ?T22_film_id WHERE { ?T22 a :schedule . ?T22 :schedule\#film_id ?T22_film_id .        }    } }
cinema,Show director with the largest number of show times in total.,SELECT ?T1_directed_by WHERE { ?T1 a :film . ?T2 a :schedule . ?T2 :schedule\#ref-film_id ?T1 .  ?T1 :film\#directed_by ?T1_directed_by . ?T2 :schedule\#show_times_per_day ?T2_show_times_per_day .        } GROUP BY ?T1_directed_by  ORDER BY DESC ((sum( ?T2_show_times_per_day) as ?aggregation_T2_show_times_per_day_103 )) LIMIT 1
cinema,Find the locations that have more than one movie theater with capacity above 300.,SELECT ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#capacity ?T1_capacity . FILTER(?T1_capacity > 300) .        } GROUP BY ?T1_location   HAVING(count( *)  > 1)
cinema,How many films have the word 'Dummy' in their titles?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . FILTER(contains (?T1_title, 'Dummy')) .        }"
products_for_hire,Are the customers holding coupons with amount 500 bad or good?,SELECT ?T1_good_or_bad_customer WHERE { ?T1 a :customers . ?T2 a :discount_coupons . ?T1 :customers\#ref-coupon_id ?T2 .  ?T1 :customers\#good_or_bad_customer ?T1_good_or_bad_customer . ?T2 :discount_coupons\#coupon_amount ?T2_coupon_amount . FILTER(?T2_coupon_amount = 500) .        }
products_for_hire,"How many bookings did each customer make? List the customer id, first name, and the count.",SELECT ?T1_customer_id ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :bookings . ?T2 :bookings\#ref-customer_id ?T1 .  ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#first_name ?T1_first_name .        } GROUP BY ?T1_customer_id ?T1_first_name
products_for_hire,What is the maximum total amount paid by a customer? List the customer id and amount.,SELECT ?T1_customer_id (sum( ?T1_amount_paid) as ?aggregation_T1_amount_paid_90 ) WHERE { ?T1 a :payments . ?T1 :payments\#customer_id ?T1_customer_id . ?T1 :payments\#amount_paid ?T1_amount_paid . ?T1 :payments\#amount_paid ?T1_amount_paid .        } GROUP BY ?T1_customer_id  ORDER BY DESC ((sum( ?T1_amount_paid) as ?aggregation_T1_amount_paid_118 )) LIMIT 1
products_for_hire,What are the id and the amount of refund of the booking that incurred the most times of payments?,SELECT ?T1_booking_id (count( *) as ?aggregation_all) ?T1_amount_of_refund WHERE { ?T1 a :bookings . ?T2 a :payments . ?T2 :payments\#ref-booking_id ?T1 .  ?T1 :bookings\#booking_id ?T1_booking_id . ?T1 :bookings\#amount_of_refund ?T1_amount_of_refund .        } GROUP BY ?T1_booking_id ?T1_amount_of_refund  ORDER BY DESC (?aggregation_all) LIMIT 1
products_for_hire,What is the id of the product that is booked for 3 times?,SELECT ?T1_product_id WHERE { ?T1 a :products_booked . ?T1 :products_booked\#product_id ?T1_product_id .        } GROUP BY ?T1_product_id   HAVING(count( *)  = 3)
products_for_hire,What are the names of products whose availability equals to 1?,SELECT ?T1_product_name WHERE { ?T1 a :products_for_hire . ?T2 a :view_product_availability . ?T2 :view_product_availability\#ref-product_id ?T1 .  ?T1 :products_for_hire\#product_name ?T1_product_name . ?T2 :view_product_availability\#available_yn ?T2_available_yn . FILTER(?T2_available_yn = 1) .        }
products_for_hire,How many different product types are there?,SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_148 ) WHERE { ?T1 a :products_for_hire . ?T1 :products_for_hire\#product_type_code ?T1_product_type_code .        }
products_for_hire,"What are the first name, last name, and gender of all the good customers? Order by their last name.",SELECT ?T1_first_name ?T1_last_name ?T1_gender_mf WHERE { ?T1 a :customers . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T1 :customers\#gender_mf ?T1_gender_mf . ?T1 :customers\#last_name ?T1_last_name . ?T1 :customers\#good_or_bad_customer ?T1_good_or_bad_customer . FILTER(?T1_good_or_bad_customer = 'good') .        }  ORDER BY ASC (?T1_last_name)
products_for_hire,What is the average amount due for all the payments?,SELECT (avg( ?T1_amount_due) as ?aggregation_T1_amount_due_176 ) WHERE { ?T1 a :payments . ?T1 :payments\#amount_due ?T1_amount_due .        }
products_for_hire,What are all the distinct payment types?,SELECT DISTINCT ?T1_payment_type_code WHERE { ?T1 a :payments . ?T1 :payments\#payment_type_code ?T1_payment_type_code .        }
products_for_hire,How many products are never booked with amount higher than 200?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products_for_hire . ?T1 :products_for_hire\#product_id ?T1_product_id . FILTER(?T1_product_id not in (?T22_booked_amount)) .       {SELECT ?T22_product_id WHERE { ?T22 a :products_booked . ?T22 :products_booked\#product_id ?T22_product_id . ?T22 :products_booked\#booked_amount ?T22_booked_amount . FILTER(?T22_booked_amount > 200) .        }    } }
products_for_hire,What are the payment date of the payment with amount paid higher than 300 or with payment type is 'Check',SELECT ?T1_payment_date WHERE { ?T1 a :payments . ?T1 :payments\#payment_date ?T1_payment_date . ?T1 :payments\#amount_paid ?T1_amount_paid . ?T1 :payments\#payment_type_code ?T1_payment_type_code . FILTER(?T1_amount_paid > 300 || ?T1_payment_type_code = 'Check') .        }
phone_market,How many phones are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :phone .        }
phone_market,List the names of phones in ascending order of price.,SELECT ?T1_name WHERE { ?T1 a :phone . ?T1 :phone\#name ?T1_name . ?T1 :phone\#price ?T1_price .        }  ORDER BY ASC (?T1_price)
phone_market,What are the memories and carriers of phones?,SELECT ?T1_memory_in_g ?T1_carrier WHERE { ?T1 a :phone . ?T1 :phone\#memory_in_g ?T1_memory_in_g . ?T1 :phone\#carrier ?T1_carrier .        }
phone_market,List the distinct carriers of phones with memories bigger than 32.,SELECT DISTINCT ?T1_carrier WHERE { ?T1 a :phone . ?T1 :phone\#carrier ?T1_carrier . ?T1 :phone\#memory_in_g ?T1_memory_in_g . FILTER(?T1_memory_in_g > 32) .        }
phone_market,Show the names of phones with carrier either 'Sprint' or 'TMobile'.,SELECT ?T1_name WHERE { ?T1 a :phone . ?T1 :phone\#name ?T1_name . ?T1 :phone\#carrier ?T1_carrier . ?T1 :phone\#carrier ?T1_carrier . FILTER(?T1_carrier = 'Sprint' || ?T1_carrier = 'TMobile') .        }
phone_market,What is the carrier of the most expensive phone?,SELECT ?T1_carrier WHERE { ?T1 a :phone . ?T1 :phone\#carrier ?T1_carrier . ?T1 :phone\#price ?T1_price .        }   ORDER BY DESC (?T1_price) LIMIT 1
phone_market,Show different carriers of phones together with the number of phones with each carrier.,SELECT ?T1_carrier (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :phone\#carrier ?T1_carrier .        } GROUP BY ?T1_carrier
phone_market,Show the most frequently used carrier of the phones.,SELECT ?T1_carrier (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :phone\#carrier ?T1_carrier .        } GROUP BY ?T1_carrier  ORDER BY DESC (?aggregation_all) LIMIT 1
phone_market,Show the carriers that have both phones with memory smaller than 32 and phones with memory bigger than 64.,SELECT DISTINCT ?T1_carrier WHERE { ?T1 a :phone . ?T1 :phone\#carrier ?T1_carrier . ?T1 :phone\#memory_in_g ?T1_memory_in_g . FILTER(?T1_memory_in_g < 32) . FILTER (?T1_carrier in (?T2_carrier)) .   ?T2 a :phone . ?T2 :phone\#carrier ?T2_carrier . ?T2 :phone\#memory_in_g ?T2_memory_in_g .  FILTER(?T2_memory_in_g > 64) .             }
phone_market,Show the names of phones and the districts of markets they are on.,SELECT ?T1_name ?T2_district WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :phone_market\#ref-phone_id ?T1 .  ?T1 :phone\#name ?T1_name . ?T2 :market\#district ?T2_district . ?T2 a :market . ?T13 :phone_market\#ref-market_id ?T2 .  ?T1 :phone\#name ?T1_name . ?T2 :market\#district ?T2_district .        }
phone_market,"Show the names of phones and the districts of markets they are on, in ascending order of the ranking of the market.",SELECT ?T1_name ?T2_district WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :phone_market\#ref-phone_id ?T1 .  ?T1 :phone\#name ?T1_name . ?T2 :market\#district ?T2_district . ?T2 :market\#ranking ?T2_ranking . ?T2 a :market . ?T13 :phone_market\#ref-market_id ?T2 .  ?T1 :phone\#name ?T1_name . ?T2 :market\#district ?T2_district . ?T2 :market\#ranking ?T2_ranking .        }  ORDER BY ASC (?T2_ranking)
phone_market,Show the names of phones that are on market with number of shops greater than 50.,SELECT ?T1_name WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :phone_market\#ref-phone_id ?T1 .  ?T1 :phone\#name ?T1_name . ?T2 :market\#num_of_shops ?T2_num_of_shops . ?T2 a :market . ?T13 :phone_market\#ref-market_id ?T2 .  ?T1 :phone\#name ?T1_name . ?T2 :market\#num_of_shops ?T2_num_of_shops . FILTER(?T2_num_of_shops > 50) .        }
phone_market,"For each phone, show its names and total number of stocks.",SELECT ?T1_name (sum( ?T2_num_of_stock) as ?aggregation_T2_num_of_stock_99 ) WHERE { ?T1 a :phone . ?T2 a :phone_market . ?T2 :phone_market\#ref-phone_id ?T1 .  ?T1 :phone\#name ?T1_name . ?T2 :phone_market\#num_of_stock ?T2_num_of_stock .        } GROUP BY ?T1_name
phone_market,"Show the names of phones that have total number of stocks bigger than 2000, in descending order of the total number of stocks.",SELECT ?T1_name WHERE { ?T1 a :phone . ?T2 a :phone_market . ?T2 :phone_market\#ref-phone_id ?T1 .  ?T1 :phone\#name ?T1_name . ?T2 :phone_market\#num_of_stock ?T2_num_of_stock . ?T2 :phone_market\#num_of_stock ?T2_num_of_stock .        } GROUP BY ?T1_name ORDER BY DESC ((sum( ?T2_num_of_stock) as ?aggregation_T2_num_of_stock_140 ))  HAVING(sum( ?T2_num_of_stock)  >= 2000)
phone_market,List the names of phones that are not on any market.,SELECT ?T1_name WHERE { ?T1 a :phone . ?T1 :phone\#name ?T1_name . ?T1 :phone\#phone_id ?T1_phone_id . FILTER(?T1_phone_id not in (?T22_phone_id)) .       {SELECT ?T22_phone_id WHERE { ?T22 a :phone_market . ?T22 :phone_market\#phone_id ?T22_phone_id .        }    } }
gas_company,How many gas companies are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :company .        }
gas_company,What is the total number of companies?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :company .        }
gas_company,List the company name and rank for all companies in the decreasing order of their sales.,SELECT ?T1_company ?T1_rank WHERE { ?T1 a :company . ?T1 :company\#company ?T1_company . ?T1 :company\#rank ?T1_rank . ?T1 :company\#sales_billion ?T1_sales_billion .        }  ORDER BY DESC (?T1_sales_billion)
gas_company,Show the company name and the main industry for all companies whose headquarters are not from USA.,SELECT ?T1_company ?T1_main_industry WHERE { ?T1 a :company . ?T1 :company\#company ?T1_company . ?T1 :company\#main_industry ?T1_main_industry . ?T1 :company\#headquarters ?T1_headquarters . FILTER(?T1_headquarters != 'USA') .        }
gas_company,Show all company names and headquarters in the descending order of market value.,SELECT ?T1_company ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company\#company ?T1_company . ?T1 :company\#headquarters ?T1_headquarters . ?T1 :company\#market_value ?T1_market_value .        }  ORDER BY DESC (?T1_market_value)
gas_company,"Show minimum, maximum, and average market value for all companies.",SELECT (min( ?T1_market_value) as ?aggregation_T1_market_value_121 ) (max( ?T1_market_value) as ?aggregation_T1_market_value_198 ) (avg( ?T1_market_value) as ?aggregation_T1_market_value_155 ) WHERE { ?T1 a :company . ?T1 :company\#market_value ?T1_market_value . ?T1 :company\#market_value ?T1_market_value . ?T1 :company\#market_value ?T1_market_value .        }
gas_company,Show all main industry for all companies.,SELECT DISTINCT ?T1_main_industry WHERE { ?T1 a :company . ?T1 :company\#main_industry ?T1_main_industry .        }
gas_company,What are the different main industries for all companies?,SELECT DISTINCT ?T1_main_industry WHERE { ?T1 a :company . ?T1 :company\#main_industry ?T1_main_industry .        }
gas_company,List all headquarters and the number of companies in each headquarter.,SELECT ?T1_headquarters (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters .        } GROUP BY ?T1_headquarters
gas_company,Show all main industry and total market value in each industry.,SELECT ?T1_main_industry (sum( ?T1_market_value) as ?aggregation_T1_market_value_142 ) WHERE { ?T1 a :company . ?T1 :company\#main_industry ?T1_main_industry . ?T1 :company\#market_value ?T1_market_value .        } GROUP BY ?T1_main_industry
gas_company,What are the main indstries and total market value for each industry?,SELECT ?T1_main_industry (sum( ?T1_market_value) as ?aggregation_T1_market_value_154 ) WHERE { ?T1 a :company . ?T1 :company\#main_industry ?T1_main_industry . ?T1 :company\#market_value ?T1_market_value .        } GROUP BY ?T1_main_industry
gas_company,List the main industry with highest total market value and its number of companies.,SELECT ?T1_main_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :company\#main_industry ?T1_main_industry . ?T1 :company\#market_value ?T1_market_value .        } GROUP BY ?T1_main_industry  ORDER BY DESC ((sum( ?T1_market_value) as ?aggregation_T1_market_value_195 )) LIMIT 1
gas_company,"For each main industry, what is the total number of companies for the industry with the highest total market value?",SELECT ?T1_main_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :company\#main_industry ?T1_main_industry . ?T1 :company\#market_value ?T1_market_value .        } GROUP BY ?T1_main_industry  ORDER BY DESC ((sum( ?T1_market_value) as ?aggregation_T1_market_value_57 )) LIMIT 1
gas_company,Show headquarters with at least two companies in the banking industry.,SELECT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters . ?T1 :company\#main_industry ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') .        } GROUP BY ?T1_headquarters   HAVING(count( *)  >= 2)
gas_company,"Show gas station id, location, and manager_name for all gas stations ordered by open year.",SELECT ?T1_station_id ?T1_location ?T1_manager_name WHERE { ?T1 a :gas_station . ?T1 :gas_station\#station_id ?T1_station_id . ?T1 :gas_station\#location ?T1_location . ?T1 :gas_station\#manager_name ?T1_manager_name . ?T1 :gas_station\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
gas_company,How many gas station are opened between 2000 and 2005?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :gas_station . ?T1 :gas_station\#open_year ?T1_open_year . FILTER(?T1_open_year >= 2000 && ?T1_open_year <= 2005) .        }
gas_company,Show all locations and the number of gas stations in each location ordered by the count.,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :gas_station . ?T1 :gas_station\#location ?T1_location .        } GROUP BY ?T1_location ORDER BY ASC ((count( *) as ?aggregation_all))
gas_company,Show all headquarters with both a company in banking industry and a company in Oil and gas.,SELECT DISTINCT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters . ?T1 :company\#main_industry ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . FILTER (?T1_headquarters in (?T2_headquarters)) .   ?T2 a :company . ?T2 :company\#headquarters ?T2_headquarters . ?T2 :company\#main_industry ?T2_main_industry .  FILTER(?T2_main_industry = 'Oil && gas') .             }
gas_company,Show all headquarters without a company in banking industry.,SELECT distinct?col1 WHERE { { SELECT (?T1_headquarters as ?col1) WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters .   }}  MINUS {SELECT (?T2_headquarters as ?col1) WHERE { ?T2 a :company . ?T2 :company\#headquarters ?T2_headquarters . ?T2 :company\#main_industry ?T2_main_industry . FILTER(?T2_main_industry = 'Banking') .        }     } }
gas_company,Show the company name with the number of gas station.,SELECT ?T1_company (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T2 a :station_company . ?T2 :station_company\#ref-company_id ?T1 .  ?T1 :company\#company ?T1_company .        } GROUP BY ?T1_company
gas_company,Show company name and main industry without a gas station.,SELECT ?T1_company ?T1_main_industry WHERE { ?T1 a :company . ?T1 :company\#company ?T1_company . ?T1 :company\#main_industry ?T1_main_industry . ?T1 :company\#company_id ?T1_company_id . FILTER(?T1_company_id not in (?T22_company_id)) .       {SELECT ?T22_company_id WHERE { ?T22 a :station_company . ?T22 :station_company\#company_id ?T22_company_id .        }    } }
gas_company,Show the manager name for gas stations belonging to the ExxonMobil company.,SELECT ?T1_manager_name WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :station_company\#ref-station_id ?T1 .  ?T1 :gas_station\#manager_name ?T1_manager_name . ?T2 :company\#company ?T2_company . ?T2 a :company . ?T13 :station_company\#ref-company_id ?T2 .  ?T1 :gas_station\#manager_name ?T1_manager_name . ?T2 :company\#company ?T2_company . FILTER(?T2_company = 'ExxonMobil') .        }
gas_company,Show all locations where a gas station for company with market value greater than 100 is located.,SELECT ?T1_location WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :station_company\#ref-station_id ?T1 .  ?T1 :gas_station\#location ?T1_location . ?T2 :company\#market_value ?T2_market_value . ?T2 a :company . ?T13 :station_company\#ref-company_id ?T2 .  ?T1 :gas_station\#location ?T1_location . ?T2 :company\#market_value ?T2_market_value . FILTER(?T2_market_value > 100) .        }
gas_company,Show the manager name with most number of gas stations opened after 2000.,SELECT ?T1_manager_name (count( *) as ?aggregation_all) WHERE { ?T1 a :gas_station . ?T1 :gas_station\#manager_name ?T1_manager_name . ?T1 :gas_station\#open_year ?T1_open_year . FILTER(?T1_open_year > 2000) .        } GROUP BY ?T1_manager_name  ORDER BY DESC (?aggregation_all) LIMIT 1
gas_company,order all gas station locations by the opening year.,SELECT ?T1_location WHERE { ?T1 a :gas_station . ?T1 :gas_station\#location ?T1_location . ?T1 :gas_station\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
gas_company,What are the locations of all the gas stations ordered by opening year?,SELECT ?T1_location WHERE { ?T1 a :gas_station . ?T1 :gas_station\#location ?T1_location . ?T1 :gas_station\#open_year ?T1_open_year .        }  ORDER BY ASC (?T1_open_year)
gas_company,"find the rank, company names, market values of the companies in the banking industry order by their sales and profits in billion.",SELECT ?T1_rank ?T1_company ?T1_market_value WHERE { ?T1 a :company . ?T1 :company\#rank ?T1_rank . ?T1 :company\#company ?T1_company . ?T1 :company\#market_value ?T1_market_value . ?T1 :company\#sales_billion ?T1_sales_billion . ?T1 :company\#main_industry ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') .        }  ORDER BY ASC (?T1_sales_billion)
gas_company,find the location and Representative name of the gas stations owned by the companies with top 3 Asset amounts.,SELECT ?T1_location ?T1_representative_name WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :station_company\#ref-station_id ?T1 .  ?T1 :gas_station\#location ?T1_location . ?T1 :gas_station\#representative_name ?T1_representative_name . ?T2 :company\#assets_billion ?T2_assets_billion . ?T2 a :company . ?T13 :station_company\#ref-company_id ?T2 .  ?T1 :gas_station\#location ?T1_location . ?T1 :gas_station\#representative_name ?T1_representative_name . ?T2 :company\#assets_billion ?T2_assets_billion .        }   ORDER BY DESC (?T2_assets_billion) LIMIT 1
party_people,How many regions do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :region .        }
party_people,Show all distinct region names ordered by their labels.,SELECT DISTINCT ?T1_region_name ?T1_label WHERE { ?T1 a :region . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#label ?T1_label . ?T1 :region\#label ?T1_label .        }  ORDER BY ASC (?T1_label)
party_people,How many parties do we have?,SELECT DISTINCT (count(DISTINCT ?T1_party_name) as ?aggregation_T1_party_name_48 ) WHERE { ?T1 a :party . ?T1 :party\#party_name ?T1_party_name .        }
party_people,Count the number of different parties.,SELECT DISTINCT (count(DISTINCT ?T1_party_name) as ?aggregation_T1_party_name_27 ) WHERE { ?T1 a :party . ?T1 :party\#party_name ?T1_party_name .        }
party_people,"Show the ministers and the time they took and left office, listed by the time they left office.",SELECT ?T1_minister ?T1_took_office ?T1_left_office WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#took_office ?T1_took_office . ?T1 :party\#left_office ?T1_left_office . ?T1 :party\#left_office ?T1_left_office .        }  ORDER BY ASC (?T1_left_office)
party_people,Show the minister who took office after 1961 or before 1959.,SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#took_office ?T1_took_office . ?T1 :party\#took_office ?T1_took_office . FILTER(?T1_took_office > 1961 || ?T1_took_office < 1959) .        }
party_people,Who are the ministers who took office after 1961 or before 1959?,SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#took_office ?T1_took_office . ?T1 :party\#took_office ?T1_took_office . FILTER(?T1_took_office > 1961 || ?T1_took_office < 1959) .        }
party_people,Show all ministers who do not belong to Progress Party.,SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#party_name ?T1_party_name . FILTER(?T1_party_name != 'Progress Party') .        }
party_people,Which ministers are not a part of the Progress Party?,SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#party_name ?T1_party_name . FILTER(?T1_party_name != 'Progress Party') .        }
party_people,Show all ministers and parties they belong to in descending order of the time they took office.,SELECT ?T1_minister ?T1_party_name WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#party_name ?T1_party_name . ?T1 :party\#took_office ?T1_took_office .        }  ORDER BY DESC (?T1_took_office)
party_people,Return the minister who left office at the latest time.,SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#left_office ?T1_left_office .        }   ORDER BY DESC (?T1_left_office) LIMIT 1
party_people,Which minister left office the latest?,SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :party\#minister ?T1_minister . ?T1 :party\#left_office ?T1_left_office .        }   ORDER BY DESC (?T1_left_office) LIMIT 1
party_people,List member names and their party names.,SELECT ?T1_member_name ?T2_party_name WHERE { ?T1 a :member . ?T2 a :party . ?T1 :member\#ref-party_id ?T2 .  ?T1 :member\#member_name ?T1_member_name . ?T2 :party\#party_name ?T2_party_name .        }
party_people,What are the names of members and their corresponding parties?,SELECT ?T1_member_name ?T2_party_name WHERE { ?T1 a :member . ?T2 a :party . ?T1 :member\#ref-party_id ?T2 .  ?T1 :member\#member_name ?T1_member_name . ?T2 :party\#party_name ?T2_party_name .        }
party_people,Show all party names and the number of members in each party.,SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :member . ?T2 :member\#ref-party_id ?T1 .  ?T1 :party\#party_name ?T1_party_name .        } GROUP BY ?T1_party_name
party_people,How many members are in each party?,SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :member . ?T2 :member\#ref-party_id ?T1 .  ?T1 :party\#party_name ?T1_party_name .        } GROUP BY ?T1_party_name
party_people,What is the name of party with most number of members?,SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :member . ?T2 :member\#ref-party_id ?T1 .  ?T1 :party\#party_name ?T1_party_name .        } GROUP BY ?T1_party_name  ORDER BY DESC (?aggregation_all) LIMIT 1
party_people,Show all party names and their region names.,SELECT ?T1_party_name ?T2_region_name WHERE { ?T1 a :party . ?T2 a :region . ?T1 :party\#ref-region_id ?T2 .  ?T1 :party\#party_name ?T1_party_name . ?T2 :region\#region_name ?T2_region_name .        }
party_people,What are the names of parties and their respective regions?,SELECT ?T1_party_name ?T2_region_name WHERE { ?T1 a :party . ?T2 a :region . ?T1 :party\#ref-region_id ?T2 .  ?T1 :party\#party_name ?T1_party_name . ?T2 :region\#region_name ?T2_region_name .        }
party_people,Show names of parties that does not have any members.,SELECT ?T1_party_name WHERE { ?T1 a :party . ?T1 :party\#party_name ?T1_party_name . ?T1 :party\#party_id ?T1_party_id . FILTER(?T1_party_id not in (?T22_party_id)) .       {SELECT ?T22_party_id WHERE { ?T22 a :member . ?T22 :member\#party_id ?T22_party_id .        }    } }
party_people,What are the names of parties that have no members?,SELECT ?T1_party_name WHERE { ?T1 a :party . ?T1 :party\#party_name ?T1_party_name . ?T1 :party\#party_id ?T1_party_id . FILTER(?T1_party_id not in (?T22_party_id)) .       {SELECT ?T22_party_id WHERE { ?T22 a :member . ?T22 :member\#party_id ?T22_party_id .        }    } }
party_people,Show the member names which are in both the party with id 3 and the party with id 1.,SELECT DISTINCT ?T1_member_name WHERE { ?T1 a :member . ?T1 :member\#member_name ?T1_member_name . ?T1 :member\#party_id ?T1_party_id . FILTER(?T1_party_id = 3) . FILTER (?T1_member_name in (?T2_member_name)) .   ?T2 a :member . ?T2 :member\#member_name ?T2_member_name . ?T2 :member\#party_id ?T2_party_id .  FILTER(?T2_party_id = 1) .             }
party_people,Which member names are shared among members in the party with the id 3 and the party with the id 1?,SELECT DISTINCT ?T1_member_name WHERE { ?T1 a :member . ?T1 :member\#member_name ?T1_member_name . ?T1 :member\#party_id ?T1_party_id . FILTER(?T1_party_id = 3) . FILTER (?T1_member_name in (?T2_member_name)) .   ?T2 a :member . ?T2 :member\#member_name ?T2_member_name . ?T2 :member\#party_id ?T2_party_id .  FILTER(?T2_party_id = 1) .             }
party_people,Show member names that are not in the Progress Party.,SELECT ?T1_member_name WHERE { ?T1 a :member . ?T2 a :party . ?T1 :member\#ref-party_id ?T2 .  ?T1 :member\#member_name ?T1_member_name . ?T2 :party\#party_name ?T2_party_name . FILTER(?T2_party_name != 'Progress Party') .        }
party_people,How many party events do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party_events .        }
party_people,Show party names and the number of events for each party.,SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :party_events . ?T2 :party_events\#ref-party_id ?T1 .  ?T1 :party\#party_name ?T1_party_name .        } GROUP BY ?T1_party_name
party_people,How many events are there for each party?,SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :party_events . ?T2 :party_events\#ref-party_id ?T1 .  ?T1 :party\#party_name ?T1_party_name .        } GROUP BY ?T1_party_name
party_people,Show all member names who are not in charge of any event.,SELECT distinct?col1 WHERE { { SELECT (?T1_member_name as ?col1) WHERE { ?T1 a :member . ?T1 :member\#member_name ?T1_member_name .   }}  MINUS {SELECT (?T2_member_name as ?col1) WHERE { ?T2 a :member . ?T2 :member\#member_name ?T2_member_name .        }     } }
party_people,What are the names of members who are not in charge of any events?,SELECT distinct?col1 WHERE { { SELECT (?T1_member_name as ?col1) WHERE { ?T1 a :member . ?T1 :member\#member_name ?T1_member_name .   }}  MINUS {SELECT (?T2_member_name as ?col1) WHERE { ?T2 a :member . ?T2 :member\#member_name ?T2_member_name .        }     } }
party_people,What are the names of parties with at least 2 events?,SELECT ?T1_party_name WHERE { ?T1 a :party . ?T2 a :party_events . ?T2 :party_events\#ref-party_id ?T1 .  ?T1 :party\#party_name ?T1_party_name .        } GROUP BY ?T1_party_name   HAVING(count( *)  >= 2)
