kg_name,question,query
perpetrator,List the names of people that are not perpetrators.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) .       {SELECT ?T22_people_id WHERE { ?T22 a :perpetrator . ?T22 :perpetrator\#people_id ?T22_people_id .        }    } }
perpetrator,Show the countries that have both perpetrators with injures more than 50 and perpetrators with injures smaller than 20.,SELECT DISTINCT ?T1_country WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#country ?T1_country . ?T1 :perpetrator\#injured ?T1_injured . FILTER(?T1_injured > 50) . FILTER (?T1_country in (?T2_country)) .   ?T2 a :perpetrator . ?T2 :perpetrator\#country ?T2_country . ?T2 :perpetrator\#injured ?T2_injured .  FILTER(?T2_injured < 20) .             }
perpetrator,How many distinct locations of perpetrators are there?,SELECT DISTINCT (count(DISTINCT ?T1_location) as ?aggregation_T1_location_47 ) WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#location ?T1_location .        }
perpetrator,Show the date of the tallest perpetrator.,SELECT ?T1_date WHERE { ?T1 a :perpetrator . ?T2 a :people . ?T1 :perpetrator\#ref-people_id ?T2 .  ?T1 :perpetrator\#date ?T1_date . ?T2 :people\#height ?T2_height .        }   ORDER BY DESC (?T2_height) LIMIT 1
perpetrator,In which year did the most recent crime happen?,SELECT (max( ?T1_year) as ?aggregation_T1_year_175 ) WHERE { ?T1 a :perpetrator . ?T1 :perpetrator\#year ?T1_year .        }
csu_1,Report the name of all campuses in Los Angeles county.,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#county ?T1_county . FILTER(?T1_county = 'Los Angeles') .        }
csu_1,What campuses are located in the county of Los Angeles?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#county ?T1_county . FILTER(?T1_county = 'Los Angeles') .        }
csu_1,What are the names of all campuses located at Chico?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#location ?T1_location . FILTER(?T1_location = 'Chico') .        }
csu_1,What campuses are located in Chico?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#location ?T1_location . FILTER(?T1_location = 'Chico') .        }
csu_1,Find all the campuses opened in 1958.,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#year ?T1_year . FILTER(?T1_year = 1958) .        }
csu_1,What are the campuses that opened in 1958?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#year ?T1_year . FILTER(?T1_year = 1958) .        }
csu_1,Find the name of the campuses opened before 1800.,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#year ?T1_year . FILTER(?T1_year < 1800) .        }
csu_1,What campuses opened before 1800?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#year ?T1_year . FILTER(?T1_year < 1800) .        }
csu_1,Which campus was opened between 1935 and 1939?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#year ?T1_year . ?T1 :campuses\#year ?T1_year . FILTER(?T1_year >= 1935 && ?T1_year <= 1939) .        }
csu_1,What campuses opened between 1935 and 1939?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#year ?T1_year . ?T1 :campuses\#year ?T1_year . FILTER(?T1_year >= 1935 && ?T1_year <= 1939) .        }
csu_1,"Find the name of the campuses that is in Northridge, Los Angeles or in San Francisco, San Francisco.",SELECT distinct?col1 WHERE { { SELECT (?T1_campus as ?col1) WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#location ?T1_location . ?T1 :campuses\#county ?T1_county . FILTER(?T1_location = 'Northridge' && ?T1_county = 'Los Angeles') .   }} UNION {SELECT (?T1_campus as ?col1) WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#location ?T1_location . ?T1 :campuses\#county ?T1_county . FILTER(?T1_location = 'San Francisco' && ?T1_county = 'San Francisco') .        }      } }
csu_1,What is the campus fee of 'San Jose State University' in year 1996?,SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\#ref-campus ?T2 .  ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T2 :campuses\#campus ?T2_campus . ?T1 :csu_fees\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 1996) .        }
csu_1,What is the campus fee for San Jose State University in 1996?,SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\#ref-campus ?T2 .  ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T2 :campuses\#campus ?T2_campus . ?T1 :csu_fees\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 1996) .        }
csu_1,What is the campus fee of 'San Francisco State University' in year 1996?,SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\#ref-campus ?T2 .  ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T2 :campuses\#campus ?T2_campus . ?T1 :csu_fees\#year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 1996) .        }
csu_1,What is the campus fee for San Francisco State University in 1996?,SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\#ref-campus ?T2 .  ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T2 :campuses\#campus ?T2_campus . ?T1 :csu_fees\#year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 1996) .        }
csu_1,Find the count of universities whose campus fee is greater than the average campus fee.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_193)) .       {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_193 ) WHERE { ?T22 a :csu_fees . ?T22 :csu_fees\#campusfee ?T22_campusfee .        }    } }
csu_1,How many universities have a campus fee higher than average?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_150)) .       {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_150 ) WHERE { ?T22 a :csu_fees . ?T22 :csu_fees\#campusfee ?T22_campusfee .        }    } }
csu_1,Find the count of universities whose campus fee is greater than the average campus fee.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_82)) .       {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_82 ) WHERE { ?T22 a :csu_fees . ?T22 :csu_fees\#campusfee ?T22_campusfee .        }    } }
csu_1,How many universities have a campus fee greater than the average?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_1)) .       {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_1 ) WHERE { ?T22 a :csu_fees . ?T22 :csu_fees\#campusfee ?T22_campusfee .        }    } }
csu_1,Which university is in Los Angeles county and opened after 1950?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#county ?T1_county . ?T1 :campuses\#year ?T1_year . FILTER(?T1_county = 'Los Angeles' && ?T1_year > 1950) .        }
csu_1,What campuses are located in Los Angeles county and opened after 1950?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#county ?T1_county . ?T1 :campuses\#year ?T1_year . FILTER(?T1_county = 'Los Angeles' && ?T1_year > 1950) .        }
csu_1,Which year has the most degrees conferred?,SELECT ?T1_year WHERE { ?T1 a :degrees . ?T1 :degrees\#year ?T1_year . ?T1 :degrees\#degrees ?T1_degrees .        } GROUP BY ?T1_year  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_125 )) LIMIT 1
csu_1,In what year was the most degrees conferred?,SELECT ?T1_year WHERE { ?T1 a :degrees . ?T1 :degrees\#year ?T1_year . ?T1 :degrees\#degrees ?T1_degrees .        } GROUP BY ?T1_year  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_129 )) LIMIT 1
csu_1,Which campus has the most degrees conferred in all times?,SELECT ?T1_campus WHERE { ?T1 a :degrees . ?T1 :degrees\#campus ?T1_campus . ?T1 :degrees\#degrees ?T1_degrees .        } GROUP BY ?T1_campus  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_56 )) LIMIT 1
csu_1,What campus has the most degrees  conferrred over its entire existence?,SELECT ?T1_campus WHERE { ?T1 a :degrees . ?T1 :degrees\#campus ?T1_campus . ?T1 :degrees\#degrees ?T1_degrees .        } GROUP BY ?T1_campus  ORDER BY DESC ((sum( ?T1_degrees) as ?aggregation_T1_degrees_190 )) LIMIT 1
csu_1,Which campus has the most faculties in year 2003?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T2 a :faculty . ?T2 :faculty\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :faculty\#faculty ?T2_faculty . ?T2 :faculty\#year ?T2_year . FILTER(?T2_year = 2003) .        }   ORDER BY DESC (?T2_faculty) LIMIT 1
csu_1,What campus has the most faculties in 2003?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T2 a :faculty . ?T2 :faculty\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :faculty\#faculty ?T2_faculty . ?T2 :faculty\#year ?T2_year . FILTER(?T2_year = 2003) .        }   ORDER BY DESC (?T2_faculty) LIMIT 1
csu_1,Find the average fee on a CSU campus in 1996,SELECT (avg( ?T1_campusfee) as ?aggregation_T1_campusfee_122 ) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T1 :csu_fees\#year ?T1_year . FILTER(?T1_year = 1996) .        }
csu_1,What is the average fee for a CSU campus in the year of 1996?,SELECT (avg( ?T1_campusfee) as ?aggregation_T1_campusfee_13 ) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T1 :csu_fees\#year ?T1_year . FILTER(?T1_year = 1996) .        }
csu_1,What is the average fee on a CSU campus in 2005?,SELECT (avg( ?T1_campusfee) as ?aggregation_T1_campusfee_150 ) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T1 :csu_fees\#year ?T1_year . FILTER(?T1_year = 2005) .        }
csu_1,What is the average fee for a CSU campus in the year of 2005?,SELECT (avg( ?T1_campusfee) as ?aggregation_T1_campusfee_177 ) WHERE { ?T1 a :csu_fees . ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T1 :csu_fees\#year ?T1_year . FILTER(?T1_year = 2005) .        }
csu_1,report the total number of degrees granted between 1998 and 2002.,SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_139 ) WHERE { ?T1 a :campuses . ?T2 a :degrees . ?T2 :degrees\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :degrees\#degrees ?T2_degrees . ?T2 :degrees\#year ?T2_year . ?T2 :degrees\#year ?T2_year . FILTER(?T2_year >= 1998 && ?T2_year <= 2002) .        } GROUP BY ?T1_campus
csu_1,how many degrees were conferred between 1998 and 2002?,SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_110 ) WHERE { ?T1 a :campuses . ?T2 a :degrees . ?T2 :degrees\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :degrees\#degrees ?T2_degrees . ?T2 :degrees\#year ?T2_year . ?T2 :degrees\#year ?T2_year . FILTER(?T2_year >= 1998 && ?T2_year <= 2002) .        } GROUP BY ?T1_campus
csu_1,"For each Orange county campus, report the number of degrees granted after 2000.",SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_123 ) WHERE { ?T1 a :campuses . ?T2 a :degrees . ?T2 :degrees\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :degrees\#degrees ?T2_degrees . ?T1 :campuses\#county ?T1_county . ?T2 :degrees\#year ?T2_year . FILTER(?T1_county = 'Orange' && ?T2_year >= 2000) .        } GROUP BY ?T1_campus
csu_1,Find the names of the campus which has more faculties in 2002 than every campus in Orange county.,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T2 a :faculty . ?T2 :faculty\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :faculty\#year ?T2_year . ?T2 :faculty\#faculty ?T2_faculty . FILTER(?T2_year = 2002 && ?T2_faculty > (?T24_county)) .       {SELECT (max( ?T23_faculty) as ?aggregation_T23_faculty_197 ) WHERE { ?T23 a :faculty . ?T24 a :campuses . ?T23 :faculty\#ref-campus ?T24 .  ?T23 :faculty\#faculty ?T23_faculty . ?T23 :faculty\#year ?T23_year . ?T24 :campuses\#county ?T24_county . FILTER(?T23_year = 2002 && ?T24_county = 'Orange') .        }    } }
csu_1,How many campuses are there in Los Angeles county?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :campuses . ?T1 :campuses\#county ?T1_county . FILTER(?T1_county = 'Los Angeles') .        }
csu_1,How many campuses exist are in the county of LA?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :campuses . ?T1 :campuses\#county ?T1_county . FILTER(?T1_county = 'Los Angeles') .        }
csu_1,What campuses are in Los Angeles county?,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses\#campus ?T1_campus . ?T1 :campuses\#county ?T1_county . FILTER(?T1_county = 'Los Angeles') .        }
csu_1,How many degrees were conferred in 'San Jose State University' in 2000?,SELECT ?T1_degrees WHERE { ?T1 a :degrees . ?T2 a :campuses . ?T1 :degrees\#ref-campus ?T2 .  ?T1 :degrees\#degrees ?T1_degrees . ?T2 :campuses\#campus ?T2_campus . ?T1 :degrees\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 2000) .        }
csu_1,How many degrees were conferred at San Jose State University in 2000?,SELECT ?T1_degrees WHERE { ?T1 a :degrees . ?T2 a :campuses . ?T1 :degrees\#ref-campus ?T2 .  ?T1 :degrees\#degrees ?T1_degrees . ?T2 :campuses\#campus ?T2_campus . ?T1 :degrees\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 2000) .        }
csu_1,What are the degrees conferred in 'San Francisco State University' in 2001.,SELECT ?T1_degrees WHERE { ?T1 a :degrees . ?T2 a :campuses . ?T1 :degrees\#ref-campus ?T2 .  ?T1 :degrees\#degrees ?T1_degrees . ?T2 :campuses\#campus ?T2_campus . ?T1 :degrees\#year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 2001) .        }
csu_1,How many faculty is there in total in the year of 2002?,SELECT (sum( ?T1_faculty) as ?aggregation_T1_faculty_76 ) WHERE { ?T1 a :faculty . ?T1 :faculty\#faculty ?T1_faculty . ?T1 :faculty\#year ?T1_year . FILTER(?T1_year = 2002) .        }
csu_1,What is the number of faculty lines in campus 'Long Beach State University' in 2002?,SELECT ?T1_faculty WHERE { ?T1 a :faculty . ?T2 a :campuses . ?T1 :faculty\#ref-campus ?T2 .  ?T1 :faculty\#faculty ?T1_faculty . ?T1 :faculty\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2002 && ?T2_campus = 'Long Beach State University') .        }
csu_1,What is the number of faculty at Long Beach State University in 2002?,SELECT ?T1_faculty WHERE { ?T1 a :faculty . ?T2 a :campuses . ?T1 :faculty\#ref-campus ?T2 .  ?T1 :faculty\#faculty ?T1_faculty . ?T1 :faculty\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2002 && ?T2_campus = 'Long Beach State University') .        }
csu_1,How many faculty lines are there in 'San Francisco State University' in year 2004?,SELECT ?T1_faculty WHERE { ?T1 a :faculty . ?T2 a :campuses . ?T1 :faculty\#ref-campus ?T2 .  ?T1 :faculty\#faculty ?T1_faculty . ?T1 :faculty\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Francisco State University') .        }
csu_1,List the campus that have between 600 and 1000 faculty lines in year 2004.,SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T2 a :faculty . ?T2 :faculty\#ref-campus ?T1 .  ?T1 :campuses\#campus ?T1_campus . ?T2 :faculty\#faculty ?T2_faculty . ?T2 :faculty\#faculty ?T2_faculty . ?T1 :campuses\#year ?T1_year . FILTER(?T2_faculty >= 600 && ?T2_faculty <= 1000 && ?T1_year = 2004) .        }
csu_1,How many undergraduates are there in 'San Jose State University' in year 2004?,SELECT (sum( ?T1_undergraduate) as ?aggregation_T1_undergraduate_196 ) WHERE { ?T1 a :discipline_enrollments . ?T2 a :campuses . ?T1 :discipline_enrollments\#ref-campus ?T2 .  ?T1 :discipline_enrollments\#undergraduate ?T1_undergraduate . ?T1 :discipline_enrollments\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Jose State University') .        }
csu_1,How many undergraduates are there at San Jose State,SELECT (sum( ?T1_undergraduate) as ?aggregation_T1_undergraduate_8 ) WHERE { ?T1 a :discipline_enrollments . ?T2 a :campuses . ?T1 :discipline_enrollments\#ref-campus ?T2 .  ?T1 :discipline_enrollments\#undergraduate ?T1_undergraduate . ?T1 :discipline_enrollments\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Jose State University') .        }
csu_1,What is the number of graduates in 'San Francisco State University' in year 2004?,SELECT (sum( ?T1_graduate) as ?aggregation_T1_graduate_150 ) WHERE { ?T1 a :discipline_enrollments . ?T2 a :campuses . ?T1 :discipline_enrollments\#ref-campus ?T2 .  ?T1 :discipline_enrollments\#graduate ?T1_graduate . ?T1 :discipline_enrollments\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Francisco State University') .        }
csu_1,How many people graduated from San Francisco State University in 2004?,SELECT (sum( ?T1_graduate) as ?aggregation_T1_graduate_193 ) WHERE { ?T1 a :discipline_enrollments . ?T2 a :campuses . ?T1 :discipline_enrollments\#ref-campus ?T2 .  ?T1 :discipline_enrollments\#graduate ?T1_graduate . ?T1 :discipline_enrollments\#year ?T1_year . ?T2 :campuses\#campus ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Francisco State University') .        }
csu_1,What is the campus fee of 'San Francisco State University' in year 2000?,SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\#ref-campus ?T2 .  ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T2 :campuses\#campus ?T2_campus . ?T1 :csu_fees\#year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 2000) .        }
csu_1,What is the campus fee in the year 2000 for San Jose State University?,SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :csu_fees\#ref-campus ?T2 .  ?T1 :csu_fees\#campusfee ?T1_campusfee . ?T2 :campuses\#campus ?T2_campus . ?T1 :csu_fees\#year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 2000) .        }
csu_1,How many CSU campuses are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :campuses .        }
csu_1,What is the total number of campuses?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :campuses .        }
candidate_poll,How many candidates are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :candidate .        }
candidate_poll,Return the poll resource associated with the most candidates.,SELECT ?T1_poll_source (count( *) as ?aggregation_all) WHERE { ?T1 a :candidate . ?T1 :candidate\#poll_source ?T1_poll_source .        } GROUP BY ?T1_poll_source  ORDER BY DESC (?aggregation_all) LIMIT 1
candidate_poll,what are the top 3 highest support rates?,SELECT ?T1_support_rate WHERE { ?T1 a :candidate . ?T1 :candidate\#support_rate ?T1_support_rate . ?T1 :candidate\#support_rate ?T1_support_rate .        }   ORDER BY DESC (?T1_support_rate) LIMIT 1
candidate_poll,Find the id of the candidate who got the lowest oppose rate.,SELECT ?T1_candidate_id WHERE { ?T1 a :candidate . ?T1 :candidate\#candidate_id ?T1_candidate_id . ?T1 :candidate\#oppose_rate ?T1_oppose_rate .        }   ORDER BY ASC (?T1_oppose_rate) LIMIT 1
candidate_poll,What is the id of the candidate with the lowest oppose rate?,SELECT ?T1_candidate_id WHERE { ?T1 a :candidate . ?T1 :candidate\#candidate_id ?T1_candidate_id . ?T1 :candidate\#oppose_rate ?T1_oppose_rate .        }   ORDER BY ASC (?T1_oppose_rate) LIMIT 1
candidate_poll,"Please list support, consider, and oppose rates for each candidate in ascending order by unsure rate.",SELECT ?T1_support_rate ?T1_consider_rate ?T1_oppose_rate WHERE { ?T1 a :candidate . ?T1 :candidate\#support_rate ?T1_support_rate . ?T1 :candidate\#consider_rate ?T1_consider_rate . ?T1 :candidate\#oppose_rate ?T1_oppose_rate . ?T1 :candidate\#unsure_rate ?T1_unsure_rate .        }  ORDER BY ASC (?T1_unsure_rate)
candidate_poll,which poll source does the highest oppose rate come from?,SELECT ?T1_poll_source WHERE { ?T1 a :candidate . ?T1 :candidate\#poll_source ?T1_poll_source . ?T1 :candidate\#oppose_rate ?T1_oppose_rate .        }   ORDER BY DESC (?T1_oppose_rate) LIMIT 1
candidate_poll,List all people names in the order of their date of birth from old to young.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#date_of_birth ?T1_date_of_birth .        }  ORDER BY ASC (?T1_date_of_birth)
candidate_poll,Find the average height and weight for all males (sex is M).,SELECT (avg( ?T1_height) as ?aggregation_T1_height_49 ) (avg( ?T1_weight) as ?aggregation_T1_weight_135 ) WHERE { ?T1 a :people . ?T1 :people\#height ?T1_height . ?T1 :people\#weight ?T1_weight . ?T1 :people\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
candidate_poll,What are the average height and weight across males (sex is M)?,SELECT (avg( ?T1_height) as ?aggregation_T1_height_21 ) (avg( ?T1_weight) as ?aggregation_T1_weight_46 ) WHERE { ?T1 a :people . ?T1 :people\#height ?T1_height . ?T1 :people\#weight ?T1_weight . ?T1 :people\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
candidate_poll,find the names of people who are taller than 200 or lower than 190.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#height ?T1_height . ?T1 :people\#height ?T1_height . FILTER(?T1_height > 200 || ?T1_height < 190) .        }
candidate_poll,Find the average and minimum weight for each gender.,SELECT (avg( ?T1_weight) as ?aggregation_T1_weight_14 ) (min( ?T1_weight) as ?aggregation_T1_weight_160 ) ?T1_sex WHERE { ?T1 a :people . ?T1 :people\#weight ?T1_weight . ?T1 :people\#weight ?T1_weight . ?T1 :people\#sex ?T1_sex .        } GROUP BY ?T1_sex
candidate_poll,What are the average and minimum weights for people of each sex?,SELECT (avg( ?T1_weight) as ?aggregation_T1_weight_85 ) (min( ?T1_weight) as ?aggregation_T1_weight_87 ) ?T1_sex WHERE { ?T1 a :people . ?T1 :people\#weight ?T1_weight . ?T1 :people\#weight ?T1_weight . ?T1 :people\#sex ?T1_sex .        } GROUP BY ?T1_sex
candidate_poll,Find the name and gender of the candidate who got the highest support rate.,SELECT ?T1_name ?T1_sex WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T1 :people\#sex ?T1_sex . ?T2 :candidate\#support_rate ?T2_support_rate .        }   ORDER BY DESC (?T2_support_rate) LIMIT 1
candidate_poll,What is the name and sex of the candidate with the highest support rate?,SELECT ?T1_name ?T1_sex WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T1 :people\#sex ?T1_sex . ?T2 :candidate\#support_rate ?T2_support_rate .        }   ORDER BY DESC (?T2_support_rate) LIMIT 1
candidate_poll,Find the name of the candidates whose oppose percentage is the lowest for each sex.,SELECT ?T1_name ?T1_sex (min( ?T2_oppose_rate) as ?aggregation_T2_oppose_rate_157 ) WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T1 :people\#sex ?T1_sex . ?T2 :candidate\#oppose_rate ?T2_oppose_rate .        } GROUP BY ?T1_name ?T1_sex
candidate_poll,"For each sex, what is the name and sex of the candidate with the oppose rate for their sex?",SELECT ?T1_name ?T1_sex (min( ?T2_oppose_rate) as ?aggregation_T2_oppose_rate_185 ) WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T1 :people\#sex ?T1_sex . ?T2 :candidate\#oppose_rate ?T2_oppose_rate .        } GROUP BY ?T1_name ?T1_sex
candidate_poll,which gender got the highest average uncertain ratio.,SELECT ?T1_sex WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#sex ?T1_sex . ?T2 :candidate\#unsure_rate ?T2_unsure_rate .        } GROUP BY ?T1_sex  ORDER BY DESC ((avg( ?T2_unsure_rate) as ?aggregation_T2_unsure_rate_144 )) LIMIT 1
candidate_poll,What is the sex of the candidate who had the highest unsure rate?,SELECT ?T1_sex WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#sex ?T1_sex . ?T2 :candidate\#unsure_rate ?T2_unsure_rate .        } GROUP BY ?T1_sex  ORDER BY DESC ((avg( ?T2_unsure_rate) as ?aggregation_T2_unsure_rate_64 )) LIMIT 1
candidate_poll,what are the names of people who did not participate in the candidate election.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) .       {SELECT ?T22_people_id WHERE { ?T22 a :candidate . ?T22 :candidate\#people_id ?T22_people_id .        }    } }
candidate_poll,Find the names of the candidates whose support percentage is lower than their oppose rate.,"SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :candidate . ?T2 :candidate\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :candidate\#support_rate ?T2_support_rate . FILTER(?T2_support_rate < [0, 7, False]) .        }"
candidate_poll,how many people are there whose weight is higher than 85 for each gender?,SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a :people . ?T1 :people\#sex ?T1_sex . ?T1 :people\#weight ?T1_weight . FILTER(?T1_weight > 85) .        } GROUP BY ?T1_sex
candidate_poll,"find the highest support percentage, lowest consider rate and oppose rate of all candidates.",SELECT (max( ?T1_support_rate) as ?aggregation_T1_support_rate_154 ) (min( ?T1_consider_rate) as ?aggregation_T1_consider_rate_162 ) (min( ?T1_oppose_rate) as ?aggregation_T1_oppose_rate_8 ) WHERE { ?T1 a :candidate . ?T1 :candidate\#support_rate ?T1_support_rate . ?T1 :candidate\#consider_rate ?T1_consider_rate . ?T1 :candidate\#oppose_rate ?T1_oppose_rate .        }
candidate_poll,list all female (sex is F) candidate names in the alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#name ?T1_name . ?T1 :people\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }  ORDER BY ASC (?T1_name)
candidate_poll,find the name of people whose height is lower than the average.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#height ?T1_height . FILTER(?T1_height < (?aggregation_T22_height_173)) .       {SELECT (avg( ?T22_height) as ?aggregation_T22_height_173 ) WHERE { ?T22 a :people . ?T22 :people\#height ?T22_height .        }    } }
candidate_poll,What are the names of people who are shorter than average?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#height ?T1_height . FILTER(?T1_height < (?aggregation_T22_height_174)) .       {SELECT (avg( ?T22_height) as ?aggregation_T22_height_174 ) WHERE { ?T22 a :people . ?T22 :people\#height ?T22_height .        }    } }
candidate_poll,List all info about all people.,SELECT * WHERE { ?T1 a :people .        }
candidate_poll,What is all the information about all people?,SELECT * WHERE { ?T1 a :people .        }
movie_1,Find the titles of all movies directed by steven spielberg.,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#director ?T1_director . FILTER(?T1_director = 'Steven Spielberg') .        }
movie_1,What are the names of all movies directed by Steven Spielberg?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#director ?T1_director . FILTER(?T1_director = 'Steven Spielberg') .        }
movie_1,How many movies were made before 2000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :movie . ?T1 :movie\#year ?T1_year . FILTER(?T1_year < 2000) .        }
movie_1,Who is the director of movie Avatar?,SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director . ?T1 :movie\#title ?T1_title . FILTER(?T1_title = 'Avatar') .        }
movie_1,Who directed Avatar?,SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director . ?T1 :movie\#title ?T1_title . FILTER(?T1_title = 'Avatar') .        }
movie_1,How many reviewers listed?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reviewer .        }
movie_1,How many reviewers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reviewer .        }
movie_1,What is the id of the reviewer whose name has substring Mike?,"SELECT ?T1_rid WHERE { ?T1 a :reviewer . ?T1 :reviewer\#rid ?T1_rid . ?T1 :reviewer\#name ?T1_name . FILTER(contains (?T1_name, 'Mike')) .        }"
movie_1,What is the id of the reviewer whose name includes the word 'Mike'?,"SELECT ?T1_rid WHERE { ?T1 a :reviewer . ?T1 :reviewer\#rid ?T1_rid . ?T1 :reviewer\#name ?T1_name . FILTER(contains (?T1_name, 'Mike')) .        }"
movie_1,What is the reviewer id of Daniel Lewis?,SELECT ?T1_rid WHERE { ?T1 a :reviewer . ?T1 :reviewer\#rid ?T1_rid . ?T1 :reviewer\#name ?T1_name . FILTER(?T1_name = 'Daniel Lewis') .        }
movie_1,What is the id of the reviewer named Daniel Lewis?,SELECT ?T1_rid WHERE { ?T1 a :reviewer . ?T1 :reviewer\#rid ?T1_rid . ?T1 :reviewer\#name ?T1_name . FILTER(?T1_name = 'Daniel Lewis') .        }
movie_1,What is the total number of ratings that has more than 3 stars?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rating . ?T1 :rating\#stars ?T1_stars . FILTER(?T1_stars > 3) .        }
movie_1,How many movie ratings have more than 3 stars?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rating . ?T1 :rating\#stars ?T1_stars . FILTER(?T1_stars > 3) .        }
movie_1,What is the lowest and highest rating star?,SELECT (max( ?T1_stars) as ?aggregation_T1_stars_64 ) (min( ?T1_stars) as ?aggregation_T1_stars_13 ) WHERE { ?T1 a :rating . ?T1 :rating\#stars ?T1_stars . ?T1 :rating\#stars ?T1_stars .        }
movie_1,What is the maximum and mininum number of stars a rating can receive?,SELECT (max( ?T1_stars) as ?aggregation_T1_stars_119 ) (min( ?T1_stars) as ?aggregation_T1_stars_30 ) WHERE { ?T1 a :rating . ?T1 :rating\#stars ?T1_stars . ?T1 :rating\#stars ?T1_stars .        }
movie_1,"Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order of year.",SELECT DISTINCT ?T1_year WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#year ?T1_year . ?T1 :movie\#year ?T1_year . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars >= 4) .        }  ORDER BY ASC (?T1_year)
movie_1,What are the names of directors who directed movies with 5 star rating? Also return the title of these movies.,SELECT ?T1_director ?T1_title WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#director ?T1_director . ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars = 5) .        }
movie_1,What is the average rating star for each reviewer?,SELECT ?T1_name (avg( ?T2_stars) as ?aggregation_T2_stars_200 ) WHERE { ?T1 a :reviewer . ?T2 a :rating . ?T2 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_name
movie_1,Find the titles of all movies that have no ratings.,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#mid ?T1_mid . FILTER(?T1_mid not in (?T22_mid)) .       {SELECT ?T22_mid WHERE { ?T22 a :rating . ?T22 :rating\#mid ?T22_mid .        }    } }
