kg_name,question,query
theme_gallery,Show all artist names with an average exhibition attendance over 200.,SELECT ?T1_name WHERE { ?T1 a :artist . ?T13 a :exhibition . ?T13 :exhibition\#ref-artist_id ?T1 .  ?T1 :artist\#name ?T1_name . ?T2 :exhibition_record\#attendance ?T2_attendance . ?T2 a :exhibition_record . ?T2 :exhibition_record\#ref-exhibition_id ?T13 .  ?T1 :artist\#name ?T1_name . ?T2 :exhibition_record\#attendance ?T2_attendance .        } GROUP BY ?T1_name   HAVING(avg( ?T2_attendance)  > 200)
theme_gallery,What are the names of artist whose exhibitions draw over 200 attendees on average?,SELECT ?T1_name WHERE { ?T1 a :artist . ?T13 a :exhibition . ?T13 :exhibition\#ref-artist_id ?T1 .  ?T1 :artist\#name ?T1_name . ?T2 :exhibition_record\#attendance ?T2_attendance . ?T2 a :exhibition_record . ?T2 :exhibition_record\#ref-exhibition_id ?T13 .  ?T1 :artist\#name ?T1_name . ?T2 :exhibition_record\#attendance ?T2_attendance .        } GROUP BY ?T1_name   HAVING(avg( ?T2_attendance)  > 200)
epinions_1,Find the id of the item whose title is 'orange'.,SELECT ?T1_i_id WHERE { ?T1 a :item . ?T1 :item\#i_id ?T1_i_id . ?T1 :item\#title ?T1_title . FILTER(?T1_title = 'orange') .        }
epinions_1,List all information in the item table.,SELECT * WHERE { ?T1 a :item .        }
epinions_1,Find the number of reviews.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :review .        }
epinions_1,How many users are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :useracct .        }
epinions_1,Find the average and maximum rating of all reviews.,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_20 ) (max( ?T1_rating) as ?aggregation_T1_rating_63 ) WHERE { ?T1 a :review . ?T1 :review\#rating ?T1_rating . ?T1 :review\#rating ?T1_rating .        }
epinions_1,Find the highest rank of all reviews.,SELECT (min( ?T1_rank) as ?aggregation_T1_rank_0 ) WHERE { ?T1 a :review . ?T1 :review\#rank ?T1_rank .        }
epinions_1,How many different users wrote some reviews?,SELECT DISTINCT (count(DISTINCT ?T1_u_id) as ?aggregation_T1_u_id_168 ) WHERE { ?T1 a :review . ?T1 :review\#u_id ?T1_u_id .        }
epinions_1,How many different items were reviewed by some users?,SELECT DISTINCT (count(DISTINCT ?T1_i_id) as ?aggregation_T1_i_id_38 ) WHERE { ?T1 a :review . ?T1 :review\#i_id ?T1_i_id .        }
epinions_1,Find the number of items that did not receive any review.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :item . ?T1 :item\#i_id ?T1_i_id . FILTER(?T1_i_id not in (?T22_i_id)) .       {SELECT ?T22_i_id WHERE { ?T22 a :review . ?T22 :review\#i_id ?T22_i_id .        }    } }
epinions_1,Find the names of users who did not leave any review.,SELECT ?T1_name WHERE { ?T1 a :useracct . ?T1 :useracct\#name ?T1_name . ?T1 :useracct\#u_id ?T1_u_id . FILTER(?T1_u_id not in (?T22_u_id)) .       {SELECT ?T22_u_id WHERE { ?T22 a :review . ?T22 :review\#u_id ?T22_u_id .        }    } }
epinions_1,Find the names of goods that receive a rating of 10.,SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T2 :review\#rating ?T2_rating . FILTER(?T2_rating = 10) .        }
epinions_1,Find the titles of items whose rating is higher than the average review rating of all items.,SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T2 :review\#rating ?T2_rating . FILTER(?T2_rating > (?aggregation_T23_rating_77)) .       {SELECT (avg( ?T23_rating) as ?aggregation_T23_rating_77 ) WHERE { ?T23 a :review . ?T23 :review\#rating ?T23_rating .        }    } }
epinions_1,Find the titles of items that received any rating below 5.,SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T2 :review\#rating ?T2_rating . FILTER(?T2_rating < 5) .        }
epinions_1,Find the titles of items that received both a rating higher than 8 and a rating below 5.,SELECT DISTINCT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T2 :review\#rating ?T2_rating . FILTER(?T2_rating > 8) . FILTER (?T1_title in (?T3_title)) .   ?T3 a :item . ?T4 a :review . ?T4 :review\#ref-i_id ?T3 .  ?T3 :item\#title ?T3_title . ?T4 :review\#rating ?T4_rating .  FILTER(?T4_rating < 5) .             }
epinions_1,Find the names of items whose rank is higher than 3 and whose average rating is above 5.,SELECT DISTINCT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T2 :review\#rank ?T2_rank . FILTER(?T2_rank > 3) . FILTER (?T1_title in (?T3_title)) .   ?T3 a :item . ?T4 a :review . ?T4 :review\#ref-i_id ?T3 .  ?T3 :item\#title ?T3_title . ?T4 :review\#rating ?T4_rating .     GROUP BY ?T3_title   HAVING(avg( ?T4_rating)  > 5)      }
epinions_1,Find the name of the item with the lowest average rating.,SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T2 :review\#rating ?T2_rating .        } GROUP BY ?T1_title  ORDER BY ASC ((avg( ?T2_rating) as ?aggregation_T2_rating_114 )) LIMIT 1
epinions_1,List the titles of all items in alphabetic order .,SELECT ?T1_title WHERE { ?T1 a :item . ?T1 :item\#title ?T1_title . ?T1 :item\#title ?T1_title .        }  ORDER BY ASC (?T1_title)
epinions_1,Find the name of the user who gives the most reviews.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :review\#ref-u_id ?T1 .  ?T1 :useracct\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
epinions_1,Find the name and id of the item with the highest average rating.,SELECT ?T1_title ?T1_i_id WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T1 :item\#i_id ?T1_i_id . ?T2 :review\#rating ?T2_rating .        } GROUP BY ?T1_title ?T1_i_id  ORDER BY DESC ((avg( ?T2_rating) as ?aggregation_T2_rating_5 )) LIMIT 1
epinions_1,Find the name and id of the good with the highest average rank.,SELECT ?T1_title ?T1_i_id WHERE { ?T1 a :item . ?T2 a :review . ?T2 :review\#ref-i_id ?T1 .  ?T1 :item\#title ?T1_title . ?T1 :item\#i_id ?T1_i_id . ?T2 :review\#rank ?T2_rank .        } GROUP BY ?T1_title ?T1_i_id  ORDER BY DESC ((avg( ?T2_rank) as ?aggregation_T2_rank_169 )) LIMIT 1
epinions_1,"For each user, return the name and the average rating of reviews given by them.",SELECT ?T1_name (avg( ?T2_rating) as ?aggregation_T2_rating_159 ) WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :review\#ref-u_id ?T1 .  ?T1 :useracct\#name ?T1_name . ?T2 :review\#rating ?T2_rating .        } GROUP BY ?T1_name
epinions_1,"For each user, find their name and the number of reviews written by them.",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :review\#ref-u_id ?T1 .  ?T1 :useracct\#name ?T1_name .        } GROUP BY ?T1_name
epinions_1,Find the name of the user who gave the highest rating.,SELECT ?T1_name WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :review\#ref-u_id ?T1 .  ?T1 :useracct\#name ?T1_name . ?T2 :review\#rating ?T2_rating .        }   ORDER BY DESC (?T2_rating) LIMIT 1
epinions_1,Find the name of the source user with the highest average trust score.,SELECT ?T1_name WHERE { ?T1 a :useracct . ?T2 a :trust . ?T2 :trust\#ref-source_u_id ?T1 .  ?T1 :useracct\#name ?T1_name . ?T2 :trust\#trust ?T2_trust .        } GROUP BY ?T1_name  ORDER BY DESC ((avg( ?T2_trust) as ?aggregation_T2_trust_29 )) LIMIT 1
epinions_1,Find each target user's name and average trust score.,SELECT ?T1_name (avg( ?T2_trust) as ?aggregation_T2_trust_38 ) WHERE { ?T1 a :useracct . ?T2 a :trust . ?T2 :trust\#ref-source_u_id ?T1 .  ?T1 :useracct\#name ?T1_name . ?T2 :trust\#trust ?T2_trust .        } GROUP BY ?T1_name
epinions_1,Find the name of the target user with the lowest trust score.,SELECT ?T1_name WHERE { ?T1 a :useracct . ?T2 a :trust . ?T2 :trust\#ref-source_u_id ?T1 .  ?T1 :useracct\#name ?T1_name . ?T2 :trust\#trust ?T2_trust .        }   ORDER BY ASC (?T2_trust) LIMIT 1
riding_club,How many players are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :player .        }
riding_club,List the names of players in ascending order of votes.,SELECT ?T1_player_name WHERE { ?T1 a :player . ?T1 :player\#player_name ?T1_player_name . ?T1 :player\#votes ?T1_votes .        }  ORDER BY ASC (?T1_votes)
riding_club,What are the gender and occupation of players?,SELECT ?T1_gender ?T1_occupation WHERE { ?T1 a :player . ?T1 :player\#gender ?T1_gender . ?T1 :player\#occupation ?T1_occupation .        }
riding_club,List the name and residence for players whose occupation is not 'Researcher'.,SELECT ?T1_player_name ?T1_residence WHERE { ?T1 a :player . ?T1 :player\#player_name ?T1_player_name . ?T1 :player\#residence ?T1_residence . ?T1 :player\#occupation ?T1_occupation . FILTER(?T1_occupation != 'Researcher') .        }
riding_club,Show the names of sponsors of players whose residence is either 'Brandon' or 'Birtle'.,SELECT ?T1_sponsor_name WHERE { ?T1 a :player . ?T1 :player\#sponsor_name ?T1_sponsor_name . ?T1 :player\#residence ?T1_residence . ?T1 :player\#residence ?T1_residence . FILTER(?T1_residence = 'Brandon' || ?T1_residence = 'Birtle') .        }
riding_club,What is the name of the player with the largest number of votes?,SELECT ?T1_player_name WHERE { ?T1 a :player . ?T1 :player\#player_name ?T1_player_name . ?T1 :player\#votes ?T1_votes .        }   ORDER BY DESC (?T1_votes) LIMIT 1
riding_club,Show different occupations along with the number of players in each occupation.,SELECT ?T1_occupation (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#occupation ?T1_occupation .        } GROUP BY ?T1_occupation
riding_club,Please show the most common occupation of players.,SELECT ?T1_occupation (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#occupation ?T1_occupation .        } GROUP BY ?T1_occupation  ORDER BY DESC (?aggregation_all) LIMIT 1
riding_club,Show the residences that have at least two players.,SELECT ?T1_residence WHERE { ?T1 a :player . ?T1 :player\#residence ?T1_residence .        } GROUP BY ?T1_residence   HAVING(count( *)  >= 2)
riding_club,Show the names of players and names of their coaches.,SELECT ?T1_player_name ?T2_coach_name WHERE { ?T1 a :player . ?T13 a :club . ?T1 :player\#ref-club_id ?T13 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :coach\#coach_name ?T2_coach_name . ?T2 a :coach . ?T2 :coach\#ref-club_id ?T13 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :coach\#coach_name ?T2_coach_name .        }
riding_club,Show the names of players coached by the rank 1 coach.,SELECT ?T1_player_name WHERE { ?T1 a :player . ?T13 a :club . ?T1 :player\#ref-club_id ?T13 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :coach\#rank ?T2_rank . ?T2 a :coach . ?T2 :coach\#ref-club_id ?T13 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :coach\#rank ?T2_rank . FILTER(?T2_rank = 1) .        }
riding_club,Show the names and genders of players with a coach starting after 2011.,SELECT ?T1_player_name ?T1_gender WHERE { ?T1 a :player . ?T2 a :player_coach . ?T2 :player_coach\#ref-player_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T1 :player\#gender ?T1_gender . ?T2 :player_coach\#starting_year ?T2_starting_year . FILTER(?T2_starting_year > 2011) .        }
riding_club,Show the names of players and names of their coaches in descending order of the votes of players.,SELECT ?T1_player_name ?T2_coach_name WHERE { ?T1 a :player . ?T13 a :club . ?T1 :player\#ref-club_id ?T13 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :coach\#coach_name ?T2_coach_name . ?T1 :player\#votes ?T1_votes . ?T2 a :coach . ?T2 :coach\#ref-club_id ?T13 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :coach\#coach_name ?T2_coach_name . ?T1 :player\#votes ?T1_votes .        }  ORDER BY DESC (?T1_votes)
riding_club,List the names of players that do not have coaches.,SELECT ?T1_player_name WHERE { ?T1 a :player . ?T1 :player\#player_name ?T1_player_name . ?T1 :player\#player_id ?T1_player_id . FILTER(?T1_player_id not in (?T22_player_id)) .       {SELECT ?T22_player_id WHERE { ?T22 a :player_coach . ?T22 :player_coach\#player_id ?T22_player_id .        }    } }
riding_club,Show the residences that have both a player of gender 'M' and a player of gender 'F'.,SELECT DISTINCT ?T1_residence WHERE { ?T1 a :player . ?T1 :player\#residence ?T1_residence . ?T1 :player\#gender ?T1_gender . FILTER(?T1_gender = 'M') . FILTER (?T1_residence in (?T2_residence)) .   ?T2 a :player . ?T2 :player\#residence ?T2_residence . ?T2 :player\#gender ?T2_gender .  FILTER(?T2_gender = 'F') .             }
riding_club,"How many coaches does each club has? List the club id, name and the number of coaches.",SELECT ?T1_club_id ?T1_club_name (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :coach . ?T2 :coach\#ref-club_id ?T1 .  ?T1 :club\#club_id ?T1_club_id . ?T1 :club\#club_name ?T1_club_name .        } GROUP BY ?T1_club_id ?T1_club_name
riding_club,How many gold medals has the club with the most coaches won?,SELECT ?T1_club_id (count( *) as ?aggregation_all) ?T1_gold WHERE { ?T1 a :match_result . ?T13 a :club . ?T1 :match_result\#ref-club_id ?T13 .  ?T1 :match_result\#club_id ?T1_club_id . ?T1 :match_result\#gold ?T1_gold .        } GROUP BY ?T1_club_id ?T1_gold  ORDER BY DESC (?aggregation_all) LIMIT 1
gymnast,How many gymnasts are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :gymnast .        }
gymnast,List the total points of gymnasts in descending order.,SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T1 :gymnast\#total_points ?T1_total_points . ?T1 :gymnast\#total_points ?T1_total_points .        }  ORDER BY DESC (?T1_total_points)
gymnast,List the total points of gymnasts in descending order of floor exercise points.,SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T1 :gymnast\#total_points ?T1_total_points . ?T1 :gymnast\#floor_exercise_points ?T1_floor_exercise_points .        }  ORDER BY DESC (?T1_floor_exercise_points)
gymnast,What is the average horizontal bar points for all gymnasts?,SELECT (avg( ?T1_horizontal_bar_points) as ?aggregation_T1_horizontal_bar_points_32 ) WHERE { ?T1 a :gymnast . ?T1 :gymnast\#horizontal_bar_points ?T1_horizontal_bar_points .        }
gymnast,Return the average horizontal bar points across all gymnasts.,SELECT (avg( ?T1_horizontal_bar_points) as ?aggregation_T1_horizontal_bar_points_135 ) WHERE { ?T1 a :gymnast . ?T1 :gymnast\#horizontal_bar_points ?T1_horizontal_bar_points .        }
gymnast,What are the names of people in ascending alphabetical order?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
gymnast,What are the names of gymnasts?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name .        }
gymnast,What are the names of gymnasts whose hometown is not 'Santo Domingo'?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#hometown ?T1_hometown . FILTER(?T1_hometown != 'Santo Domingo') .        }
gymnast,What is the age of the tallest person?,SELECT ?T1_age WHERE { ?T1 a :people . ?T1 :people\#age ?T1_age . ?T1 :people\#height ?T1_height .        }   ORDER BY DESC (?T1_height) LIMIT 1
gymnast,List the names of the top 5 oldest people.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
gymnast,What are the names of the five oldest people?,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
gymnast,What is the total point count of the youngest gymnast?,SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T2 a :people . ?T1 :gymnast\#ref-gymnast_id ?T2 .  ?T1 :gymnast\#total_points ?T1_total_points . ?T2 :people\#age ?T2_age .        }   ORDER BY ASC (?T2_age) LIMIT 1
gymnast,What is the average age of all gymnasts?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_30 ) WHERE { ?T1 a :people . ?T1 :people\#age ?T1_age .        }
gymnast,Return the average age across all gymnasts.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_172 ) WHERE { ?T1 a :people . ?T1 :people\#age ?T1_age .        }
gymnast,Give the different hometowns of gymnasts that have a total point score of above 57.5.,SELECT DISTINCT ?T1_hometown WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\#ref-gymnast_id ?T1 .  ?T1 :people\#hometown ?T1_hometown . ?T2 :gymnast\#total_points ?T2_total_points . FILTER(?T2_total_points > 57.5) .        }
gymnast,How many gymnasts are from each hometown?,SELECT ?T1_hometown (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\#ref-gymnast_id ?T1 .  ?T1 :people\#hometown ?T1_hometown .        } GROUP BY ?T1_hometown
gymnast,What is the most common hometown of gymnasts?,SELECT ?T1_hometown (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\#ref-gymnast_id ?T1 .  ?T1 :people\#hometown ?T1_hometown .        } GROUP BY ?T1_hometown  ORDER BY DESC (?aggregation_all) LIMIT 1
gymnast,What are the hometowns that are shared by at least two gymnasts?,SELECT ?T1_hometown WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\#ref-gymnast_id ?T1 .  ?T1 :people\#hometown ?T1_hometown .        } GROUP BY ?T1_hometown   HAVING(count( *)  >= 2)
gymnast,List the names of gymnasts in ascending order by their heights.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#height ?T1_height .        }  ORDER BY ASC (?T1_height)
gymnast,List the distinct hometowns that are not associated with any gymnast.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_hometown as ?col1) WHERE { ?T1 a :people . ?T1 :people\#hometown ?T1_hometown .   }}  MINUS {SELECT DISTINCT (?T2_hometown as ?col1) WHERE { ?T2 a :people . ?T2 :people\#hometown ?T2_hometown .        }     } }
gymnast,From which hometowns did no gymnasts come from?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_hometown as ?col1) WHERE { ?T1 a :people . ?T1 :people\#hometown ?T1_hometown .   }}  MINUS {SELECT DISTINCT (?T2_hometown as ?col1) WHERE { ?T2 a :people . ?T2 :people\#hometown ?T2_hometown .        }     } }
gymnast,Show the hometowns shared by people older than 23 and younger than 20.,SELECT DISTINCT ?T1_hometown WHERE { ?T1 a :people . ?T1 :people\#hometown ?T1_hometown . ?T1 :people\#age ?T1_age . FILTER(?T1_age > 23) . FILTER (?T1_hometown in (?T2_hometown)) .   ?T2 a :people . ?T2 :people\#hometown ?T2_hometown . ?T2 :people\#age ?T2_age .  FILTER(?T2_age < 20) .             }
gymnast,How many distinct hometowns did these people have?,SELECT DISTINCT (count(DISTINCT ?T1_hometown) as ?aggregation_T1_hometown_154 ) WHERE { ?T1 a :people . ?T1 :people\#hometown ?T1_hometown .        }
gymnast,Count the number of different hometowns of these people.,SELECT DISTINCT (count(DISTINCT ?T1_hometown) as ?aggregation_T1_hometown_155 ) WHERE { ?T1 a :people . ?T1 :people\#hometown ?T1_hometown .        }
gymnast,Show the ages of gymnasts in descending order of total points.,SELECT ?T1_age WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :gymnast\#ref-gymnast_id ?T1 .  ?T1 :people\#age ?T1_age . ?T2 :gymnast\#total_points ?T2_total_points .        }  ORDER BY DESC (?T2_total_points)
small_bank_1,Find the total savings balance of all accounts except the account with name Brown.,SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_80 ) WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\#ref-custid ?T2 .  ?T1 :savings\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name . FILTER(?T2_name != 'Brown') .        }
small_bank_1,How many accounts are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts .        }
small_bank_1,What is the total checking balance in all accounts?,SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_161 ) WHERE { ?T1 a :checking . ?T1 :checking\#balance ?T1_balance .        }
small_bank_1,Find the total balance across checking accounts.,SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_157 ) WHERE { ?T1 a :checking . ?T1 :checking\#balance ?T1_balance .        }
small_bank_1,Find the average checking balance.,SELECT (avg( ?T1_balance) as ?aggregation_T1_balance_114 ) WHERE { ?T1 a :checking . ?T1 :checking\#balance ?T1_balance .        }
small_bank_1,What is the average balance in checking accounts?,SELECT (avg( ?T1_balance) as ?aggregation_T1_balance_185 ) WHERE { ?T1 a :checking . ?T1 :checking\#balance ?T1_balance .        }
small_bank_1,Find the number of accounts with a savings balance that is higher than the average savings balance.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :savings . ?T1 :savings\#balance ?T1_balance . FILTER(?T1_balance > (?aggregation_T22_balance_128)) .       {SELECT (avg( ?T22_balance) as ?aggregation_T22_balance_128 ) WHERE { ?T22 a :savings . ?T22 :savings\#balance ?T22_balance .        }    } }
small_bank_1,Find the name and id of accounts whose checking balance is below the maximum checking balance.,SELECT ?T1_custid ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#custid ?T1_custid . ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_58)) .       {SELECT (max( ?T23_balance) as ?aggregation_T23_balance_58 ) WHERE { ?T23 a :checking . ?T23 :checking\#balance ?T23_balance .        }    } }
small_bank_1,Find the balance of the checking account belonging to an owner whose name contains 'ee'.,"SELECT ?T1_balance WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :checking\#ref-custid ?T2 .  ?T1 :checking\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name . FILTER(contains (?T2_name, 'ee')) .        }"
small_bank_1,Find the checking balance and saving balance in the Browns account.,SELECT ?T1_balance ?T2_balance WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :checking\#ref-custid ?T3 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T3 :accounts\#name ?T3_name . ?T2 a :savings . ?T2 :savings\#ref-custid ?T3 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T3 :accounts\#name ?T3_name . FILTER(?T3_name = 'Brown') .        }
small_bank_1,"Find the names of accounts whose checking balance is above the average checking balance, but savings balance is below the average savings balance.",SELECT DISTINCT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :savings\#balance ?T2_balance . FILTER(?T2_balance > (?aggregation_T23_balance_32)) . FILTER (?T1_name in (?T4_name)) .   ?T3 a :accounts . ?T4 a :savings . ?T4 :savings\#ref-custid ?T3 .  ?T3 :accounts\#name ?T3_name . ?T4 :savings\#balance ?T4_balance .  FILTER(?T4_balance < (?aggregation_T25_balance_92)) .            { ?T23 a :checking . ?T23 :checking\#balance ?T23_balance .        } }
small_bank_1,What are the names of accounts with checking balances greater than the average checking balance and savings balances below the average savings balance?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :savings\#balance ?T2_balance . FILTER(?T2_balance > (?aggregation_T23_balance_33)) . FILTER (?T1_name in (?T4_name)) .   ?T3 a :accounts . ?T4 a :savings . ?T4 :savings\#ref-custid ?T3 .  ?T3 :accounts\#name ?T3_name . ?T4 :savings\#balance ?T4_balance .  FILTER(?T4_balance < (?aggregation_T25_balance_23)) .            { ?T23 a :checking . ?T23 :checking\#balance ?T23_balance .        } }
small_bank_1,Find the checking balance of the accounts whose savings balance is higher than the average savings balance.,SELECT ?T1_balance WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\#ref-custid ?T2 .  ?T1 :savings\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name . FILTER(?T2_name in (?aggregation_T45_balance_110)) .       {SELECT ?T23_name WHERE { ?T23 a :accounts . ?T24 a :savings . ?T24 :savings\#ref-custid ?T23 .  ?T23 :accounts\#name ?T23_name . ?T24 :savings\#balance ?T24_balance . FILTER(?T24_balance > (?aggregation_T45_balance_110)) .       {SELECT (avg( ?T45_balance) as ?aggregation_T45_balance_110 ) WHERE { ?T45 a :savings . ?T45 :savings\#balance ?T45_balance .        }    } }    } }
small_bank_1,What are the balances of checking accounts belonging to people with savings balances greater than the average savings balance?,SELECT ?T1_balance WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\#ref-custid ?T2 .  ?T1 :savings\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name . FILTER(?T2_name in (?aggregation_T45_balance_179)) .       {SELECT ?T23_name WHERE { ?T23 a :accounts . ?T24 a :savings . ?T24 :savings\#ref-custid ?T23 .  ?T23 :accounts\#name ?T23_name . ?T24 :savings\#balance ?T24_balance . FILTER(?T24_balance > (?aggregation_T45_balance_179)) .       {SELECT (avg( ?T45_balance) as ?aggregation_T45_balance_179 ) WHERE { ?T45 a :savings . ?T45 :savings\#balance ?T45_balance .        }    } }    } }
small_bank_1,List all customers names in the alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :accounts . ?T1 :accounts\#name ?T1_name . ?T1 :accounts\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
small_bank_1,What are the names of all the customers in alphabetical order?,SELECT ?T1_name WHERE { ?T1 a :accounts . ?T1 :accounts\#name ?T1_name . ?T1 :accounts\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
small_bank_1,Find the name of account that has the lowest total checking and saving balance.,SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance .        }   ORDER BY ASC (?T2_balance + ?T3_balance) LIMIT 1
small_bank_1,Find the names and total checking and savings balances of accounts whose savings balance is higher than the average savings balance.,SELECT ?T1_name ?T2_balance + ?T3_balance WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance . ?T3 :savings\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance . ?T3 :savings\#balance ?T3_balance . FILTER(?T3_balance > (?aggregation_T24_balance_44)) .       {SELECT (avg( ?T24_balance) as ?aggregation_T24_balance_44 ) WHERE { ?T24 a :savings . ?T24 :savings\#balance ?T24_balance .        }    } }
small_bank_1,What are the names and sum of checking and savings balances for accounts with savings balances higher than the average savings balance?,SELECT ?T1_name ?T2_balance + ?T3_balance WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance . ?T3 :savings\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance . ?T3 :savings\#balance ?T3_balance . FILTER(?T3_balance > (?aggregation_T24_balance_6)) .       {SELECT (avg( ?T24_balance) as ?aggregation_T24_balance_6 ) WHERE { ?T24 a :savings . ?T24 :savings\#balance ?T24_balance .        }    } }
small_bank_1,Find the name and checking balance of the account with the lowest savings balance.,SELECT ?T1_name ?T2_balance WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . ?T3 :savings\#balance ?T3_balance .        }   ORDER BY ASC (?T3_balance) LIMIT 1
small_bank_1,Find the number of checking accounts for each account name.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :checking\#ref-custid ?T2 .  ?T2 :accounts\#name ?T2_name .        } GROUP BY ?T2_name
small_bank_1,Find the total saving balance for each account name.,SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_167 ) ?T2_name WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :savings\#ref-custid ?T2 .  ?T1 :savings\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name .        } GROUP BY ?T2_name
small_bank_1,Find the name of accounts whose checking balance is below the average checking balance.,SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_73)) .       {SELECT (avg( ?T23_balance) as ?aggregation_T23_balance_73 ) WHERE { ?T23 a :checking . ?T23 :checking\#balance ?T23_balance .        }    } }
small_bank_1,Find the saving balance of the account with the highest checking balance.,SELECT ?T1_balance WHERE { ?T1 a :savings . ?T13 a :accounts . ?T1 :savings\#ref-custid ?T13 .  ?T1 :savings\#balance ?T1_balance . ?T2 :checking\#balance ?T2_balance . ?T2 a :checking . ?T2 :checking\#ref-custid ?T13 .  ?T1 :savings\#balance ?T1_balance . ?T2 :checking\#balance ?T2_balance .        }   ORDER BY DESC (?T2_balance) LIMIT 1
small_bank_1,Find the total checking and saving balance of all accounts sorted by the total balance in ascending order.,SELECT ?T1_balance + ?T2_balance WHERE { ?T1 a :checking . ?T13 a :accounts . ?T1 :checking\#ref-custid ?T13 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T1 :checking\#balance ?T1_balance . ?T2 a :savings . ?T2 :savings\#ref-custid ?T13 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T1 :checking\#balance ?T1_balance .        }  ORDER BY ASC (?T1_balance + ?T2_balance)
small_bank_1,Find the name and checking balance of the account with the lowest saving balance.,SELECT ?T1_balance ?T2_name WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :checking\#ref-custid ?T2 .  ?T1 :checking\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name . ?T3 :savings\#balance ?T3_balance . ?T3 a :savings . ?T3 :savings\#ref-custid ?T2 .  ?T1 :checking\#balance ?T1_balance . ?T2 :accounts\#name ?T2_name . ?T3 :savings\#balance ?T3_balance .        }   ORDER BY ASC (?T3_balance) LIMIT 1
small_bank_1,"Find the name, checking balance and saving balance of all accounts in the bank.",SELECT ?T1_balance ?T2_balance ?T3_name WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :checking\#ref-custid ?T3 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T3 :accounts\#name ?T3_name . ?T2 a :savings . ?T2 :savings\#ref-custid ?T3 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T3 :accounts\#name ?T3_name .        }
small_bank_1,"Find the name, checking balance and savings balance of all accounts in the bank sorted by their total checking and savings balance in descending order.",SELECT ?T1_balance ?T2_balance ?T3_name WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :checking\#ref-custid ?T3 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T3 :accounts\#name ?T3_name . ?T1 :checking\#balance ?T1_balance . ?T2 a :savings . ?T2 :savings\#ref-custid ?T3 .  ?T1 :checking\#balance ?T1_balance . ?T2 :savings\#balance ?T2_balance . ?T3 :accounts\#name ?T3_name . ?T1 :checking\#balance ?T1_balance .        }  ORDER BY DESC (?T1_balance + ?T2_balance)
