kg_name,question,query
scholar,When was Michael Stonebraker GIS Database published ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Michael Stonebraker' && ?T3_keyphrasename = 'GIS Database') .        }
scholar,When did Michael Stonebraker publish his GIS Database paper ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Michael Stonebraker' && ?T3_keyphrasename = 'GIS Database') .        }
scholar,When does Michael Stonebraker publish the GIS Database paper ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Michael Stonebraker' && ?T3_keyphrasename = 'GIS Database') .        }
scholar,In 2010 what journal published an article about Trophic Cascade ?,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T2_keyphrasename = 'Trophic Cascade' && ?T1_year = 2010) .        }
scholar,What is the most popular paper this year in CVPR ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_67 ) WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2016 && ?T3_venuename = 'CVPR') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_83 ))
scholar,How many citations does luke zettlemoyer have per year,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_132 ) ?T2_year WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T14 :writes\#ref-aid ?T3 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'luke zettlemoyer') .        } GROUP BY ?T2_year
scholar,authors working on ImageNet,SELECT DISTINCT ?T1_paperid WHERE { ?T2 :dataset\#ref-writes_id ?T1 . FILTER(?T2_datasetname = 'ImageNet') .        }
scholar,Where did sergey levine publish his last paper ?,SELECT DISTINCT ?T1_venueid ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'sergey levine') .        }  ORDER BY DESC (?T1_year)
scholar,keyphrases used by dan klein in his emnlp papers,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :paperkeyphrase . ?T14 a :paper . ?T1 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T14 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T14 :paper\#ref-venueid ?T3 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'dan klein' && ?T3_venuename = 'emnlp') .        }
scholar,Who are the prominent researchers in Neutralizing Antibody in 2012 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_154 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T3_keyphrasename = 'Neutralizing Antibody' && ?T1_year = 2012) .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_132 ))
scholar,the papers at eccv in 2014 using ImageNet dataset,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_datasetname = 'ImageNet' && ?T1_year = 2014 && ?T3_venuename = 'eccv') .        }
scholar,which papers in eccv 2014 use ImageNet ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_datasetname = 'ImageNet' && ?T1_year = 2014 && ?T3_venuename = 'eccv') .        }
scholar,Euclidean Distance papers citing NIPS papers,SELECT DISTINCT ?T1_citingpaperid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\#ref-citedpaperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T14 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Euclidean Distance' && ?T3_venuename = 'NIPS') .        }
scholar,top authors working on ImageNet ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_1 ) ?T2_paperid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#paperid ?T2_paperid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :dataset\#datasetname ?T3_datasetname . FILTER(?T3_datasetname = 'ImageNet') .        } GROUP BY ?T2_paperid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_191 ))
scholar,how many ACL 2012 papers have more than 7 citations ?,SELECT DISTINCT ?T1_paperid (count(DISTINCT ?T2_citingpaperid) as ?aggregation_T2_citingpaperid_165 ) WHERE { ?T1 a :paper . ?T2 a :cite . ?T2 :cite\#ref-citedpaperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 :cite\#citingpaperid ?T2_citingpaperid . FILTER(?T1_year = 2012 && ?T3_venuename = 'ACL') .        } GROUP BY ?T1_paperid   HAVING(count( ?T2_citingpaperid) as ?aggregation_T2_citingpaperid_15 ) > 7)
scholar,What was the topic of best paper in 2012 EMNLP-CoNLL ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_20 ) ?T2_keyphraseid ?T3_paperid WHERE { ?T1 a :cite . ?T3 a :paper . ?T1 :cite\#ref-citedpaperid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paperkeyphrase\#keyphraseid ?T2_keyphraseid . ?T3 :paper\#paperid ?T3_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :paper\#year ?T3_year . ?T4 :venue\#venuename ?T4_venuename . ?T2 a :paperkeyphrase . ?T2 :paperkeyphrase\#ref-paperid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paperkeyphrase\#keyphraseid ?T2_keyphraseid . ?T3 :paper\#paperid ?T3_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :paper\#year ?T3_year . ?T4 :venue\#venuename ?T4_venuename . ?T4 a :venue . ?T3 :paper\#ref-venueid ?T4 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paperkeyphrase\#keyphraseid ?T2_keyphraseid . ?T3 :paper\#paperid ?T3_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :paper\#year ?T3_year . ?T4 :venue\#venuename ?T4_venuename . FILTER(?T3_year = 2012 && ?T4_venuename = 'EMNLP-CoNLL') .        } GROUP BY ?T2_keyphraseid ?T3_paperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_25 ))
scholar,How many papers has Noah Smith co-authored since 2009 ?,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_14 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T1 :writes\#paperid ?T1_paperid . ?T3 a :paper . ?T1 :writes\#ref-paperid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T1 :writes\#paperid ?T1_paperid . FILTER(?T2_authorname != 'Noah Smith' && ?T3_year > 2009 && ?T1_paperid in (?T25_authorname)) .       {SELECT ?T24_paperid WHERE { ?T24 a :writes . ?T25 a :author . ?T24 :writes\#ref-aid ?T25 .  ?T24 :writes\#paperid ?T24_paperid . ?T25 :author\#authorname ?T25_authorname . FILTER(contains (?T25_authorname, 'Noah Smith')) .        }    } }"
scholar,Number of ACL papers with more than 2 citations,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_148 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T1 :cite\#citedpaperid ?T1_citedpaperid . FILTER(?T2_venuename = 'ACL') .        } GROUP BY (count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_60 )   HAVING(count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_111 ) > 2)
scholar,What is the name of Eric C. Kerrigan 's Liquid Automatica paper ?,"SELECT DISTINCT ?T1_title WHERE { ?T1 a :paper . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T1 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T4 :venue\#venuename ?T4_venuename . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T4 :venue\#venuename ?T4_venuename . ?T16 a :paperkeyphrase . ?T16 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T4 :venue\#venuename ?T4_venuename . ?T3 a :keyphrase . ?T16 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T4 :venue\#venuename ?T4_venuename . ?T4 a :venue . ?T1 :paper\#ref-venueid ?T4 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T4 :venue\#venuename ?T4_venuename . FILTER(contains (?T2_authorname, 'Eric C. Kerrigan') && ?T3_keyphrasename = 'Liquid' && ?T4_venuename = 'Automatica') .        }"
scholar,How many papers used ImageNet datasets in cvpr ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_20 ) WHERE { ?T1 a :paper . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_datasetname = 'ImageNet' && ?T3_venuename = 'cvpr') .        }
scholar,What venues are for Neuroscience ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :venue . ?T1 :venue\#venueid ?T1_venueid . ?T1 :venue\#venuename ?T1_venuename . FILTER(?T1_venuename = 'Neuroscience') .        }
scholar,When was the last time Mary Crainie published a paper ?,SELECT DISTINCT (max(DISTINCT ?T1_year) as ?aggregation_T1_year_179 ) WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Mary Crainie') .        }
scholar,I want the co-authors of papers on Machine Translation Output with Philipp Koehn,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paper . ?T13 :writes\#ref-paperid ?T14 .  ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T1_authorname = 'Philipp Koehn' && ?T2_keyphrasename = 'Machine Translation Output') .        }
scholar,How many papers does Samuel Madden publish outside of PVLDB area ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_181 ) WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Samuel Madden' && ?T3_venuename != 'PVLDB') .        }
scholar,which journal did Donald E Knuth publish his last paper ?,SELECT DISTINCT ?T1_journalid ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Donald E Knuth') .        }  ORDER BY DESC (?T1_year)
scholar,What is the venue of Fracture of acrylic bone cement ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T1 :paper\#venueid ?T1_venueid . ?T1 :paper\#title ?T1_title . FILTER(?T1_title = 'Fracture of acrylic bone cement') .        }
scholar,How many authors published at sigcse in 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_133 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2010 && ?T2_venuename = 'sigcse') .        }
scholar,What is the year of publication of ' A Switching Architecture For ISDN ' ?,SELECT DISTINCT ?T1_title ?T1_year WHERE { ?T1 a :paper . ?T1 :paper\#title ?T1_title . ?T1 :paper\#year ?T1_year . ?T1 :paper\#title ?T1_title . FILTER(?T1_title = 'A Switching Architecture For ISDN') .        }
scholar,what keywords are used by papers at uist,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :keyphrase . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T1 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :venue\#venuename ?T2_venuename . ?T14 a :paper . ?T13 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T14 :paper\#ref-venueid ?T2 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'uist') .        }
scholar,papers in semantic parsing for each year,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_139 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'semantic parsing') .        } GROUP BY ?T1_year ORDER BY DESC (?T1_year)
scholar,What is the most cited paper at sigcomm ?,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_7 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'sigcomm') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_65 ))
scholar,What is the name of Ranjit Jhala 's Liquid Haskell paper ?,"SELECT DISTINCT ?T1_title WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(contains (?T2_authorname, 'Ranjit Jhala') && ?T3_keyphrasename = 'Liquid Haskell') .        }"
yelp,List all the businesses with more than 4.5 stars,SELECT ?T1_name WHERE { ?T1 a :business . ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . FILTER(?T1_rating > 4.5) .        }
yelp,List all businesses with rating 3.5,SELECT ?T1_name WHERE { ?T1 a :business . ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . FILTER(?T1_rating = 3.5) .        }
yelp,List all user ids with name Michelle,SELECT ?T1_user_id WHERE { ?T1 a :users . ?T1 :users\#user_id ?T1_user_id . ?T1 :users\#name ?T1_name . FILTER(?T1_name = 'Michelle') .        }
yelp,Find all states in which there is a Whataburger,SELECT ?T1_state WHERE { ?T1 a :business . ?T1 :business\#state ?T1_state . ?T1 :business\#name ?T1_name . FILTER(?T1_name = 'Whataburger') .        }
yelp,Find all cities in which there is a restaurant called ' MGM Grand Buffet ',SELECT ?T1_city WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_name = 'MGM Grand Buffet' && ?T2_category_name = 'category_category_name0') .        }
yelp,Find the cities of businesses rated below 1.5,SELECT ?T1_city WHERE { ?T1 a :business . ?T1 :business\#city ?T1_city . ?T1 :business\#rating ?T1_rating . FILTER(?T1_rating < 1.5) .        }
yelp,Find all cities which has a ' Taj Mahal ' .,SELECT ?T1_city WHERE { ?T1 a :business . ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . FILTER(?T1_name = 'Taj Mahal') .        }
yelp,List all the reviews which rated a business less than 1,SELECT ?T1_text WHERE { ?T1 a :review . ?T1 :review\#text ?T1_text . ?T1 :review\#rating ?T1_rating . FILTER(?T1_rating < 1) .        }
yelp,List all the restaurant rated more than 3.5,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_rating > 3.5 && ?T2_category_name = 'restaurant') .        }
yelp,find all cities which has a ' Taj Mahal ' restaurant,SELECT ?T1_city WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_name = 'Taj Mahal' && ?T2_category_name = 'restaurant') .        }
yelp,list all the reviews by Niloofar,SELECT ?T1_text WHERE { ?T2 :users\#ref-review_id ?T1 . FILTER(?T2_name = 'Niloofar') .        }
yelp,list all the businesses which have a review by Niloofar,SELECT ?T1_name WHERE { ?T2 :users\#ref-business_id ?T1 . FILTER(?T2_name = 'Niloofar') .        }
yelp,list all the businesses which Niloofar rated 5,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :review . ?T2 :review\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :review\#rating ?T2_rating . ?T3 :users\#name ?T3_name . FILTER(?T2_rating = 5 && ?T3_name = 'Niloofar') .        }
yelp,List all the reviews by Michelle for Italian restaurant,SELECT ?T1_text WHERE { ?T1 a :review . ?T14 a :business . ?T1 :review\#ref-business_id ?T14 .  ?T1 :review\#text ?T1_text . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . ?T3 :users\#name ?T3_name . ?T2 a :category . ?T2 :category\#ref-business_id ?T14 .  ?T1 :review\#text ?T1_text . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . ?T3 :users\#name ?T3_name . FILTER(?T2_category_name = 'Italian' && ?T2_category_name = 'category_category_name1' && ?T3_name = 'Michelle') .        }
yelp,find the number of reviews written for ' Cafe Zinho ' restaurant in Texas,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_90 ) WHERE { ?T1 a :review . ?T2 a :business . ?T1 :review\#ref-business_id ?T2 .  ?T1 :review\#text ?T1_text . ?T2 :business\#name ?T2_name . ?T2 :business\#state ?T2_state . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :review\#text ?T1_text . ?T2 :business\#name ?T2_name . ?T2 :business\#state ?T2_state . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_name = 'Cafe Zinho' && ?T2_state = 'Texas' && ?T3_category_name = 'restaurant') .        }
yelp,List all 5 star Italian restaurant,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_rating = 5 && ?T2_category_name = 'Italian' && ?T2_category_name = 'restaurant') .        }
yelp,List all the neighbourhoods with Italian restaurant in Madison,SELECT ?T1_neighbourhood_name WHERE { ?T1 a :neighbourhood . ?T2 a :business . ?T1 :neighbourhood\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_city = 'Madison' && ?T3_category_name = 'Italian' && ?T3_category_name = 'restaurant') .        }
yelp,List all the neighbourhoods with Italian restaurant rated less than 2.5 in Madison,SELECT ?T1_neighbourhood_name WHERE { ?T1 a :neighbourhood . ?T2 a :business . ?T1 :neighbourhood\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#city ?T2_city . ?T2 :business\#rating ?T2_rating . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#city ?T2_city . ?T2 :business\#rating ?T2_rating . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_city = 'Madison' && ?T2_rating < 2.5 && ?T3_category_name = 'Italian' && ?T3_category_name = 'restaurant') .        }
yelp,find all the restaurant in Pennsylvania,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#state ?T1_state . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_state = 'Pennsylvania' && ?T2_category_name = 'restaurant') .        }
yelp,Find all the reviews for all Pet Groomers with more than 100 reviews,SELECT ?T1_text WHERE { ?T1 a :review . ?T2 a :business . ?T1 :review\#ref-business_id ?T2 .  ?T1 :review\#text ?T1_text . ?T2 :business\#review_count ?T2_review_count . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :review\#text ?T1_text . ?T2 :business\#review_count ?T2_review_count . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_review_count > 100 && ?T3_category_name = 'Pet Groomers') .        }
yelp,What are all the breweries in ' Los Angeles ' ?,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Los Angeles' && ?T2_category_name = 'breweries') .        }
yelp,Find all users who reviewed restaurant ' Mesa Grill ',SELECT ?T1_name WHERE { ?T2 a :business . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_name = 'Mesa Grill' && ?T3_category_name = 'restaurant') .        }
yelp,List the addresses of all Walmart in ' Los Angeles ',SELECT ?T1_full_address WHERE { ?T1 a :business . ?T1 :business\#full_address ?T1_full_address . ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . FILTER(?T1_city = 'Los Angeles' && ?T1_name = 'Walmart') .        }
yelp,Find all restaurant reviewed by Patrick in ' Dallas ',SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . ?T3 :users\#name ?T3_name . FILTER(?T1_city = 'Dallas' && ?T2_category_name = 'restaurant' && ?T3_name = 'Patrick') .        }
yelp,Which restaurant in Dallas were reviewed by user Patrick ?,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . ?T3 :users\#name ?T3_name . FILTER(?T1_city = 'Dallas' && ?T2_category_name = 'restaurant' && ?T3_name = 'Patrick') .        }
yelp,Find all Bars reviewed by Patrick,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name . ?T3 :users\#name ?T3_name . FILTER(?T2_category_name = 'Bars' && ?T3_name = 'Patrick') .        }
yelp,Find all Bars reviewed by Patrick with at least 3 stars,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . ?T3 :users\#name ?T3_name . FILTER(?T1_rating >= 3 && ?T2_category_name = 'Bars' && ?T3_name = 'Patrick') .        }
