kg_name,question,query
scholar,How many papers does Christopher D. Manning have ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_83 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,How many papers has Christopher D. Manning ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_77 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,How many papers has Christopher D. Manning published ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_20 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,Has Christopher D. Manning published any papers ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_50 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,How many paper does Christopher D. Manning have ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_112 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,How many publications does Christopher D. Manning have ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_67 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,How many papers does Christopher D. Manning have,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_36 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,number of papers written by Christopher D. Manning,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_70 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Christopher D. Manning') .        }
scholar,what kind of papers does Luke Zettlemoyer publish,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :keyphrase . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T1 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :paper . ?T13 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Luke Zettlemoyer') .        }
scholar,What keywords are in papers by Luke Zettlemoyer ?,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :keyphrase . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T1 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :paper . ?T13 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Luke Zettlemoyer') .        }
scholar,What topic does Luke Zettlemoyer write about ?,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :keyphrase . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T1 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :paper . ?T13 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T14 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :keyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Luke Zettlemoyer') .        }
scholar,What conference does Daniella Coelho publish in ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniella Coelho') .        }
scholar,In which conferences does Daniella Coelho typically publish ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniella Coelho') .        }
scholar,in what conferences does Daniella Coelho publish ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniella Coelho') .        }
scholar,What conferences does Daniella Coelho publish in ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniella Coelho') .        }
scholar,At which conferences does Daniella Coelho publish ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniella Coelho') .        }
scholar,What conferences does Daniella Coelho submit to ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Daniella Coelho') .        }
scholar,How many papers are there ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_100 ) WHERE { ?T1 a :paper . ?T1 :paper\#paperid ?T1_paperid .        }
scholar,How many papers by Ed Desmond contain the keyphrases Semantic Parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_9 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paper . ?T1 :writes\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Ed Desmond' && ?T3_keyphrasename = 'Semantic Parsing') .        }
scholar,How many papers does Ed Desmond have in Semantic Parsing area ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_45 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paper . ?T1 :writes\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Ed Desmond' && ?T3_keyphrasename = 'Semantic Parsing') .        }
scholar,How many Semantic Parsing papers has Ed Desmond written ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_142 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paper . ?T1 :writes\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Ed Desmond' && ?T3_keyphrasename = 'Semantic Parsing') .        }
scholar,How many paper has Ed Desmond written about Semantic Parsing ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_100 ) WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paper . ?T1 :writes\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Ed Desmond' && ?T3_keyphrasename = 'Semantic Parsing') .        }
scholar,What conferences did li dong submit to in 2016 ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'li dong' && ?T1_year = 2016) .        }
scholar,What conferences did li dong publish in in 2016 ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'li dong' && ?T1_year = 2016) .        }
scholar,Where did li dong publish in 2016 ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'li dong' && ?T1_year = 2016) .        }
scholar,acl papers in 2012 on Parsing,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Parsing' && ?T1_year = 2012 && ?T3_venuename = 'acl') .        }
scholar,What papers were published in acl in 2012 about Parsing ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Parsing' && ?T1_year = 2012 && ?T3_venuename = 'acl') .        }
scholar,What papers were published at acl in 2012 were about Parsing ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Parsing' && ?T1_year = 2012 && ?T3_venuename = 'acl') .        }
scholar,how many Parsing papers did acl 2012 have ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Parsing' && ?T1_year = 2012 && ?T3_venuename = 'acl') .        }
scholar,which papers in acl 2012 had Parsing in them ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Parsing' && ?T1_year = 2012 && ?T3_venuename = 'acl') .        }
scholar,what were some Parsing based papers in acl 2012 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'Parsing' && ?T1_year = 2012 && ?T3_venuename = 'acl') .        }
scholar,List the popular publications on dependent types,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'dependent types') .        }
scholar,Which paper should I read about dependent types ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'dependent types') .        }
scholar,What papers talk about Question Answering ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Question Answering') .        }
scholar,What is the paper about Question Answering ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Question Answering') .        }
scholar,Which papers are about about Question Answering ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Question Answering') .        }
scholar,keyphrases used by Luke S Zettlemoyer for each year,SELECT DISTINCT ?T1_keyphraseid ?T2_year WHERE { ?T1 a :paperkeyphrase . ?T2 a :paper . ?T1 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T14 :writes\#ref-aid ?T3 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Luke S Zettlemoyer') .        }  ORDER BY ASC (?T2_year)
scholar,recent research interests of sanjeev arora,SELECT DISTINCT ?T1_keyphrasename ?T2_year WHERE { ?T1 a :keyphrase . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T1 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T2 a :paper . ?T14 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T2 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T15 :writes\#ref-aid ?T3 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'sanjeev arora') .        }  ORDER BY DESC (?T2_year)
scholar,list papers published by balakrishnan prabhakaran,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'balakrishnan prabhakaran') .        }
scholar,subhasis chaudhuri,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'subhasis chaudhuri') .        }
scholar,how many parsing papers in ACL 2014,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_185 ) WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'parsing' && ?T1_year = 2014 && ?T3_venuename = 'ACL') .        }
scholar,how many parsing papers appeared in the proceeeding of ACL 2014 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_107 ) WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'parsing' && ?T1_year = 2014 && ?T3_venuename = 'ACL') .        }
scholar,how many parsing papers were published at ACL 2014 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_97 ) WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'parsing' && ?T1_year = 2014 && ?T3_venuename = 'ACL') .        }
scholar,brian curless convolution paper,SELECT DISTINCT ?T1_authorid ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname = 'brian curless' && ?T3_keyphrasename = 'convolution') .        }
scholar,What are the papers of brian curless in convolution ?,SELECT DISTINCT ?T1_authorid ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname = 'brian curless' && ?T3_keyphrasename = 'convolution') .        }
scholar,What is the paper about convolution from brian curless ?,SELECT DISTINCT ?T1_authorid ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname = 'brian curless' && ?T3_keyphrasename = 'convolution') .        }
scholar,What papers has brian curless written on convolution ?,SELECT DISTINCT ?T1_authorid ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname = 'brian curless' && ?T3_keyphrasename = 'convolution') .        }
scholar,What papers has brian curless written about convolution ?,SELECT DISTINCT ?T1_authorid ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname = 'brian curless' && ?T3_keyphrasename = 'convolution') .        }
