kg_name,question,query
game_1,"Show the average, minimum, and maximum age for different majors.",SELECT ?T1_major (avg( ?T1_age) as ?aggregation_T1_age_16 ) (min( ?T1_age) as ?aggregation_T1_age_173 ) (max( ?T1_age) as ?aggregation_T1_age_74 ) WHERE { ?T1 a :student . ?T1 :student\#major ?T1_major . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age . ?T1 :student\#age ?T1_age .        } GROUP BY ?T1_major
game_1,How many sports do we have?,SELECT DISTINCT (count(DISTINCT ?T1_sportname) as ?aggregation_T1_sportname_131 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#sportname ?T1_sportname .        }
game_1,How many different types of sports do we offer?,SELECT DISTINCT (count(DISTINCT ?T1_sportname) as ?aggregation_T1_sportname_149 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#sportname ?T1_sportname .        }
game_1,How many students play sports?,SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_169 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid .        }
game_1,How many different students are involved in sports?,SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_152 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid .        }
game_1,List ids for all student who are on scholarship.,SELECT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid . ?T1 :sportsinfo\#onscholarship ?T1_onscholarship . FILTER(?T1_onscholarship = 'Y') .        }
game_1,What are the ids for all sporty students who are on scholarship?,SELECT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid . ?T1 :sportsinfo\#onscholarship ?T1_onscholarship . FILTER(?T1_onscholarship = 'Y') .        }
game_1,Show last names for all student who are on scholarship.,SELECT ?T1_lname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :sportsinfo\#ref-stuid ?T1 .  ?T1 :student\#lname ?T1_lname . ?T2 :sportsinfo\#onscholarship ?T2_onscholarship . FILTER(?T2_onscholarship = 'Y') .        }
game_1,What are the last names for all scholarship students?,SELECT ?T1_lname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :sportsinfo\#ref-stuid ?T1 .  ?T1 :student\#lname ?T1_lname . ?T2 :sportsinfo\#onscholarship ?T2_onscholarship . FILTER(?T2_onscholarship = 'Y') .        }
game_1,How many games are played for all students?,SELECT (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_44 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#gamesplayed ?T1_gamesplayed .        }
game_1,What is the total number of games played?,SELECT (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_95 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#gamesplayed ?T1_gamesplayed .        }
game_1,Show all sport name and the number of students.,SELECT ?T1_sportname (count( *) as ?aggregation_all) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#sportname ?T1_sportname .        } GROUP BY ?T1_sportname
game_1,How many students play each sport?,SELECT ?T1_sportname (count( *) as ?aggregation_all) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#sportname ?T1_sportname .        } GROUP BY ?T1_sportname
game_1,Show all student IDs with the number of sports and total number of games played,SELECT ?T1_stuid (count( *) as ?aggregation_all) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_110 ) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid . ?T1 :sportsinfo\#gamesplayed ?T1_gamesplayed .        } GROUP BY ?T1_stuid
game_1,Show all student IDs with more than total 10 hours per week on all sports played.,SELECT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid . ?T1 :sportsinfo\#hoursperweek ?T1_hoursperweek .        } GROUP BY ?T1_stuid   HAVING(sum( ?T1_hoursperweek)  > 10)
game_1,What is the first name and last name of the student who have most number of sports?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :sportsinfo\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
game_1,What is the first and last name of the student who played the most sports?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :sportsinfo\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
game_1,Which sport has most number of students on scholarship?,SELECT ?T1_sportname (count( *) as ?aggregation_all) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#sportname ?T1_sportname . ?T1 :sportsinfo\#onscholarship ?T1_onscholarship . FILTER(?T1_onscholarship = 'Y') .        } GROUP BY ?T1_sportname  ORDER BY DESC (?aggregation_all) LIMIT 1
game_1,What is the sport with the most scholarship students?,SELECT ?T1_sportname (count( *) as ?aggregation_all) WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#sportname ?T1_sportname . ?T1 :sportsinfo\#onscholarship ?T1_onscholarship . FILTER(?T1_onscholarship = 'Y') .        } GROUP BY ?T1_sportname  ORDER BY DESC (?aggregation_all) LIMIT 1
game_1,Show student ids who don't have any sports.,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid .        }     } }
game_1,What are the ids of all students who don't play sports?,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid .        }     } }
game_1,Show student ids who are on scholarship and have major 600.,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 600) . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid . ?T2 :sportsinfo\#onscholarship ?T2_onscholarship .  FILTER(?T2_onscholarship = 'Y') .             }
game_1,What are the student ids for those on scholarship in major number 600?,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 600) . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid . ?T2 :sportsinfo\#onscholarship ?T2_onscholarship .  FILTER(?T2_onscholarship = 'Y') .             }
game_1,Show student ids who are female and play football.,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid . ?T2 :sportsinfo\#sportname ?T2_sportname .  FILTER(?T2_sportname = 'Football') .             }
game_1,What are the ids of all female students who play football?,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'F') . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid . ?T2 :sportsinfo\#sportname ?T2_sportname .  FILTER(?T2_sportname = 'Football') .             }
game_1,Show all male student ids who don't play football.,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid . ?T2 :sportsinfo\#sportname ?T2_sportname . FILTER(?T2_sportname = 'Football') .        }     } }
game_1,What are the ids of all male students who do not play football?,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#sex ?T1_sex . FILTER(?T1_sex = 'M') .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :sportsinfo . ?T2 :sportsinfo\#stuid ?T2_stuid . ?T2 :sportsinfo\#sportname ?T2_sportname . FILTER(?T2_sportname = 'Football') .        }     } }
game_1,Show total hours per week and number of games played for student David Shieber.,SELECT (sum( ?T1_hoursperweek) as ?aggregation_T1_hoursperweek_68 ) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_194 ) WHERE { ?T1 a :sportsinfo . ?T2 a :student . ?T1 :sportsinfo\#ref-stuid ?T2 .  ?T1 :sportsinfo\#hoursperweek ?T1_hoursperweek . ?T1 :sportsinfo\#gamesplayed ?T1_gamesplayed . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'David' && ?T2_lname = 'Shieber') .        }
game_1,Show total hours per week and number of games played for students under 20.,SELECT (sum( ?T1_hoursperweek) as ?aggregation_T1_hoursperweek_129 ) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_34 ) WHERE { ?T1 a :sportsinfo . ?T2 a :student . ?T1 :sportsinfo\#ref-stuid ?T2 .  ?T1 :sportsinfo\#hoursperweek ?T1_hoursperweek . ?T1 :sportsinfo\#gamesplayed ?T1_gamesplayed . ?T2 :student\#age ?T2_age . FILTER(?T2_age < 20) .        }
game_1,How many students play video games?,SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_153 ) WHERE { ?T1 a :plays_games . ?T1 :plays_games\#stuid ?T1_stuid .        }
game_1,How many different students play games?,SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_10 ) WHERE { ?T1 a :plays_games . ?T1 :plays_games\#stuid ?T1_stuid .        }
game_1,Show ids of students who don't play video game.,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :plays_games . ?T2 :plays_games\#stuid ?T2_stuid .        }     } }
game_1,What are the ids of all students who are not video game players?,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :plays_games . ?T2 :plays_games\#stuid ?T2_stuid .        }     } }
game_1,Show ids of students who play video game and play sports.,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :plays_games . ?T2 :plays_games\#stuid ?T2_stuid .              }
game_1,What are the ids of all students who played video games and sports?,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :sportsinfo\#stuid ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :plays_games . ?T2 :plays_games\#stuid ?T2_stuid .              }
game_1,Show all game ids and the number of hours played.,SELECT ?T1_gameid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_72 ) WHERE { ?T1 a :plays_games . ?T1 :plays_games\#gameid ?T1_gameid . ?T1 :plays_games\#hours_played ?T1_hours_played .        } GROUP BY ?T1_gameid
game_1,What are ids and total number of hours played for each game?,SELECT ?T1_gameid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_102 ) WHERE { ?T1 a :plays_games . ?T1 :plays_games\#gameid ?T1_gameid . ?T1 :plays_games\#hours_played ?T1_hours_played .        } GROUP BY ?T1_gameid
game_1,Show all student ids and the number of hours played.,SELECT ?T1_stuid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_29 ) WHERE { ?T1 a :plays_games . ?T1 :plays_games\#stuid ?T1_stuid . ?T1 :plays_games\#hours_played ?T1_hours_played .        } GROUP BY ?T1_stuid
game_1,What are the ids of all students and number of hours played?,SELECT ?T1_stuid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_101 ) WHERE { ?T1 a :plays_games . ?T1 :plays_games\#stuid ?T1_stuid . ?T1 :plays_games\#hours_played ?T1_hours_played .        } GROUP BY ?T1_stuid
game_1,Show the game name that has most number of hours played.,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T2 a :plays_games . ?T2 :plays_games\#ref-gameid ?T1 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :plays_games\#hours_played ?T2_hours_played .        } GROUP BY ?T1_gname  ORDER BY DESC ((sum( ?T2_hours_played) as ?aggregation_T2_hours_played_192 )) LIMIT 1
game_1,What is the name of the game that has been played the most?,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T2 a :plays_games . ?T2 :plays_games\#ref-gameid ?T1 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :plays_games\#hours_played ?T2_hours_played .        } GROUP BY ?T1_gname  ORDER BY DESC ((sum( ?T2_hours_played) as ?aggregation_T2_hours_played_142 )) LIMIT 1
game_1,Show all game names played by at least 1000 hours.,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T2 a :plays_games . ?T2 :plays_games\#ref-gameid ?T1 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :plays_games\#hours_played ?T2_hours_played .        } GROUP BY ?T1_gname   HAVING(sum( ?T2_hours_played)  >= 1000)
game_1,What are the names of all the games that have been played for at least 1000 hours?,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T2 a :plays_games . ?T2 :plays_games\#ref-gameid ?T1 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :plays_games\#hours_played ?T2_hours_played .        } GROUP BY ?T1_gname   HAVING(sum( ?T2_hours_played)  >= 1000)
game_1,Show all game names played by Linda Smith,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T13 a :plays_games . ?T13 :plays_games\#ref-gameid ?T1 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :student\#lname ?T2_lname . ?T2 :student\#fname ?T2_fname . ?T2 a :student . ?T13 :plays_games\#ref-stuid ?T2 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :student\#lname ?T2_lname . ?T2 :student\#fname ?T2_fname . FILTER(?T2_lname = 'Smith' && ?T2_fname = 'Linda') .        }
game_1,What are the names of all games played by Linda Smith?,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T13 a :plays_games . ?T13 :plays_games\#ref-gameid ?T1 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :student\#lname ?T2_lname . ?T2 :student\#fname ?T2_fname . ?T2 a :student . ?T13 :plays_games\#ref-stuid ?T2 .  ?T1 :video_games\#gname ?T1_gname . ?T2 :student\#lname ?T2_lname . ?T2 :student\#fname ?T2_fname . FILTER(?T2_lname = 'Smith' && ?T2_fname = 'Linda') .        }
game_1,Find the last and first name of students who are playing Football or Lacrosse.,SELECT ?T1_lname ?T1_fname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :sportsinfo\#ref-stuid ?T1 .  ?T1 :student\#lname ?T1_lname . ?T1 :student\#fname ?T1_fname . ?T2 :sportsinfo\#sportname ?T2_sportname . ?T2 :sportsinfo\#sportname ?T2_sportname . FILTER(?T2_sportname = 'Football' || ?T2_sportname = 'Lacrosse') .        }
game_1,Find the first name and age of the students who are playing both Football and Lacrosse.,SELECT ?T1_fname ?T1_age WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_sportname)) .       {SELECT ?T22_stuid WHERE { ?T22 a :sportsinfo . ?T22 :sportsinfo\#stuid ?T22_stuid . ?T22 :sportsinfo\#sportname ?T22_sportname . FILTER(?T22_sportname = 'Football') .        }    } }
game_1,What are the first names and ages of all students who are playing both Football and Lacrosse?,SELECT ?T1_fname ?T1_age WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_sportname)) .       {SELECT ?T22_stuid WHERE { ?T22 a :sportsinfo . ?T22 :sportsinfo\#stuid ?T22_stuid . ?T22 :sportsinfo\#sportname ?T22_sportname . FILTER(?T22_sportname = 'Football') .        }    } }
game_1,Find the last name and gender of the students who are playing both Call of Destiny and Works of Widenius games.,SELECT ?T1_lname ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#sex ?T1_sex . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T23_gname)) .       {SELECT ?T22_stuid WHERE { ?T22 a :plays_games . ?T23 a :video_games . ?T22 :plays_games\#ref-gameid ?T23 .  ?T22 :plays_games\#stuid ?T22_stuid . ?T23 :video_games\#gname ?T23_gname . FILTER(?T23_gname = 'Call of Destiny') .        }    } }
game_1,what is the last name and gender of all students who played both Call of Destiny and Works of Widenius?,SELECT ?T1_lname ?T1_sex WHERE { ?T1 a :student . ?T1 :student\#lname ?T1_lname . ?T1 :student\#sex ?T1_sex . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T23_gname)) .       {SELECT ?T22_stuid WHERE { ?T22 a :plays_games . ?T23 a :video_games . ?T22 :plays_games\#ref-gameid ?T23 .  ?T22 :plays_games\#stuid ?T22_stuid . ?T23 :video_games\#gname ?T23_gname . FILTER(?T23_gname = 'Call of Destiny') .        }    } }
customers_and_addresses,Find the name of all customers.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name .        }
customers_and_addresses,What are the names of all the customers?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name .        }
customers_and_addresses,How many customers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }
customers_and_addresses,What is the average amount of items ordered in each order?,SELECT (avg( ?T1_order_quantity) as ?aggregation_T1_order_quantity_85 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_quantity ?T1_order_quantity .        }
customers_and_addresses,Find the average order quantity per order.,SELECT (avg( ?T1_order_quantity) as ?aggregation_T1_order_quantity_169 ) WHERE { ?T1 a :order_items . ?T1 :order_items\#order_quantity ?T1_order_quantity .        }
customers_and_addresses,What are the names of customers who use payment method 'Cash'?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#payment_method ?T1_payment_method . FILTER(?T1_payment_method = 'Cash') .        }
customers_and_addresses,Find the 'date became customers' of the customers whose ID is between 10 and 20.,SELECT ?T1_date_became_customer WHERE { ?T1 a :customers . ?T1 :customers\#date_became_customer ?T1_date_became_customer . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id >= 10 && ?T1_customer_id <= 20) .        }
customers_and_addresses,Which payment method is used by most customers?,SELECT ?T1_payment_method (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#payment_method ?T1_payment_method .        } GROUP BY ?T1_payment_method  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_addresses,What are the names of customers using the most popular payment method?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#payment_method ?T1_payment_method . FILTER(?T1_payment_method = (?T22_payment_method)) .       {SELECT ?T22_payment_method (count( *) as ?aggregation_all) WHERE { ?T22 a :customers . ?T22 :customers\#payment_method ?T22_payment_method .        } GROUP BY ?T22_payment_method  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
customers_and_addresses,What are all the payment methods?,SELECT DISTINCT ?T1_payment_method WHERE { ?T1 a :customers . ?T1 :customers\#payment_method ?T1_payment_method .        }
customers_and_addresses,What are the details of all products?,SELECT DISTINCT ?T1_product_details WHERE { ?T1 a :products . ?T1 :products\#product_details ?T1_product_details .        }
customers_and_addresses,Find the name of all customers whose name contains 'Alex'.,"SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_name ?T1_customer_name . FILTER(contains (?T1_customer_name, 'Alex')) .        }"
customers_and_addresses,Find the detail of products whose detail contains the word 'Latte' or the word 'Americano',"SELECT ?T1_product_details WHERE { ?T1 a :products . ?T1 :products\#product_details ?T1_product_details . ?T1 :products\#product_details ?T1_product_details . ?T1 :products\#product_details ?T1_product_details . FILTER(contains (?T1_product_details, 'Latte') || contains (?T1_product_details, 'Americano')) .        }"
customers_and_addresses,What is the address content of the customer named 'Maudie Kertzmann'?,SELECT ?T1_address_content WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\#ref-address_id ?T1 .  ?T1 :addresses\#address_content ?T1_address_content . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Maudie Kertzmann') .        }
customers_and_addresses,How many customers are living in city 'Lake Geovannyton'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\#ref-address_id ?T2 .  ?T2 :addresses\#city ?T2_city . FILTER(?T2_city = 'Lake Geovannyton') .        }
customers_and_addresses,Find the name of customers who are living in Colorado?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\#ref-address_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :addresses\#state_province_county ?T2_state_province_county . FILTER(?T2_state_province_county = 'Colorado') .        }
customers_and_addresses,What are the names of customers who live in Colorado state?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\#ref-address_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :addresses\#state_province_county ?T2_state_province_county . FILTER(?T2_state_province_county = 'Colorado') .        }
customers_and_addresses,Find the list of cities that no customer is living in.,SELECT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#city ?T1_city . FILTER(?T1_city not in (?T22_city)) .       {SELECT DISTINCT ?T22_city WHERE { ?T22 a :addresses . ?T22 :addresses\#city ?T22_city .        }    } }
customers_and_addresses,What are the cities no customers live in?,SELECT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#city ?T1_city . FILTER(?T1_city not in (?T22_city)) .       {SELECT DISTINCT ?T22_city WHERE { ?T22 a :addresses . ?T22 :addresses\#city ?T22_city .        }    } }
customers_and_addresses,Which city has the most customers living in?,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\#ref-address_id ?T1 .  ?T1 :addresses\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_addresses,Find the city with post code 255.,SELECT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#zip_postcode ?T1_zip_postcode . FILTER(?T1_zip_postcode = '255') .        }
customers_and_addresses,Which city is post code 255 located in?,SELECT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#zip_postcode ?T1_zip_postcode . FILTER(?T1_zip_postcode = '255') .        }
customers_and_addresses,Find the state and country of all cities with post code starting with 4.,"SELECT ?T1_state_province_county ?T1_country WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county . ?T1 :addresses\#country ?T1_country . ?T1 :addresses\#zip_postcode ?T1_zip_postcode . FILTER(contains (?T1_zip_postcode, '4')) .        }"
customers_and_addresses,List the countries having more than 4 addresses listed.,SELECT ?T1_country WHERE { ?T1 a :addresses . ?T1 :addresses\#country ?T1_country . ?T1 :addresses\#address_id ?T1_address_id .        } GROUP BY ?T1_country   HAVING(count( ?T1_address_id) as ?aggregation_T1_address_id_31 ) > 4)
customers_and_addresses,List all the contact channel codes that were used less than 5 times.,SELECT ?T1_channel_code WHERE { ?T1 a :customer_contact_channels . ?T1 :customer_contact_channels\#channel_code ?T1_channel_code . ?T1 :customer_contact_channels\#customer_id ?T1_customer_id .        } GROUP BY ?T1_channel_code   HAVING(count( ?T1_customer_id) as ?aggregation_T1_customer_id_26 ) < 5)
customers_and_addresses,Which contact channel codes were used less than 5 times?,SELECT ?T1_channel_code WHERE { ?T1 a :customer_contact_channels . ?T1 :customer_contact_channels\#channel_code ?T1_channel_code . ?T1 :customer_contact_channels\#customer_id ?T1_customer_id .        } GROUP BY ?T1_channel_code   HAVING(count( ?T1_customer_id) as ?aggregation_T1_customer_id_187 ) < 5)
customers_and_addresses,Which contact channel has been used by the customer with name 'Tillman Ernser'?,SELECT DISTINCT ?T1_channel_code WHERE { ?T1 a :customer_contact_channels . ?T2 a :customers . ?T1 :customer_contact_channels\#ref-customer_id ?T2 .  ?T1 :customer_contact_channels\#channel_code ?T1_channel_code . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Tillman Ernser') .        }
customers_and_addresses,What is the 'active to date' of the latest contact channel used by 'Tillman Ernser'?,SELECT (max( ?T1_active_to_date) as ?aggregation_T1_active_to_date_34 ) WHERE { ?T1 a :customer_contact_channels . ?T2 a :customers . ?T1 :customer_contact_channels\#ref-customer_id ?T2 .  ?T1 :customer_contact_channels\#active_to_date ?T1_active_to_date . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Tillman Ernser') .        }
customers_and_addresses,Return the the 'active to date' of the latest contact channel used by the customer named 'Tillman Ernser'.,SELECT (max( ?T1_active_to_date) as ?aggregation_T1_active_to_date_171 ) WHERE { ?T1 a :customer_contact_channels . ?T2 a :customers . ?T1 :customer_contact_channels\#ref-customer_id ?T2 .  ?T1 :customer_contact_channels\#active_to_date ?T1_active_to_date . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Tillman Ernser') .        }
customers_and_addresses,What is the average time span of contact channels in the database?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses .        }
customers_and_addresses,Return the channel code and contact number of the customer contact channel whose active duration was the longest.,SELECT ?T1_channel_code ?T1_contact_number WHERE { ?T1 a :customer_contact_channels . ?T1 :customer_contact_channels\#channel_code ?T1_channel_code . ?T1 :customer_contact_channels\#contact_number ?T1_contact_number . ?T1 :customer_contact_channels\#active_to_date ?T1_active_to_date . ?T1 :customer_contact_channels\#active_from_date ?T1_active_from_date . FILTER(?T1_active_to_date - ?T1_active_from_date = (?T1_contact_number)) .       {SELECT ?T22_active_to_date - ?T22_active_from_date WHERE { ?T22 a :customer_contact_channels . ?T22 :customer_contact_channels\#active_to_date ?T22_active_to_date . ?T22 :customer_contact_channels\#active_from_date ?T22_active_from_date . ?T22 :customer_contact_channels\#active_to_date ?T22_active_to_date . ?T22 :customer_contact_channels\#active_from_date ?T22_active_from_date .        }   ORDER BY DESC (?T22_active_to_date - ?T22_active_from_date) LIMIT 1 } }
customers_and_addresses,Find the name and active date of the customer that use email as the contact channel.,SELECT ?T1_customer_name ?T2_active_from_date WHERE { ?T1 a :customers . ?T2 a :customer_contact_channels . ?T2 :customer_contact_channels\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :customer_contact_channels\#active_from_date ?T2_active_from_date . ?T2 :customer_contact_channels\#channel_code ?T2_channel_code . FILTER(?T2_channel_code = 'Email') .        }
customers_and_addresses,What is the name of the customer that made the order with the largest quantity?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_quantity ?T2_order_quantity . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_quantity ?T2_order_quantity . FILTER(?T2_order_quantity = (?aggregation_T23_order_quantity_94)) .       {SELECT (max( ?T23_order_quantity) as ?aggregation_T23_order_quantity_94 ) WHERE { ?T23 a :order_items . ?T23 :order_items\#order_quantity ?T23_order_quantity .        }    } }
customers_and_addresses,Find the name of the customer who made the order of the largest amount of goods.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_quantity ?T2_order_quantity . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_quantity ?T2_order_quantity . FILTER(?T2_order_quantity = (?aggregation_T23_order_quantity_190)) .       {SELECT (max( ?T23_order_quantity) as ?aggregation_T23_order_quantity_190 ) WHERE { ?T23 a :order_items . ?T23 :order_items\#order_quantity ?T23_order_quantity .        }    } }
customers_and_addresses,What is the name of the customer that has purchased the most items?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_quantity ?T2_order_quantity . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#order_quantity ?T2_order_quantity .        } GROUP BY ?T1_customer_name  ORDER BY DESC ((sum( ?T2_order_quantity) as ?aggregation_T2_order_quantity_87 )) LIMIT 1
customers_and_addresses,What is the payment method of the customer that has purchased the least quantity of items?,SELECT ?T1_payment_method WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#payment_method ?T1_payment_method . ?T2 :order_items\#order_quantity ?T2_order_quantity . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#payment_method ?T1_payment_method . ?T2 :order_items\#order_quantity ?T2_order_quantity .        } GROUP BY ?T1_payment_method  ORDER BY ASC ((sum( ?T2_order_quantity) as ?aggregation_T2_order_quantity_9 )) LIMIT 1
customers_and_addresses,How many types of products have Rodrick Heaney bought in total?,SELECT DISTINCT (count(DISTINCT ?T1_product_id) as ?aggregation_T1_product_id_131 ) WHERE { ?T1 a :order_items . ?T13 a :customer_orders . ?T1 :order_items\#ref-order_id ?T13 .  ?T1 :order_items\#product_id ?T1_product_id . ?T2 :customers\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customer_orders\#ref-customer_id ?T2 .  ?T1 :order_items\#product_id ?T1_product_id . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Rodrick Heaney') .        }
customers_and_addresses,Find the number of distinct products Rodrick Heaney has bought so far.,SELECT DISTINCT (count(DISTINCT ?T1_product_id) as ?aggregation_T1_product_id_127 ) WHERE { ?T1 a :order_items . ?T13 a :customer_orders . ?T1 :order_items\#ref-order_id ?T13 .  ?T1 :order_items\#product_id ?T1_product_id . ?T2 :customers\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customer_orders\#ref-customer_id ?T2 .  ?T1 :order_items\#product_id ?T1_product_id . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Rodrick Heaney') .        }
customers_and_addresses,What is the total quantity of products purchased by 'Rodrick Heaney'?,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_130 ) WHERE { ?T1 a :order_items . ?T13 a :customer_orders . ?T1 :order_items\#ref-order_id ?T13 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customers\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customer_orders\#ref-customer_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Rodrick Heaney') .        }
