kg_name,question,query
company_employee,Show the headquarters that have both companies in banking industry and companies in oil and gas industry.,SELECT DISTINCT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters . ?T1 :company\#industry ?T1_industry . FILTER(?T1_industry = 'Banking') . FILTER (?T1_headquarters in (?T2_headquarters)) .   ?T2 a :company . ?T2 :company\#headquarters ?T2_headquarters . ?T2 :company\#industry ?T2_industry .  FILTER(?T2_industry = 'Oil && gas') .             }
company_employee,Show the names of companies and of employees.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :company . ?T13 a :employment . ?T13 :employment\#ref-company_id ?T1 .  ?T1 :company\#name ?T1_name . ?T2 :people\#name ?T2_name . ?T2 a :people . ?T13 :employment\#ref-people_id ?T2 .  ?T1 :company\#name ?T1_name . ?T2 :people\#name ?T2_name .        }
company_employee,Show names of companies and that of employees in descending order of number of years working for that employee.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :company . ?T3 a :employment . ?T3 :employment\#ref-company_id ?T1 .  ?T1 :company\#name ?T1_name . ?T2 :people\#name ?T2_name . ?T3 :employment\#year_working ?T3_year_working . ?T2 a :people . ?T3 :employment\#ref-people_id ?T2 .  ?T1 :company\#name ?T1_name . ?T2 :people\#name ?T2_name . ?T3 :employment\#year_working ?T3_year_working .        }  ORDER BY ASC (?T3_year_working)
company_employee,Show the names of employees that work for companies with sales bigger than 200.,SELECT ?T1_name WHERE { ?T1 a :people . ?T13 a :employment . ?T13 :employment\#ref-people_id ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :company\#sales_in_billion ?T2_sales_in_billion . ?T2 a :company . ?T13 :employment\#ref-company_id ?T2 .  ?T1 :people\#name ?T1_name . ?T2 :company\#sales_in_billion ?T2_sales_in_billion . FILTER(?T2_sales_in_billion > 200) .        }
company_employee,Show the names of companies and the number of employees they have,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T2 a :employment . ?T2 :employment\#ref-company_id ?T1 .  ?T1 :company\#name ?T1_name .        } GROUP BY ?T1_name
company_employee,List the names of people that are not employed by any company,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) .       {SELECT ?T22_people_id WHERE { ?T22 a :employment . ?T22 :employment\#people_id ?T22_people_id .        }    } }
company_employee,list the names of the companies with more than 200 sales in the descending order of sales and profits.,SELECT ?T1_name WHERE { ?T1 a :company . ?T1 :company\#name ?T1_name . ?T1 :company\#sales_in_billion ?T1_sales_in_billion . ?T1 :company\#sales_in_billion ?T1_sales_in_billion . FILTER(?T1_sales_in_billion > 200) .        }  ORDER BY DESC (?T1_sales_in_billion)
film_rank,How many film are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :film .        }
film_rank,List the distinct director of all films.,SELECT DISTINCT ?T1_director WHERE { ?T1 a :film . ?T1 :film\#director ?T1_director .        }
film_rank,What are the different film Directors?,SELECT DISTINCT ?T1_director WHERE { ?T1 a :film . ?T1 :film\#director ?T1_director .        }
film_rank,What is the average ticket sales gross in dollars of films?,SELECT (avg( ?T1_gross_in_dollar) as ?aggregation_T1_gross_in_dollar_61 ) WHERE { ?T1 a :film . ?T1 :film\#gross_in_dollar ?T1_gross_in_dollar .        }
film_rank,Return the average gross sales in dollars across all films.,SELECT (avg( ?T1_gross_in_dollar) as ?aggregation_T1_gross_in_dollar_159 ) WHERE { ?T1 a :film . ?T1 :film\#gross_in_dollar ?T1_gross_in_dollar .        }
film_rank,What are the low and high estimates of film markets?,SELECT ?T1_low_estimate ?T1_high_estimate WHERE { ?T1 a :film_market_estimation . ?T1 :film_market_estimation\#low_estimate ?T1_low_estimate . ?T1 :film_market_estimation\#high_estimate ?T1_high_estimate .        }
film_rank,What are the types of film market estimations in year 1995?,SELECT ?T1_type WHERE { ?T1 a :film_market_estimation . ?T1 :film_market_estimation\#type ?T1_type . ?T1 :film_market_estimation\#year ?T1_year . FILTER(?T1_year = 1995) .        }
film_rank,What are the maximum and minimum number of cities in all markets.,SELECT (max( ?T1_number_cities) as ?aggregation_T1_number_cities_169 ) (min( ?T1_number_cities) as ?aggregation_T1_number_cities_68 ) WHERE { ?T1 a :market . ?T1 :market\#number_cities ?T1_number_cities . ?T1 :market\#number_cities ?T1_number_cities .        }
film_rank,Return the maximum and minimum number of cities across all markets.,SELECT (max( ?T1_number_cities) as ?aggregation_T1_number_cities_43 ) (min( ?T1_number_cities) as ?aggregation_T1_number_cities_128 ) WHERE { ?T1 a :market . ?T1 :market\#number_cities ?T1_number_cities . ?T1 :market\#number_cities ?T1_number_cities .        }
film_rank,How many markets have number of cities smaller than 300?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :market . ?T1 :market\#number_cities ?T1_number_cities . FILTER(?T1_number_cities < 300) .        }
film_rank,List all countries of markets in ascending alphabetical order.,SELECT ?T1_country WHERE { ?T1 a :market . ?T1 :market\#country ?T1_country . ?T1 :market\#country ?T1_country .        }  ORDER BY ASC (?T1_country)
film_rank,List all countries of markets in descending order of number of cities.,SELECT ?T1_country WHERE { ?T1 a :market . ?T1 :market\#country ?T1_country . ?T1 :market\#number_cities ?T1_number_cities .        }  ORDER BY DESC (?T1_number_cities)
film_rank,Please show the titles of films and the types of market estimations.,SELECT ?T1_title ?T2_type WHERE { ?T1 a :film . ?T2 a :film_market_estimation . ?T2 :film_market_estimation\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T2 :film_market_estimation\#type ?T2_type .        }
film_rank,Show the distinct director of films with market estimation in the year of 1995.,SELECT DISTINCT ?T1_director WHERE { ?T1 a :film . ?T2 a :film_market_estimation . ?T2 :film_market_estimation\#ref-film_id ?T1 .  ?T1 :film\#director ?T1_director . ?T2 :film_market_estimation\#year ?T2_year . FILTER(?T2_year = 1995) .        }
film_rank,Please list the countries and years of film market estimations.,SELECT ?T1_country ?T2_year WHERE { ?T1 a :market . ?T2 a :film_market_estimation . ?T2 :film_market_estimation\#ref-market_id ?T1 .  ?T1 :market\#country ?T1_country . ?T2 :film_market_estimation\#year ?T2_year .        }
film_rank,Please list the years of film market estimations when the market is in country 'Japan' in descending order.,SELECT ?T1_year WHERE { ?T1 a :film_market_estimation . ?T2 a :market . ?T1 :film_market_estimation\#ref-market_id ?T2 .  ?T1 :film_market_estimation\#year ?T1_year . ?T1 :film_market_estimation\#year ?T1_year . ?T2 :market\#country ?T2_country . FILTER(?T2_country = 'Japan') .        }  ORDER BY DESC (?T1_year)
film_rank,List the studios of each film and the number of films produced by that studio.,SELECT ?T1_studio (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .        } GROUP BY ?T1_studio
film_rank,How films are produced by each studio?,SELECT ?T1_studio (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .        } GROUP BY ?T1_studio
film_rank,List the name of film studio that have the most number of films.,SELECT ?T1_studio (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .        } GROUP BY ?T1_studio  ORDER BY DESC (?aggregation_all) LIMIT 1
film_rank,What is the name of teh studio that created the most films?,SELECT ?T1_studio (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .        } GROUP BY ?T1_studio  ORDER BY DESC (?aggregation_all) LIMIT 1
film_rank,List the names of studios that have at least two films.,SELECT ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .        } GROUP BY ?T1_studio   HAVING(count( *)  >= 2)
film_rank,What are the names of studios that have made two or more films?,SELECT ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .        } GROUP BY ?T1_studio   HAVING(count( *)  >= 2)
film_rank,List the title of films that do not have any market estimation.,SELECT ?T1_title WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id . FILTER(?T1_film_id not in (?T22_film_id)) .       {SELECT ?T22_film_id WHERE { ?T22 a :film_market_estimation . ?T22 :film_market_estimation\#film_id ?T22_film_id .        }    } }
film_rank,What are the titles of films that do not have a film market estimation?,SELECT ?T1_title WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#film_id ?T1_film_id . FILTER(?T1_film_id not in (?T22_film_id)) .       {SELECT ?T22_film_id WHERE { ?T22 a :film_market_estimation . ?T22 :film_market_estimation\#film_id ?T22_film_id .        }    } }
film_rank,Show the studios that have produced films with director 'Nicholas Meyer' and 'Walter Hill'.,SELECT DISTINCT ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio . ?T1 :film\#director ?T1_director . FILTER(?T1_director = 'Nicholas Meyer') . FILTER (?T1_studio in (?T2_studio)) .   ?T2 a :film . ?T2 :film\#studio ?T2_studio . ?T2 :film\#director ?T2_director .  FILTER(?T2_director = 'Walter Hill') .             }
film_rank,Find the titles and studios of the films that are produced by some film studios that contained the word 'Universal'.,"SELECT ?T1_title ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#studio ?T1_studio . ?T1 :film\#studio ?T1_studio . FILTER(contains (?T1_studio, 'Universal')) .        }"
film_rank,What are the titles and studios of films that have been produced by a studio whose name contains 'Universal'?,"SELECT ?T1_title ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#studio ?T1_studio . ?T1 :film\#studio ?T1_studio . FILTER(contains (?T1_studio, 'Universal')) .        }"
film_rank,Show the studios that have not produced films with director 'Walter Hill'.,SELECT distinct?col1 WHERE { { SELECT (?T1_studio as ?col1) WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .   }}  MINUS {SELECT (?T2_studio as ?col1) WHERE { ?T2 a :film . ?T2 :film\#studio ?T2_studio . ?T2 :film\#director ?T2_director . FILTER(?T2_director = 'Walter Hill') .        }     } }
film_rank,Which studios have never worked with the director Walter Hill?,SELECT distinct?col1 WHERE { { SELECT (?T1_studio as ?col1) WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio .   }}  MINUS {SELECT (?T2_studio as ?col1) WHERE { ?T2 a :film . ?T2 :film\#studio ?T2_studio . ?T2 :film\#director ?T2_director . FILTER(?T2_director = 'Walter Hill') .        }     } }
film_rank,List the studios which average gross is above 4500000.,SELECT ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio . ?T1 :film\#gross_in_dollar ?T1_gross_in_dollar .        } GROUP BY ?T1_studio   HAVING(avg( ?T1_gross_in_dollar)  >= 4500000)
film_rank,Which studios have an average gross of over 4500000?,SELECT ?T1_studio WHERE { ?T1 a :film . ?T1 :film\#studio ?T1_studio . ?T1 :film\#gross_in_dollar ?T1_gross_in_dollar .        } GROUP BY ?T1_studio   HAVING(avg( ?T1_gross_in_dollar)  >= 4500000)
film_rank,What is the title of the film that has the highest high market estimation.,SELECT ?T1_title WHERE { ?T1 a :film . ?T2 a :film_market_estimation . ?T2 :film_market_estimation\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T2 :film_market_estimation\#high_estimate ?T2_high_estimate .        }   ORDER BY DESC (?T2_high_estimate) LIMIT 1
film_rank,Return the title of the film with the highest high estimate?,SELECT ?T1_title WHERE { ?T1 a :film . ?T2 a :film_market_estimation . ?T2 :film_market_estimation\#ref-film_id ?T1 .  ?T1 :film\#title ?T1_title . ?T2 :film_market_estimation\#high_estimate ?T2_high_estimate .        }   ORDER BY DESC (?T2_high_estimate) LIMIT 1
film_rank,Return the titles and directors of films that were never in the market of China.,SELECT ?T1_title ?T1_director WHERE { ?T1 a :film . ?T1 :film\#title ?T1_title . ?T1 :film\#director ?T1_director . ?T1 :film\#film_id ?T1_film_id . FILTER(?T1_film_id not in (?T23_country)) .       {SELECT ?T22_film_id WHERE { ?T22 a :film_market_estimation . ?T23 a :market . ?T22 :film_market_estimation\#ref-market_id ?T23 .  ?T22 :film_market_estimation\#film_id ?T22_film_id . ?T23 :market\#country ?T23_country . FILTER(?T23_country = 'China') .        }    } }
cre_doc_tracking_db,How many calendar items do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_calendar .        }
cre_doc_tracking_db,Show all calendar dates and day Numbers.,SELECT ?T1_calendar_date ?T1_day_number WHERE { ?T1 a :ref_calendar . ?T1 :ref_calendar\#calendar_date ?T1_calendar_date . ?T1 :ref_calendar\#day_number ?T1_day_number .        }
cre_doc_tracking_db,What are all the calendar dates and day Numbers?,SELECT ?T1_calendar_date ?T1_day_number WHERE { ?T1 a :ref_calendar . ?T1 :ref_calendar\#calendar_date ?T1_calendar_date . ?T1 :ref_calendar\#day_number ?T1_day_number .        }
cre_doc_tracking_db,Show the number of document types.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_document_types .        }
cre_doc_tracking_db,How many document types are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_document_types .        }
cre_doc_tracking_db,List all document type codes and document type names.,SELECT ?T1_document_type_code ?T1_document_type_name WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code . ?T1 :ref_document_types\#document_type_name ?T1_document_type_name .        }
cre_doc_tracking_db,What are all the document type codes and document type names?,SELECT ?T1_document_type_code ?T1_document_type_name WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code . ?T1 :ref_document_types\#document_type_name ?T1_document_type_name .        }
cre_doc_tracking_db,What is the name and description for document type code RV?,SELECT ?T1_document_type_name ?T1_document_type_description WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_name ?T1_document_type_name . ?T1 :ref_document_types\#document_type_description ?T1_document_type_description . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'RV') .        }
cre_doc_tracking_db,What is the document type code for document type 'Paper'?,SELECT ?T1_document_type_code WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code . ?T1 :ref_document_types\#document_type_name ?T1_document_type_name . FILTER(?T1_document_type_name = 'Paper') .        }
cre_doc_tracking_db,Show the number of documents with document type code CV or BK.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :all_documents . ?T1 :all_documents\#document_type_code ?T1_document_type_code . ?T1 :all_documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'CV' || ?T1_document_type_code = 'BK') .        }
cre_doc_tracking_db,How many documents have document type code CV or BK?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :all_documents . ?T1 :all_documents\#document_type_code ?T1_document_type_code . ?T1 :all_documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'CV' || ?T1_document_type_code = 'BK') .        }
cre_doc_tracking_db,What is the date when the document 'Marry CV' was stored?,SELECT ?T1_date_stored WHERE { ?T1 a :all_documents . ?T1 :all_documents\#date_stored ?T1_date_stored . ?T1 :all_documents\#document_name ?T1_document_name . FILTER(?T1_document_name = 'Marry CV') .        }
cre_doc_tracking_db,What is the day Number and date of all the documents?,SELECT ?T1_day_number ?T2_date_stored WHERE { ?T1 a :ref_calendar . ?T2 a :all_documents . ?T2 :all_documents\#ref-date_stored ?T1 .  ?T1 :ref_calendar\#day_number ?T1_day_number . ?T2 :all_documents\#date_stored ?T2_date_stored .        }
cre_doc_tracking_db,What is the document type name for the document with name 'How to read a book'?,SELECT ?T1_document_type_name WHERE { ?T1 a :ref_document_types . ?T2 a :all_documents . ?T2 :all_documents\#ref-document_type_code ?T1 .  ?T1 :ref_document_types\#document_type_name ?T1_document_type_name . ?T2 :all_documents\#document_name ?T2_document_name . FILTER(?T2_document_name = 'How to read a book') .        }
cre_doc_tracking_db,Show the number of locations.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_locations .        }
cre_doc_tracking_db,How many locations are listed in the database?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_locations .        }
cre_doc_tracking_db,List all location codes and location names.,SELECT ?T1_location_code ?T1_location_name WHERE { ?T1 a :ref_locations . ?T1 :ref_locations\#location_code ?T1_location_code . ?T1 :ref_locations\#location_name ?T1_location_name .        }
cre_doc_tracking_db,What are all the location codes and location names?,SELECT ?T1_location_code ?T1_location_name WHERE { ?T1 a :ref_locations . ?T1 :ref_locations\#location_code ?T1_location_code . ?T1 :ref_locations\#location_name ?T1_location_name .        }
cre_doc_tracking_db,What are the name and description for location code x?,SELECT ?T1_location_name ?T1_location_description WHERE { ?T1 a :ref_locations . ?T1 :ref_locations\#location_name ?T1_location_name . ?T1 :ref_locations\#location_description ?T1_location_description . ?T1 :ref_locations\#location_code ?T1_location_code . FILTER(?T1_location_code = 'x') .        }
cre_doc_tracking_db,What is the location code for the country 'Canada'?,SELECT ?T1_location_code WHERE { ?T1 a :ref_locations . ?T1 :ref_locations\#location_code ?T1_location_code . ?T1 :ref_locations\#location_name ?T1_location_name . FILTER(?T1_location_name = 'Canada') .        }
cre_doc_tracking_db,How many roles are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :roles .        }
cre_doc_tracking_db,"List all role codes, role names, and role descriptions.",SELECT ?T1_role_code ?T1_role_name ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\#role_code ?T1_role_code . ?T1 :roles\#role_name ?T1_role_name . ?T1 :roles\#role_description ?T1_role_description .        }
cre_doc_tracking_db,What are the name and description for role code 'MG'?,SELECT ?T1_role_name ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\#role_name ?T1_role_name . ?T1 :roles\#role_description ?T1_role_description . ?T1 :roles\#role_code ?T1_role_code . FILTER(?T1_role_code = 'MG') .        }
cre_doc_tracking_db,Show the description for role name 'Proof Reader'.,SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\#role_description ?T1_role_description . ?T1 :roles\#role_name ?T1_role_name . FILTER(?T1_role_name = 'Proof Reader') .        }
cre_doc_tracking_db,What is the description of the role named 'Proof Reader'?,SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\#role_description ?T1_role_description . ?T1 :roles\#role_name ?T1_role_name . FILTER(?T1_role_name = 'Proof Reader') .        }
cre_doc_tracking_db,How many employees do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employees .        }
cre_doc_tracking_db,"Show the name, role code, and date of birth for the employee with name 'Armani'.",SELECT ?T1_employee_name ?T1_role_code ?T1_date_of_birth WHERE { ?T1 a :employees . ?T1 :employees\#employee_name ?T1_employee_name . ?T1 :employees\#role_code ?T1_role_code . ?T1 :employees\#date_of_birth ?T1_date_of_birth . ?T1 :employees\#employee_name ?T1_employee_name . FILTER(?T1_employee_name = 'Armani') .        }
cre_doc_tracking_db,What is the id for the employee called Ebba?,SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id . ?T1 :employees\#employee_name ?T1_employee_name . FILTER(?T1_employee_name = 'Ebba') .        }
cre_doc_tracking_db,Show the names of all the employees with role 'HR'.,SELECT ?T1_employee_name WHERE { ?T1 a :employees . ?T1 :employees\#employee_name ?T1_employee_name . ?T1 :employees\#role_code ?T1_role_code . FILTER(?T1_role_code = 'HR') .        }
cre_doc_tracking_db,Show all role codes and the number of employees in each role.,SELECT ?T1_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T1 :employees\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code
cre_doc_tracking_db,What is the code of each role and the number of employees in each role?,SELECT ?T1_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T1 :employees\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code
cre_doc_tracking_db,What is the role code with the largest number of employees?,SELECT ?T1_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T1 :employees\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_doc_tracking_db,Show all role codes with at least 3 employees.,SELECT ?T1_role_code WHERE { ?T1 a :employees . ?T1 :employees\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code   HAVING(count( *)  >= 3)
cre_doc_tracking_db,Show the role code with the least employees.,SELECT ?T1_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T1 :employees\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code  ORDER BY ASC (?aggregation_all) LIMIT 1
cre_doc_tracking_db,What is the role name and role description for employee called Ebba?,SELECT ?T1_role_name ?T1_role_description WHERE { ?T1 a :roles . ?T2 a :employees . ?T2 :employees\#ref-role_code ?T1 .  ?T1 :roles\#role_name ?T1_role_name . ?T1 :roles\#role_description ?T1_role_description . ?T2 :employees\#employee_name ?T2_employee_name . FILTER(?T2_employee_name = 'Ebba') .        }
cre_doc_tracking_db,Show the names of employees with role name Editor.,SELECT ?T1_employee_name WHERE { ?T1 a :employees . ?T2 a :roles . ?T1 :employees\#ref-role_code ?T2 .  ?T1 :employees\#employee_name ?T1_employee_name . ?T2 :roles\#role_name ?T2_role_name . FILTER(?T2_role_name = 'Editor') .        }
cre_doc_tracking_db,Show the employee ids for all employees with role name 'Human Resource' or 'Manager'.,SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T2 a :roles . ?T1 :employees\#ref-role_code ?T2 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :roles\#role_name ?T2_role_name . ?T2 :roles\#role_name ?T2_role_name . FILTER(?T2_role_name = 'Human Resource' || ?T2_role_name = 'Manager') .        }
cre_doc_tracking_db,What are the employee ids of the employees whose role name is 'Human Resource' or 'Manager'?,SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T2 a :roles . ?T1 :employees\#ref-role_code ?T2 .  ?T1 :employees\#employee_id ?T1_employee_id . ?T2 :roles\#role_name ?T2_role_name . ?T2 :roles\#role_name ?T2_role_name . FILTER(?T2_role_name = 'Human Resource' || ?T2_role_name = 'Manager') .        }
cre_doc_tracking_db,What are the different location codes for documents?,SELECT DISTINCT ?T1_location_code WHERE { ?T1 a :document_locations . ?T1 :document_locations\#location_code ?T1_location_code .        }
cre_doc_tracking_db,Show the location name for document 'Robin CV'.,SELECT ?T1_location_name WHERE { ?T1 a :ref_locations . ?T13 a :document_locations . ?T13 :document_locations\#ref-location_code ?T1 .  ?T1 :ref_locations\#location_name ?T1_location_name . ?T2 :all_documents\#document_name ?T2_document_name . ?T2 a :all_documents . ?T13 :document_locations\#ref-document_id ?T2 .  ?T1 :ref_locations\#location_name ?T1_location_name . ?T2 :all_documents\#document_name ?T2_document_name . FILTER(?T2_document_name = 'Robin CV') .        }
cre_doc_tracking_db,What is the location name of the document 'Robin CV'?,SELECT ?T1_location_name WHERE { ?T1 a :ref_locations . ?T13 a :document_locations . ?T13 :document_locations\#ref-location_code ?T1 .  ?T1 :ref_locations\#location_name ?T1_location_name . ?T2 :all_documents\#document_name ?T2_document_name . ?T2 a :all_documents . ?T13 :document_locations\#ref-document_id ?T2 .  ?T1 :ref_locations\#location_name ?T1_location_name . ?T2 :all_documents\#document_name ?T2_document_name . FILTER(?T2_document_name = 'Robin CV') .        }
cre_doc_tracking_db,"Show the location code, the starting date and ending data in that location for all the documents.",SELECT ?T1_location_code ?T1_date_in_location_from ?T1_date_in_locaton_to WHERE { ?T1 a :document_locations . ?T1 :document_locations\#location_code ?T1_location_code . ?T1 :document_locations\#date_in_location_from ?T1_date_in_location_from . ?T1 :document_locations\#date_in_locaton_to ?T1_date_in_locaton_to .        }
cre_doc_tracking_db,What is 'the date in location from' and 'the date in location to' for the document with name 'Robin CV'?,SELECT ?T1_date_in_location_from ?T1_date_in_locaton_to WHERE { ?T1 a :document_locations . ?T2 a :all_documents . ?T1 :document_locations\#ref-document_id ?T2 .  ?T1 :document_locations\#date_in_location_from ?T1_date_in_location_from . ?T1 :document_locations\#date_in_locaton_to ?T1_date_in_locaton_to . ?T2 :all_documents\#document_name ?T2_document_name . FILTER(?T2_document_name = 'Robin CV') .        }
cre_doc_tracking_db,Show the location codes and the number of documents in each location.,SELECT ?T1_location_code (count( *) as ?aggregation_all) WHERE { ?T1 a :document_locations . ?T1 :document_locations\#location_code ?T1_location_code .        } GROUP BY ?T1_location_code
cre_doc_tracking_db,What is the location code with the most documents?,SELECT ?T1_location_code (count( *) as ?aggregation_all) WHERE { ?T1 a :document_locations . ?T1 :document_locations\#location_code ?T1_location_code .        } GROUP BY ?T1_location_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_doc_tracking_db,Show the location codes with at least 3 documents.,SELECT ?T1_location_code WHERE { ?T1 a :document_locations . ?T1 :document_locations\#location_code ?T1_location_code .        } GROUP BY ?T1_location_code   HAVING(count( *)  >= 3)
cre_doc_tracking_db,What are the codes of the locations with at least three documents?,SELECT ?T1_location_code WHERE { ?T1 a :document_locations . ?T1 :document_locations\#location_code ?T1_location_code .        } GROUP BY ?T1_location_code   HAVING(count( *)  >= 3)
cre_doc_tracking_db,Show the location name and code with the least documents.,SELECT ?T1_location_name (count( *) as ?aggregation_all) ?T2_location_code WHERE { ?T1 a :ref_locations . ?T2 a :document_locations . ?T2 :document_locations\#ref-location_code ?T1 .  ?T1 :ref_locations\#location_name ?T1_location_name . ?T2 :document_locations\#location_code ?T2_location_code .        } GROUP BY ?T1_location_name ?T2_location_code  ORDER BY ASC (?aggregation_all) LIMIT 1
cre_doc_tracking_db,List the names of the employees who authorized the destruction of documents and the employees who destroyed the corresponding documents.,SELECT ?T1_employee_name ?T1_employee_name WHERE { ?T1 a :employees . ?T1 :employees\#employee_name ?T1_employee_name . ?T1 :employees\#employee_name ?T1_employee_name .        }
cre_doc_tracking_db,Show the id of each employee and the number of document destruction authorised by that employee.,SELECT ?T1_destruction_authorised_by_employee_id (count( *) as ?aggregation_all) WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destruction_authorised_by_employee_id ?T1_destruction_authorised_by_employee_id .        } GROUP BY ?T1_destruction_authorised_by_employee_id
cre_doc_tracking_db,Show the employee ids and the number of documents destroyed by each employee.,SELECT ?T1_destroyed_by_employee_id (count( *) as ?aggregation_all) WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destroyed_by_employee_id ?T1_destroyed_by_employee_id .        } GROUP BY ?T1_destroyed_by_employee_id
cre_doc_tracking_db,Show the ids of the employees who don't authorize destruction for any document.,SELECT distinct?col1 WHERE { { SELECT (?T1_employee_id as ?col1) WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id .   }}  MINUS {SELECT (?T2_destruction_authorised_by_employee_id as ?col1) WHERE { ?T2 a :documents_to_be_destroyed . ?T2 :documents_to_be_destroyed\#destruction_authorised_by_employee_id ?T2_destruction_authorised_by_employee_id .        }     } }
cre_doc_tracking_db,Show the ids of all employees who have authorized destruction.,SELECT DISTINCT ?T1_destruction_authorised_by_employee_id WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destruction_authorised_by_employee_id ?T1_destruction_authorised_by_employee_id .        }
cre_doc_tracking_db,Show the ids of all employees who have destroyed a document.,SELECT DISTINCT ?T1_destroyed_by_employee_id WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destroyed_by_employee_id ?T1_destroyed_by_employee_id .        }
cre_doc_tracking_db,What are the ids of all the employees who have destroyed documents?,SELECT DISTINCT ?T1_destroyed_by_employee_id WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destroyed_by_employee_id ?T1_destroyed_by_employee_id .        }
cre_doc_tracking_db,Show the ids of all employees who don't destroy any document.,SELECT distinct?col1 WHERE { { SELECT (?T1_employee_id as ?col1) WHERE { ?T1 a :employees . ?T1 :employees\#employee_id ?T1_employee_id .   }}  MINUS {SELECT (?T2_destroyed_by_employee_id as ?col1) WHERE { ?T2 a :documents_to_be_destroyed . ?T2 :documents_to_be_destroyed\#destroyed_by_employee_id ?T2_destroyed_by_employee_id .        }     } }
cre_doc_tracking_db,Show the ids of all employees who have either destroyed a document or made an authorization to do this.,SELECT distinct?col1 WHERE { { SELECT (?T1_destroyed_by_employee_id as ?col1) WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destroyed_by_employee_id ?T1_destroyed_by_employee_id .   }} UNION {SELECT (?T1_destruction_authorised_by_employee_id as ?col1) WHERE { ?T1 a :documents_to_be_destroyed . ?T1 :documents_to_be_destroyed\#destruction_authorised_by_employee_id ?T1_destruction_authorised_by_employee_id .        }      } }
club_1,How many clubs are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club .        }
club_1,What are the names of all clubs?,SELECT ?T1_clubname WHERE { ?T1 a :club . ?T1 :club\#clubname ?T1_clubname .        }
club_1,How many students are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student .        }
club_1,What are the first names of all the students?,SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname .        }
club_1,Find the last names of the members of the club 'Bootup Baltimore'.,SELECT ?T1_lname WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }
club_1,How many members does the club 'Tennis Club' has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }
club_1,Find the number of members of club 'Pen and Paper Gaming'.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }
club_1,How many people have membership in the club 'Pen and Paper Gaming'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }
