kg_name,question,query
scholar,Does brian curless do convolution ?,SELECT DISTINCT ?T1_authorid ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorid ?T1_authorid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname = 'brian curless' && ?T3_keyphrasename = 'convolution') .        }
scholar,What papers has Liwen Xiong written in 2015,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'Liwen Xiong' && ?T1_year = 2015) .        }
scholar,What did Liwen Xiong published in 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'Liwen Xiong' && ?T1_year = 2015) .        }
scholar,What papers did Liwen Xiong publish last year ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'Liwen Xiong' && ?T1_year = 2015) .        }
scholar,Liwen Xiong 's papers in 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . FILTER(?T2_authorname = 'Liwen Xiong' && ?T1_year = 2015) .        }
scholar,What TAIL paper published in NIPS ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'TAIL' && ?T3_venuename = 'NIPS') .        }
scholar,what are the papers in NIPS about TAIL ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'TAIL' && ?T3_venuename = 'NIPS') .        }
scholar,How many co-authors has Mark Steedman had ?,SELECT DISTINCT (count(DISTINCT ?T1_authorid) as ?aggregation_T1_authorid_97 ) WHERE { ?T1 a :author . ?T2 a :writes . ?T2 :writes\#ref-aid ?T1 .  ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . ?T2 :writes\#paperid ?T2_paperid . FILTER(?T1_authorname != 'Mark Steedman' && ?T2_paperid in (?T24_authorname)) .       {SELECT ?T23_paperid WHERE { ?T23 a :writes . ?T24 a :author . ?T23 :writes\#ref-aid ?T24 .  ?T23 :writes\#paperid ?T23_paperid . ?T24 :author\#authorname ?T24_authorname . FILTER(?T24_authorname = 'Mark Steedman') .        }    } }
scholar,keyphrases used by Christof Dallermassl in 2000,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :paperkeyphrase . ?T3 a :paper . ?T1 :paperkeyphrase\#ref-paperid ?T3 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T3 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . FILTER(?T2_authorname = 'Christof Dallermassl' && ?T3_year = 2000) .        }
scholar,What are keyphrases by Christof Dallermassl in 2000 ?,SELECT DISTINCT ?T1_keyphraseid WHERE { ?T1 a :paperkeyphrase . ?T3 a :paper . ?T1 :paperkeyphrase\#ref-paperid ?T3 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T3 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paperkeyphrase\#keyphraseid ?T1_keyphraseid . ?T2 :author\#authorname ?T2_authorname . ?T3 :paper\#year ?T3_year . FILTER(?T2_authorname = 'Christof Dallermassl' && ?T3_year = 2000) .        }
scholar,what author is most cited ?,SELECT DISTINCT ?T1_authorname (count(DISTINCT ?T2_citingpaperid) as ?aggregation_T2_citingpaperid_107 ) WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T14 a :paper . ?T13 :writes\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T2 a :cite . ?T2 :cite\#ref-citedpaperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :cite\#citingpaperid ?T2_citingpaperid . ?T2 :cite\#citingpaperid ?T2_citingpaperid .        } GROUP BY ?T1_authorname ORDER BY DESC ((count( ?T2_citingpaperid) as ?aggregation_T2_citingpaperid_198 ))
scholar,journal articles by mohammad rastegari,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#journalid ?T1_journalid . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#journalid ?T1_journalid . FILTER(?T2_authorname = 'mohammad rastegari' && ?T1_journalid >= 0) .        }
scholar,best paper in TACL 2014 ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_56 ) ?T2_paperid WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2014 && ?T3_venuename = 'TACL') .        } GROUP BY ?T2_paperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_60 ))
scholar,What was the best paper at TACL 2014 ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_70 ) ?T2_paperid WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#paperid ?T2_paperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2014 && ?T3_venuename = 'TACL') .        } GROUP BY ?T2_paperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_198 ))
scholar,who published at acl 2016 ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2016 && ?T3_venuename = 'acl') .        }
scholar,who had papers at acl 2016 ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T2 :paper\#ref-venueid ?T3 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :paper\#year ?T2_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_year = 2016 && ?T3_venuename = 'acl') .        }
scholar,How many papers run experiments on ImageNet ?,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_56 ) WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
scholar,How many papers used ImageNet dataset ?,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_70 ) WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
scholar,How many papers written on ImageNet ?,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_25 ) WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
scholar,how many papers are based on ImageNet,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_191 ) WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
scholar,how many papers use ImageNet ?,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_154 ) WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
scholar,How many papers did Mirella Lapata cite ?,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_100 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Mirella Lapata') .        }
scholar,how many papers does Mirella Lapata cite,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_76 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Mirella Lapata') .        }
scholar,how many papers has Mirella Lapata cited ?,SELECT DISTINCT (count(DISTINCT ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_57 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Mirella Lapata') .        }
scholar,When does Michael Stonebraker publish the first VLDB paper ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Michael Stonebraker' && ?T3_venuename = 'VLDB') .        }  ORDER BY ASC (?T1_year)
scholar,semantic parsing dataset,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :dataset\#ref-keyphrase_id ?T2 . FILTER(?T2_keyphrasename = 'semantic parsing') .        }
scholar,where does Peter Mertens publish ?,SELECT DISTINCT ?T1_journalid ?T2_venueid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :venue\#venueid ?T2_venueid . ?T3 :author\#authorname ?T3_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :venue\#venueid ?T2_venueid . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T14 :writes\#ref-aid ?T3 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :venue\#venueid ?T2_venueid . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Peter Mertens') .        }
scholar,in what venues does Peter Mertens publish ?,SELECT DISTINCT ?T1_journalid ?T2_venueid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :venue\#venueid ?T2_venueid . ?T3 :author\#authorname ?T3_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :venue\#venueid ?T2_venueid . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T14 :writes\#ref-aid ?T3 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :venue\#venueid ?T2_venueid . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Peter Mertens') .        }
scholar,how many papers appeared at nature communications last year,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_27 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers were at nature communications 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_64 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,how many papers accepted in nature communications 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_54 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers were published in nature communications in 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_11 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers on nature communications in 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_94 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,how many papers in nature communications 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_115 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers were accepted at nature communications 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_170 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers are presented in nature communications 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_200 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers published in nature communications in 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_50 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,how many papers published in nature communications 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_178 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,How many papers was published in nature communications in 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_68 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'nature communications') .        }
scholar,what was the first deep learning paper ?,SELECT DISTINCT ?T1_datasetid ?T2_year WHERE { ?T2 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :dataset\#datasetid ?T1_datasetid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :dataset\#datasetid ?T1_datasetid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T2_year)
scholar,what year was the first deep learning paper published ?,SELECT DISTINCT ?T1_datasetid ?T2_year WHERE { ?T2 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :dataset\#datasetid ?T1_datasetid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :dataset\#datasetid ?T1_datasetid . ?T2 :paper\#year ?T2_year . ?T2 :paper\#year ?T2_year . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T2_year)
scholar,datasets mentioned at ACL,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :dataset\#ref-venue_id ?T2 . FILTER(?T2_venuename = 'ACL') .        }
scholar,what datasets do papers at ACL use most ?,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :dataset\#ref-venue_id ?T2 . FILTER(?T2_venuename = 'ACL') .        }
scholar,the papers on semantic parsing by li dong at acl in 2016,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . ?T16 a :paperkeyphrase . ?T16 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . ?T3 a :keyphrase . ?T16 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . ?T4 a :venue . ?T1 :paper\#ref-venueid ?T4 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . FILTER(?T2_authorname = 'li dong' && ?T3_keyphrasename = 'semantic parsing' && ?T1_year = 2016 && ?T4_venuename = 'acl') .        }
scholar,How many papers were written on convolutional neural networks in 2016 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_89 ) WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T2_keyphrasename = 'convolutional neural networks' && ?T1_year = 2016) .        }
scholar,What papers were written on question answering this year ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T2_keyphrasename = 'question answering' && ?T1_year = 2016) .        }
scholar,which year had the most NIPS papers ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_59 ) ?T1_year WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        } GROUP BY ?T1_year ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_145 ))
scholar,what year had the most NIPS papers ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_173 ) ?T1_year WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        } GROUP BY ?T1_year ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_23 ))
scholar,what year had the most number of NIPS papers ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_141 ) ?T1_year WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        } GROUP BY ?T1_year ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_148 ))
scholar,when were most NIPS papers published ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_52 ) ?T1_year WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        } GROUP BY ?T1_year ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_88 ))
scholar,who writes papers with Noah A Smith ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,Who is a coauthor with Noah A Smith ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,Who has coauthored with Noah A Smith ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,who does Noah A Smith author with ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,who are all the co-authors of Noah A Smith ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,who does Noah A Smith work with ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,who does Noah A Smith collaborate with ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,Who are Noah A Smith 's coauthors ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :author . ?T1 :author\#authorid ?T1_authorid . ?T1 :author\#authorname ?T1_authorname . FILTER(?T1_authorname = 'Noah A Smith') .        }
scholar,what datasets did jitendra malik use ?,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :paperdataset\#ref-author_id ?T2 . FILTER(?T2_authorname = 'jitendra malik') .        }
scholar,what datasets did jitendra malik use in his papers ?,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :paperdataset\#ref-author_id ?T2 . FILTER(?T2_authorname = 'jitendra malik') .        }
scholar,what datasets were used by jitendra malik ?,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :paperdataset\#ref-author_id ?T2 . FILTER(?T2_authorname = 'jitendra malik') .        }
scholar,datasets used in papers written by jitendra malik ?,SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :paperdataset\#ref-author_id ?T2 . FILTER(?T2_authorname = 'jitendra malik') .        }
scholar,recent deep learning papers,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
scholar,What are the latest publications on deep learning ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
scholar,Most recent deep learning conference ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
scholar,Show me some recent papers on deep learning ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
scholar,What are some recent papers written in deep learning ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
scholar,What is the most recent paper of deep learning ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY DESC (?T1_year)
