kg_name,question,query
club_1,How many clubs does 'Linda Smith' belong to?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }
club_1,How many clubs does 'Linda Smith' have membership for?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }
club_1,Find the number of clubs where 'Tracy Kim' is a member.,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Tracy' && ?T2_lname = 'Kim') .        }
club_1,For how many clubs is 'Tracy Kim' a member?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Tracy' && ?T2_lname = 'Kim') .        }
club_1,Find all the female members of club 'Bootup Baltimore'. Show the first name and last name.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T1 :student\#sex ?T1_sex . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T1 :student\#sex ?T1_sex . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T1_sex = 'F') .        }
club_1,What are the first name and last name of each male member in club 'Hopkins Student Enterprises'?,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T1 :student\#sex ?T1_sex . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T1 :student\#sex ?T1_sex . FILTER(?T2_clubname = 'Hopkins Student Enterprises' && ?T1_sex = 'M') .        }
club_1,Find all members of 'Bootup Baltimore' whose major is '600'. Show the first name and last name.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T1 :student\#major ?T1_major . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T1 :student\#major ?T1_major . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T1_major = 600) .        }
club_1,Which club has the most members majoring in '600'?,SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :member_of_club . ?T2 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T3 :student\#major ?T3_major . ?T3 a :student . ?T2 :member_of_club\#ref-stuid ?T3 .  ?T1 :club\#clubname ?T1_clubname . ?T3 :student\#major ?T3_major . FILTER(?T3_major = 600) .        } GROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1
club_1,Find the name of the club that has the most female students.,SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :member_of_club . ?T2 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T3 :student\#sex ?T3_sex . ?T3 a :student . ?T2 :member_of_club\#ref-stuid ?T3 .  ?T1 :club\#clubname ?T1_clubname . ?T3 :student\#sex ?T3_sex . FILTER(?T3_sex = 'F') .        } GROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1
club_1,What is the description of the club named 'Tennis Club'?,SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :club\#clubdesc ?T1_clubdesc . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }
club_1,Find the description of the club 'Pen and Paper Gaming'.,SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :club\#clubdesc ?T1_clubdesc . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }
club_1,What is the description of the club 'Pen and Paper Gaming'?,SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :club\#clubdesc ?T1_clubdesc . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }
club_1,What is the location of the club named 'Tennis Club'?,SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\#clublocation ?T1_clublocation . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }
club_1,Where us the club named 'Tennis Club' located?,SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\#clublocation ?T1_clublocation . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }
club_1,Find the location of the club 'Pen and Paper Gaming'.,SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\#clublocation ?T1_clublocation . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }
club_1,Where is the club 'Pen and Paper Gaming' located?,SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\#clublocation ?T1_clublocation . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }
club_1,Where is the club 'Hopkins Student Enterprises' located?,SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\#clublocation ?T1_clublocation . ?T1 :club\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Hopkins Student Enterprises') .        }
club_1,Find the name of all the clubs at 'AKW'.,SELECT ?T1_clubname WHERE { ?T1 a :club . ?T1 :club\#clubname ?T1_clubname . ?T1 :club\#clublocation ?T1_clublocation . FILTER(?T1_clublocation = 'AKW') .        }
club_1,How many clubs are located at 'HHH'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\#clublocation ?T1_clublocation . FILTER(?T1_clublocation = 'HHH') .        }
club_1,What are the first and last name of the president of the club 'Bootup Baltimore'?,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T3 a :member_of_club . ?T3 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T3 :member_of_club\#position ?T3_position . ?T2 a :club . ?T3 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T3 :member_of_club\#position ?T3_position . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_position = 'President') .        }
club_1,Find the first name and last name for the 'CTO' of the club 'Hopkins Student Enterprises'?,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T3 a :member_of_club . ?T3 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T3 :member_of_club\#position ?T3_position . ?T2 a :club . ?T3 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :club\#clubname ?T2_clubname . ?T3 :member_of_club\#position ?T3_position . FILTER(?T2_clubname = 'Hopkins Student Enterprises' && ?T3_position = 'CTO') .        }
club_1,How many different roles are there in the club 'Bootup Baltimore'?,SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_51 ) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\#ref-clubid ?T2 .  ?T1 :member_of_club\#position ?T1_position . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }
club_1,Count the number of different positions in the club 'Bootup Baltimore'.,SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_5 ) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\#ref-clubid ?T2 .  ?T1 :member_of_club\#position ?T1_position . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }
club_1,How many members of 'Bootup Baltimore' are older than 18?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\#ref-clubid ?T2 .  ?T2 :club\#clubname ?T2_clubname . ?T3 :student\#age ?T3_age . ?T3 a :student . ?T1 :member_of_club\#ref-stuid ?T3 .  ?T2 :club\#clubname ?T2_clubname . ?T3 :student\#age ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age > 18) .        }
club_1,How many members of club 'Bootup Baltimore' are younger than 18?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\#ref-clubid ?T2 .  ?T2 :club\#clubname ?T2_clubname . ?T3 :student\#age ?T3_age . ?T3 a :student . ?T1 :member_of_club\#ref-stuid ?T3 .  ?T2 :club\#clubname ?T2_clubname . ?T3 :student\#age ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age < 18) .        }
club_1,Find the names of all the clubs that have at least a member from the city with city code 'BAL'.,SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#city_code ?T2_city_code . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#city_code ?T2_city_code . FILTER(?T2_city_code = 'BAL') .        }
club_1,How many clubs does the student named 'Eric Tai' belong to?,SELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_102 ) WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai') .        }
club_1,Count the number of clubs for which the student named 'Eric Tai' is a member.,SELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_11 ) WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai') .        }
club_1,List the clubs having 'Davis Steven' as a member.,SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Davis' && ?T2_lname = 'Steven') .        }
club_1,What are the names of the clubs that have 'Davis Steven' as a member?,SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Davis' && ?T2_lname = 'Steven') .        }
club_1,List the clubs that have at least a member with advisor '1121'.,SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#advisor ?T2_advisor . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#advisor ?T2_advisor . FILTER(?T2_advisor = 1121) .        }
club_1,Which clubs have one or more members whose advisor is '1121'?,SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-clubid ?T1 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#advisor ?T2_advisor . ?T2 a :student . ?T13 :member_of_club\#ref-stuid ?T2 .  ?T1 :club\#clubname ?T1_clubname . ?T2 :student\#advisor ?T2_advisor . FILTER(?T2_advisor = 1121) .        }
club_1,What is the average age of the members of the club 'Bootup Baltimore'?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_18 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }
club_1,Find the average age of the members in the club 'Bootup Baltimore'.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_156 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }
club_1,Find the average age of members of the club 'Hopkins Student Enterprises'.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_192 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Hopkins Student Enterprises') .        }
club_1,"On average, how old are the members in the club 'Hopkins Student Enterprises'?",SELECT (avg( ?T1_age) as ?aggregation_T1_age_68 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Hopkins Student Enterprises') .        }
club_1,Retrieve the average age of members of the club 'Tennis Club'.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') .        }
club_1,Compute the average age of the members in the club 'Tennis Club'.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_161 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\#ref-clubid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :club\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') .        }
tracking_grants_for_research,What are the distinct grant amount for the grants where the documents were sent before '1986-08-26 20:49:27' and grant were ended after '1989-03-16 18:27:16'?,SELECT DISTINCT ?T1_grant_amount WHERE { ?T1 a :grants . ?T2 a :documents . ?T2 :documents\#ref-grant_id ?T1 .  ?T1 :grants\#grant_amount ?T1_grant_amount . ?T2 :documents\#sent_date ?T2_sent_date . FILTER(?T2_sent_date < 1986-08-26 20:49:27) . FILTER (?T1_grant_amount in (?T3_grant_amount)) .   ?T3 a :grants . ?T3 :grants\#grant_amount ?T3_grant_amount . ?T3 :grants\#grant_end_date ?T3_grant_end_date .  FILTER(?T3_grant_end_date > 1989-03-16 18:27:16) .             }
tracking_grants_for_research,What are the different grant amounts for documents sent before '1986-08-26 20:49:27' and after the grant ended on '1989-03-16 18:27:16'?,SELECT DISTINCT ?T1_grant_amount WHERE { ?T1 a :grants . ?T2 a :documents . ?T2 :documents\#ref-grant_id ?T1 .  ?T1 :grants\#grant_amount ?T1_grant_amount . ?T2 :documents\#sent_date ?T2_sent_date . FILTER(?T2_sent_date < 1986-08-26 20:49:27) . FILTER (?T1_grant_amount in (?T3_grant_amount)) .   ?T3 a :grants . ?T3 :grants\#grant_amount ?T3_grant_amount . ?T3 :grants\#grant_end_date ?T3_grant_end_date .  FILTER(?T3_grant_end_date > 1989-03-16 18:27:16) .             }
tracking_grants_for_research,List the project details of the project both producing patent and paper as outcomes.,SELECT DISTINCT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :project_outcomes\#outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'Paper') . FILTER (?T1_project_details in (?T3_project_details)) .   ?T3 a :projects . ?T4 a :project_outcomes . ?T4 :project_outcomes\#ref-project_id ?T3 .  ?T3 :projects\#project_details ?T3_project_details . ?T4 :project_outcomes\#outcome_code ?T4_outcome_code .  FILTER(?T4_outcome_code = 'Patent') .             }
tracking_grants_for_research,What are the details of the project that is producing both patents and papers as outcomes?,SELECT DISTINCT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :project_outcomes\#outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'Paper') . FILTER (?T1_project_details in (?T3_project_details)) .   ?T3 a :projects . ?T4 a :project_outcomes . ?T4 :project_outcomes\#ref-project_id ?T3 .  ?T3 :projects\#project_details ?T3_project_details . ?T4 :project_outcomes\#outcome_code ?T4_outcome_code .  FILTER(?T4_outcome_code = 'Patent') .             }
tracking_grants_for_research,What is the total amount of grant money for research?,SELECT (sum( ?T1_grant_amount) as ?aggregation_T1_grant_amount_150 ) WHERE { ?T1 a :grants . ?T13 a :organisations . ?T1 :grants\#ref-organisation_id ?T13 .  ?T1 :grants\#grant_amount ?T1_grant_amount . ?T2 :organisation_types\#organisation_type_description ?T2_organisation_type_description . ?T2 a :organisation_types . ?T13 :organisations\#ref-organisation_type ?T2 .  ?T1 :grants\#grant_amount ?T1_grant_amount . ?T2 :organisation_types\#organisation_type_description ?T2_organisation_type_description . FILTER(?T2_organisation_type_description = 'Research') .        }
tracking_grants_for_research,List from which date and to which date these staff work: project staff of the project which hires the most staffs,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#project_id ?T1_project_id . FILTER(?T1_project_id in (?T22_project_id)) .   }} UNION {SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#role_code ?T1_role_code . FILTER(?T1_role_code = 'leader') .        }      } }
tracking_grants_for_research,From what date and to what date do the staff work on a project that has the most staff and has staff in a leader role?,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#project_id ?T1_project_id . FILTER(?T1_project_id in (?T22_project_id)) .   }} UNION {SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#role_code ?T1_role_code . FILTER(?T1_role_code = 'leader') .        }      } }
tracking_grants_for_research,Find the organisation ids and details of the organisations which are involved in,SELECT ?T1_organisation_id ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :grants . ?T2 :grants\#ref-organisation_id ?T1 .  ?T1 :organisations\#organisation_id ?T1_organisation_id . ?T1 :organisations\#organisation_details ?T1_organisation_details . ?T2 :grants\#grant_amount ?T2_grant_amount .        } GROUP BY ?T1_organisation_id ?T1_organisation_details   HAVING(sum( ?T2_grant_amount)  > 6000)
tracking_grants_for_research,What are the ids and details for all organizations that have grants of more than 6000 dollars?,SELECT ?T1_organisation_id ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :grants . ?T2 :grants\#ref-organisation_id ?T1 .  ?T1 :organisations\#organisation_id ?T1_organisation_id . ?T1 :organisations\#organisation_details ?T1_organisation_details . ?T2 :grants\#grant_amount ?T2_grant_amount .        } GROUP BY ?T1_organisation_id ?T1_organisation_details   HAVING(sum( ?T2_grant_amount)  > 6000)
tracking_grants_for_research,Which organisation type hires most research staff?,SELECT ?T1_organisation_type (count( *) as ?aggregation_all) WHERE { ?T1 a :organisations . ?T2 a :research_staff . ?T2 :research_staff\#ref-employer_organisation_id ?T1 .  ?T1 :organisations\#organisation_type ?T1_organisation_type .        } GROUP BY ?T1_organisation_type  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,What is the type of the organization with the most research staff?,SELECT ?T1_organisation_type (count( *) as ?aggregation_all) WHERE { ?T1 a :organisations . ?T2 a :research_staff . ?T2 :research_staff\#ref-employer_organisation_id ?T1 .  ?T1 :organisations\#organisation_type ?T1_organisation_type .        } GROUP BY ?T1_organisation_type  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,Find out the send dates of the documents with the grant amount of more than 5000 were granted by organisation type described,SELECT ?T1_sent_date WHERE { ?T1 a :documents . ?T2 a :grants . ?T1 :documents\#ref-grant_id ?T2 .  ?T1 :documents\#sent_date ?T1_sent_date . ?T2 :grants\#grant_amount ?T2_grant_amount . ?T3 :organisation_types\#organisation_type_description ?T3_organisation_type_description . ?T14 a :organisations . ?T2 :grants\#ref-organisation_id ?T14 .  ?T1 :documents\#sent_date ?T1_sent_date . ?T2 :grants\#grant_amount ?T2_grant_amount . ?T3 :organisation_types\#organisation_type_description ?T3_organisation_type_description . ?T3 a :organisation_types . ?T14 :organisations\#ref-organisation_type ?T3 .  ?T1 :documents\#sent_date ?T1_sent_date . ?T2 :grants\#grant_amount ?T2_grant_amount . ?T3 :organisation_types\#organisation_type_description ?T3_organisation_type_description . FILTER(?T2_grant_amount > 5000 && ?T3_organisation_type_description = 'Research') .        }
tracking_grants_for_research,List the project details of the projects which did not hire any staff for a researcher role.,SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :projects\#project_details ?T1_project_details . ?T1 :projects\#project_id ?T1_project_id . FILTER(?T1_project_id not in (?T22_role_code)) .       {SELECT ?T22_project_id WHERE { ?T22 a :project_staff . ?T22 :project_staff\#project_id ?T22_project_id . ?T22 :project_staff\#role_code ?T22_role_code . FILTER(?T22_role_code = 'researcher') .        }    } }
tracking_grants_for_research,"What are the task details, task id and project id for the projects which are detailed as 'omnis' or  have more than 2 outcomes?",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_task_details as ?col1) (?T1_task_id as ?col2) (?T2_project_id as ?col3) WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :tasks\#ref-project_id ?T2 .  ?T1 :tasks\#task_details ?T1_task_details . ?T1 :tasks\#task_id ?T1_task_id . ?T2 :projects\#project_id ?T2_project_id . ?T2 :projects\#project_details ?T2_project_details . FILTER(?T2_project_details = 'omnis') .   }} UNION {SELECT (?T1_task_details as ?col1) (?T1_task_id as ?col2) (?T2_project_id as ?col3) WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :tasks\#ref-project_id ?T2 .  ?T1 :tasks\#task_details ?T1_task_details . ?T1 :tasks\#task_id ?T1_task_id . ?T2 :projects\#project_id ?T2_project_id . ?T3 a :project_outcomes . ?T3 :project_outcomes\#ref-project_id ?T2 .  ?T1 :tasks\#task_details ?T1_task_details . ?T1 :tasks\#task_id ?T1_task_id . ?T2 :projects\#project_id ?T2_project_id .        } GROUP BY ?T1_task_details ?T1_task_id ?T2_project_id   HAVING(count( *)  > 2)  } }
tracking_grants_for_research,"What are the task details, task ids, and project ids for the progrects that are detailed as 'omnis' or have at least 3 outcomes?",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_task_details as ?col1) (?T1_task_id as ?col2) (?T2_project_id as ?col3) WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :tasks\#ref-project_id ?T2 .  ?T1 :tasks\#task_details ?T1_task_details . ?T1 :tasks\#task_id ?T1_task_id . ?T2 :projects\#project_id ?T2_project_id . ?T2 :projects\#project_details ?T2_project_details . FILTER(?T2_project_details = 'omnis') .   }} UNION {SELECT (?T1_task_details as ?col1) (?T1_task_id as ?col2) (?T2_project_id as ?col3) WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :tasks\#ref-project_id ?T2 .  ?T1 :tasks\#task_details ?T1_task_details . ?T1 :tasks\#task_id ?T1_task_id . ?T2 :projects\#project_id ?T2_project_id . ?T3 a :project_outcomes . ?T3 :project_outcomes\#ref-project_id ?T2 .  ?T1 :tasks\#task_details ?T1_task_details . ?T1 :tasks\#task_id ?T1_task_id . ?T2 :projects\#project_id ?T2_project_id .        } GROUP BY ?T1_task_details ?T1_task_id ?T2_project_id   HAVING(count( *)  > 2)  } }
tracking_grants_for_research,When did researchers start and stop working?,SELECT ?T1_date_from ?T1_date_to WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#role_code ?T1_role_code . FILTER(?T1_role_code = 'researcher') .        }
tracking_grants_for_research,How many kinds of roles are there for the staff?,SELECT DISTINCT (count(DISTINCT ?T1_role_code) as ?aggregation_T1_role_code_24 ) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#role_code ?T1_role_code .        }
tracking_grants_for_research,How many different roles are there on the project staff?,SELECT DISTINCT (count(DISTINCT ?T1_role_code) as ?aggregation_T1_role_code_112 ) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#role_code ?T1_role_code .        }
tracking_grants_for_research,What is the total amount of grants given by each organisations? Also list the organisation id.,SELECT (sum( ?T1_grant_amount) as ?aggregation_T1_grant_amount_81 ) ?T1_organisation_id WHERE { ?T1 a :grants . ?T1 :grants\#grant_amount ?T1_grant_amount . ?T1 :grants\#organisation_id ?T1_organisation_id .        } GROUP BY ?T1_organisation_id
tracking_grants_for_research,List the project details of the projects with the research outcome described with the substring 'Published'.,"SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T13 a :project_outcomes . ?T13 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :research_outcomes\#outcome_description ?T2_outcome_description . ?T2 a :research_outcomes . ?T13 :project_outcomes\#ref-outcome_code ?T2 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :research_outcomes\#outcome_description ?T2_outcome_description . FILTER(contains (?T2_outcome_description, 'Published')) .        }"
tracking_grants_for_research,What are the details for the project whose research has been published?,"SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T13 a :project_outcomes . ?T13 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :research_outcomes\#outcome_description ?T2_outcome_description . ?T2 a :research_outcomes . ?T13 :project_outcomes\#ref-outcome_code ?T2 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :research_outcomes\#outcome_description ?T2_outcome_description . FILTER(contains (?T2_outcome_description, 'Published')) .        }"
tracking_grants_for_research,How many staff does each project has? List the project id and the number in an ascending order.,SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a :project_staff . ?T2 a :projects . ?T1 :project_staff\#ref-project_id ?T2 .  ?T1 :project_staff\#project_id ?T1_project_id .        } GROUP BY ?T1_project_id ORDER BY ASC ((count( *) as ?aggregation_all))
tracking_grants_for_research,What is the complete description of the researcher role.,SELECT ?T1_role_description WHERE { ?T1 a :staff_roles . ?T1 :staff_roles\#role_description ?T1_role_description . ?T1 :staff_roles\#role_code ?T1_role_code . FILTER(?T1_role_code = 'researcher') .        }
tracking_grants_for_research,What is the complete description of the job of a researcher?,SELECT ?T1_role_description WHERE { ?T1 a :staff_roles . ?T1 :staff_roles\#role_description ?T1_role_description . ?T1 :staff_roles\#role_code ?T1_role_code . FILTER(?T1_role_code = 'researcher') .        }
tracking_grants_for_research,When did the first staff for the projects started working?,SELECT ?T1_date_from WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_from ?T1_date_from .        }   ORDER BY ASC (?T1_date_from) LIMIT 1
tracking_grants_for_research,When did the first staff member start working?,SELECT ?T1_date_from WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_from ?T1_date_from .        }   ORDER BY ASC (?T1_date_from) LIMIT 1
tracking_grants_for_research,Which project made the most number of outcomes? List the project details and the project id.,SELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T1 :projects\#project_id ?T1_project_id .        } GROUP BY ?T1_project_details ?T1_project_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,What are the details and id of the project with the most outcomes?,SELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T1 :projects\#project_id ?T1_project_id .        } GROUP BY ?T1_project_details ?T1_project_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,Which projects have no outcome? List the project details.,SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :projects\#project_details ?T1_project_details . ?T1 :projects\#project_id ?T1_project_id . FILTER(?T1_project_id not in (?T22_project_id)) .       {SELECT ?T22_project_id WHERE { ?T22 a :project_outcomes . ?T22 :project_outcomes\#project_id ?T22_project_id .        }    } }
tracking_grants_for_research,What are the details of the project with no outcomes?,SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :projects\#project_details ?T1_project_details . ?T1 :projects\#project_id ?T1_project_id . FILTER(?T1_project_id not in (?T22_project_id)) .       {SELECT ?T22_project_id WHERE { ?T22 a :project_outcomes . ?T22 :project_outcomes\#project_id ?T22_project_id .        }    } }
