kg_name,question,query
customers_and_addresses,Tell me the total quantity of products bought by the customer called 'Rodrick Heaney'.,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_32 ) WHERE { ?T1 a :order_items . ?T13 a :customer_orders . ?T1 :order_items\#ref-order_id ?T13 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customers\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customer_orders\#ref-customer_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Rodrick Heaney') .        }
customers_and_addresses,How many customers have at least one order with status 'Cancelled'?,SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_145 ) WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\#customer_id ?T1_customer_id . ?T1 :customer_orders\#order_status ?T1_order_status . FILTER(?T1_order_status = 'Cancelled') .        }
customers_and_addresses,Return the number of customers who have at least one order with 'Cancelled' status.,SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_119 ) WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\#customer_id ?T1_customer_id . ?T1 :customer_orders\#order_status ?T1_order_status . FILTER(?T1_order_status = 'Cancelled') .        }
customers_and_addresses,How many orders have detail 'Second time'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\#order_details ?T1_order_details . FILTER(?T1_order_details = 'Second time') .        }
customers_and_addresses,Find the customer name and date of the orders that have the status 'Delivered'.,SELECT ?T1_customer_name ?T2_order_date WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :customer_orders\#order_date ?T2_order_date . ?T2 :customer_orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'Delivered') .        }
customers_and_addresses,What is the total number of products that are in orders with status 'Cancelled'?,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_55 ) WHERE { ?T1 a :order_items . ?T2 a :customer_orders . ?T1 :order_items\#ref-order_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customer_orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'Cancelled') .        }
customers_and_addresses,Find the total quantity of products associated with the orders in the 'Cancelled' status.,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_102 ) WHERE { ?T1 a :order_items . ?T2 a :customer_orders . ?T1 :order_items\#ref-order_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customer_orders\#order_status ?T2_order_status . FILTER(?T2_order_status = 'Cancelled') .        }
customers_and_addresses,Find the total amount of products ordered before 2018-03-17 07:13:53.,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_137 ) WHERE { ?T1 a :order_items . ?T2 a :customer_orders . ?T1 :order_items\#ref-order_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customer_orders\#order_date ?T2_order_date . FILTER(?T2_order_date < 2018-03-17 07:13:53) .        }
customers_and_addresses,What is the total amount of products purchased before 2018-03-17 07:13:53?,SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_136 ) WHERE { ?T1 a :order_items . ?T2 a :customer_orders . ?T1 :order_items\#ref-order_id ?T2 .  ?T1 :order_items\#order_quantity ?T1_order_quantity . ?T2 :customer_orders\#order_date ?T2_order_date . FILTER(?T2_order_date < 2018-03-17 07:13:53) .        }
customers_and_addresses,Who made the latest order?,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :customer_orders\#order_date ?T2_order_date .        }   ORDER BY DESC (?T2_order_date) LIMIT 1
customers_and_addresses,Which product has been ordered most number of times?,SELECT ?T1_product_details (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :order_items . ?T2 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_details ?T1_product_details .        } GROUP BY ?T1_product_details  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_and_addresses,Find the name and ID of the product whose total order quantity is the largest.,SELECT ?T1_product_details ?T1_product_id WHERE { ?T1 a :products . ?T2 a :order_items . ?T2 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_details ?T1_product_details . ?T1 :products\#product_id ?T1_product_id . ?T2 :order_items\#order_quantity ?T2_order_quantity .        } GROUP BY ?T1_product_details ?T1_product_id  ORDER BY ASC ((sum( ?T2_order_quantity) as ?aggregation_T2_order_quantity_200 )) LIMIT 1
customers_and_addresses,"Find all the addresses in East Julianaside, Texas or in Gleasonmouth, Arizona.",SELECT distinct?col1 WHERE { { SELECT (?T1_address_content as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#address_content ?T1_address_content . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#state_province_county ?T1_state_province_county . FILTER(?T1_city = 'East Julianaside' && ?T1_state_province_county = 'Texas') .   }} UNION {SELECT (?T1_address_content as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\#address_content ?T1_address_content . ?T1 :addresses\#city ?T1_city . ?T1 :addresses\#state_province_county ?T1_state_province_county . FILTER(?T1_city = 'Gleasonmouth' && ?T1_state_province_county = 'Arizona') .        }      } }
customers_and_addresses,Find the names of customers who never ordered product Latte.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name .   }}  MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :customers . ?T14 a :customer_orders . ?T14 :customer_orders\#ref-customer_id ?T2 .  ?T2 :customers\#customer_name ?T2_customer_name . ?T3 :products\#product_details ?T3_product_details . ?T15 a :order_items . ?T15 :order_items\#ref-order_id ?T14 .  ?T2 :customers\#customer_name ?T2_customer_name . ?T3 :products\#product_details ?T3_product_details . ?T3 a :products . ?T15 :order_items\#ref-product_id ?T3 .  ?T2 :customers\#customer_name ?T2_customer_name . ?T3 :products\#product_details ?T3_product_details . FILTER(?T3_product_details = 'Latte') .        }     } }
customers_and_addresses,Find the names of customers who ordered both products Latte and Americano.,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_details ?T2_product_details . ?T14 a :order_items . ?T14 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_details ?T2_product_details . ?T2 a :products . ?T14 :order_items\#ref-product_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_details ?T2_product_details . FILTER(?T2_product_details = 'Latte') . FILTER (?T1_customer_name in (?T3_customer_name)) .   ?T3 a :customers . ?T15 a :customer_orders . ?T15 :customer_orders\#ref-customer_id ?T3 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :products\#product_details ?T4_product_details . ?T16 a :order_items . ?T16 :order_items\#ref-order_id ?T15 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :products\#product_details ?T4_product_details . ?T4 a :products . ?T16 :order_items\#ref-product_id ?T4 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :products\#product_details ?T4_product_details .  FILTER(?T4_product_details = 'Americano') .             }
customers_and_addresses,What are the names of customers who have purchased both products Latte and Americano?,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_details ?T2_product_details . ?T14 a :order_items . ?T14 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_details ?T2_product_details . ?T2 a :products . ?T14 :order_items\#ref-product_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_details ?T2_product_details . FILTER(?T2_product_details = 'Latte') . FILTER (?T1_customer_name in (?T3_customer_name)) .   ?T3 a :customers . ?T15 a :customer_orders . ?T15 :customer_orders\#ref-customer_id ?T3 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :products\#product_details ?T4_product_details . ?T16 a :order_items . ?T16 :order_items\#ref-order_id ?T15 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :products\#product_details ?T4_product_details . ?T4 a :products . ?T16 :order_items\#ref-product_id ?T4 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :products\#product_details ?T4_product_details .  FILTER(?T4_product_details = 'Americano') .             }
music_4,How many artists are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist .        }
music_4,List the age of all music artists.,SELECT ?T1_age WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age .        }
music_4,What are the ages of all music artists?,SELECT ?T1_age WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age .        }
music_4,What is the average age of all artists?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_92 ) WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age .        }
music_4,Return the average age across all artists.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_100 ) WHERE { ?T1 a :artist . ?T1 :artist\#age ?T1_age .        }
music_4,What are the famous titles of the artist 'Triumfall'?,SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T1 :artist\#famous_title ?T1_famous_title . ?T1 :artist\#artist ?T1_artist . FILTER(?T1_artist = 'Triumfall') .        }
music_4,What are the distinct Famous release dates?,SELECT DISTINCT ?T1_famous_release_date WHERE { ?T1 a :artist . ?T1 :artist\#famous_release_date ?T1_famous_release_date .        }
music_4,Return the dates of ceremony and the results of all music festivals,SELECT ?T1_date_of_ceremony ?T1_result WHERE { ?T1 a :music_festival . ?T1 :music_festival\#date_of_ceremony ?T1_date_of_ceremony . ?T1 :music_festival\#result ?T1_result .        }
music_4,What are the dates of ceremony and results for each music festival?,SELECT ?T1_date_of_ceremony ?T1_result WHERE { ?T1 a :music_festival . ?T1 :music_festival\#date_of_ceremony ?T1_date_of_ceremony . ?T1 :music_festival\#result ?T1_result .        }
music_4,What are the category of music festivals with result 'Awarded'?,SELECT ?T1_category WHERE { ?T1 a :music_festival . ?T1 :music_festival\#category ?T1_category . ?T1 :music_festival\#result ?T1_result . FILTER(?T1_result = 'Awarded') .        }
music_4,What are the maximum and minimum week on top of all volumes?,SELECT (max( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_24 ) (min( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_111 ) WHERE { ?T1 a :volume . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top .        }
music_4,Give the maximum and minimum weeks on top across all volumes.,SELECT (max( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_132 ) (min( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_2 ) WHERE { ?T1 a :volume . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top .        }
music_4,What are the songs in volumes with more than 1 week on top?,SELECT ?T1_song WHERE { ?T1 a :volume . ?T1 :volume\#song ?T1_song . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top . FILTER(?T1_weeks_on_top > 1) .        }
music_4,Please list all songs in volumes in ascending alphabetical order.,SELECT ?T1_song WHERE { ?T1 a :volume . ?T1 :volume\#song ?T1_song . ?T1 :volume\#song ?T1_song .        }  ORDER BY ASC (?T1_song)
music_4,How many distinct artists do the volumes associate to?,SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_74 ) WHERE { ?T1 a :volume . ?T1 :volume\#artist_id ?T1_artist_id .        }
music_4,Please show the date of ceremony of the volumes that last more than 2 weeks on top.,SELECT ?T1_date_of_ceremony WHERE { ?T1 a :music_festival . ?T2 a :volume . ?T1 :music_festival\#ref-volume ?T2 .  ?T1 :music_festival\#date_of_ceremony ?T1_date_of_ceremony . ?T2 :volume\#weeks_on_top ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) .        }
music_4,Please show the songs that have result 'nominated' at music festivals.,SELECT ?T1_song WHERE { ?T1 a :volume . ?T2 a :music_festival . ?T2 :music_festival\#ref-volume ?T1 .  ?T1 :volume\#song ?T1_song . ?T2 :music_festival\#result ?T2_result . FILTER(?T2_result = 'Nominated') .        }
music_4,What are the issue dates of volumes associated with the artist 'Gorgoroth'?,SELECT ?T1_issue_date WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :volume\#ref-artist_id ?T2 .  ?T1 :volume\#issue_date ?T1_issue_date . ?T2 :artist\#artist ?T2_artist . FILTER(?T2_artist = 'Gorgoroth') .        }
music_4,Return names of songs in volumes that are by artists that are at least 32 years old.,SELECT ?T1_song WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :volume\#ref-artist_id ?T2 .  ?T1 :volume\#song ?T1_song . ?T2 :artist\#age ?T2_age . FILTER(?T2_age >= 32) .        }
music_4,Return the average number of weeks on top for volumes by artists that are at most 25 years old.,SELECT (avg( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_111 ) WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :volume\#ref-artist_id ?T2 .  ?T1 :volume\#weeks_on_top ?T1_weeks_on_top . ?T2 :artist\#age ?T2_age . FILTER(?T2_age <= 25) .        }
music_4,Return the famous titles for artists that have volumes that lasted more than 2 weeks on top.,SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T2 a :volume . ?T2 :volume\#ref-artist_id ?T1 .  ?T1 :artist\#famous_title ?T1_famous_title . ?T2 :volume\#weeks_on_top ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) .        }
music_4,Please list the age and famous title of artists in descending order of age.,SELECT ?T1_famous_title ?T1_age WHERE { ?T1 a :artist . ?T1 :artist\#famous_title ?T1_famous_title . ?T1 :artist\#age ?T1_age . ?T1 :artist\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
music_4,What is the famous release date of the artist with the oldest age?,SELECT ?T1_famous_release_date WHERE { ?T1 a :artist . ?T1 :artist\#famous_release_date ?T1_famous_release_date . ?T1 :artist\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
music_4,Please show the categories of the music festivals and the count.,SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a :music_festival . ?T1 :music_festival\#category ?T1_category .        } GROUP BY ?T1_category
music_4,What is the most common result of the music festival?,SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a :music_festival . ?T1 :music_festival\#result ?T1_result .        } GROUP BY ?T1_result  ORDER BY DESC (?aggregation_all) LIMIT 1
music_4,Please show the categories of the music festivals with count more than 1.,SELECT ?T1_category WHERE { ?T1 a :music_festival . ?T1 :music_festival\#category ?T1_category .        } GROUP BY ?T1_category   HAVING(count( *)  > 1)
music_4,What is the song in the volume with the maximum weeks on top?,SELECT ?T1_song WHERE { ?T1 a :volume . ?T1 :volume\#song ?T1_song . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top .        }   ORDER BY DESC (?T1_weeks_on_top) LIMIT 1
music_4,Return the song in the volume that has spent the most weeks on top?,SELECT ?T1_song WHERE { ?T1 a :volume . ?T1 :volume\#song ?T1_song . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top .        }   ORDER BY DESC (?T1_weeks_on_top) LIMIT 1
music_4,Find the famous titles of artists that do not have any volume.,SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T1 :artist\#famous_title ?T1_famous_title . ?T1 :artist\#artist_id ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) .       {SELECT ?T22_artist_id WHERE { ?T22 a :volume . ?T22 :volume\#artist_id ?T22_artist_id .        }    } }
music_4,What are the famous titles of artists who do not have any volumes?,SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T1 :artist\#famous_title ?T1_famous_title . ?T1 :artist\#artist_id ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) .       {SELECT ?T22_artist_id WHERE { ?T22 a :volume . ?T22 :volume\#artist_id ?T22_artist_id .        }    } }
music_4,Show the famous titles of the artists with both volumes that lasted more than 2 weeks on top and volumes that lasted less than 2 weeks on top.,SELECT DISTINCT ?T1_famous_title WHERE { ?T1 a :artist . ?T2 a :volume . ?T2 :volume\#ref-artist_id ?T1 .  ?T1 :artist\#famous_title ?T1_famous_title . ?T2 :volume\#weeks_on_top ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . FILTER (?T1_famous_title in (?T3_famous_title)) .   ?T3 a :artist . ?T4 a :volume . ?T4 :volume\#ref-artist_id ?T3 .  ?T3 :artist\#famous_title ?T3_famous_title . ?T4 :volume\#weeks_on_top ?T4_weeks_on_top .  FILTER(?T4_weeks_on_top < 2) .             }
music_4,What are the date of ceremony of music festivals with category 'Best Song' and result 'Awarded'?,SELECT ?T1_date_of_ceremony WHERE { ?T1 a :music_festival . ?T1 :music_festival\#date_of_ceremony ?T1_date_of_ceremony . ?T1 :music_festival\#category ?T1_category . ?T1 :music_festival\#result ?T1_result . FILTER(?T1_category = 'Best Song' && ?T1_result = 'Awarded') .        }
music_4,What is the issue date of the volume with the minimum weeks on top?,SELECT ?T1_issue_date WHERE { ?T1 a :volume . ?T1 :volume\#issue_date ?T1_issue_date . ?T1 :volume\#weeks_on_top ?T1_weeks_on_top .        }   ORDER BY ASC (?T1_weeks_on_top) LIMIT 1
music_4,How many distinct artists have volumes?,SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_115 ) WHERE { ?T1 a :volume . ?T1 :volume\#artist_id ?T1_artist_id .        }
music_4,Count the number of artists who have had volumes.,SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_119 ) WHERE { ?T1 a :volume . ?T1 :volume\#artist_id ?T1_artist_id .        }
music_4,"Please show the results of music festivals and the number of music festivals that have had each, ordered by this count.",SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a :music_festival . ?T1 :music_festival\#result ?T1_result .        } GROUP BY ?T1_result ORDER BY DESC ((count( *) as ?aggregation_all))
music_4,Return the issue dates of volumes by artists who are at most 23 years old?,SELECT ?T1_issue_date WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :volume\#ref-artist_id ?T2 .  ?T1 :volume\#issue_date ?T1_issue_date . ?T2 :artist\#age ?T2_age . FILTER(?T2_age <= 23) .        }
roller_coaster,How many roller coasters are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :roller_coaster .        }
roller_coaster,List the names of roller coasters by ascending order of length.,SELECT ?T1_name WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#name ?T1_name . ?T1 :roller_coaster\#length ?T1_length .        }  ORDER BY ASC (?T1_length)
roller_coaster,What are the lengths and heights of roller coasters?,SELECT ?T1_length ?T1_height WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#length ?T1_length . ?T1 :roller_coaster\#height ?T1_height .        }
roller_coaster,List the names of countries whose language is not 'German'.,SELECT ?T1_name WHERE { ?T1 a :country . ?T1 :country\#name ?T1_name . ?T1 :country\#languages ?T1_languages . FILTER(?T1_languages != 'German') .        }
roller_coaster,Show the statuses of roller coasters longer than 3300 or higher than 100.,SELECT ?T1_status WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#status ?T1_status . ?T1 :roller_coaster\#length ?T1_length . ?T1 :roller_coaster\#height ?T1_height . FILTER(?T1_length > 3300 || ?T1_height > 100) .        }
roller_coaster,What are the speeds of the longest roller coaster?,SELECT ?T1_speed WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#speed ?T1_speed . ?T1 :roller_coaster\#length ?T1_length .        }   ORDER BY DESC (?T1_length) LIMIT 1
roller_coaster,What is the average speed of roller coasters?,SELECT (avg( ?T1_speed) as ?aggregation_T1_speed_27 ) WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#speed ?T1_speed .        }
roller_coaster,Show the different statuses and the numbers of roller coasters for each status.,SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#status ?T1_status .        } GROUP BY ?T1_status
roller_coaster,Please show the most common status of roller coasters.,SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#status ?T1_status .        } GROUP BY ?T1_status  ORDER BY DESC (?aggregation_all) LIMIT 1
roller_coaster,List the status shared by more than two roller coaster.,SELECT ?T1_status WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#status ?T1_status .        } GROUP BY ?T1_status   HAVING(count( *)  > 2)
roller_coaster,Show the park of the roller coaster with the highest speed.,SELECT ?T1_park WHERE { ?T1 a :roller_coaster . ?T1 :roller_coaster\#park ?T1_park . ?T1 :roller_coaster\#speed ?T1_speed .        }   ORDER BY DESC (?T1_speed) LIMIT 1
roller_coaster,Show the names of roller coasters and names of country they are in.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :roller_coaster . ?T2 a :country . ?T1 :roller_coaster\#ref-country_id ?T2 .  ?T1 :roller_coaster\#name ?T1_name . ?T2 :country\#name ?T2_name .        }
roller_coaster,Show the names of countries that have more than one roller coaster.,SELECT ?T1_name WHERE { ?T1 a :country . ?T2 a :roller_coaster . ?T2 :roller_coaster\#ref-country_id ?T1 .  ?T1 :country\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
roller_coaster,Show the name and population of the country that has the highest roller coaster.,SELECT ?T1_name ?T1_population WHERE { ?T1 a :country . ?T2 a :roller_coaster . ?T2 :roller_coaster\#ref-country_id ?T1 .  ?T1 :country\#name ?T1_name . ?T1 :country\#population ?T1_population . ?T2 :roller_coaster\#height ?T2_height .        }   ORDER BY DESC (?T2_height) LIMIT 1
roller_coaster,Show the names of countries and the average speed of roller coasters from each country.,SELECT ?T1_name (avg( ?T2_speed) as ?aggregation_T2_speed_102 ) WHERE { ?T1 a :country . ?T2 a :roller_coaster . ?T2 :roller_coaster\#ref-country_id ?T1 .  ?T1 :country\#name ?T1_name . ?T2 :roller_coaster\#speed ?T2_speed .        } GROUP BY ?T1_name
roller_coaster,How many countries do not have an roller coaster longer than 3000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :country . ?T1 :country\#country_id ?T1_country_id . FILTER(?T1_country_id not in (?T22_length)) .       {SELECT ?T22_country_id WHERE { ?T22 a :roller_coaster . ?T22 :roller_coaster\#country_id ?T22_country_id . ?T22 :roller_coaster\#length ?T22_length . FILTER(?T22_length > 3000) .        }    } }
roller_coaster,"What are the country names, area and population which has both roller coasters with speed higher",SELECT DISTINCT ?T1_name ?T1_area ?T1_population WHERE { ?T1 a :country . ?T2 a :roller_coaster . ?T2 :roller_coaster\#ref-country_id ?T1 .  ?T1 :country\#name ?T1_name . ?T1 :country\#area ?T1_area . ?T1 :country\#population ?T1_population . ?T2 :roller_coaster\#speed ?T2_speed . FILTER(?T2_speed > 60) . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_area in (?T3_area)) . FILTER (?T1_population in (?T3_population)) .   ?T3 a :country . ?T4 a :roller_coaster . ?T4 :roller_coaster\#ref-country_id ?T3 .  ?T3 :country\#name ?T3_name . ?T3 :country\#area ?T3_area . ?T3 :country\#population ?T3_population . ?T4 :roller_coaster\#speed ?T4_speed .  FILTER(?T4_speed < 55) .             }
ship_1,How many different captain ranks are there?,SELECT DISTINCT (count(DISTINCT ?T1_rank) as ?aggregation_T1_rank_85 ) WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank .        }
ship_1,Count the number of different ranks of captain.,SELECT DISTINCT (count(DISTINCT ?T1_rank) as ?aggregation_T1_rank_145 ) WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank .        }
ship_1,How many captains are in each rank?,SELECT (count( *) as ?aggregation_all) ?T1_rank WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank .        } GROUP BY ?T1_rank
ship_1,How many captains with younger than 50 are in each rank?,SELECT (count( *) as ?aggregation_all) ?T1_rank WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank . ?T1 :captain\#age ?T1_age . FILTER(?T1_age < 50) .        } GROUP BY ?T1_rank
ship_1,Sort all captain names by their ages from old to young.,SELECT ?T1_name WHERE { ?T1 a :captain . ?T1 :captain\#name ?T1_name . ?T1 :captain\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
ship_1,"Find the name, class and rank of all captains.",SELECT ?T1_name ?T1_class ?T1_rank WHERE { ?T1 a :captain . ?T1 :captain\#name ?T1_name . ?T1 :captain\#class ?T1_class . ?T1 :captain\#rank ?T1_rank .        }
ship_1,Which rank is the most common among captains?,SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank .        } GROUP BY ?T1_rank  ORDER BY DESC (?aggregation_all) LIMIT 1
ship_1,Which classes have more than two captains?,SELECT ?T1_class WHERE { ?T1 a :captain . ?T1 :captain\#class ?T1_class .        } GROUP BY ?T1_class   HAVING(count( *)  > 2)
ship_1,Find the name of captains whose rank are either Midshipman or Lieutenant.,SELECT ?T1_name WHERE { ?T1 a :captain . ?T1 :captain\#name ?T1_name . ?T1 :captain\#rank ?T1_rank . ?T1 :captain\#rank ?T1_rank . FILTER(?T1_rank = 'Midshipman' || ?T1_rank = 'Lieutenant') .        }
ship_1,What are the average and minimum age of captains in different class?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_172 ) (min( ?T1_age) as ?aggregation_T1_age_38 ) ?T1_class WHERE { ?T1 a :captain . ?T1 :captain\#age ?T1_age . ?T1 :captain\#age ?T1_age . ?T1 :captain\#class ?T1_class .        } GROUP BY ?T1_class
ship_1,Return the average and minimum age of captains in each class.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_168 ) (min( ?T1_age) as ?aggregation_T1_age_165 ) ?T1_class WHERE { ?T1 a :captain . ?T1 :captain\#age ?T1_age . ?T1 :captain\#age ?T1_age . ?T1 :captain\#class ?T1_class .        } GROUP BY ?T1_class
ship_1,Find the captain rank that has some captains in both Cutter and Armed schooner classes.,SELECT DISTINCT ?T1_rank WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank . ?T1 :captain\#class ?T1_class . FILTER(?T1_class = 'Cutter') . FILTER (?T1_rank in (?T2_rank)) .   ?T2 a :captain . ?T2 :captain\#rank ?T2_rank . ?T2 :captain\#class ?T2_class .  FILTER(?T2_class = 'Armed schooner') .             }
ship_1,Find the captain rank that has no captain in Third-rate ship of the line class.,SELECT distinct?col1 WHERE { { SELECT (?T1_rank as ?col1) WHERE { ?T1 a :captain . ?T1 :captain\#rank ?T1_rank .   }}  MINUS {SELECT (?T2_rank as ?col1) WHERE { ?T2 a :captain . ?T2 :captain\#rank ?T2_rank . ?T2 :captain\#class ?T2_class . FILTER(?T2_class = 'Third-rate ship of the line') .        }     } }
ship_1,What is the name of the youngest captain?,SELECT ?T1_name WHERE { ?T1 a :captain . ?T1 :captain\#name ?T1_name . ?T1 :captain\#age ?T1_age .        }   ORDER BY ASC (?T1_age) LIMIT 1
ship_1,how many ships are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ship .        }
ship_1,"Find the name, type, and flag of the ship that is built in the most recent year.",SELECT ?T1_name ?T1_type ?T1_flag WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#type ?T1_type . ?T1 :ship\#flag ?T1_flag . ?T1 :ship\#built_year ?T1_built_year .        }   ORDER BY DESC (?T1_built_year) LIMIT 1
ship_1,"Group by ships by flag, and return number of ships that have each flag.",SELECT (count( *) as ?aggregation_all) ?T1_flag WHERE { ?T1 a :ship . ?T1 :ship\#flag ?T1_flag .        } GROUP BY ?T1_flag
ship_1,Which flag is most widely used among all ships?,SELECT ?T1_flag (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :ship\#flag ?T1_flag .        } GROUP BY ?T1_flag  ORDER BY DESC (?aggregation_all) LIMIT 1
ship_1,List all ship names in the order of built year and class.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#built_year ?T1_built_year .        }  ORDER BY ASC (?T1_built_year)
ship_1,Find the ship type that are used by both ships with Panama and Malta flags.,SELECT DISTINCT ?T1_type WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type . ?T1 :ship\#flag ?T1_flag . FILTER(?T1_flag = 'Panama') . FILTER (?T1_type in (?T2_type)) .   ?T2 a :ship . ?T2 :ship\#type ?T2_type . ?T2 :ship\#flag ?T2_flag .  FILTER(?T2_flag = 'Malta') .             }
ship_1,In which year were most of ships built?,SELECT ?T1_built_year (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :ship\#built_year ?T1_built_year .        } GROUP BY ?T1_built_year  ORDER BY DESC (?aggregation_all) LIMIT 1
ship_1,What is the year in which most ships were built?,SELECT ?T1_built_year (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :ship\#built_year ?T1_built_year .        } GROUP BY ?T1_built_year  ORDER BY DESC (?aggregation_all) LIMIT 1
ship_1,Find the name of the ships that have more than one captain.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :captain\#ref-ship_id ?T1 .  ?T1 :ship\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
ship_1,What are the names of ships that have more than one captain?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :captain\#ref-ship_id ?T1 .  ?T1 :ship\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
ship_1,Return the names and classes of ships that do not have a captain?,SELECT ?T1_name ?T1_class WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#class ?T1_class . ?T1 :ship\#ship_id ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_ship_id)) .       {SELECT ?T22_ship_id WHERE { ?T22 a :captain . ?T22 :captain\#ship_id ?T22_ship_id .        }    } }
ship_1,Find the name of the ship that is steered by the youngest captain.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :captain\#ref-ship_id ?T1 .  ?T1 :ship\#name ?T1_name . ?T2 :captain\#age ?T2_age .        }   ORDER BY ASC (?T2_age) LIMIT 1
ship_1,What is the name of the ship that is commanded by the youngest captain?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :captain\#ref-ship_id ?T1 .  ?T1 :ship\#name ?T1_name . ?T2 :captain\#age ?T2_age .        }   ORDER BY ASC (?T2_age) LIMIT 1
ship_1,Find the name and flag of ships that are not steered by any captain with Midshipman rank.,SELECT ?T1_name ?T1_flag WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#flag ?T1_flag . ?T1 :ship\#ship_id ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_rank)) .       {SELECT ?T22_ship_id WHERE { ?T22 a :captain . ?T22 :captain\#ship_id ?T22_ship_id . ?T22 :captain\#rank ?T22_rank . FILTER(?T22_rank = 'Midshipman') .        }    } }
ship_1,Find the name of the ships that are steered by both a captain with Midshipman rank and a captain with Lieutenant rank.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :captain\#ref-ship_id ?T1 .  ?T1 :ship\#name ?T1_name . ?T2 :captain\#rank ?T2_rank . FILTER(?T2_rank = 'Midshipman') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :ship . ?T4 a :captain . ?T4 :captain\#ref-ship_id ?T3 .  ?T3 :ship\#name ?T3_name . ?T4 :captain\#rank ?T4_rank .  FILTER(?T4_rank = 'Lieutenant') .             }
