kg_name,question,query
party_people,What is the name of member in charge of greatest number of events?,SELECT ?T1_member_name (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T2 a :party_events . ?T2 :party_events\#ref-member_in_charge_id ?T1 .  ?T1 :member\#member_name ?T1_member_name .        } GROUP BY ?T1_member_name  ORDER BY DESC (?aggregation_all) LIMIT 1
party_people,find the event names that have more than 2 records.,SELECT ?T1_event_name WHERE { ?T1 a :party_events . ?T1 :party_events\#event_name ?T1_event_name .        } GROUP BY ?T1_event_name   HAVING(count( *)  > 2)
party_people,Which event names were used more than twice for party events?,SELECT ?T1_event_name WHERE { ?T1 a :party_events . ?T1 :party_events\#event_name ?T1_event_name .        } GROUP BY ?T1_event_name   HAVING(count( *)  > 2)
party_people,How many Annual Meeting events happened in the United Kingdom region?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :region . ?T1 :party\#ref-region_id ?T2 .  ?T2 :region\#region_name ?T2_region_name . ?T3 :party_events\#event_name ?T3_event_name . ?T3 a :party_events . ?T3 :party_events\#ref-party_id ?T1 .  ?T2 :region\#region_name ?T2_region_name . ?T3 :party_events\#event_name ?T3_event_name . FILTER(?T2_region_name = 'United Kingdom' && ?T3_event_name = 'Annaual Meeting') .        }
pilot_record,How many pilots are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :pilot .        }
pilot_record,List the names of pilots in ascending order of rank.,SELECT ?T1_pilot_name WHERE { ?T1 a :pilot . ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T1 :pilot\#rank ?T1_rank .        }  ORDER BY ASC (?T1_rank)
pilot_record,What are the positions and teams of pilots?,SELECT ?T1_position ?T1_team WHERE { ?T1 a :pilot . ?T1 :pilot\#position ?T1_position . ?T1 :pilot\#team ?T1_team .        }
pilot_record,List the distinct positions of pilots older than 30.,SELECT DISTINCT ?T1_position WHERE { ?T1 a :pilot . ?T1 :pilot\#position ?T1_position . ?T1 :pilot\#age ?T1_age . FILTER(?T1_age > 30) .        }
pilot_record,Show the names of pilots from team 'Bradley' or 'Fordham'.,SELECT ?T1_pilot_name WHERE { ?T1 a :pilot . ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T1 :pilot\#team ?T1_team . ?T1 :pilot\#team ?T1_team . FILTER(?T1_team = 'Bradley' || ?T1_team = 'Fordham') .        }
pilot_record,What is the joined year of the pilot of the highest rank?,SELECT ?T1_join_year WHERE { ?T1 a :pilot . ?T1 :pilot\#join_year ?T1_join_year . ?T1 :pilot\#rank ?T1_rank .        }   ORDER BY ASC (?T1_rank) LIMIT 1
pilot_record,What are the different nationalities of pilots? Show each nationality and the number of pilots of each nationality.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :pilot . ?T1 :pilot\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality
pilot_record,Show the most common nationality of pilots.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :pilot . ?T1 :pilot\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality  ORDER BY DESC (?aggregation_all) LIMIT 1
pilot_record,Show the pilot positions that have both pilots joining after year 2005 and pilots joining before 2000.,SELECT DISTINCT ?T1_position WHERE { ?T1 a :pilot . ?T1 :pilot\#position ?T1_position . ?T1 :pilot\#join_year ?T1_join_year . FILTER(?T1_join_year < 2000) . FILTER (?T1_position in (?T2_position)) .   ?T2 a :pilot . ?T2 :pilot\#position ?T2_position . ?T2 :pilot\#join_year ?T2_join_year .  FILTER(?T2_join_year > 2005) .             }
pilot_record,Show the names of pilots and models of aircrafts they have flied with.,SELECT ?T1_pilot_name ?T2_model WHERE { ?T1 a :pilot . ?T13 a :pilot_record . ?T13 :pilot_record\#ref-pilot_id ?T1 .  ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T2 :aircraft\#model ?T2_model . ?T2 a :aircraft . ?T13 :pilot_record\#ref-aircraft_id ?T2 .  ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T2 :aircraft\#model ?T2_model .        }
pilot_record,Show the names of pilots and fleet series of the aircrafts they have flied with in ascending order of the rank of the pilot.,SELECT ?T1_pilot_name ?T2_fleet_series WHERE { ?T1 a :pilot . ?T13 a :pilot_record . ?T13 :pilot_record\#ref-pilot_id ?T1 .  ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T2 :aircraft\#fleet_series ?T2_fleet_series . ?T1 :pilot\#rank ?T1_rank . ?T2 a :aircraft . ?T13 :pilot_record\#ref-aircraft_id ?T2 .  ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T2 :aircraft\#fleet_series ?T2_fleet_series . ?T1 :pilot\#rank ?T1_rank .        }  ORDER BY ASC (?T1_rank)
pilot_record,Show the fleet series of the aircrafts flied by pilots younger than 34,SELECT ?T1_fleet_series WHERE { ?T1 a :aircraft . ?T13 a :pilot_record . ?T13 :pilot_record\#ref-aircraft_id ?T1 .  ?T1 :aircraft\#fleet_series ?T1_fleet_series . ?T2 :pilot\#age ?T2_age . ?T2 a :pilot . ?T13 :pilot_record\#ref-pilot_id ?T2 .  ?T1 :aircraft\#fleet_series ?T1_fleet_series . ?T2 :pilot\#age ?T2_age . FILTER(?T2_age < 34) .        }
pilot_record,Show the names of pilots and the number of records they have.,SELECT ?T1_pilot_name (count( *) as ?aggregation_all) WHERE { ?T1 a :pilot . ?T2 a :pilot_record . ?T2 :pilot_record\#ref-pilot_id ?T1 .  ?T1 :pilot\#pilot_name ?T1_pilot_name .        } GROUP BY ?T1_pilot_name
pilot_record,Show names of pilots that have more than one record.,SELECT ?T1_pilot_name (count( *) as ?aggregation_all) WHERE { ?T1 a :pilot . ?T2 a :pilot_record . ?T2 :pilot_record\#ref-pilot_id ?T1 .  ?T1 :pilot\#pilot_name ?T1_pilot_name .        } GROUP BY ?T1_pilot_name   HAVING(count( *)  > 1)
pilot_record,List the names of pilots that do not have any record.,SELECT ?T1_pilot_name WHERE { ?T1 a :pilot . ?T1 :pilot\#pilot_name ?T1_pilot_name . ?T1 :pilot\#pilot_id ?T1_pilot_id . FILTER(?T1_pilot_id not in (?T22_pilot_id)) .       {SELECT ?T22_pilot_id WHERE { ?T22 a :pilot_record . ?T22 :pilot_record\#pilot_id ?T22_pilot_id .        }    } }
cre_doc_control_systems,What document status codes do we have?,SELECT ?T1_document_status_code WHERE { ?T1 a :ref_document_status . ?T1 :ref_document_status\#document_status_code ?T1_document_status_code .        }
cre_doc_control_systems,What is the description of document status code 'working'?,SELECT ?T1_document_status_description WHERE { ?T1 a :ref_document_status . ?T1 :ref_document_status\#document_status_description ?T1_document_status_description . ?T1 :ref_document_status\#document_status_code ?T1_document_status_code . FILTER(?T1_document_status_code = 'working') .        }
cre_doc_control_systems,What document type codes do we have?,SELECT ?T1_document_type_code WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code .        }
cre_doc_control_systems,What is the description of document type 'Paper'?,SELECT ?T1_document_type_description WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_description ?T1_document_type_description . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code . FILTER(?T1_document_type_code = 'Paper') .        }
cre_doc_control_systems,What are the shipping agent names?,SELECT ?T1_shipping_agent_name WHERE { ?T1 a :ref_shipping_agents . ?T1 :ref_shipping_agents\#shipping_agent_name ?T1_shipping_agent_name .        }
cre_doc_control_systems,What is the shipping agent code of shipping agent UPS?,SELECT ?T1_shipping_agent_code WHERE { ?T1 a :ref_shipping_agents . ?T1 :ref_shipping_agents\#shipping_agent_code ?T1_shipping_agent_code . ?T1 :ref_shipping_agents\#shipping_agent_name ?T1_shipping_agent_name . FILTER(?T1_shipping_agent_name = 'UPS') .        }
cre_doc_control_systems,What are all role codes?,SELECT ?T1_role_code WHERE { ?T1 a :roles . ?T1 :roles\#role_code ?T1_role_code .        }
cre_doc_control_systems,What is the description of role code ED?,SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\#role_description ?T1_role_description . ?T1 :roles\#role_code ?T1_role_code . FILTER(?T1_role_code = 'ED') .        }
cre_doc_control_systems,How many employees do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employees .        }
cre_doc_control_systems,What is the role of the employee named Koby?,SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T2 a :employees . ?T2 :employees\#ref-role_code ?T1 .  ?T1 :roles\#role_description ?T1_role_description . ?T2 :employees\#employee_name ?T2_employee_name . FILTER(?T2_employee_name = 'Koby') .        }
cre_doc_control_systems,List all document ids and receipt dates of documents.,SELECT ?T1_document_id ?T1_receipt_date WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#receipt_date ?T1_receipt_date .        }
cre_doc_control_systems,"How many employees does each role have? List role description, id and number of employees.",SELECT ?T1_role_description ?T2_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :roles . ?T2 a :employees . ?T2 :employees\#ref-role_code ?T1 .  ?T1 :roles\#role_description ?T1_role_description . ?T2 :employees\#role_code ?T2_role_code .        } GROUP BY ?T1_role_description ?T2_role_code
cre_doc_control_systems,List roles that have more than one employee. List the role description and number of employees.,SELECT ?T1_role_description (count( ?T2_employee_id) as ?aggregation_T2_employee_id_111 ) WHERE { ?T1 a :roles . ?T2 a :employees . ?T2 :employees\#ref-role_code ?T1 .  ?T1 :roles\#role_description ?T1_role_description . ?T2 :employees\#employee_id ?T2_employee_id . ?T2 :employees\#employee_id ?T2_employee_id .        } GROUP BY ?T1_role_description   HAVING(count( ?T2_employee_id) as ?aggregation_T2_employee_id_120 ) > 1)
cre_doc_control_systems,What is the document status description of the document with id 1?,SELECT ?T1_document_status_description WHERE { ?T1 a :ref_document_status . ?T2 a :documents . ?T2 :documents\#ref-document_status_code ?T1 .  ?T1 :ref_document_status\#document_status_description ?T1_document_status_description . ?T2 :documents\#document_id ?T2_document_id . FILTER(?T2_document_id = 1) .        }
cre_doc_control_systems,How many documents have the status code done?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#document_status_code ?T1_document_status_code . FILTER(?T1_document_status_code = 'done') .        }
cre_doc_control_systems,List the document type code for the document with the id 2.,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code . ?T1 :documents\#document_id ?T1_document_id . FILTER(?T1_document_id = 2) .        }
cre_doc_control_systems,List the document ids for any documents with the status code done and the type code paper.,SELECT ?T1_document_id WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_status_code ?T1_document_status_code . ?T1 :documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_status_code = 'done' && ?T1_document_type_code = 'Paper') .        }
cre_doc_control_systems,What is the name of the shipping agent of the document with id 2?,SELECT ?T1_shipping_agent_name WHERE { ?T1 a :ref_shipping_agents . ?T2 a :documents . ?T2 :documents\#ref-shipping_agent_code ?T1 .  ?T1 :ref_shipping_agents\#shipping_agent_name ?T1_shipping_agent_name . ?T2 :documents\#document_id ?T2_document_id . FILTER(?T2_document_id = 2) .        }
cre_doc_control_systems,How many documents were shipped by USPS?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T2 a :ref_shipping_agents . ?T1 :documents\#ref-shipping_agent_code ?T2 .  ?T2 :ref_shipping_agents\#shipping_agent_name ?T2_shipping_agent_name . FILTER(?T2_shipping_agent_name = 'USPS') .        }
cre_doc_control_systems,Which shipping agent shipped the most documents? List the shipping agent name and the number of documents.,SELECT ?T1_shipping_agent_name (count( *) as ?aggregation_all) (count( ?T2_document_id) as ?aggregation_T2_document_id_69 ) WHERE { ?T1 a :ref_shipping_agents . ?T2 a :documents . ?T2 :documents\#ref-shipping_agent_code ?T1 .  ?T1 :ref_shipping_agents\#shipping_agent_name ?T1_shipping_agent_name . ?T2 :documents\#document_id ?T2_document_id . ?T2 :documents\#document_id ?T2_document_id .        } GROUP BY ?T1_shipping_agent_name  ORDER BY DESC ((count( ?T2_document_id) as ?aggregation_T2_document_id_137 )) LIMIT 1
cre_doc_control_systems,What is the receipt date of the document with id 3?,SELECT ?T1_receipt_date WHERE { ?T1 a :documents . ?T1 :documents\#receipt_date ?T1_receipt_date . ?T1 :documents\#document_id ?T1_document_id . FILTER(?T1_document_id = 3) .        }
cre_doc_control_systems,What address was the document with id 4 mailed to?,SELECT ?T1_address_details WHERE { ?T1 a :addresses . ?T2 a :documents_mailed . ?T2 :documents_mailed\#ref-mailed_to_address_id ?T1 .  ?T1 :addresses\#address_details ?T1_address_details . ?T2 :documents_mailed\#document_id ?T2_document_id . FILTER(?T2_document_id = 4) .        }
cre_doc_control_systems,What is the mail date of the document with id 7?,SELECT ?T1_mailing_date WHERE { ?T1 a :documents_mailed . ?T1 :documents_mailed\#mailing_date ?T1_mailing_date . ?T1 :documents_mailed\#document_id ?T1_document_id . FILTER(?T1_document_id = 7) .        }
cre_doc_control_systems,"List the document ids of documents with the status done and type Paper, which not shipped by the shipping agent named USPS.",SELECT distinct?col1 WHERE { { SELECT (?T1_document_id as ?col1) WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_status_code ?T1_document_status_code . ?T1 :documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_status_code = 'done' && ?T1_document_type_code = 'Paper') .   }}  MINUS {SELECT (?T2_document_id as ?col1) WHERE { ?T2 a :documents . ?T3 a :ref_shipping_agents . ?T2 :documents\#ref-shipping_agent_code ?T3 .  ?T2 :documents\#document_id ?T2_document_id . ?T3 :ref_shipping_agents\#shipping_agent_name ?T3_shipping_agent_name . FILTER(?T3_shipping_agent_name = 'USPS') .        }     } }
cre_doc_control_systems,List document id of documents status is done and document type is Paper and the document is shipped by shipping agent named USPS.,SELECT DISTINCT ?T1_document_id WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_status_code ?T1_document_status_code . ?T1 :documents\#document_type_code ?T1_document_type_code . FILTER(?T1_document_status_code = 'done' && ?T1_document_type_code = 'Paper') . FILTER (?T1_document_id in (?T2_document_id)) .   ?T2 a :documents . ?T3 a :ref_shipping_agents . ?T2 :documents\#ref-shipping_agent_code ?T3 .  ?T2 :documents\#document_id ?T2_document_id . ?T3 :ref_shipping_agents\#shipping_agent_name ?T3_shipping_agent_name .  FILTER(?T3_shipping_agent_name = 'USPS') .             }
cre_doc_control_systems,What is draft detail of the document with id 7?,SELECT ?T1_draft_details WHERE { ?T1 a :document_drafts . ?T1 :document_drafts\#draft_details ?T1_draft_details . ?T1 :document_drafts\#document_id ?T1_document_id . FILTER(?T1_document_id = 7) .        }
cre_doc_control_systems,How many draft copies does the document with id 2 have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :draft_copies . ?T1 :draft_copies\#document_id ?T1_document_id . FILTER(?T1_document_id = 2) .        }
cre_doc_control_systems,Which document has the most draft copies? List its document id and number of draft copies.,SELECT ?T1_document_id (count( *) as ?aggregation_all) (count( ?T1_copy_number) as ?aggregation_T1_copy_number_13 ) WHERE { ?T1 a :draft_copies . ?T1 :draft_copies\#document_id ?T1_document_id . ?T1 :draft_copies\#copy_number ?T1_copy_number . ?T1 :draft_copies\#copy_number ?T1_copy_number .        } GROUP BY ?T1_document_id  ORDER BY DESC ((count( ?T1_copy_number) as ?aggregation_T1_copy_number_119 )) LIMIT 1
cre_doc_control_systems,Which documents have more than 1 draft copies? List document id and number of draft copies.,SELECT ?T1_document_id (count( *) as ?aggregation_all) WHERE { ?T1 a :draft_copies . ?T1 :draft_copies\#document_id ?T1_document_id .        } GROUP BY ?T1_document_id   HAVING(count( *)  > 1)
cre_doc_control_systems,List all employees in the circulation history of the document with id 1. List the employee's name.,SELECT ?T1_employee_name WHERE { ?T1 a :employees . ?T2 a :circulation_history . ?T2 :circulation_history\#ref-employee_id ?T1 .  ?T1 :employees\#employee_name ?T1_employee_name . ?T2 :circulation_history\#document_id ?T2_document_id . FILTER(?T2_document_id = 1) .        }
cre_doc_control_systems,List the employees who have not showed up in any circulation history of documents. List the employee's name.,SELECT distinct?col1 WHERE { { SELECT (?T1_employee_name as ?col1) WHERE { ?T1 a :employees . ?T1 :employees\#employee_name ?T1_employee_name .   }}  MINUS {SELECT (?T2_employee_name as ?col1) WHERE { ?T2 a :employees . ?T2 :employees\#employee_name ?T2_employee_name .        }     } }
cre_doc_control_systems,Which employee has showed up in most circulation history documents. List the employee's name and the number of drafts and copies.,SELECT ?T1_employee_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T2 a :circulation_history . ?T2 :circulation_history\#ref-employee_id ?T1 .  ?T1 :employees\#employee_name ?T1_employee_name .        } GROUP BY ?T1_employee_name  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_doc_control_systems,"For each document, list the number of employees who have showed up in the circulation history of that document. List the document ids and number of employees.",SELECT DISTINCT ?T1_document_id (count(DISTINCT ?T1_employee_id) as ?aggregation_T1_employee_id_116 ) WHERE { ?T1 a :circulation_history . ?T1 :circulation_history\#document_id ?T1_document_id . ?T1 :circulation_history\#employee_id ?T1_employee_id .        } GROUP BY ?T1_document_id
company_1,List all department names ordered by their starting date.,SELECT ?T1_dname WHERE { ?T1 a :department . ?T1 :department\#dname ?T1_dname . ?T1 :department\#mgr_start_date ?T1_mgr_start_date .        }  ORDER BY ASC (?T1_mgr_start_date)
company_1,find all dependent names who have a spouse relation with some employee.,SELECT ?T1_dependent_name WHERE { ?T1 a :dependent . ?T1 :dependent\#dependent_name ?T1_dependent_name . ?T1 :dependent\#relationship ?T1_relationship . FILTER(?T1_relationship = 'Spouse') .        }
company_1,how many female dependents are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :dependent . ?T1 :dependent\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
company_1,Find the names of departments that are located in Houston.,SELECT ?T1_dname WHERE { ?T2 :dept_locations\#ref-department_id ?T1 . FILTER(?T2_dlocation = 'Houston') .        }
company_1,Return the first names and last names of employees who earn more than 30000 in salary.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :employee . ?T1 :employee\#fname ?T1_fname . ?T1 :employee\#lname ?T1_lname . ?T1 :employee\#salary ?T1_salary . FILTER(?T1_salary > 30000) .        }
company_1,Find the number of employees of each gender whose salary is lower than 50000.,SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a :employee . ?T1 :employee\#sex ?T1_sex . ?T1 :employee\#salary ?T1_salary . FILTER(?T1_salary < 50000) .        } GROUP BY ?T1_sex
company_1,"list the first and last names, and the addresses of all employees in the ascending order of their birth date.",SELECT ?T1_fname ?T1_lname ?T1_address WHERE { ?T1 a :employee . ?T1 :employee\#fname ?T1_fname . ?T1 :employee\#lname ?T1_lname . ?T1 :employee\#address ?T1_address . ?T1 :employee\#bdate ?T1_bdate .        }  ORDER BY ASC (?T1_bdate)
local_govt_in_alabama,"How many events have each participants attended? List the participant id, type and the number.",SELECT ?T1_participant_id ?T1_participant_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :participants . ?T2 a :participants_in_events . ?T2 :participants_in_events\#ref-participant_id ?T1 .  ?T1 :participants\#participant_id ?T1_participant_id . ?T1 :participants\#participant_type_code ?T1_participant_type_code .        } GROUP BY ?T1_participant_id ?T1_participant_type_code
local_govt_in_alabama,How many participants belong to the type 'Organizer'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :participants . ?T1 :participants\#participant_type_code ?T1_participant_type_code . FILTER(?T1_participant_type_code = 'Organizer') .        }
local_govt_in_alabama,List the type of the services in alphabetical order.,SELECT ?T1_service_type_code WHERE { ?T1 a :services . ?T1 :services\#service_type_code ?T1_service_type_code . ?T1 :services\#service_type_code ?T1_service_type_code .        }  ORDER BY ASC (?T1_service_type_code)
local_govt_in_alabama,List the service id and details for the events.,SELECT ?T1_service_id ?T1_event_details WHERE { ?T1 a :events . ?T1 :events\#service_id ?T1_service_id . ?T1 :events\#event_details ?T1_event_details .        }
local_govt_in_alabama,How many events had participants whose details had the substring 'Dr.',"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :participants_in_events . ?T2 a :participants . ?T1 :participants_in_events\#ref-participant_id ?T2 .  ?T2 :participants\#participant_details ?T2_participant_details . FILTER(contains (?T2_participant_details, 'Dr.')) .        }"
local_govt_in_alabama,What is the most common participant type?,SELECT ?T1_participant_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :participants . ?T1 :participants\#participant_type_code ?T1_participant_type_code .        } GROUP BY ?T1_participant_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
local_govt_in_alabama,Which service id and type has the least number of participants?,SELECT ?T1_service_id (count( *) as ?aggregation_all) ?T2_service_type_code WHERE { ?T1 a :events . ?T2 a :services . ?T1 :events\#ref-service_id ?T2 .  ?T1 :events\#service_id ?T1_service_id . ?T2 :services\#service_type_code ?T2_service_type_code . ?T14 a :participants_in_events . ?T14 :participants_in_events\#ref-event_id ?T1 .  ?T1 :events\#service_id ?T1_service_id . ?T2 :services\#service_type_code ?T2_service_type_code .        } GROUP BY ?T1_service_id ?T2_service_type_code  ORDER BY ASC (?aggregation_all) LIMIT 1
local_govt_in_alabama,What is the id of the event with the most participants?,SELECT ?T1_event_id (count( *) as ?aggregation_all) WHERE { ?T1 a :participants_in_events . ?T1 :participants_in_events\#event_id ?T1_event_id .        } GROUP BY ?T1_event_id  ORDER BY DESC (?aggregation_all) LIMIT 1
local_govt_in_alabama,Which services type had both successful and failure event details?,SELECT DISTINCT ?T1_service_type_code WHERE { ?T1 a :services . ?T2 a :events . ?T2 :events\#ref-service_id ?T1 .  ?T1 :services\#service_type_code ?T1_service_type_code . ?T2 :events\#event_details ?T2_event_details . FILTER(?T2_event_details = 'Success') . FILTER (?T1_service_type_code in (?T3_service_type_code)) .   ?T3 a :services . ?T4 a :events . ?T4 :events\#ref-service_id ?T3 .  ?T3 :services\#service_type_code ?T3_service_type_code . ?T4 :events\#event_details ?T4_event_details .  FILTER(?T4_event_details = 'Fail') .             }
local_govt_in_alabama,How many events did not have any participants?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :events . ?T1 :events\#event_id ?T1_event_id . FILTER(?T1_event_id not in (?T22_event_id)) .       {SELECT ?T22_event_id WHERE { ?T22 a :participants_in_events . ?T22 :participants_in_events\#event_id ?T22_event_id .        }    } }
local_govt_in_alabama,What are all the distinct participant ids who attended any events?,SELECT DISTINCT (count(DISTINCT ?T1_participant_id) as ?aggregation_T1_participant_id_9 ) WHERE { ?T1 a :participants_in_events . ?T1 :participants_in_events\#participant_id ?T1_participant_id .        }
formula_1,What is the name of the race held most recently?,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#date ?T1_date .        }   ORDER BY DESC (?T1_date) LIMIT 1
formula_1,What is the name of the race that occurred most recently?,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#date ?T1_date .        }   ORDER BY DESC (?T1_date) LIMIT 1
formula_1,What is the name and date of the most recent race?,SELECT ?T1_name ?T1_date WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#date ?T1_date . ?T1 :races\#date ?T1_date .        }   ORDER BY DESC (?T1_date) LIMIT 1
formula_1,What is the name and date of the race that occurred most recently?,SELECT ?T1_name ?T1_date WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#date ?T1_date . ?T1 :races\#date ?T1_date .        }   ORDER BY DESC (?T1_date) LIMIT 1
formula_1,Find the names of all races held in 2017.,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#year ?T1_year . FILTER(?T1_year = 2017) .        }
formula_1,What are the names of all the races that occurred in the year 2017?,SELECT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#year ?T1_year . FILTER(?T1_year = 2017) .        }
formula_1,Find the distinct names of all races held between 2014 and 2017?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#year ?T1_year . FILTER(?T1_year >= 2014 && ?T1_year <= 2017) .        }
formula_1,What are the unique names of all race held between 2014 and 2017?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :races . ?T1 :races\#name ?T1_name . ?T1 :races\#year ?T1_year . FILTER(?T1_year >= 2014 && ?T1_year <= 2017) .        }
formula_1,What is the id and family name of the driver who has the longest laptime?,SELECT ?T1_driverid ?T1_surname WHERE { ?T1 a :drivers . ?T2 a :laptimes . ?T2 :laptimes\#ref-driverid ?T1 .  ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#surname ?T1_surname . ?T2 :laptimes\#milliseconds ?T2_milliseconds .        }   ORDER BY DESC (?T2_milliseconds) LIMIT 1
formula_1,What is the id and last name of the driver with the longest laptime?,SELECT ?T1_driverid ?T1_surname WHERE { ?T1 a :drivers . ?T2 a :laptimes . ?T2 :laptimes\#ref-driverid ?T1 .  ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#surname ?T1_surname . ?T2 :laptimes\#milliseconds ?T2_milliseconds .        }   ORDER BY DESC (?T2_milliseconds) LIMIT 1
formula_1,"What is the id, forname and surname of the driver who had the first position in terms of laptime at least twice?",SELECT ?T1_driverid ?T1_forename ?T1_surname WHERE { ?T1 a :drivers . ?T2 a :laptimes . ?T2 :laptimes\#ref-driverid ?T1 .  ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T2 :laptimes\#position ?T2_position . FILTER(?T2_position = 1) .        } GROUP BY ?T1_driverid ?T1_forename ?T1_surname   HAVING(count( *)  >= 2)
formula_1,"What is the id, first name, and last name of the driver who was in the first position for laptime at least twice?",SELECT ?T1_driverid ?T1_forename ?T1_surname WHERE { ?T1 a :drivers . ?T2 a :laptimes . ?T2 :laptimes\#ref-driverid ?T1 .  ?T1 :drivers\#driverid ?T1_driverid . ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T2 :laptimes\#position ?T2_position . FILTER(?T2_position = 1) .        } GROUP BY ?T1_driverid ?T1_forename ?T1_surname   HAVING(count( *)  >= 2)
formula_1,How many drivers were in the Australian Grand Prix held in 2009?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :results . ?T2 a :races . ?T1 :results\#ref-raceid ?T2 .  ?T2 :races\#name ?T2_name . ?T2 :races\#year ?T2_year . FILTER(?T2_name = 'Australian Grand Prix' && ?T2_year = 2009) .        }
formula_1,How many drivers did not participate in the races held in 2009?,SELECT DISTINCT (count(DISTINCT ?T1_driverid) as ?aggregation_T1_driverid_31 ) WHERE { ?T1 a :results . ?T1 :results\#driverid ?T1_driverid . ?T1 :results\#raceid ?T1_raceid . FILTER(?T1_raceid not in (?T22_year)) .       {SELECT ?T22_raceid WHERE { ?T22 a :races . ?T22 :races\#raceid ?T22_raceid . ?T22 :races\#year ?T22_year . FILTER(?T22_year != 2009) .        }    } }
formula_1,How many drivers did not race in 2009?,SELECT DISTINCT (count(DISTINCT ?T1_driverid) as ?aggregation_T1_driverid_130 ) WHERE { ?T1 a :results . ?T1 :results\#driverid ?T1_driverid . ?T1 :results\#raceid ?T1_raceid . FILTER(?T1_raceid not in (?T22_year)) .       {SELECT ?T22_raceid WHERE { ?T22 a :races . ?T22 :races\#raceid ?T22_raceid . ?T22 :races\#year ?T22_year . FILTER(?T22_year != 2009) .        }    } }
formula_1,Find the forename and surname of drivers whose nationality is German?,SELECT ?T1_forename ?T1_surname WHERE { ?T1 a :drivers . ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#nationality ?T1_nationality . FILTER(?T1_nationality = 'German') .        }
formula_1,What is the first and last name of all the German drivers?,SELECT ?T1_forename ?T1_surname WHERE { ?T1 a :drivers . ?T1 :drivers\#forename ?T1_forename . ?T1 :drivers\#surname ?T1_surname . ?T1 :drivers\#nationality ?T1_nationality . FILTER(?T1_nationality = 'German') .        }
formula_1,Find the id and forenames of drivers who participated both the races with name Australian Grand Prix and the races with name Chinese Grand Prix?,SELECT DISTINCT ?T1_driverid ?T2_forename WHERE { ?T1 a :results . ?T2 a :drivers . ?T1 :results\#ref-driverid ?T2 .  ?T1 :results\#driverid ?T1_driverid . ?T2 :drivers\#forename ?T2_forename . ?T3 :races\#name ?T3_name . ?T14 a :qualifying . ?T14 :qualifying\#ref-driverid ?T2 .  ?T1 :results\#driverid ?T1_driverid . ?T2 :drivers\#forename ?T2_forename . ?T3 :races\#name ?T3_name . ?T3 a :races . ?T14 :qualifying\#ref-raceid ?T3 .  ?T1 :results\#driverid ?T1_driverid . ?T2 :drivers\#forename ?T2_forename . ?T3 :races\#name ?T3_name . FILTER(?T3_name = 'Australian Grand Prix') . FILTER (?T1_driverid in (?T4_driverid)) . FILTER (?T2_forename in (?T5_forename)) .   ?T4 a :results . ?T5 a :drivers . ?T4 :results\#ref-driverid ?T5 .  ?T4 :results\#driverid ?T4_driverid . ?T5 :drivers\#forename ?T5_forename . ?T6 :races\#name ?T6_name . ?T17 a :qualifying . ?T17 :qualifying\#ref-driverid ?T5 .  ?T4 :results\#driverid ?T4_driverid . ?T5 :drivers\#forename ?T5_forename . ?T6 :races\#name ?T6_name . ?T6 a :races . ?T17 :qualifying\#ref-raceid ?T6 .  ?T4 :results\#driverid ?T4_driverid . ?T5 :drivers\#forename ?T5_forename . ?T6 :races\#name ?T6_name .  FILTER(?T6_name = 'Chinese Grand Prix') .             }
