[
    {
        "kg_name": "imdb",
        "question": "What is the nationality of the actor ' Christoph Waltz ' ?",
        "query": "SELECT ?T1_nationality WHERE { ?T1 a :actor . ?T1 :actor\\#nationality ?T1_nationality . ?T1 :actor\\#name ?T1_name . FILTER(?T1_name = 'Christoph Waltz') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "When was ' Kevin Spacey ' born ?",
        "query": "SELECT ?T1_birth_year WHERE { ?T1 a :actor . ?T1 :actor\\#birth_year ?T1_birth_year . ?T1 :actor\\#name ?T1_name . FILTER(?T1_name = 'actor_name0') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "In what year was ' Kevin Spacey ' born ?",
        "query": "SELECT ?T1_birth_year WHERE { ?T1 a :actor . ?T1 :actor\\#birth_year ?T1_birth_year . ?T1 :actor\\#name ?T1_name . FILTER(?T1_name = 'actor_name0') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "In what city was ' Kevin Spacey ' born ?",
        "query": "SELECT ?T1_birth_city WHERE { ?T1 a :director . ?T1 :director\\#birth_city ?T1_birth_city . ?T1 :director\\#name ?T1_name . FILTER(?T1_name = 'director_name0') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the nationality of ' Kevin Spacey ' ?",
        "query": "SELECT ?T1_nationality WHERE { ?T1 a :director . ?T1 :director\\#nationality ?T1_nationality . ?T1 :director\\#name ?T1_name . FILTER(?T1_name = 'director_name0') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who is the director of the movie ' James Bond ' ?",
        "query": "SELECT ?T1_name WHERE { ?T2 :movie\\#ref-director_id ?T1 . FILTER(?T2_title = 'James Bond') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who directed the movie ' James Bond ' ?",
        "query": "SELECT ?T1_name WHERE { ?T2 :movie\\#ref-director_id ?T1 . FILTER(?T2_title = 'James Bond') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who acted ' Alan Turing ' in the movie ' The Imitation Game ' ?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\\#ref-aid ?T1 .  ?T1 :actor\\#name ?T1_name . ?T2 :cast_of_actors\\#role ?T2_role . ?T3 :movie\\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who acts as ' Alan Turing ' in the movie ' The Imitation Game ' ?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\\#ref-aid ?T1 .  ?T1 :actor\\#name ?T1_name . ?T2 :cast_of_actors\\#role ?T2_role . ?T3 :movie\\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who is the actor playing ' Alan Turing ' in ' The Imitation Game ' ?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\\#ref-aid ?T1 .  ?T1 :actor\\#name ?T1_name . ?T2 :cast_of_actors\\#role ?T2_role . ?T3 :movie\\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the genre of the movie ' Jurassic Park ' ?",
        "query": "SELECT ?T1_genre WHERE { ?T2 :movie\\#ref-genre_id ?T1 . FILTER(?T2_title = 'Jurassic Park') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What are all the movies featuring ' Robin Wright ' ?",
        "query": "SELECT ?T1_title WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Robin Wright') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who are the actors born in ' Austin ' after 1980 ?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\\#name ?T1_name . ?T1 :actor\\#birth_city ?T1_birth_city . ?T1 :actor\\#birth_year ?T1_birth_year . FILTER(?T1_birth_city = 'Austin' && ?T1_birth_year > 1980) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Which movies did ' Alfred Hitchcock ' direct ?",
        "query": "SELECT ?T1_title WHERE { ?T1 :movie\\#ref-director_id ?T2 . FILTER(?T2_name = 'Alfred Hitchcock') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What are all the tv series created by ' Shonda Rhimes ' ?",
        "query": "SELECT ?T1_title WHERE { ?T1 :tv_series\\#ref-producer_id ?T2 . FILTER(?T2_name = 'Shonda Rhimes') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who acts ' Olivia Pope ' in the series Scandal ?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\\#ref-aid ?T1 .  ?T1 :actor\\#name ?T1_name . ?T2 :cast_of_actors\\#role ?T2_role . ?T3 :tv_series\\#title ?T3_title . FILTER(?T2_role = 'Olivia Pope' && ?T3_title = 'Scandal') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What are the series featuring ' Scott Foley ' ?",
        "query": "SELECT ?T1_title WHERE { ?T1 :tv_series\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Scott Foley') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What are the series in which ' Scott Foley ' is an actor ?",
        "query": "SELECT ?T1_title WHERE { ?T1 :tv_series\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Scott Foley') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "Who is the director of the tv series ' House of Cards ' from 2013 ?",
        "query": "SELECT ?T1_name WHERE { ?T2 :tv_series\\#ref-director_id ?T1 . FILTER(?T2_release_year = 2013 && ?T2_title = 'House of Cards') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the number of movies in which ' Jennifer Aniston ' acted after 2010 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_18 ) WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Jennifer Aniston' && ?T1_release_year > 2010) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the number of actors in the movie ' Saving Private Ryan ' ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_12 ) WHERE { ?T2 :movie\\#ref-actor_id ?T1 . FILTER(?T2_title = 'Saving Private Ryan') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "How many actors are in the movie ' Saving Private Ryan ' ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_15 ) WHERE { ?T2 :movie\\#ref-actor_id ?T1 . FILTER(?T2_title = 'Saving Private Ryan') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "How many movies did ' Steven Spielberg ' direct ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_84 ) WHERE { ?T1 :movie\\#ref-director_id ?T2 . FILTER(?T2_name = 'Steven Spielberg') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the number of movies directed by ' Woody Allen ' per year ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_28 ) ?T1_release_year WHERE { ?T1 :movie\\#ref-director_id ?T2 . FILTER(?T2_name = 'Woody Allen') .        } GROUP BY ?T1_release_year"
    },
    {
        "kg_name": "imdb",
        "question": "How many movies did ' Shahab Hosseini ' act in ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_176 ) WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the number of movies in which ' Shahab Hosseini ' acted ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_117 ) WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the number of movies featuring ' Shahab Hosseini ' ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_193 ) WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "How many actors were born in ' Los Angeles ' after 2000 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_0 ) WHERE { ?T1 a :actor . ?T1 :actor\\#name ?T1_name . ?T1 :actor\\#birth_city ?T1_birth_city . ?T1 :actor\\#birth_year ?T1_birth_year . FILTER(?T1_birth_city = 'Los Angeles' && ?T1_birth_year > 2000) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "How many movies did ' Humphrey Bogart ' act in before 1942 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_11 ) WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Humphrey Bogart' && ?T1_release_year < 1942) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the number of movies that ' Brad Pitt ' acts in per year ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_0 ) ?T1_release_year WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_name = 'Brad Pitt') .        } GROUP BY ?T1_release_year"
    },
    {
        "kg_name": "imdb",
        "question": "How many movies did ' Quentin Tarantino ' direct after 2010 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_158 ) WHERE { ?T1 :movie\\#ref-director_id ?T2 . FILTER(?T2_name = 'Quentin Tarantino' && ?T1_release_year > 2010) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "How many movies did ' Quentin Tarantino ' direct before 2010 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_50 ) WHERE { ?T1 :movie\\#ref-director_id ?T2 . FILTER(?T2_name = 'Quentin Tarantino' && ?T1_release_year < 2010) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "How many female actors were born in ' New York City ' after 1980 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_70 ) WHERE { ?T1 a :actor . ?T1 :actor\\#name ?T1_name . ?T1 :actor\\#birth_city ?T1_birth_city . ?T1 :actor\\#birth_year ?T1_birth_year . ?T1 :actor\\#gender ?T1_gender . FILTER(?T1_birth_city = 'New York City' && ?T1_birth_year > 1980 && ?T1_gender = 'female') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What movies have the same director as the movie ' Revolutionary Road ' ?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\\#title ?T1_title . ?T1 :movie\\#title ?T1_title . FILTER(?T1_title = 'Revolutionary Road') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "which movie has the most number of actors from China ?",
        "query": "SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 :movie\\#ref-actor_id ?T2 . FILTER(?T2_nationality = 'China') .        } GROUP BY ?T1_title  ORDER BY DESC ((count( ?T2_name) as ?aggregation_T2_name_92 )) LIMIT 1"
    },
    {
        "kg_name": "imdb",
        "question": "Which producer has worked with the most number of directors ?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :producer . ?T13 a :made_by . ?T13 :made_by\\#ref-pid ?T1 .  ?T1 :producer\\#name ?T1_name . ?T2 :director\\#name ?T2_name . ?T14 a :copyright . ?T13 :made_by\\#ref-msid ?T14 .  ?T1 :producer\\#name ?T1_name . ?T2 :director\\#name ?T2_name . ?T15 a :directed_by . ?T15 :directed_by\\#ref-msid ?T14 .  ?T1 :producer\\#name ?T1_name . ?T2 :director\\#name ?T2_name . ?T2 a :director . ?T15 :directed_by\\#ref-did ?T2 .  ?T1 :producer\\#name ?T1_name . ?T2 :director\\#name ?T2_name .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_name) as ?aggregation_T2_name_152 )) LIMIT 1"
    }
]