kg_name,question,query
inn_1,Find the first and last names of people who payed more than the rooms' base prices.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :reservations . ?T2 a :rooms . ?T1 :reservations\#ref-room ?T2 .  ?T1 :reservations\#firstname ?T1_firstname . ?T1 :reservations\#lastname ?T1_lastname . ?T1 :reservations\#rate ?T1_rate . ?T2 :rooms\#baseprice ?T2_baseprice . FILTER(?T1_rate - ?T2_baseprice > 0) .        }
inn_1,How many rooms are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms .        }
inn_1,What is the total number of rooms available in this inn?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms .        }
inn_1,Find the number of rooms with a king bed.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') .        }
inn_1,How many rooms have a king bed?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') .        }
inn_1,Find the number of rooms for each bed type.,SELECT ?T1_bedtype (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype .        } GROUP BY ?T1_bedtype
inn_1,What are the number of rooms for each bed type?,SELECT ?T1_bedtype (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype .        } GROUP BY ?T1_bedtype
inn_1,Find the name of the room with the maximum occupancy.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#maxoccupancy ?T1_maxoccupancy .        }   ORDER BY DESC (?T1_maxoccupancy) LIMIT 1
inn_1,What is the name of the room that can accommodate the most people?,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#maxoccupancy ?T1_maxoccupancy .        }   ORDER BY DESC (?T1_maxoccupancy) LIMIT 1
inn_1,Find the id and name of the most expensive base price room.,SELECT ?T1_roomid ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomid ?T1_roomid . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice .        }   ORDER BY DESC (?T1_baseprice) LIMIT 1
inn_1,Which room has the highest base price?,SELECT ?T1_roomid ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomid ?T1_roomid . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice .        }   ORDER BY DESC (?T1_baseprice) LIMIT 1
inn_1,List the type of bed and name of all traditional rooms.,SELECT ?T1_roomname ?T1_bedtype WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#decor ?T1_decor . FILTER(?T1_decor = 'traditional') .        }
inn_1,What are the bed type and name of all the rooms with traditional decor?,SELECT ?T1_roomname ?T1_bedtype WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#decor ?T1_decor . FILTER(?T1_decor = 'traditional') .        }
inn_1,Find the number of rooms with king bed for each decor type.,SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') .        } GROUP BY ?T1_decor
inn_1,Find the average and minimum price of the rooms in different decor.,SELECT ?T1_decor (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_99 ) (min( ?T1_baseprice) as ?aggregation_T1_baseprice_25 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#baseprice ?T1_baseprice . ?T1 :rooms\#baseprice ?T1_baseprice .        } GROUP BY ?T1_decor
inn_1,What is the average minimum and price of the rooms for each different decor.,SELECT ?T1_decor (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_130 ) (min( ?T1_baseprice) as ?aggregation_T1_baseprice_127 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#baseprice ?T1_baseprice . ?T1 :rooms\#baseprice ?T1_baseprice .        } GROUP BY ?T1_decor
inn_1,List the name of all rooms sorted by their prices.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice .        }  ORDER BY ASC (?T1_baseprice)
inn_1,Find the number of rooms with price higher than 120 for different decor.,SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#baseprice ?T1_baseprice . FILTER(?T1_baseprice > 120) .        } GROUP BY ?T1_decor
inn_1,"For each bed type, find the average room price.",SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_95 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#baseprice ?T1_baseprice .        } GROUP BY ?T1_bedtype
inn_1,List the name of rooms with king or queen bed.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King' || ?T1_bedtype = 'Queen') .        }
inn_1,What are the names of rooms that have either king or queen bed?,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King' || ?T1_bedtype = 'Queen') .        }
inn_1,How many different types of beds are there?,SELECT DISTINCT (count(DISTINCT ?T1_bedtype) as ?aggregation_T1_bedtype_83 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype .        }
inn_1,Find the number of distinct bed types available in this inn.,SELECT DISTINCT (count(DISTINCT ?T1_bedtype) as ?aggregation_T1_bedtype_132 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype .        }
inn_1,What are the name and id of the three highest priced rooms?,SELECT ?T1_roomid ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomid ?T1_roomid . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice .        }   ORDER BY DESC (?T1_baseprice) LIMIT 1
inn_1,Find the name of rooms whose price is higher than the average price.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice . FILTER(?T1_baseprice > (?aggregation_T22_baseprice_11)) .       {SELECT (avg( ?T22_baseprice) as ?aggregation_T22_baseprice_11 ) WHERE { ?T22 a :rooms . ?T22 :rooms\#baseprice ?T22_baseprice .        }    } }
inn_1,What are the name of rooms that cost more than the average.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice . FILTER(?T1_baseprice > (?aggregation_T22_baseprice_105)) .       {SELECT (avg( ?T22_baseprice) as ?aggregation_T22_baseprice_105 ) WHERE { ?T22 a :rooms . ?T22 :rooms\#baseprice ?T22_baseprice .        }    } }
inn_1,Find the number of rooms that do not have any reservation.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#roomid ?T1_roomid . FILTER(?T1_roomid not in (?T22_room)) .       {SELECT DISTINCT ?T22_room WHERE { ?T22 a :reservations . ?T22 :reservations\#room ?T22_room .        }    } }
inn_1,How many rooms have not had any reservation yet?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#roomid ?T1_roomid . FILTER(?T1_roomid not in (?T22_room)) .       {SELECT DISTINCT ?T22_room WHERE { ?T22 a :reservations . ?T22 :reservations\#room ?T22_room .        }    } }
inn_1,Return the name and number of reservations made for each of the rooms.,SELECT ?T1_roomname (count( *) as ?aggregation_all) ?T2_room WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname . ?T2 :reservations\#room ?T2_room .        } GROUP BY ?T1_roomname ?T2_room
inn_1,Find the names of rooms that have been reserved for more than 60 times.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname .        } GROUP BY ?T1_roomname   HAVING(count( *)  > 60)
inn_1,Find the name of rooms whose base price is between 120 and 150.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice . FILTER(?T1_baseprice >= 120 && ?T1_baseprice <= 150) .        }
inn_1,Find the name of rooms booked by some customers whose first name contains ROY.,"SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname . ?T2 :reservations\#firstname ?T2_firstname . FILTER(contains (?T2_firstname, 'ROY')) .        }"
inn_1,What are the name of rooms booked by customers whose first name has 'ROY' in part?,"SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname . ?T2 :reservations\#firstname ?T2_firstname . FILTER(contains (?T2_firstname, 'ROY')) .        }"
local_govt_mdm,What is the cmi cross reference id that is related to at least one council tax entry? List the cross reference id and source system code.,SELECT ?T1_cmi_cross_ref_id ?T1_source_system_code WHERE { ?T1 a :cmi_cross_references . ?T2 a :council_tax . ?T2 :council_tax\#ref-cmi_cross_ref_id ?T1 .  ?T1 :cmi_cross_references\#cmi_cross_ref_id ?T1_cmi_cross_ref_id . ?T1 :cmi_cross_references\#source_system_code ?T1_source_system_code .        } GROUP BY ?T1_cmi_cross_ref_id ?T1_source_system_code   HAVING(count( *)  >= 1)
local_govt_mdm,"How many business rates are related to each cmi cross reference? List cross reference id, master customer id and the n",SELECT ?T1_cmi_cross_ref_id ?T1_master_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :cmi_cross_references . ?T2 a :business_rates . ?T2 :business_rates\#ref-cmi_cross_ref_id ?T1 .  ?T1 :cmi_cross_references\#cmi_cross_ref_id ?T1_cmi_cross_ref_id . ?T1 :cmi_cross_references\#master_customer_id ?T1_master_customer_id .        } GROUP BY ?T1_cmi_cross_ref_id ?T1_master_customer_id
local_govt_mdm,"What is the tax source system code related to the benefits and overpayments? List the code and the benifit id, order by benifit id.",SELECT ?T1_source_system_code ?T2_council_tax_id WHERE { ?T1 a :cmi_cross_references . ?T2 a :benefits_overpayments . ?T2 :benefits_overpayments\#ref-cmi_cross_ref_id ?T1 .  ?T1 :cmi_cross_references\#source_system_code ?T1_source_system_code . ?T2 :benefits_overpayments\#council_tax_id ?T2_council_tax_id . ?T2 :benefits_overpayments\#council_tax_id ?T2_council_tax_id .        }  ORDER BY ASC (?T2_council_tax_id)
local_govt_mdm,"List all information about customer master index, and sort them by details in descending order.",SELECT * WHERE { ?T1 a :customer_master_index . ?T1 :customer_master_index\#cmi_details ?T1_cmi_details .        }  ORDER BY DESC (?T1_cmi_details)
local_govt_mdm,List the council tax ids and their related cmi cross references of all the parking fines.,SELECT ?T1_council_tax_id ?T1_cmi_cross_ref_id WHERE { ?T1 a :parking_fines . ?T1 :parking_fines\#council_tax_id ?T1_council_tax_id . ?T1 :parking_fines\#cmi_cross_ref_id ?T1_cmi_cross_ref_id .        }
local_govt_mdm,How many council taxes are collected for renting arrears ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rent_arrears .        }
local_govt_mdm,Which cmi cross reference id is not related to any parking taxes?,SELECT distinct?col1 WHERE { { SELECT (?T1_cmi_cross_ref_id as ?col1) WHERE { ?T1 a :cmi_cross_references . ?T1 :cmi_cross_references\#cmi_cross_ref_id ?T1_cmi_cross_ref_id .   }}  MINUS {SELECT (?T2_cmi_cross_ref_id as ?col1) WHERE { ?T2 a :parking_fines . ?T2 :parking_fines\#cmi_cross_ref_id ?T2_cmi_cross_ref_id .        }     } }
local_govt_mdm,Which distinct source system code includes the substring 'en'?,"SELECT DISTINCT ?T1_source_system_code WHERE { ?T1 a :cmi_cross_references . ?T1 :cmi_cross_references\#source_system_code ?T1_source_system_code . ?T1 :cmi_cross_references\#source_system_code ?T1_source_system_code . FILTER(contains (?T1_source_system_code, 'en')) .        }"
party_host,How many parties are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party .        }
party_host,List the themes of parties in ascending order of number of hosts.,SELECT ?T1_party_theme WHERE { ?T1 a :party . ?T1 :party\#party_theme ?T1_party_theme . ?T1 :party\#number_of_hosts ?T1_number_of_hosts .        }  ORDER BY ASC (?T1_number_of_hosts)
party_host,What are the themes and locations of parties?,SELECT ?T1_party_theme ?T1_location WHERE { ?T1 a :party . ?T1 :party\#party_theme ?T1_party_theme . ?T1 :party\#location ?T1_location .        }
party_host,Show the first year and last year of parties with theme 'Spring' or 'Teqnology'.,SELECT ?T1_first_year ?T1_last_year WHERE { ?T1 a :party . ?T1 :party\#first_year ?T1_first_year . ?T1 :party\#last_year ?T1_last_year . ?T1 :party\#party_theme ?T1_party_theme . ?T1 :party\#party_theme ?T1_party_theme . FILTER(?T1_party_theme = 'Spring' || ?T1_party_theme = 'Teqnology') .        }
party_host,What are the first year and last year of the parties whose theme is 'Spring' or 'Teqnology'?,SELECT ?T1_first_year ?T1_last_year WHERE { ?T1 a :party . ?T1 :party\#first_year ?T1_first_year . ?T1 :party\#last_year ?T1_last_year . ?T1 :party\#party_theme ?T1_party_theme . ?T1 :party\#party_theme ?T1_party_theme . FILTER(?T1_party_theme = 'Spring' || ?T1_party_theme = 'Teqnology') .        }
party_host,What is the average number of hosts for parties?,SELECT (avg( ?T1_number_of_hosts) as ?aggregation_T1_number_of_hosts_30 ) WHERE { ?T1 a :party . ?T1 :party\#number_of_hosts ?T1_number_of_hosts .        }
party_host,Compute the average number of hosts for parties.,SELECT (avg( ?T1_number_of_hosts) as ?aggregation_T1_number_of_hosts_141 ) WHERE { ?T1 a :party . ?T1 :party\#number_of_hosts ?T1_number_of_hosts .        }
party_host,What is the location of the party with the most hosts?,SELECT ?T1_location WHERE { ?T1 a :party . ?T1 :party\#location ?T1_location . ?T1 :party\#number_of_hosts ?T1_number_of_hosts .        }   ORDER BY DESC (?T1_number_of_hosts) LIMIT 1
party_host,Show different nationalities along with the number of hosts of each nationality.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :host . ?T1 :host\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality
party_host,Show the most common nationality of hosts.,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :host . ?T1 :host\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality  ORDER BY DESC (?aggregation_all) LIMIT 1
party_host,Which nationality has the most hosts?,SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :host . ?T1 :host\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality  ORDER BY DESC (?aggregation_all) LIMIT 1
party_host,Show the nations that have both hosts older than 45 and hosts younger than 35.,SELECT DISTINCT ?T1_nationality WHERE { ?T1 a :host . ?T1 :host\#nationality ?T1_nationality . ?T1 :host\#age ?T1_age . FILTER(?T1_age > 45) . FILTER (?T1_nationality in (?T2_nationality)) .   ?T2 a :host . ?T2 :host\#nationality ?T2_nationality . ?T2 :host\#age ?T2_age .  FILTER(?T2_age < 35) .             }
party_host,Which nations have both hosts of age above 45 and hosts of age below 35?,SELECT DISTINCT ?T1_nationality WHERE { ?T1 a :host . ?T1 :host\#nationality ?T1_nationality . ?T1 :host\#age ?T1_age . FILTER(?T1_age > 45) . FILTER (?T1_nationality in (?T2_nationality)) .   ?T2 a :host . ?T2 :host\#nationality ?T2_nationality . ?T2 :host\#age ?T2_age .  FILTER(?T2_age < 35) .             }
party_host,Show the themes of parties and the names of the party hosts.,SELECT ?T1_party_theme ?T2_name WHERE { ?T1 a :party . ?T13 a :party_host . ?T13 :party_host\#ref-party_id ?T1 .  ?T1 :party\#party_theme ?T1_party_theme . ?T2 :host\#name ?T2_name . ?T2 a :host . ?T13 :party_host\#ref-host_id ?T2 .  ?T1 :party\#party_theme ?T1_party_theme . ?T2 :host\#name ?T2_name .        }
party_host,Show the locations of parties and the names of the party hosts in ascending order of the age of the host.,SELECT ?T1_location ?T2_name WHERE { ?T1 a :party . ?T13 a :party_host . ?T13 :party_host\#ref-party_id ?T1 .  ?T1 :party\#location ?T1_location . ?T2 :host\#name ?T2_name . ?T2 :host\#age ?T2_age . ?T2 a :host . ?T13 :party_host\#ref-host_id ?T2 .  ?T1 :party\#location ?T1_location . ?T2 :host\#name ?T2_name . ?T2 :host\#age ?T2_age .        }  ORDER BY ASC (?T2_age)
party_host,Show the locations of parties with hosts older than 50.,SELECT ?T1_location WHERE { ?T1 a :party . ?T13 a :party_host . ?T13 :party_host\#ref-party_id ?T1 .  ?T1 :party\#location ?T1_location . ?T2 :host\#age ?T2_age . ?T2 a :host . ?T13 :party_host\#ref-host_id ?T2 .  ?T1 :party\#location ?T1_location . ?T2 :host\#age ?T2_age . FILTER(?T2_age > 50) .        }
party_host,Show the host names for parties with number of hosts greater than 20.,SELECT ?T1_name WHERE { ?T1 a :host . ?T13 a :party_host . ?T13 :party_host\#ref-host_id ?T1 .  ?T1 :host\#name ?T1_name . ?T2 :party\#number_of_hosts ?T2_number_of_hosts . ?T2 a :party . ?T13 :party_host\#ref-party_id ?T2 .  ?T1 :host\#name ?T1_name . ?T2 :party\#number_of_hosts ?T2_number_of_hosts . FILTER(?T2_number_of_hosts > 20) .        }
party_host,Show the name and the nationality of the oldest host.,SELECT ?T1_name ?T1_nationality WHERE { ?T1 a :host . ?T1 :host\#name ?T1_name . ?T1 :host\#nationality ?T1_nationality . ?T1 :host\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
party_host,What are the name and the nationality of the host of the highest age?,SELECT ?T1_name ?T1_nationality WHERE { ?T1 a :host . ?T1 :host\#name ?T1_name . ?T1 :host\#nationality ?T1_nationality . ?T1 :host\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
party_host,List the names of hosts who did not serve as a host of any party in our record.,SELECT ?T1_name WHERE { ?T1 a :host . ?T1 :host\#name ?T1_name . ?T1 :host\#host_id ?T1_host_id . FILTER(?T1_host_id not in (?T22_host_id)) .       {SELECT ?T22_host_id WHERE { ?T22 a :party_host . ?T22 :party_host\#host_id ?T22_host_id .        }    } }
party_host,What are the names of hosts who did not host any party in our record?,SELECT ?T1_name WHERE { ?T1 a :host . ?T1 :host\#name ?T1_name . ?T1 :host\#host_id ?T1_host_id . FILTER(?T1_host_id not in (?T22_host_id)) .       {SELECT ?T22_host_id WHERE { ?T22 a :party_host . ?T22 :party_host\#host_id ?T22_host_id .        }    } }
storm_record,How many regions do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :region .        }
storm_record,Show all region code and region name sorted by the codes.,SELECT ?T1_region_code ?T1_region_name WHERE { ?T1 a :region . ?T1 :region\#region_code ?T1_region_code . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#region_code ?T1_region_code .        }  ORDER BY ASC (?T1_region_code)
storm_record,List all region names in alphabetical order.,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#region_name ?T1_region_name .        }  ORDER BY ASC (?T1_region_name)
storm_record,What are the names of the regions in alphabetical order?,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#region_name ?T1_region_name .        }  ORDER BY ASC (?T1_region_name)
storm_record,Show names for all regions except for Denmark.,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#region_name ?T1_region_name . FILTER(?T1_region_name != 'Denmark') .        }
storm_record,How many storms had death records?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :storm . ?T1 :storm\#number_deaths ?T1_number_deaths . FILTER(?T1_number_deaths > 0) .        }
storm_record,"List name, dates active, and number of deaths for all storms with at least 1 death.",SELECT ?T1_name ?T1_dates_active ?T1_number_deaths WHERE { ?T1 a :storm . ?T1 :storm\#name ?T1_name . ?T1 :storm\#dates_active ?T1_dates_active . ?T1 :storm\#number_deaths ?T1_number_deaths . ?T1 :storm\#number_deaths ?T1_number_deaths . FILTER(?T1_number_deaths >= 1) .        }
storm_record,Show the average and maximum damage for all storms with max speed higher than 1000.,SELECT (avg( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_155 ) (max( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_20 ) WHERE { ?T1 a :storm . ?T1 :storm\#damage_millions_usd ?T1_damage_millions_usd . ?T1 :storm\#damage_millions_usd ?T1_damage_millions_usd . ?T1 :storm\#max_speed ?T1_max_speed . FILTER(?T1_max_speed > 1000) .        }
storm_record,Return the total number of deaths and total damange in millions for storms that had a max speed greater than the average.,SELECT (sum( ?T1_number_deaths) as ?aggregation_T1_number_deaths_168 ) (sum( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_151 ) WHERE { ?T1 a :storm . ?T1 :storm\#number_deaths ?T1_number_deaths . ?T1 :storm\#damage_millions_usd ?T1_damage_millions_usd . ?T1 :storm\#max_speed ?T1_max_speed . FILTER(?T1_max_speed > (?aggregation_T22_max_speed_83)) .       {SELECT (avg( ?T22_max_speed) as ?aggregation_T22_max_speed_83 ) WHERE { ?T22 a :storm . ?T22 :storm\#max_speed ?T22_max_speed .        }    } }
storm_record,List name and damage for all storms in a descending order of max speed.,SELECT ?T1_name ?T1_damage_millions_usd WHERE { ?T1 a :storm . ?T1 :storm\#name ?T1_name . ?T1 :storm\#damage_millions_usd ?T1_damage_millions_usd . ?T1 :storm\#max_speed ?T1_max_speed .        }  ORDER BY DESC (?T1_max_speed)
storm_record,How many regions are affected?,SELECT DISTINCT (count(DISTINCT ?T1_region_id) as ?aggregation_T1_region_id_171 ) WHERE { ?T1 a :affected_region . ?T1 :affected_region\#region_id ?T1_region_id .        }
storm_record,Count the number of different affected regions.,SELECT DISTINCT (count(DISTINCT ?T1_region_id) as ?aggregation_T1_region_id_128 ) WHERE { ?T1 a :affected_region . ?T1 :affected_region\#region_id ?T1_region_id .        }
storm_record,Show the name for regions not affected.,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#region_id ?T1_region_id . FILTER(?T1_region_id not in (?T22_region_id)) .       {SELECT ?T22_region_id WHERE { ?T22 a :affected_region . ?T22 :affected_region\#region_id ?T22_region_id .        }    } }
storm_record,What are the names of regions that were not affected?,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region\#region_name ?T1_region_name . ?T1 :region\#region_id ?T1_region_id . FILTER(?T1_region_id not in (?T22_region_id)) .       {SELECT ?T22_region_id WHERE { ?T22 a :affected_region . ?T22 :affected_region\#region_id ?T22_region_id .        }    } }
storm_record,Show the name for regions and the number of storms for each region.,SELECT ?T1_region_name (count( *) as ?aggregation_all) WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :affected_region\#ref-region_id ?T1 .  ?T1 :region\#region_name ?T1_region_name .        } GROUP BY ?T1_region_name
storm_record,How many storms occured in each region?,SELECT ?T1_region_name (count( *) as ?aggregation_all) WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :affected_region\#ref-region_id ?T1 .  ?T1 :region\#region_name ?T1_region_name .        } GROUP BY ?T1_region_name
storm_record,List the name for storms and the number of affected regions for each storm.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name .        } GROUP BY ?T1_name
storm_record,How many regions were affected by each storm?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name .        } GROUP BY ?T1_name
storm_record,What is the storm name and max speed which affected the greatest number of regions?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_max_speed WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name . ?T1 :storm\#max_speed ?T1_max_speed .        } GROUP BY ?T1_name ?T1_max_speed  ORDER BY DESC (?aggregation_all) LIMIT 1
storm_record,Show the name of storms which don't have affected region in record.,SELECT ?T1_name WHERE { ?T1 a :storm . ?T1 :storm\#name ?T1_name . ?T1 :storm\#storm_id ?T1_storm_id . FILTER(?T1_storm_id not in (?T22_storm_id)) .       {SELECT ?T22_storm_id WHERE { ?T22 a :affected_region . ?T22 :affected_region\#storm_id ?T22_storm_id .        }    } }
storm_record,What are the names of storms that did not affect any regions?,SELECT ?T1_name WHERE { ?T1 a :storm . ?T1 :storm\#name ?T1_name . ?T1 :storm\#storm_id ?T1_storm_id . FILTER(?T1_storm_id not in (?T22_storm_id)) .       {SELECT ?T22_storm_id WHERE { ?T22 a :affected_region . ?T22 :affected_region\#storm_id ?T22_storm_id .        }    } }
storm_record,Show storm name with at least two regions and 10 cities affected.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name . FILTER (?T1_name in (?T3_name)) .   ?T3 a :storm . ?T4 a :affected_region . ?T4 :affected_region\#ref-storm_id ?T3 .  ?T3 :storm\#name ?T3_name . ?T4 :affected_region\#number_city_affected ?T4_number_city_affected .     GROUP BY ?T3_name   HAVING(sum( ?T4_number_city_affected)  >= 10)      } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
storm_record,What are the names of storms that both affected two or more regions and affected a total of 10 or more cities?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name . FILTER (?T1_name in (?T3_name)) .   ?T3 a :storm . ?T4 a :affected_region . ?T4 :affected_region\#ref-storm_id ?T3 .  ?T3 :storm\#name ?T3_name . ?T4 :affected_region\#number_city_affected ?T4_number_city_affected .     GROUP BY ?T3_name   HAVING(sum( ?T4_number_city_affected)  >= 10)      } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
storm_record,Show all storm names except for those with at least two affected regions.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :storm . ?T1 :storm\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :storm . ?T3 a :affected_region . ?T3 :affected_region\#ref-storm_id ?T2 .  ?T2 :storm\#name ?T2_name .        } GROUP BY ?T2_name   HAVING(count( *)  >= 2) } }
storm_record,What are the names of storms that did not affect two or more regions?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :storm . ?T1 :storm\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :storm . ?T3 a :affected_region . ?T3 :affected_region\#ref-storm_id ?T2 .  ?T2 :storm\#name ?T2_name .        } GROUP BY ?T2_name   HAVING(count( *)  >= 2) } }
storm_record,Return the names of the regions affected by storms that had a death count of at least 10.,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T13 a :affected_region . ?T13 :affected_region\#ref-region_id ?T1 .  ?T1 :region\#region_name ?T1_region_name . ?T2 :storm\#number_deaths ?T2_number_deaths . ?T2 a :storm . ?T13 :affected_region\#ref-storm_id ?T2 .  ?T1 :region\#region_name ?T1_region_name . ?T2 :storm\#number_deaths ?T2_number_deaths . FILTER(?T2_number_deaths >= 10) .        }
storm_record,Show all storm names affecting region 'Denmark'.,SELECT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name . ?T2 :region\#region_name ?T2_region_name . ?T2 a :region . ?T13 :affected_region\#ref-region_id ?T2 .  ?T1 :storm\#name ?T1_name . ?T2 :region\#region_name ?T2_region_name . FILTER(?T2_region_name = 'Denmark') .        }
storm_record,What are the names of the storms that affected Denmark?,SELECT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name . ?T2 :region\#region_name ?T2_region_name . ?T2 a :region . ?T13 :affected_region\#ref-region_id ?T2 .  ?T1 :storm\#name ?T1_name . ?T2 :region\#region_name ?T2_region_name . FILTER(?T2_region_name = 'Denmark') .        }
storm_record,Show the region name with at least two storms.,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :affected_region\#ref-region_id ?T1 .  ?T1 :region\#region_name ?T1_region_name .        } GROUP BY ?T1_region_name   HAVING(count( *)  >= 2)
storm_record,What are the names of regions with two or more storms?,SELECT ?T1_region_name WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :affected_region\#ref-region_id ?T1 .  ?T1 :region\#region_name ?T1_region_name .        } GROUP BY ?T1_region_name   HAVING(count( *)  >= 2)
storm_record,Find the name of the storm that affected both Afghanistan and Albania regions.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :affected_region\#ref-storm_id ?T1 .  ?T1 :storm\#name ?T1_name . ?T2 :region\#region_name ?T2_region_name . ?T2 a :region . ?T13 :affected_region\#ref-region_id ?T2 .  ?T1 :storm\#name ?T1_name . ?T2 :region\#region_name ?T2_region_name . FILTER(?T2_region_name = 'Afghanistan') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :storm . ?T15 a :affected_region . ?T15 :affected_region\#ref-storm_id ?T3 .  ?T3 :storm\#name ?T3_name . ?T4 :region\#region_name ?T4_region_name . ?T4 a :region . ?T15 :affected_region\#ref-region_id ?T4 .  ?T3 :storm\#name ?T3_name . ?T4 :region\#region_name ?T4_region_name .  FILTER(?T4_region_name = 'Albania') .             }
election,How many counties are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :county .        }
election,Show the county name and population of all counties.,SELECT ?T1_county_name ?T1_population WHERE { ?T1 a :county . ?T1 :county\#county_name ?T1_county_name . ?T1 :county\#population ?T1_population .        }
election,What are the name and population of each county?,SELECT ?T1_county_name ?T1_population WHERE { ?T1 a :county . ?T1 :county\#county_name ?T1_county_name . ?T1 :county\#population ?T1_population .        }
election,Show the average population of all counties.,SELECT (avg( ?T1_population) as ?aggregation_T1_population_22 ) WHERE { ?T1 a :county . ?T1 :county\#population ?T1_population .        }
election,On average how large is the population of the counties?,SELECT (avg( ?T1_population) as ?aggregation_T1_population_43 ) WHERE { ?T1 a :county . ?T1 :county\#population ?T1_population .        }
election,Return the maximum and minimum population among all counties.,SELECT (max( ?T1_population) as ?aggregation_T1_population_80 ) (min( ?T1_population) as ?aggregation_T1_population_182 ) WHERE { ?T1 a :county . ?T1 :county\#population ?T1_population . ?T1 :county\#population ?T1_population .        }
election,What are the maximum and minimum population of the counties?,SELECT (max( ?T1_population) as ?aggregation_T1_population_36 ) (min( ?T1_population) as ?aggregation_T1_population_124 ) WHERE { ?T1 a :county . ?T1 :county\#population ?T1_population . ?T1 :county\#population ?T1_population .        }
election,Show all the distinct districts for elections.,SELECT DISTINCT ?T1_district WHERE { ?T1 a :election . ?T1 :election\#district ?T1_district .        }
election,What are the distinct districts for elections?,SELECT DISTINCT ?T1_district WHERE { ?T1 a :election . ?T1 :election\#district ?T1_district .        }
election,Show the zip code of the county with name 'Howard'.,SELECT ?T1_zip_code WHERE { ?T1 a :county . ?T1 :county\#zip_code ?T1_zip_code . ?T1 :county\#county_name ?T1_county_name . FILTER(?T1_county_name = 'Howard') .        }
