kg_name,question,query
scholar,What were the papers published at pldi 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'pldi') .        }
scholar,What are the papers from pldi 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'pldi') .        }
scholar,Papers from pldi 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'pldi') .        }
scholar,Which papers were accepted in pldi 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'pldi') .        }
scholar,What papers were published during the conference pldi 2015 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'pldi') .        }
scholar,List today 's journals,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :paper . ?T1 :paper\#journalid ?T1_journalid . ?T1 :paper\#year ?T1_year . FILTER(?T1_year = 2011) .        }
scholar,ACL papers in 2016 with neural attention in the title,"SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#title ?T1_title . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(contains (?T1_title, 'neural attention') && ?T1_year = 2016 && ?T2_venuename = 'ACL') .        }"
scholar,Who writes a lot of papers in Machine Learning ?,SELECT DISTINCT ?T1_authorname (count(DISTINCT ?T2_paperid) as ?aggregation_T2_paperid_39 ) WHERE { ?T1 a :author . ?T2 a :writes . ?T2 :writes\#ref-aid ?T1 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :writes\#paperid ?T2_paperid . ?T2 :writes\#paperid ?T2_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paper . ?T2 :writes\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :writes\#paperid ?T2_paperid . ?T2 :writes\#paperid ?T2_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :writes\#paperid ?T2_paperid . ?T2 :writes\#paperid ?T2_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :writes\#paperid ?T2_paperid . ?T2 :writes\#paperid ?T2_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'Machine Learning') .        } GROUP BY ?T1_authorname ORDER BY DESC ((count( ?T2_paperid) as ?aggregation_T2_paperid_195 ))
scholar,Who wrote sensor fusion ?,"SELECT DISTINCT ?T1_authorname WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paper . ?T13 :writes\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(contains (?T2_keyphrasename, 'sensor fusion')) .        }"
scholar,Who publishes in sensor fusion ?,"SELECT DISTINCT ?T1_authorname WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paper . ?T13 :writes\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T14 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(contains (?T2_keyphrasename, 'sensor fusion')) .        }"
scholar,how many papers by dan klein are cited by michael i. jordan,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_131 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'michael i. jordan' && ?T2_authorname = 'dan klein') .        }
scholar,how many of dan klein 's papers cite michael i. jordan,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_196 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'michael i. jordan' && ?T2_authorname = 'dan klein') .        }
scholar,who else was on the paper with Ameet Soni and Ras Bodik ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Ameet Soni' && ?T2_authorname = 'Ras Bodik') .        }
scholar,2014 papers using ImageNet,SELECT DISTINCT ?T1_paperid WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(?T2_datasetname = 'ImageNet' && ?T1_year = 2014) .        }
scholar,What journals are Takashi Matsumoto 's articles published in ?,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Takashi Matsumoto') .        }
scholar,What journals has Takashi Matsumoto published in ?,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Takashi Matsumoto') .        }
scholar,In what scholarly journals does Takashi Matsumoto publish ?,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Takashi Matsumoto') .        }
scholar,What authors wrote papers about Bacterial Wilt in 2016 ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T3 a :paper . ?T1 :writes\#ref-paperid ?T3 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :paper\#year ?T3_year . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T3 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :paper\#year ?T3_year . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :paper\#year ?T3_year . FILTER(?T2_keyphrasename = 'Bacterial Wilt' && ?T3_year = 2016) .        }
scholar,Who wrote on the topic of Bacterial Wilt in 2016 ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T3 a :paper . ?T1 :writes\#ref-paperid ?T3 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :paper\#year ?T3_year . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T3 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :paper\#year ?T3_year . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :paper\#year ?T3_year . FILTER(?T2_keyphrasename = 'Bacterial Wilt' && ?T3_year = 2016) .        }
scholar,When did Luke S Zettlemoyer publish ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Luke S Zettlemoyer') .        }  ORDER BY ASC (?T1_year)
scholar,What papers were written on question answering in 2016 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :paper\#year ?T1_year . FILTER(?T2_keyphrasename = 'question answering' && ?T1_year = 2016) .        }
scholar,what keyphrases get most citations ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_161 ) ?T2_keyphrasename WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T1 :cite\#citingpaperid ?T1_citingpaperid .        } GROUP BY ?T2_keyphrasename ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_177 ))
scholar,Find journals about Temporal Data .,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#journalid ?T1_journalid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Temporal Data') .        }
scholar,which ACL 2014 papers about Parsing used Jeopardy! Questions ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . ?T4 a :venue . ?T1 :paper\#ref-venueid ?T4 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T1 :paper\#year ?T1_year . ?T4 :venue\#venuename ?T4_venuename . FILTER(?T2_datasetname = 'Jeopardy! Questions' && ?T3_keyphrasename = 'Parsing' && ?T1_year = 2014 && ?T4_venuename = 'ACL') .        }
scholar,in what journals does linda shapiro publish ?,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :journal . ?T13 a :paper . ?T13 :paper\#ref-journalid ?T1 .  ?T1 :journal\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :journal\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :journal\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'linda shapiro') .        }
scholar,Which journals did linda shapiro submit papers to ?,SELECT DISTINCT ?T1_journalid WHERE { ?T1 a :journal . ?T13 a :paper . ?T13 :paper\#ref-journalid ?T1 .  ?T1 :journal\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T13 .  ?T1 :journal\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :journal\#journalid ?T1_journalid . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'linda shapiro') .        }
scholar,NIPS authors,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T13 a :paper . ?T1 :writes\#ref-paperid ?T13 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        }
scholar,who are the authors at NIPS ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T13 a :paper . ?T1 :writes\#ref-paperid ?T13 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        }
scholar,who authored papers at NIPS ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T13 a :paper . ?T1 :writes\#ref-paperid ?T13 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        }
scholar,who publishes in NIPS ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T13 a :paper . ?T1 :writes\#ref-paperid ?T13 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        }
scholar,who has papers at NIPS ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T13 a :paper . ?T1 :writes\#ref-paperid ?T13 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'NIPS') .        }
scholar,which venue publishes the most papers about deep learning,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_180 ) ?T2_venueid WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venueid ?T2_venueid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venueid ?T2_venueid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venueid ?T2_venueid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'deep learning') .        } GROUP BY ?T2_venueid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_126 ))
scholar,How many publications were added to the Cell journal this year ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_169 ) WHERE { ?T1 a :paper . ?T2 a :journal . ?T1 :paper\#ref-journalid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :journal\#journalname ?T2_journalname . ?T1 :paper\#year ?T1_year . FILTER(?T2_journalname = 'Cell' && ?T1_year = 2015) .        }
scholar,How many articles were published in the Cell journal in 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_84 ) WHERE { ?T1 a :paper . ?T2 a :journal . ?T1 :paper\#ref-journalid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :journal\#journalname ?T2_journalname . ?T1 :paper\#year ?T1_year . FILTER(?T2_journalname = 'Cell' && ?T1_year = 2015) .        }
scholar,What are all the publication titles by Donald E Knuth ?,SELECT DISTINCT ?T1_title WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#title ?T1_title . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Donald E Knuth') .        }
scholar,papers published in eccv 2016 by ali farhadi,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'ali farhadi' && ?T1_year = 2016 && ?T3_venuename = 'eccv') .        }
scholar,Does ali farhadi have a paper in eccv in 2016 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'ali farhadi' && ?T1_year = 2016 && ?T3_venuename = 'eccv') .        }
scholar,What are some papers dealing with Semantic Data in YAGO ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paperkeyphrase . ?T3 a :keyphrase . ?T1 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :paperkeyphrase\#paperid ?T1_paperid . ?T2 :dataset\#datasetname ?T2_datasetname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T2_datasetname = 'YAGO' && ?T3_keyphrasename = 'Semantic Data') .        }
scholar,Who has published more papers in chi ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_146 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'chi') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_81 ))
scholar,Who has written the most papers at chi ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_55 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'chi') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_146 ))
scholar,how is the most prolific author in chi ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_102 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'chi') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_53 ))
scholar,In what year did Ye Cao publish the most papers,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_156 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(contains (?T2_authorname, 'Ye Cao')) .        } GROUP BY ?T1_year ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_51 ))"
scholar,What year did Ye Cao publish the most papers,"SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_144 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . FILTER(contains (?T2_authorname, 'Ye Cao')) .        } GROUP BY ?T1_year ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_46 ))"
scholar,conferences that mention ImageNet,SELECT DISTINCT ?T1_venueid WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(?T2_datasetname = 'ImageNet') .        }
scholar,first deep learning paper,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T1_year)
scholar,What was the first paper on deep learning written ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T1_year)
scholar,When was deep learning proposed ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T1_year)
scholar,when was the first deep learning paper published ?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T1_year)
scholar,what papers were published in Academic radiology in 1995 ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T2 a :journal . ?T1 :paper\#ref-journalid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :journal\#journalname ?T2_journalname . ?T1 :paper\#year ?T1_year . FILTER(?T2_journalname = 'Academic radiology' && ?T1_year = 1995) .        }
scholar,what papers do parsing papers typically cite ?,SELECT DISTINCT ?T1_citedpaperid WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'parsing') .        }
scholar,venue for Trophic Cascade,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Trophic Cascade') .        }
scholar,What was the conference name that approved Trophic Cascade ?,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T13 a :paperkeyphrase . ?T13 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T13 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#venueid ?T1_venueid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Trophic Cascade') .        }
scholar,What are the best NLP conferences ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_12 ) ?T2_venueid WHERE { ?T1 a :cite . ?T2 a :paper . ?T1 :cite\#ref-citedpaperid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#venueid ?T2_venueid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#venueid ?T2_venueid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :paper\#venueid ?T2_venueid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'NLP') .        } GROUP BY ?T2_venueid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_5 ))
scholar,ACL papers by author,SELECT DISTINCT ?T1_paperid ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'ACL') .        }
scholar,papers with more than 10 citations,SELECT DISTINCT ?T1_citingpaperid WHERE { ?T1 a :cite . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citedpaperid ?T1_citedpaperid .        } GROUP BY ?T1_citingpaperid   HAVING(count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_26 ) > 10)
scholar,Which authors published papers in 2015 ?,SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T2 a :paper . ?T1 :writes\#ref-paperid ?T2 .  ?T1 :writes\#authorid ?T1_authorid . ?T2 :paper\#year ?T2_year . FILTER(?T2_year = 2015) .        }
scholar,main topics of work by Brian DeRenzi,SELECT DISTINCT ?T1_keyphrasename (sum(DISTINCT ?T2_numcitedby) as ?aggregation_T2_numcitedby_31 ) WHERE { ?T1 a :keyphrase . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T1 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T3 :author\#authorname ?T3_authorname . ?T2 a :paper . ?T14 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T3 :author\#authorname ?T3_authorname . ?T15 a :writes . ?T15 :writes\#ref-paperid ?T2 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T15 :writes\#ref-aid ?T3 .  ?T1 :keyphrase\#keyphrasename ?T1_keyphrasename . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T2 :paper\#numcitedby ?T2_numcitedby . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Brian DeRenzi') .        } GROUP BY ?T1_keyphrasename ORDER BY DESC ((sum( ?T2_numcitedby) as ?aggregation_T2_numcitedby_31 ))
scholar,authors with at least 5 papers,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_82 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid .        } GROUP BY ?T2_authorid   HAVING(count( ?T1_paperid) as ?aggregation_T1_paperid_122 ) >= 5)
scholar,papers that were not published in the last year,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . FILTER(?T1_year != 2015) .        }
