kg_name,question,query
allergy_1,Find the average age of the students who have allergies with food and animal types.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_104 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T23_allergytype)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T23 a :allergy_type . ?T22 :has_allergy\#ref-allergy ?T23 .  ?T22 :has_allergy\#stuid ?T22_stuid . ?T23 :allergy_type\#allergytype ?T23_allergytype . FILTER(?T23_allergytype = 'food') .        }    } }
allergy_1,How old are the students with allergies to food and animal types on average?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_58 ) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid in (?T23_allergytype)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T23 a :allergy_type . ?T22 :has_allergy\#ref-allergy ?T23 .  ?T22 :has_allergy\#stuid ?T22_stuid . ?T23 :allergy_type\#allergytype ?T23_allergytype . FILTER(?T23_allergytype = 'food') .        }    } }
allergy_1,How many male students (sex is 'M') are allergic to any type of food?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#sex ?T1_sex . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_sex = 'M' && ?T1_stuid in (?T23_allergytype)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T23 a :allergy_type . ?T22 :has_allergy\#ref-allergy ?T23 .  ?T22 :has_allergy\#stuid ?T22_stuid . ?T23 :allergy_type\#allergytype ?T23_allergytype . FILTER(?T23_allergytype = 'food') .        }    } }
allergy_1,Find the different first names and cities of the students who have allergy to milk or cat.,SELECT DISTINCT ?T1_fname ?T1_city_code WHERE { ?T1 :student\#ref-has_allergy_id ?T2 . FILTER(?T2_allergy = 'Milk' || ?T2_allergy = 'Cat') .        }
allergy_1,Find the number of students who are older than 18 and do not have allergy to either food or animal.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\#age ?T1_age . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_age > 18 && ?T1_stuid not in (?T23_allergytype)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T23 a :allergy_type . ?T22 :has_allergy\#ref-allergy ?T23 .  ?T22 :has_allergy\#stuid ?T22_stuid . ?T23 :allergy_type\#allergytype ?T23_allergytype . ?T23 :allergy_type\#allergytype ?T23_allergytype . FILTER(?T23_allergytype = 'food' || ?T23_allergytype = 'animal') .        }    } }
allergy_1,Find the first name and major of the students who are not allegry to soy.,SELECT ?T1_fname ?T1_major WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#major ?T1_major . ?T1 :student\#stuid ?T1_stuid . FILTER(?T1_stuid not in (?T22_allergy)) .       {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T22 :has_allergy\#stuid ?T22_stuid . ?T22 :has_allergy\#allergy ?T22_allergy . FILTER(?T22_allergy = 'Soy') .        }    } }
store_1,A list of the top 5 countries by number of invoices. List country name and number of invoices.,SELECT ?T1_billing_country (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_country ?T1_billing_country .        } GROUP BY ?T1_billing_country  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,A list of the top 8 countries by gross/total invoice size. List country name and gross invoice size.,SELECT ?T1_billing_country (sum( ?T1_total) as ?aggregation_T1_total_50 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_country ?T1_billing_country . ?T1 :invoices\#total ?T1_total . ?T1 :invoices\#total ?T1_total .        } GROUP BY ?T1_billing_country  ORDER BY DESC ((sum( ?T1_total) as ?aggregation_T1_total_131 )) LIMIT 1
store_1,A list of the top 10 countries by average invoice size. List country name and average invoice size.,SELECT ?T1_billing_country (avg( ?T1_total) as ?aggregation_T1_total_17 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_country ?T1_billing_country . ?T1 :invoices\#total ?T1_total . ?T1 :invoices\#total ?T1_total .        } GROUP BY ?T1_billing_country  ORDER BY DESC ((avg( ?T1_total) as ?aggregation_T1_total_74 )) LIMIT 1
store_1,Find out 5 customers who most recently purchased something. List customers' first and last name.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :invoices . ?T2 :invoices\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T2 :invoices\#invoice_date ?T2_invoice_date .        }   ORDER BY DESC (?T2_invoice_date) LIMIT 1
store_1,Find out the top 10 customers by total number of orders. List customers' first and last name and the number of total orders.,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :invoices . ?T2 :invoices\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,What are the top 10 customers' first and last names by total number of orders and how many orders did they make?,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :invoices . ?T2 :invoices\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,List the top 10 customers by total gross sales. List customers' first and last name and total gross sales.,SELECT ?T1_first_name ?T1_last_name (sum( ?T2_total) as ?aggregation_T2_total_4 ) WHERE { ?T1 a :customers . ?T2 a :invoices . ?T2 :invoices\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T2 :invoices\#total ?T2_total . ?T2 :invoices\#total ?T2_total .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC ((sum( ?T2_total) as ?aggregation_T2_total_168 )) LIMIT 1
store_1,"What are the top 10 customers' first and last names with the highest gross sales, and also what are the sales?",SELECT ?T1_first_name ?T1_last_name (sum( ?T2_total) as ?aggregation_T2_total_82 ) WHERE { ?T1 a :customers . ?T2 a :invoices . ?T2 :invoices\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T2 :invoices\#total ?T2_total . ?T2 :invoices\#total ?T2_total .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC ((sum( ?T2_total) as ?aggregation_T2_total_32 )) LIMIT 1
store_1,List the top 5 genres by number of tracks. List genres name and total tracks.,SELECT ?T1_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :genres . ?T2 a :tracks . ?T2 :tracks\#ref-genre_id ?T1 .  ?T1 :genres\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,How many tracks does each genre have and what are the names of the top 5?,SELECT ?T1_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :genres . ?T2 a :tracks . ?T2 :tracks\#ref-genre_id ?T1 .  ?T1 :genres\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,List every album's title.,SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title .        }
store_1,What are the titles of all the albums?,SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title .        }
store_1,List every album ordered by album title in ascending order.,SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title . ?T1 :albums\#title ?T1_title .        }  ORDER BY ASC (?T1_title)
store_1,What are the titles of all the albums alphabetically ascending?,SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title . ?T1 :albums\#title ?T1_title .        }  ORDER BY ASC (?T1_title)
store_1,List every album whose title starts with A in alphabetical order.,"SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title . ?T1 :albums\#title ?T1_title . ?T1 :albums\#title ?T1_title . FILTER(contains (?T1_title, 'A')) .        }  ORDER BY ASC (?T1_title)"
store_1,List the customers first and last name of 10 least expensive invoices.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :invoices . ?T2 :invoices\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T2 :invoices\#total ?T2_total .        }   ORDER BY ASC (?T2_total) LIMIT 1
store_1,"List total amount of  invoice from Chicago, IL.",SELECT (sum( ?T1_total) as ?aggregation_T1_total_11 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#total ?T1_total . ?T1 :invoices\#billing_city ?T1_billing_city . ?T1 :invoices\#billing_state ?T1_billing_state . FILTER(?T1_billing_city = 'Chicago' && ?T1_billing_state = 'IL') .        }
store_1,"List the number of invoices from Chicago, IL.",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_city ?T1_billing_city . ?T1 :invoices\#billing_state ?T1_billing_state . FILTER(?T1_billing_city = 'Chicago' && ?T1_billing_state = 'IL') .        }
store_1,"List the number of invoices from the US, grouped by state.",SELECT ?T1_billing_state (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_state ?T1_billing_state . ?T1 :invoices\#billing_country ?T1_billing_country . FILTER(?T1_billing_country = 'USA') .        } GROUP BY ?T1_billing_state
store_1,How many invoices were billed from each state?,SELECT ?T1_billing_state (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_state ?T1_billing_state . ?T1 :invoices\#billing_country ?T1_billing_country . FILTER(?T1_billing_country = 'USA') .        } GROUP BY ?T1_billing_state
store_1,List the state in the US with the most invoices.,SELECT ?T1_billing_state (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_state ?T1_billing_state . ?T1 :invoices\#billing_country ?T1_billing_country . FILTER(?T1_billing_country = 'USA') .        } GROUP BY ?T1_billing_state  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,What are the states with the most invoices?,SELECT ?T1_billing_state (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_state ?T1_billing_state . ?T1 :invoices\#billing_country ?T1_billing_country . FILTER(?T1_billing_country = 'USA') .        } GROUP BY ?T1_billing_state  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,List the number of invoices and the invoice total from California.,SELECT ?T1_billing_state (count( *) as ?aggregation_all) (sum( ?T1_total) as ?aggregation_T1_total_134 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_state ?T1_billing_state . ?T1 :invoices\#total ?T1_total . ?T1 :invoices\#billing_state ?T1_billing_state . FILTER(?T1_billing_state = 'CA') .        } GROUP BY ?T1_billing_state
store_1,What is the number of invoices and total money billed in them from CA?,SELECT ?T1_billing_state (count( *) as ?aggregation_all) (sum( ?T1_total) as ?aggregation_T1_total_88 ) WHERE { ?T1 a :invoices . ?T1 :invoices\#billing_state ?T1_billing_state . ?T1 :invoices\#total ?T1_total . ?T1 :invoices\#billing_state ?T1_billing_state . FILTER(?T1_billing_state = 'CA') .        } GROUP BY ?T1_billing_state
store_1,List Aerosmith's albums.,SELECT ?T1_title WHERE { ?T1 a :albums . ?T2 a :artists . ?T1 :albums\#ref-artist_id ?T2 .  ?T1 :albums\#title ?T1_title . ?T2 :artists\#name ?T2_name . FILTER(?T2_name = 'Aerosmith') .        }
store_1,What are the titles of all the Aerosmith albums?,SELECT ?T1_title WHERE { ?T1 a :albums . ?T2 a :artists . ?T1 :albums\#ref-artist_id ?T2 .  ?T1 :albums\#title ?T1_title . ?T2 :artists\#name ?T2_name . FILTER(?T2_name = 'Aerosmith') .        }
store_1,How many albums does Billy Cobham has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :albums . ?T2 a :artists . ?T1 :albums\#ref-artist_id ?T2 .  ?T2 :artists\#name ?T2_name . FILTER(?T2_name = 'Billy Cobham') .        }
store_1,How many albums has Billy Cobam released?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :albums . ?T2 a :artists . ?T1 :albums\#ref-artist_id ?T2 .  ?T2 :artists\#name ?T2_name . FILTER(?T2_name = 'Billy Cobham') .        }
store_1,Eduardo Martins is a customer at which company?,SELECT ?T1_company WHERE { ?T1 a :customers . ?T1 :customers\#company ?T1_company . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Eduardo' && ?T1_last_name = 'Martins') .        }
store_1,What is the company where Eduardo Martins is a customer?,SELECT ?T1_company WHERE { ?T1 a :customers . ?T1 :customers\#company ?T1_company . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Eduardo' && ?T1_last_name = 'Martins') .        }
store_1,What is Astrid Gruber's email and phone number?,SELECT ?T1_email ?T1_phone WHERE { ?T1 a :customers . ?T1 :customers\#email ?T1_email . ?T1 :customers\#phone ?T1_phone . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Astrid' && ?T1_last_name = 'Gruber') .        }
store_1,What is the email and phone number of Astrid Gruber the customer?,SELECT ?T1_email ?T1_phone WHERE { ?T1 a :customers . ?T1 :customers\#email ?T1_email . ?T1 :customers\#phone ?T1_phone . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Astrid' && ?T1_last_name = 'Gruber') .        }
store_1,How many customers live in Prague city?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#city ?T1_city . FILTER(?T1_city = 'Prague') .        }
store_1,How many customers live in the city of Prague?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#city ?T1_city . FILTER(?T1_city = 'Prague') .        }
store_1,How many customers in state of CA?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#state ?T1_state . FILTER(?T1_state = 'CA') .        }
store_1,How many customers are from California?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#state ?T1_state . FILTER(?T1_state = 'CA') .        }
store_1,What country does Roberto Almeida live?,SELECT ?T1_country WHERE { ?T1 a :customers . ?T1 :customers\#country ?T1_country . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Roberto' && ?T1_last_name = 'Almeida') .        }
store_1,In which country does Roberto Almeida?,SELECT ?T1_country WHERE { ?T1 a :customers . ?T1 :customers\#country ?T1_country . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Roberto' && ?T1_last_name = 'Almeida') .        }
store_1,List the name of albums that are released by aritist whose name has 'Led',"SELECT ?T1_title WHERE { ?T1 a :albums . ?T2 a :artists . ?T1 :albums\#ref-artist_id ?T2 .  ?T1 :albums\#title ?T1_title . ?T2 :artists\#name ?T2_name . FILTER(contains (?T2_name, 'Led')) .        }"
store_1,How many customers does Steve Johnson support?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :employees . ?T1 :customers\#ref-support_rep_id ?T2 .  ?T2 :employees\#first_name ?T2_first_name . ?T2 :employees\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Steve' && ?T2_last_name = 'Johnson') .        }
store_1,What is the count of customers that Steve Johnson supports?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :employees . ?T1 :customers\#ref-support_rep_id ?T2 .  ?T2 :employees\#first_name ?T2_first_name . ?T2 :employees\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Steve' && ?T2_last_name = 'Johnson') .        }
store_1,find the full name of employees who report to Nancy Edwards?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Nancy' && ?T1_last_name = 'Edwards') .        }
store_1,What is the address of employee Nancy Edwards?,SELECT ?T1_address WHERE { ?T1 a :employees . ?T1 :employees\#address ?T1_address . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Nancy' && ?T1_last_name = 'Edwards') .        }
store_1,What is Nancy Edwards's address?,SELECT ?T1_address WHERE { ?T1 a :employees . ?T1 :employees\#address ?T1_address . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Nancy' && ?T1_last_name = 'Edwards') .        }
store_1,Find the full name of employee who supported the most number of customers.,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name WHERE { ?T1 a :employees . ?T2 a :customers . ?T2 :customers\#ref-support_rep_id ?T1 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,What is the full name of the employee who has the most customers?,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name WHERE { ?T1 a :employees . ?T2 a :customers . ?T2 :customers\#ref-support_rep_id ?T1 .  ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
store_1,How many employees are living in Canada?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T1 :employees\#country ?T1_country . FILTER(?T1_country = 'Canada') .        }
store_1,How many employees live in Canada?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employees . ?T1 :employees\#country ?T1_country . FILTER(?T1_country = 'Canada') .        }
store_1,What is employee Nancy Edwards's phone number?,SELECT ?T1_phone WHERE { ?T1 a :employees . ?T1 :employees\#phone ?T1_phone . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Nancy' && ?T1_last_name = 'Edwards') .        }
store_1,What is the the phone number of Nancy Edwards?,SELECT ?T1_phone WHERE { ?T1 a :employees . ?T1 :employees\#phone ?T1_phone . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Nancy' && ?T1_last_name = 'Edwards') .        }
store_1,Who is the youngest employee in the company? List employee's first and last name.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#birth_date ?T1_birth_date .        }   ORDER BY DESC (?T1_birth_date) LIMIT 1
store_1,What si the youngest employee's first and last name?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#birth_date ?T1_birth_date .        }   ORDER BY DESC (?T1_birth_date) LIMIT 1
store_1,List top 10 employee work longest in the company. List employee's first and last name.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#hire_date ?T1_hire_date .        }   ORDER BY ASC (?T1_hire_date) LIMIT 1
store_1,Find the number of employees whose title is IT Staff from each city?,SELECT (count( *) as ?aggregation_all) ?T1_city WHERE { ?T1 a :employees . ?T1 :employees\#city ?T1_city . ?T1 :employees\#title ?T1_title . FILTER(?T1_title = 'IT Staff') .        } GROUP BY ?T1_city
store_1,How many employees who are IT staff are from each city?,SELECT (count( *) as ?aggregation_all) ?T1_city WHERE { ?T1 a :employees . ?T1 :employees\#city ?T1_city . ?T1 :employees\#title ?T1_title . FILTER(?T1_title = 'IT Staff') .        } GROUP BY ?T1_city
store_1,"Which employee manage most number of peoples? List employee's first and last name, and number of people report to that employee.",SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name (count( ?T1_reports_to) as ?aggregation_T1_reports_to_127 ) WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#reports_to ?T1_reports_to . ?T1 :employees\#reports_to ?T1_reports_to .        } GROUP BY ?T1_last_name  ORDER BY DESC ((count( ?T1_reports_to) as ?aggregation_T1_reports_to_134 )) LIMIT 1
store_1,What are the first and last names of all the employees and how many people report to them?,SELECT ?T1_first_name (count( *) as ?aggregation_all) ?T1_last_name (count( ?T1_reports_to) as ?aggregation_T1_reports_to_83 ) WHERE { ?T1 a :employees . ?T1 :employees\#first_name ?T1_first_name . ?T1 :employees\#last_name ?T1_last_name . ?T1 :employees\#reports_to ?T1_reports_to . ?T1 :employees\#reports_to ?T1_reports_to .        } GROUP BY ?T1_last_name  ORDER BY DESC ((count( ?T1_reports_to) as ?aggregation_T1_reports_to_58 )) LIMIT 1
store_1,How many orders does Lucas Mancini has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T2 a :customers . ?T1 :invoices\#ref-customer_id ?T2 .  ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Lucas' && ?T2_last_name = 'Mancini') .        }
store_1,How many orders does Luca Mancini have in his invoices?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :invoices . ?T2 a :customers . ?T1 :invoices\#ref-customer_id ?T2 .  ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Lucas' && ?T2_last_name = 'Mancini') .        }
store_1,What is the total amount of money spent by Lucas Mancini?,SELECT (sum( ?T1_total) as ?aggregation_T1_total_157 ) WHERE { ?T1 a :invoices . ?T2 a :customers . ?T1 :invoices\#ref-customer_id ?T2 .  ?T1 :invoices\#total ?T1_total . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Lucas' && ?T2_last_name = 'Mancini') .        }
store_1,How much money did Lucas Mancini spend?,SELECT (sum( ?T1_total) as ?aggregation_T1_total_171 ) WHERE { ?T1 a :invoices . ?T2 a :customers . ?T1 :invoices\#ref-customer_id ?T2 .  ?T1 :invoices\#total ?T1_total . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Lucas' && ?T2_last_name = 'Mancini') .        }
store_1,List all media types.,SELECT ?T1_name WHERE { ?T1 a :media_types . ?T1 :media_types\#name ?T1_name .        }
store_1,What are the names of all the media types?,SELECT ?T1_name WHERE { ?T1 a :media_types . ?T1 :media_types\#name ?T1_name .        }
store_1,List all different genre types.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :genres . ?T1 :genres\#name ?T1_name .        }
store_1,What are the different names of the genres?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :genres . ?T1 :genres\#name ?T1_name .        }
store_1,List the name of all playlist.,SELECT ?T1_name WHERE { ?T1 a :playlists . ?T1 :playlists\#name ?T1_name .        }
store_1,What are the names of all the playlists?,SELECT ?T1_name WHERE { ?T1 a :playlists . ?T1 :playlists\#name ?T1_name .        }
store_1,Who is the composer of track Fast As a Shark?,SELECT ?T1_composer WHERE { ?T1 a :tracks . ?T1 :tracks\#composer ?T1_composer . ?T1 :tracks\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }
store_1,What is the composer who created the track 'Fast As a Shark'?,SELECT ?T1_composer WHERE { ?T1 a :tracks . ?T1 :tracks\#composer ?T1_composer . ?T1 :tracks\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }
store_1,How long does track Fast As a Shark has?,SELECT ?T1_milliseconds WHERE { ?T1 a :tracks . ?T1 :tracks\#milliseconds ?T1_milliseconds . ?T1 :tracks\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }
store_1,How many milliseconds long is Fast As a Shark?,SELECT ?T1_milliseconds WHERE { ?T1 a :tracks . ?T1 :tracks\#milliseconds ?T1_milliseconds . ?T1 :tracks\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }
store_1,What is the name of tracks whose genre is Rock?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . FILTER(?T2_name = 'Rock') .        }
store_1,What is the name of all tracks in the Rock genre?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . FILTER(?T2_name = 'Rock') .        }
store_1,What is title of album which track Balls to the Wall belongs to?,SELECT ?T1_title WHERE { ?T1 a :albums . ?T2 a :tracks . ?T2 :tracks\#ref-album_id ?T1 .  ?T1 :albums\#title ?T1_title . ?T2 :tracks\#name ?T2_name . FILTER(?T2_name = 'Balls to the Wall') .        }
store_1,What is the name of the album that has the track Ball to the Wall?,SELECT ?T1_title WHERE { ?T1 a :albums . ?T2 a :tracks . ?T2 :tracks\#ref-album_id ?T1 .  ?T1 :albums\#title ?T1_title . ?T2 :tracks\#name ?T2_name . FILTER(?T2_name = 'Balls to the Wall') .        }
store_1,List name of all tracks in Balls to the Wall.,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :albums . ?T1 :tracks\#ref-album_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :albums\#title ?T2_title . FILTER(?T2_title = 'Balls to the Wall') .        }
store_1,What is the name of all tracks in the album named Balls to the Wall?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :albums . ?T1 :tracks\#ref-album_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :albums\#title ?T2_title . FILTER(?T2_title = 'Balls to the Wall') .        }
store_1,List title of albums have the number of tracks greater than 10.,SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title . ?T1 :albums\#id ?T1_id .        } GROUP BY ?T1_title   HAVING(count( ?T1_id) as ?aggregation_T1_id_2 ) > 10)
store_1,What are the names of the albums that have more than 10 tracks?,SELECT ?T1_title WHERE { ?T1 a :albums . ?T1 :albums\#title ?T1_title . ?T1 :albums\#id ?T1_id .        } GROUP BY ?T1_title   HAVING(count( ?T1_id) as ?aggregation_T1_id_137 ) > 10)
store_1,List the name of tracks belongs to genre Rock and whose media type is MPEG audio file.,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . ?T3 :media_types\#name ?T3_name . ?T3 a :media_types . ?T1 :tracks\#ref-media_type_id ?T3 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . ?T3 :media_types\#name ?T3_name . FILTER(?T2_name = 'Rock' && ?T3_name = 'MPEG audio file') .        }
store_1,What are the names of all Rock tracks that are stored on MPEG audio files?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . ?T3 :media_types\#name ?T3_name . ?T3 a :media_types . ?T1 :tracks\#ref-media_type_id ?T3 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . ?T3 :media_types\#name ?T3_name . FILTER(?T2_name = 'Rock' && ?T3_name = 'MPEG audio file') .        }
store_1,List the name of tracks belongs to genre Rock or genre Jazz.,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . ?T2 :genres\#name ?T2_name . FILTER(?T2_name = 'Rock' || ?T2_name = 'Jazz') .        }
store_1,What are the names of the tracks that are Rock or Jazz songs?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :genres\#name ?T2_name . ?T2 :genres\#name ?T2_name . FILTER(?T2_name = 'Rock' || ?T2_name = 'Jazz') .        }
store_1,List the name of all tracks in the playlists of Movies.,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T13 a :playlist_tracks . ?T13 :playlist_tracks\#ref-track_id ?T1 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . ?T2 a :playlists . ?T13 :playlist_tracks\#ref-playlist_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . FILTER(?T2_name = 'Movies') .        }
store_1,What are the names of all tracks that are on playlists titled Movies?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T13 a :playlist_tracks . ?T13 :playlist_tracks\#ref-track_id ?T1 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . ?T2 a :playlists . ?T13 :playlist_tracks\#ref-playlist_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . FILTER(?T2_name = 'Movies') .        }
store_1,List the name of playlist which has number of tracks greater than 100.,SELECT ?T1_name WHERE { ?T1 a :playlists . ?T2 a :playlist_tracks . ?T2 :playlist_tracks\#ref-playlist_id ?T1 .  ?T1 :playlists\#name ?T1_name . ?T2 :playlist_tracks\#track_id ?T2_track_id .        } GROUP BY ?T1_name   HAVING(count( ?T2_track_id) as ?aggregation_T2_track_id_36 ) > 100)
store_1,What are the names of all playlists that have more than 100 tracks?,SELECT ?T1_name WHERE { ?T1 a :playlists . ?T2 a :playlist_tracks . ?T2 :playlist_tracks\#ref-playlist_id ?T1 .  ?T1 :playlists\#name ?T1_name . ?T2 :playlist_tracks\#track_id ?T2_track_id .        } GROUP BY ?T1_name   HAVING(count( ?T2_track_id) as ?aggregation_T2_track_id_30 ) > 100)
store_1,List all tracks bought by customer Daan Peeters.,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T13 a :invoice_lines . ?T13 :invoice_lines\#ref-track_id ?T1 .  ?T1 :tracks\#name ?T1_name . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . ?T14 a :invoices . ?T13 :invoice_lines\#ref-invoice_id ?T14 .  ?T1 :tracks\#name ?T1_name . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . ?T2 a :customers . ?T14 :invoices\#ref-customer_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Daan' && ?T2_last_name = 'Peeters') .        }
store_1,What are the tracks that Dean Peeters bought?,SELECT ?T1_name WHERE { ?T1 a :tracks . ?T13 a :invoice_lines . ?T13 :invoice_lines\#ref-track_id ?T1 .  ?T1 :tracks\#name ?T1_name . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . ?T14 a :invoices . ?T13 :invoice_lines\#ref-invoice_id ?T14 .  ?T1 :tracks\#name ?T1_name . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . ?T2 a :customers . ?T14 :invoices\#ref-customer_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Daan' && ?T2_last_name = 'Peeters') .        }
store_1,How much is the track Fast As a Shark?,SELECT ?T1_unit_price WHERE { ?T1 a :tracks . ?T1 :tracks\#unit_price ?T1_unit_price . ?T1 :tracks\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }
store_1,What is the unit price of the tune 'Fast As a Shark'?,SELECT ?T1_unit_price WHERE { ?T1 a :tracks . ?T1 :tracks\#unit_price ?T1_unit_price . ?T1 :tracks\#name ?T1_name . FILTER(?T1_name = 'Fast As a Shark') .        }
