kg_name,question,query
music_2,What instruments did the musician with the last name 'Heilo' play in 'Badlands'?,SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\#ref-bandmateid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . FILTER(?T2_lastname = 'Heilo' && ?T3_title = 'Badlands') .        }
music_2,How many instruments does the song 'Badlands' use?,SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_15 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\#ref-songid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }
music_2,How many different instruments are used in the song 'Badlands'?,SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_144 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\#ref-songid ?T2 .  ?T1 :instruments\#instrument ?T1_instrument . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }
music_2,What are the vocal types used in song 'Badlands'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }
music_2,What types of vocals are used in the song 'Badlands'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }
music_2,Find the number of vocal types used in song 'Le Pop',SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,How many vocal types are used in the song 'Le Pop'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }
music_2,How many songs have a shared vocal?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_62 ) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :vocals\#type ?T2_type . FILTER(?T2_type = 'shared') .        }
music_2,How many different songs have shared vocals?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_35 ) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :vocals\#type ?T2_type . FILTER(?T2_type = 'shared') .        }
music_2,Find all the songs that do not have a back vocal.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_title as ?col1) WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :songs . ?T3 a :vocals . ?T3 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . ?T3 :vocals\#type ?T3_type . FILTER(?T3_type = 'back') .        }     } }
music_2,What are the different names of all songs without back vocals?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_title as ?col1) WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :songs . ?T3 a :vocals . ?T3 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . ?T3 :vocals\#type ?T3_type . FILTER(?T3_type = 'back') .        }     } }
music_2,Which vocal type has the band mate with first name 'Solveig' played the most?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Solveig') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What are the types of vocals that the band member with the first name 'Solveig' played the most?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Solveig') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,Which vocal type did the musician with last name 'Heilo' played in the song with title 'Der Kapitan'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . FILTER(?T2_lastname = 'Heilo' && ?T3_title = 'Der Kapitan') .        }
music_2,What are the types of vocals that the musician with the last name 'Heilo' played in 'Der Kapitan'?,SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T14 a :performance . ?T14 :performance\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . ?T3 a :songs . ?T14 :performance\#ref-songid ?T3 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#lastname ?T2_lastname . ?T3 :songs\#title ?T3_title . FILTER(?T2_lastname = 'Heilo' && ?T3_title = 'Der Kapitan') .        }
music_2,Find the first name of the band mate that has performed in most songs.,SELECT ?T1_firstname (count( *) as ?aggregation_all) WHERE { ?T1 a :band . ?T2 a :performance . ?T2 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname .        } GROUP BY ?T1_firstname  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the first name of the band mate who perfomed in the most songs?,SELECT ?T1_firstname (count( *) as ?aggregation_all) WHERE { ?T1 a :band . ?T2 a :performance . ?T2 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname .        } GROUP BY ?T1_firstname  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,Which vocal type has the band mate with first name 'Marianne' played the most?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Marianne') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the vocal type of the band mate whose first name is 'Marianne' played the most?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\#ref-bandmate ?T2 .  ?T1 :vocals\#type ?T1_type . ?T2 :band\#firstname ?T2_firstname . FILTER(?T2_firstname = 'Marianne') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
music_2,What is the first and last name of the artist who performed back stage for the song 'Der Kapitan'?,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T3 a :performance . ?T3 :performance\#ref-bandmate ?T1 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T3 :performance\#stageposition ?T3_stageposition . ?T2 a :songs . ?T3 :performance\#ref-songid ?T2 .  ?T1 :band\#firstname ?T1_firstname . ?T1 :band\#lastname ?T1_lastname . ?T2 :songs\#title ?T2_title . ?T3 :performance\#stageposition ?T3_stageposition . FILTER(?T2_title = 'Der Kapitan' && ?T3_stageposition = 'back') .        }
music_2,What are the names of the songs that do not have back vocals?,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_title as ?col1) WHERE { ?T1 a :songs . ?T1 :songs\#title ?T1_title .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :songs . ?T3 a :vocals . ?T3 :vocals\#ref-songid ?T2 .  ?T2 :songs\#title ?T2_title . ?T3 :vocals\#type ?T3_type . FILTER(?T3_type = 'back') .        }     } }
music_2,What are the songs in album 'A Kiss Before You Go: Live in Hamburg'?,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#title ?T2_title . ?T2 a :albums . ?T13 :tracklists\#ref-albumid ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#title ?T2_title . FILTER(?T2_title = 'A Kiss Before You Go: Live in Hamburg') .        }
music_2,What are the song titles on the album 'A Kiss Before You Go: Live in Hamburg'?,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#title ?T2_title . ?T2 a :albums . ?T13 :tracklists\#ref-albumid ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#title ?T2_title . FILTER(?T2_title = 'A Kiss Before You Go: Live in Hamburg') .        }
music_2,What are all the songs in albums under label 'Universal Music Group'?,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#label ?T2_label . ?T2 a :albums . ?T13 :tracklists\#ref-albumid ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#label ?T2_label . FILTER(?T2_label = 'Universal Music Group') .        }
music_2,What are the names of all the songs whose album is under the label of 'Universal Music Group'?,SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#label ?T2_label . ?T2 a :albums . ?T13 :tracklists\#ref-albumid ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#label ?T2_label . FILTER(?T2_label = 'Universal Music Group') .        }
music_2,Find the number of songs in all the studio albums.,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_117 ) WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#type ?T2_type . ?T2 a :albums . ?T13 :tracklists\#ref-albumid ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#type ?T2_type . FILTER(?T2_type = 'Studio') .        }
music_2,How many songs appear in studio albums?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_62 ) WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\#ref-songid ?T1 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#type ?T2_type . ?T2 a :albums . ?T13 :tracklists\#ref-albumid ?T2 .  ?T1 :songs\#title ?T1_title . ?T2 :albums\#type ?T2_type . FILTER(?T2_type = 'Studio') .        }
manufactory_1,Who is the founder of Sony?,SELECT ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#founder ?T1_founder . ?T1 :manufacturers\#name ?T1_name . FILTER(?T1_name = 'Sony') .        }
manufactory_1,Where is the headquarter of the company founded by James?,SELECT ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#founder ?T1_founder . FILTER(?T1_founder = 'James') .        }
manufactory_1,What is the headquarter of the company whose founder is James?,SELECT ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#founder ?T1_founder . FILTER(?T1_founder = 'James') .        }
manufactory_1,"Find all manufacturers' names and their headquarters, sorted by the ones with highest revenue first.",SELECT ?T1_name ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#revenue ?T1_revenue .        }  ORDER BY DESC (?T1_revenue)
manufactory_1,"Return the average, maximum, and total revenues across all manufacturers.",SELECT (avg( ?T1_revenue) as ?aggregation_T1_revenue_144 ) (max( ?T1_revenue) as ?aggregation_T1_revenue_195 ) (sum( ?T1_revenue) as ?aggregation_T1_revenue_161 ) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#revenue ?T1_revenue .        }
manufactory_1,How many companies were created by Andy?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#founder ?T1_founder . FILTER(?T1_founder = 'Andy') .        }
manufactory_1,Find the total revenue created by the companies whose headquarter is located at Austin.,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_101 ) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Austin') .        }
manufactory_1,What is the sum of revenue from companies with headquarters in Austin?,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_133 ) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Austin') .        }
manufactory_1,What are the different cities listed?,SELECT DISTINCT ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#headquarter ?T1_headquarter .        }
manufactory_1,Find the number of manufactures that are based in Tokyo or Beijing.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Beijing') .        }
manufactory_1,How many manufacturers have headquarters in either Tokyo or Beijing?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Beijing') .        }
manufactory_1,Find the founder of the company whose name begins with the letter 'S'.,"SELECT ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#founder ?T1_founder . ?T1 :manufacturers\#name ?T1_name . FILTER(contains (?T1_name, 'S')) .        }"
manufactory_1,Who is the founders of companies whose first letter is S?,"SELECT ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#founder ?T1_founder . ?T1 :manufacturers\#name ?T1_name . FILTER(contains (?T1_name, 'S')) .        }"
manufactory_1,Find the name of companies whose revenue is between 100 and 150.,SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#revenue ?T1_revenue . FILTER(?T1_revenue >= 100 && ?T1_revenue <= 150) .        }
manufactory_1,What are the names of companies with revenue between 100 and 150?,SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#revenue ?T1_revenue . FILTER(?T1_revenue >= 100 && ?T1_revenue <= 150) .        }
manufactory_1,Return the total revenue of companies with headquarters in Tokyo or Taiwan.,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_103 ) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Taiwan') .        }
manufactory_1,Find the name of product that is produced by both companies Creative Labs and Sony.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#name ?T1_name . ?T2 :manufacturers\#name ?T2_name . FILTER(?T2_name = 'Creative Labs') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :products . ?T4 a :manufacturers . ?T3 :products\#ref-manufacturer ?T4 .  ?T3 :products\#name ?T3_name . ?T4 :manufacturers\#name ?T4_name .  FILTER(?T4_name = 'Sony') .             }
manufactory_1,What are the names of products produced by both Creative Labs and Sony?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#name ?T1_name . ?T2 :manufacturers\#name ?T2_name . FILTER(?T2_name = 'Creative Labs') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :products . ?T4 a :manufacturers . ?T3 :products\#ref-manufacturer ?T4 .  ?T3 :products\#name ?T3_name . ?T4 :manufacturers\#name ?T4_name .  FILTER(?T4_name = 'Sony') .             }
manufactory_1,"Find the name, headquarter and founder of the manufacturer that has the highest revenue.",SELECT ?T1_name ?T1_headquarter ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#founder ?T1_founder . ?T1 :manufacturers\#revenue ?T1_revenue .        }   ORDER BY DESC (?T1_revenue) LIMIT 1
manufactory_1,"Find the name, headquarter and revenue of all manufacturers sorted by their revenue in the descending order.",SELECT ?T1_name ?T1_headquarter ?T1_revenue WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#headquarter ?T1_headquarter . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#revenue ?T1_revenue .        }  ORDER BY DESC (?T1_revenue)
manufactory_1,Find the name of companies whose revenue is greater than the average revenue of all companies.,SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#revenue ?T1_revenue . FILTER(?T1_revenue > (?aggregation_T22_revenue_182)) .       {SELECT (avg( ?T22_revenue) as ?aggregation_T22_revenue_182 ) WHERE { ?T22 a :manufacturers . ?T22 :manufacturers\#revenue ?T22_revenue .        }    } }
manufactory_1,Find the name of companies whose revenue is smaller than the revenue of all companies based in Austin.,SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#revenue ?T1_revenue . FILTER(?T1_revenue < (?T22_headquarter)) .       {SELECT (min( ?T22_revenue) as ?aggregation_T22_revenue_43 ) WHERE { ?T22 a :manufacturers . ?T22 :manufacturers\#revenue ?T22_revenue . ?T22 :manufacturers\#headquarter ?T22_headquarter . FILTER(?T22_headquarter = 'Austin') .        }    } }
manufactory_1,Find the total revenue of companies whose revenue is larger than the revenue of some companies based in Austin.,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_121 ) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#revenue ?T1_revenue . FILTER(?T1_revenue > (?T22_headquarter)) .       {SELECT (min( ?T22_revenue) as ?aggregation_T22_revenue_142 ) WHERE { ?T22 a :manufacturers . ?T22 :manufacturers\#revenue ?T22_revenue . ?T22 :manufacturers\#headquarter ?T22_headquarter . FILTER(?T22_headquarter = 'Austin') .        }    } }
manufactory_1,Find the total revenue of companies of each founder.,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_103 ) ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#founder ?T1_founder .        } GROUP BY ?T1_founder
manufactory_1,What is the total revenue of companies started by founder?,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_53 ) ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#founder ?T1_founder .        } GROUP BY ?T1_founder
manufactory_1,Find the name and revenue of the company that earns the highest revenue in each city.,SELECT ?T1_name (max( ?T1_revenue) as ?aggregation_T1_revenue_136 ) ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#headquarter ?T1_headquarter .        } GROUP BY ?T1_headquarter
manufactory_1,Find the total revenue for each manufacturer.,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_63 ) ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#name ?T1_name .        } GROUP BY ?T1_name
manufactory_1,What is the total revenue of each manufacturer?,SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_183 ) ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#revenue ?T1_revenue . ?T1 :manufacturers\#name ?T1_name .        } GROUP BY ?T1_name
manufactory_1,"Find the average prices of all products from each manufacture, and list each company's name.",SELECT (avg( ?T1_price) as ?aggregation_T1_price_185 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#price ?T1_price . ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T2_name
manufactory_1,What are the average prices of products for each manufacturer?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_180 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#price ?T1_price . ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T2_name
manufactory_1,Find the number of different products that are produced by companies at different headquarter cities.,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_95 ) ?T2_headquarter WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#name ?T1_name . ?T2 :manufacturers\#headquarter ?T2_headquarter .        } GROUP BY ?T2_headquarter
manufactory_1,How many different products are produced in each headquarter city?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_18 ) ?T2_headquarter WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#name ?T1_name . ?T2 :manufacturers\#headquarter ?T2_headquarter .        } GROUP BY ?T2_headquarter
manufactory_1,Find number of products which Sony does not make.,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_58 ) WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#name ?T1_name . FILTER(?T1_name not in (?T23_name)) .       {SELECT ?T22_name WHERE { ?T22 a :products . ?T23 a :manufacturers . ?T22 :products\#ref-manufacturer ?T23 .  ?T22 :products\#name ?T22_name . ?T23 :manufacturers\#name ?T23_name . FILTER(?T23_name = 'Sony') .        }    } }
manufactory_1,How many products are not made by Sony?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_121 ) WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#name ?T1_name . FILTER(?T1_name not in (?T23_name)) .       {SELECT ?T22_name WHERE { ?T22 a :products . ?T23 a :manufacturers . ?T22 :products\#ref-manufacturer ?T23 .  ?T22 :products\#name ?T22_name . ?T23 :manufacturers\#name ?T23_name . FILTER(?T23_name = 'Sony') .        }    } }
manufactory_1,Find the name of companies that do not make DVD drive.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :manufacturers . ?T3 a :products . ?T3 :products\#ref-manufacturer ?T2 .  ?T2 :manufacturers\#name ?T2_name . ?T3 :products\#name ?T3_name . FILTER(?T3_name = 'DVD drive') .        }     } }
manufactory_1,What are the names of companies that do not make DVD drives?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :manufacturers . ?T1 :manufacturers\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :manufacturers . ?T3 a :products . ?T3 :products\#ref-manufacturer ?T2 .  ?T2 :manufacturers\#name ?T2_name . ?T3 :products\#name ?T3_name . FILTER(?T3_name = 'DVD drive') .        }     } }
manufactory_1,"Find the number of products for each manufacturer, showing the name of each company.",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T2_name
manufactory_1,How many products are there for each manufacturer?,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T2_name
manufactory_1,Select the names of all the products in the store.,SELECT ?T1_name WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name .        }
manufactory_1,What are the names of all products?,SELECT ?T1_name WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name .        }
manufactory_1,Select the names and the prices of all the products in the store.,SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price .        }
manufactory_1,What are the names and prices of all products in the store?,SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price .        }
manufactory_1,Select the name of the products with a price less than or equal to $200.,SELECT ?T1_name WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . FILTER(?T1_price <= 200) .        }
manufactory_1,What are the names of products with price at most 200?,SELECT ?T1_name WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . FILTER(?T1_price <= 200) .        }
manufactory_1,Find all information of all the products with a price between $60 and $120.,SELECT * WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price . FILTER(?T1_price >= 60 && ?T1_price <= 120) .        }
manufactory_1,Compute the average price of all the products.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_56 ) WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price .        }
manufactory_1,What is the average price across all products?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_33 ) WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price .        }
manufactory_1,Compute the average price of all products with manufacturer code equal to 2.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_51 ) WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price . ?T1 :products\#manufacturer ?T1_manufacturer . FILTER(?T1_manufacturer = 2) .        }
manufactory_1,Compute the number of products with a price larger than or equal to $180.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price . FILTER(?T1_price >= 180) .        }
manufactory_1,How many products have prices of at least 180?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price . FILTER(?T1_price >= 180) .        }
manufactory_1,"Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name  (in ascending order).",SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . ?T1 :products\#price ?T1_price . ?T1 :products\#price ?T1_price . FILTER(?T1_price >= 180) .        }  ORDER BY ASC (?T1_price)
manufactory_1,Select all the data from the products and each product's manufacturer.,SELECT * WHERE { ?T1 a :products .        }
manufactory_1,"Select the average price of each manufacturer's products, showing only the manufacturer's code.",SELECT (avg( ?T1_price) as ?aggregation_T1_price_59 ) ?T1_manufacturer WHERE { ?T1 a :products . ?T1 :products\#price ?T1_price . ?T1 :products\#manufacturer ?T1_manufacturer .        } GROUP BY ?T1_manufacturer
manufactory_1,"Select the average price of each manufacturer's products, showing the manufacturer's name.",SELECT (avg( ?T1_price) as ?aggregation_T1_price_133 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#price ?T1_price . ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T2_name
manufactory_1,Select the names of manufacturer whose products have an average price higher than or equal to $150.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_194 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#price ?T1_price . ?T2 :manufacturers\#name ?T2_name . ?T1 :products\#price ?T1_price .        } GROUP BY ?T2_name   HAVING(avg( ?T1_price)  >= 150)
manufactory_1,Select the name and price of the cheapest product.,SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . ?T1 :products\#price ?T1_price .        }   ORDER BY ASC (?T1_price) LIMIT 1
manufactory_1,What is the name and price of the cheapest product?,SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . ?T1 :products\#price ?T1_price .        }   ORDER BY ASC (?T1_price) LIMIT 1
manufactory_1,Select the name of each manufacturer along with the name and price of its most expensive product.,SELECT ?T1_name (max( ?T1_price) as ?aggregation_T1_price_103 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T1_name ?T2_name
manufactory_1,"For each manufacturer name, what are the names and prices of their most expensive product?",SELECT ?T1_name (max( ?T1_price) as ?aggregation_T1_price_14 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\#ref-manufacturer ?T2 .  ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price . ?T2 :manufacturers\#name ?T2_name .        } GROUP BY ?T1_name ?T2_name
manufactory_1,Select the code of the product that is cheapest in each product category.,SELECT ?T1_code ?T1_name (min( ?T1_price) as ?aggregation_T1_price_175 ) WHERE { ?T1 a :products . ?T1 :products\#code ?T1_code . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price .        } GROUP BY ?T1_name
manufactory_1,What are the codes and names of the cheapest products in each category?,SELECT ?T1_code ?T1_name (min( ?T1_price) as ?aggregation_T1_price_134 ) WHERE { ?T1 a :products . ?T1 :products\#code ?T1_code . ?T1 :products\#name ?T1_name . ?T1 :products\#price ?T1_price .        } GROUP BY ?T1_name
tracking_software_problems,What is the id of the problem log that is created most recently?,SELECT ?T1_problem_log_id WHERE { ?T1 a :problem_log . ?T1 :problem_log\#problem_log_id ?T1_problem_log_id . ?T1 :problem_log\#log_entry_date ?T1_log_entry_date .        }   ORDER BY DESC (?T1_log_entry_date) LIMIT 1
tracking_software_problems,What is the oldest log id and its corresponding problem id?,SELECT ?T1_problem_log_id ?T1_problem_id WHERE { ?T1 a :problem_log . ?T1 :problem_log\#problem_log_id ?T1_problem_log_id . ?T1 :problem_log\#problem_id ?T1_problem_id . ?T1 :problem_log\#log_entry_date ?T1_log_entry_date .        }   ORDER BY ASC (?T1_log_entry_date) LIMIT 1
tracking_software_problems,Find all the ids and dates of the logs for the problem whose id is 10.,SELECT ?T1_problem_log_id ?T1_log_entry_date WHERE { ?T1 a :problem_log . ?T1 :problem_log\#problem_log_id ?T1_problem_log_id . ?T1 :problem_log\#log_entry_date ?T1_log_entry_date . ?T1 :problem_log\#problem_id ?T1_problem_id . FILTER(?T1_problem_id = 10) .        }
tracking_software_problems,List all the log ids and their descriptions from the problem logs.,SELECT ?T1_problem_log_id ?T1_log_entry_description WHERE { ?T1 a :problem_log . ?T1 :problem_log\#problem_log_id ?T1_problem_log_id . ?T1 :problem_log\#log_entry_description ?T1_log_entry_description .        }
tracking_software_problems,What are the log id and entry description of each problem?,SELECT ?T1_problem_log_id ?T1_log_entry_description WHERE { ?T1 a :problem_log . ?T1 :problem_log\#problem_log_id ?T1_problem_log_id . ?T1 :problem_log\#log_entry_description ?T1_log_entry_description .        }
