kg_name,question,query
academic,return me the authors who have papers in VLDB conference in 2002 .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T3 a :publication . ?T14 :writes\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T2 a :conference . ?T3 :publication\#ref-cid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#year ?T3_year . FILTER(?T2_name = 'VLDB' && ?T3_year = 2002) .        }
academic,return me the authors who have papers in VLDB conference before 2002 after 1995 .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T3 :publication\#year ?T3_year . ?T3 a :publication . ?T14 :writes\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T3 :publication\#year ?T3_year . ?T2 a :conference . ?T3 :publication\#ref-cid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T3 :publication\#year ?T3_year . FILTER(?T2_name = 'VLDB' && ?T3_year < 2002 && ?T3_year > 1995) .        }
academic,return me the area of PVLDB .,SELECT ?T1_name WHERE { ?T1 a :domain . ?T13 a :domain_journal . ?T13 :domain_journal\#ref-did ?T1 .  ?T1 :domain\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T2 a :journal . ?T13 :domain_journal\#ref-jid ?T2 .  ?T1 :domain\#name ?T1_name . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the authors who have papers in PVLDB .,SELECT ?T1_name WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T14 a :publication . ?T13 :writes\#ref-pid ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T2 a :journal . ?T14 :publication\#ref-jid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the organization ' H. V. Jagadish ' is in .,SELECT ?T1_name WHERE { ?T1 :organization\#ref-author_id ?T2 . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,"return me the conferences, which have papers by ' H. V. Jagadish ' .",SELECT ?T1_name WHERE { ?T1 a :conference . ?T13 a :publication . ?T13 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T14 a :writes . ?T14 :writes\#ref-pid ?T13 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,"return me the journals, which have papers by ' H. V. Jagadish ' .",SELECT ?T1_name WHERE { ?T1 a :journal . ?T13 a :publication . ?T13 :publication\#ref-jid ?T1 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T14 a :writes . ?T14 :writes\#ref-pid ?T13 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the domain where ' H. V. Jagadish ' is focused .,SELECT ?T1_name WHERE { ?T1 a :domain . ?T13 a :domain_author . ?T13 :domain_author\#ref-did ?T1 .  ?T1 :domain\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :domain_author\#ref-aid ?T2 .  ?T1 :domain\#name ?T1_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the authors of ' Making database systems usable ' .,SELECT ?T1_name WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T2 a :publication . ?T13 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . FILTER(?T2_title = 'Making database systems usable') .        }
academic,"return me the conference, which published ' Making database systems usable ' .",SELECT ?T1_name WHERE { ?T1 a :conference . ?T2 a :publication . ?T2 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . FILTER(?T2_title = 'Making database systems usable') .        }
academic,return me the papers by ' H. V. Jagadish ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the papers on VLDB conference .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the papers on PVLDB .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the papers on PVLDB after 2000 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_year > 2000) .        }
academic,return me the papers on VLDB conference after 2000 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_year > 2000) .        }
academic,return me the papers by ' H. V. Jagadish ' on PVLDB .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'PVLDB') .        }
academic,return me the papers by ' H. V. Jagadish ' on VLDB conference .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T3 a :conference . ?T1 :publication\#ref-cid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'VLDB') .        }
academic,return me the papers by ' H. V. Jagadish ' after 2000 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T1_year > 2000) .        }
academic,return me the papers by ' H. V. Jagadish ' on PVLDB after 2000 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'PVLDB' && ?T1_year > 2000) .        }
academic,return me the papers by ' H. V. Jagadish ' on VLDB conference after 2000 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T3 a :conference . ?T1 :publication\#ref-cid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'VLDB' && ?T1_year > 2000) .        }
academic,return me the area of the VLDB conference .,SELECT ?T1_name WHERE { ?T1 a :domain . ?T13 a :domain_conference . ?T13 :domain_conference\#ref-did ?T1 .  ?T1 :domain\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T2 a :conference . ?T13 :domain_conference\#ref-cid ?T2 .  ?T1 :domain\#name ?T1_name . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the authors who have papers in the VLDB conference .,SELECT ?T1_name WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T14 a :publication . ?T13 :writes\#ref-pid ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T2 a :conference . ?T14 :publication\#ref-cid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me all the keywords in Databases area .,SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T13 a :domain_keyword . ?T13 :domain_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :domain\#name ?T2_name . ?T2 a :domain . ?T13 :domain_keyword\#ref-did ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :domain\#name ?T2_name . FILTER(?T2_name = 'Databases') .        }
academic,"return me all the papers, which contain the keyword ' Natural Language ' .",SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :keyword\#keyword ?T2_keyword . ?T2 a :keyword . ?T13 :publication_keyword\#ref-kid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :keyword\#keyword ?T2_keyword . FILTER(?T2_keyword = 'Natural Language') .        }
academic,return me the keywords of ' Making database systems usable ' .,SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . ?T2 a :publication . ?T13 :publication_keyword\#ref-pid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :publication\#title ?T2_title . FILTER(?T2_title = 'Making database systems usable') .        }
academic,return me the keywords related to ' H. V. Jagadish ' .,SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T14 a :publication . ?T13 :publication_keyword\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T15 a :writes . ?T15 :writes\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the keywords in VLDB conference .,SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T14 a :publication . ?T13 :publication_keyword\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T2 a :conference . ?T14 :publication\#ref-cid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the keywords in PVLDB .,SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T13 a :publication_keyword . ?T13 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T14 a :publication . ?T13 :publication_keyword\#ref-pid ?T14 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T2 a :journal . ?T14 :publication\#ref-jid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the keywords in the papers of ' University of Michigan ' .,SELECT ?T1_keyword WHERE { ?T2 :organization\#ref-keyword_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me the papers of ' H. V. Jagadish ' containing keyword ' User Study ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T15 a :domain_author . ?T15 :domain_author\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T16 a :domain . ?T15 :domain_author\#ref-did ?T16 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T17 a :domain_keyword . ?T17 :domain_keyword\#ref-did ?T16 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T17 :domain_keyword\#ref-kid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_keyword = 'User Study') .        }
academic,return me the papers in PVLDB containing keyword ' Keyword search ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T14 :publication_keyword\#ref-kid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T2_name = 'PVLDB' && ?T3_keyword = 'Keyword search') .        }
academic,return me the papers in VLDB conference containing keyword ' Information Retrieval ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . ?T3 a :keyword . ?T14 :publication_keyword\#ref-kid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :keyword\#keyword ?T3_keyword . FILTER(?T2_name = 'VLDB' && ?T3_keyword = 'Information Retrieval') .        }
academic,return me the authors who have papers containing keyword ' Relational Database ' .,SELECT ?T1_name WHERE { ?T1 a :author . ?T13 a :domain_author . ?T13 :domain_author\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T14 a :domain . ?T13 :domain_author\#ref-did ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T15 a :domain_keyword . ?T15 :domain_keyword\#ref-did ?T14 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T2 a :keyword . ?T15 :domain_keyword\#ref-kid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . FILTER(?T2_keyword = 'Relational Database') .        }
academic,return me all the organizations in Databases area .,SELECT ?T1_name WHERE { ?T1 :organization\#ref-domain_id ?T2 . FILTER(?T2_name = 'Databases') .        }
academic,return me all the organizations in Databases area located in ' North America ' .,SELECT ?T1_name WHERE { ?T1 :organization\#ref-domain_id ?T2 . FILTER(?T2_name = 'Databases' && ?T1_continent = 'North America') .        }
academic,return me all the researchers in ' University of Michigan ' .,SELECT ?T1_name WHERE { ?T2 :organization\#ref-author_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me all the researchers in Databases area in ' University of Michigan ' .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :domain_author . ?T14 :domain_author\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T2 a :domain . ?T14 :domain_author\#ref-did ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'Databases' && ?T3_name = 'University of Michigan') .        }
academic,return me all the papers in ' University of Michigan ' .,SELECT ?T1_title WHERE { ?T2 :organization\#ref-publication_id ?T1 . FILTER(?T2_name = 'University of Michigan') .        }
academic,return me all the papers after 2000 in ' University of Michigan ' .,SELECT ?T1_title WHERE { ?T2 :organization\#ref-publication_id ?T1 . FILTER(?T2_name = 'University of Michigan' && ?T1_year > 2000) .        }
academic,return me all the papers in VLDB conference in ' University of Michigan ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'VLDB' && ?T3_name = 'University of Michigan') .        }
academic,return me all the papers in PVLDB in ' University of Michigan ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :organization\#name ?T3_name . FILTER(?T2_name = 'PVLDB' && ?T3_name = 'University of Michigan') .        }
academic,return me all the papers in PVLDB after 2000 in ' University of Michigan ' .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T3_name = 'University of Michigan' && ?T1_year > 2000) .        }
academic,return me the paper in Databases area with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :domain_publication . ?T13 :domain_publication\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :domain\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 a :domain . ?T13 :domain_publication\#ref-did ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :domain\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'Databases' && ?T1_citation_num > 200) .        }
academic,return me the paper in PVLDB with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'PVLDB' && ?T1_citation_num > 200) .        }
academic,return me the paper in VLDB conference with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'VLDB' && ?T1_citation_num > 200) .        }
academic,return me the paper by ' H. V. Jagadish ' with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'H. V. Jagadish' && ?T1_citation_num > 200) .        }
academic,return me the papers by ' H. V. Jagadish ' on PVLDB with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'PVLDB' && ?T1_citation_num > 200) .        }
academic,return me the papers by ' H. V. Jagadish ' on VLDB conference with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T3 a :conference . ?T1 :publication\#ref-cid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'VLDB' && ?T1_citation_num > 200) .        }
academic,return me the paper after 2000 with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T1 :publication\#year ?T1_year . FILTER(?T1_citation_num > 200 && ?T1_year > 2000) .        }
academic,return me the paper after 2000 in PVLDB with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_citation_num > 200 && ?T1_year > 2000) .        }
academic,return me the paper after 2000 in VLDB conference with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T1 :publication\#citation_num ?T1_citation_num . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_citation_num > 200 && ?T1_year > 2000) .        }
academic,return me the number of conferences which have papers by ' H. V. Jagadish ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_172 ) WHERE { ?T1 a :conference . ?T13 a :publication . ?T13 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T14 a :writes . ?T14 :writes\#ref-pid ?T13 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the number of journals which have papers by ' H. V. Jagadish ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_141 ) WHERE { ?T1 a :journal . ?T13 a :publication . ?T13 :publication\#ref-jid ?T1 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T14 a :writes . ?T14 :writes\#ref-pid ?T13 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the number of papers written by ' H. V. Jagadish ' in each year .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_36 ) ?T1_year WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        } GROUP BY ?T1_year
academic,return me the number of authors of ' Making database systems usable ' .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_188 ) WHERE { ?T1 a :author . ?T13 a :writes . ?T13 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T2 a :publication . ?T13 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . FILTER(?T2_title = 'Making database systems usable') .        }
academic,return me the number of citations of ' Making database systems usable ' in each year .,SELECT ?T1_year (sum( ?T1_citation_num) as ?aggregation_T1_citation_num_91 ) WHERE { ?T1 a :publication . ?T1 :publication\#year ?T1_year . ?T1 :publication\#citation_num ?T1_citation_num . ?T1 :publication\#title ?T1_title . FILTER(?T1_title = 'Making database systems usable') .        } GROUP BY ?T1_year
academic,return me the number of citations of ' Making database systems usable ' before 2010 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_197 ) WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . FILTER(?T1_title = 'Making database systems usable' && ?T1_year < 2010) .        }
academic,return me the number of papers by ' H. V. Jagadish ' .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_181 ) WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }
academic,return me the number of papers on VLDB conference .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_1 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }
academic,return me the number of papers on PVLDB .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_128 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }
academic,return me the number of papers after 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_137 ) WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . FILTER(?T1_year > 2000) .        }
academic,return me the number of papers on PVLDB after 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_178 ) WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :journal\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_year > 2000) .        }
academic,return me the number of papers on VLDB conference after 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_40 ) WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :conference\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_year > 2000) .        }
academic,return me the number of papers by ' H. V. Jagadish ' on PVLDB .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_47 ) WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'PVLDB') .        }
academic,return me the number of papers by ' H. V. Jagadish ' on VLDB conference .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_177 ) WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . ?T3 a :conference . ?T1 :publication\#ref-cid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :conference\#name ?T3_name . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'VLDB') .        }
academic,return me the number of papers by ' H. V. Jagadish ' after 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_154 ) WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T1_year > 2000) .        }
academic,return me the number of papers by ' H. V. Jagadish ' on PVLDB after 2000 .,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_160 ) WHERE { ?T1 a :publication . ?T14 a :writes . ?T14 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . ?T3 a :journal . ?T1 :publication\#ref-jid ?T3 .  ?T1 :publication\#title ?T1_title . ?T2 :author\#name ?T2_name . ?T3 :journal\#name ?T3_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'H. V. Jagadish' && ?T3_name = 'PVLDB' && ?T1_year > 2000) .        }
