kg_name,question,query
geo,how many states border colorado and border new mexico,SELECT (count( ?T1_border) as ?aggregation_T1_border_104 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_border in (?T22_state_name) && ?T1_state_name = 'colorado') .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'new mexico') .        }    } }
geo,how many major cities are in states bordering nebraska,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_158 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name in (?T22_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'nebraska') .        }    } }
geo,what is the total population of the states that border texas,SELECT (sum( ?T1_population) as ?aggregation_T1_population_91 ) WHERE { ?T1 a :state . ?T2 a :border_info . ?T2 :border_info\#ref-border ?T1 .  ?T1 :state\#population ?T1_population . ?T2 :border_info\#state_name ?T2_state_name . FILTER(?T2_state_name = 'texas') .        }
geo,what are the major lakes in united states,SELECT ?T1_lake_name WHERE { ?T1 a :lake . ?T1 :lake\#lake_name ?T1_lake_name . ?T1 :lake\#area ?T1_area . FILTER(?T1_area > 750) .        }
geo,name all the lakes of us,SELECT ?T1_lake_name WHERE { ?T1 a :lake . ?T1 :lake\#lake_name ?T1_lake_name .        }
geo,how many major rivers cross ohio,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_36 ) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length > 750 && ?T1_traverse = 'ohio') .        }
geo,what state has the shortest river,SELECT DISTINCT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_24)) .       {SELECT DISTINCT (min(DISTINCT ?T22_length) as ?aggregation_T22_length_24 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,how many states are next to major rivers,SELECT DISTINCT (count(DISTINCT ?T1_traverse) as ?aggregation_T1_traverse_127 ) WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length > 750) .        }
geo,what is the height of mount mckinley,SELECT ?T1_mountain_altitude WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . ?T1 :mountain\#mountain_name ?T1_mountain_name . FILTER(?T1_mountain_name = 'mckinley') .        }
geo,what states does the shortest river run through,SELECT ?T1_traverse WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_131)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_131 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the highest point in the state with the smallest population,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T2 a :state . ?T1 :highlow\#ref-state_name ?T2 .  ?T1 :highlow\#highest_point ?T1_highest_point . ?T2 :state\#state_name ?T2_state_name . FILTER(?T2_state_name in (?aggregation_T44_population_95)) .       {SELECT ?T23_state_name WHERE { ?T23 a :state . ?T23 :state\#state_name ?T23_state_name . ?T23 :state\#population ?T23_population . FILTER(?T23_population = (?aggregation_T44_population_95)) .       {SELECT (min( ?T44_population) as ?aggregation_T44_population_95 ) WHERE { ?T44 a :state . ?T44 :state\#population ?T44_population .        }    } }    } }
geo,which rivers run through the state with the lowest elevation in the usa,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?aggregation_T43_lowest_elevation_178)) .       {SELECT ?T22_state_name WHERE { ?T22 a :highlow . ?T22 :highlow\#state_name ?T22_state_name . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation . FILTER(?T22_lowest_elevation = (?aggregation_T43_lowest_elevation_178)) .       {SELECT (min( ?T43_lowest_elevation) as ?aggregation_T43_lowest_elevation_178 ) WHERE { ?T43 a :highlow . ?T43 :highlow\#lowest_elevation ?T43_lowest_elevation .        }    } }    } }
geo,what rivers run through the state with the lowest point in the usa,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?aggregation_T43_lowest_elevation_186)) .       {SELECT ?T22_state_name WHERE { ?T22 a :highlow . ?T22 :highlow\#state_name ?T22_state_name . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation . FILTER(?T22_lowest_elevation = (?aggregation_T43_lowest_elevation_186)) .       {SELECT (min( ?T43_lowest_elevation) as ?aggregation_T43_lowest_elevation_186 ) WHERE { ?T43 a :highlow . ?T43 :highlow\#lowest_elevation ?T43_lowest_elevation .        }    } }    } }
geo,what mountains are in alaska,SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_name ?T1_mountain_name . ?T1 :mountain\#state_name ?T1_state_name . FILTER(?T1_state_name = 'alaska') .        }
geo,how many states have major rivers,SELECT (count( ?T1_traverse) as ?aggregation_T1_traverse_125 ) WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length > 750) .        }
geo,what is the smallest state through which the longest river runs,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_area = (?aggregation_T64_length_199) && ?T1_state_name in (?aggregation_T43_length_178)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_6 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_length_199)) .       {SELECT ?T43_traverse WHERE { ?T43 a :river . ?T43 :river\#traverse ?T43_traverse . ?T43 :river\#length ?T43_length . FILTER(?T43_length = (?aggregation_T64_length_199)) .       {SELECT (max( ?T64_length) as ?aggregation_T64_length_199 ) WHERE { ?T64 a :river . ?T64 :river\#length ?T64_length .        }    } }    } }    } {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#length ?T22_length . FILTER(?T22_length = (?aggregation_T43_length_178)) .       {SELECT (max( ?T43_length) as ?aggregation_T43_length_178 ) WHERE { ?T43 a :river . ?T43 :river\#length ?T43_length .        }    } }    } }
geo,what is the largest state traversed by the rio grande river,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_area = (?T43_river_name) && ?T1_state_name in (?T22_river_name)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_136 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_river_name)) .       {SELECT ?T43_traverse WHERE { ?T43 a :river . ?T43 :river\#traverse ?T43_traverse . ?T43 :river\#river_name ?T43_river_name . FILTER(?T43_river_name = 'rio grande') .        }    } }    } {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#river_name ?T22_river_name . FILTER(?T22_river_name = 'rio grande') .        }    } }
geo,what is the capital of the largest state,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_23)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_23 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the capital city of the largest state in the us,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_187)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_187 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,how many cities are in texas,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_133 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
geo,how many cities does texas have,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_68 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
geo,what is the area of the states,SELECT ?T1_area WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,how many states in the us does the shortest river run through,SELECT DISTINCT (count(DISTINCT ?T1_traverse) as ?aggregation_T1_traverse_194 ) WHERE { ?T1 a :river . ?T1 :river\#traverse ?T1_traverse . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_13)) .       {SELECT DISTINCT (min(DISTINCT ?T22_length) as ?aggregation_T22_length_13 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what rivers flow through states that border the state with the largest population,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?aggregation_T64_population_8)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_population_8)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#population ?T43_population . FILTER(?T43_population = (?aggregation_T64_population_8)) .       {SELECT (max( ?T64_population) as ?aggregation_T64_population_8 ) WHERE { ?T64 a :state . ?T64 :state\#population ?T64_population .        }    } }    } }    } }
geo,what are the major cities in the largest state,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name = (?aggregation_T43_area_138)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_138)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_138 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the area of the smallest state,SELECT ?T1_area WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_164)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_164 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,which states border the longest river in the usa,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_length_122)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#length ?T22_length . FILTER(?T22_length = (?aggregation_T43_length_122)) .       {SELECT (max( ?T43_length) as ?aggregation_T43_length_122 ) WHERE { ?T43 a :river . ?T43 :river\#length ?T43_length .        }    } }    } }
geo,what is the population density of the state with the smallest population,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_165)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_165 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the population of the capital of the smallest state,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = (?aggregation_T43_area_57)) .       {SELECT ?T22_capital WHERE { ?T22 a :state . ?T22 :state\#capital ?T22_capital . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_57)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_57 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the lowest point of the state with the largest area,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T2 a :state . ?T1 :highlow\#ref-state_name ?T2 .  ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T2 :state\#state_name ?T2_state_name . FILTER(?T2_state_name in (?aggregation_T44_area_108)) .       {SELECT ?T23_state_name WHERE { ?T23 a :state . ?T23 :state\#state_name ?T23_state_name . ?T23 :state\#area ?T23_area . FILTER(?T23_area = (?aggregation_T44_area_108)) .       {SELECT (max( ?T44_area) as ?aggregation_T44_area_108 ) WHERE { ?T44 a :state . ?T44 :state\#area ?T44_area .        }    } }    } }
geo,what states border states that border the state with the largest population,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_population_134)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#population ?T22_population . FILTER(?T22_population = (?aggregation_T43_population_134)) .       {SELECT (max( ?T43_population) as ?aggregation_T43_population_134 ) WHERE { ?T43 a :state . ?T43 :state\#population ?T43_population .        }    } }    } }
geo,what is the size of the largest state in the usa,SELECT (max( ?T1_area) as ?aggregation_T1_area_152 ) WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,what is the area of the largest state,SELECT (max( ?T1_area) as ?aggregation_T1_area_163 ) WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,which capitals are not major cities,SELECT ?T1_capital WHERE { ?T1 a :state . ?T2 a :city . ?T2 :city\#ref-state_name ?T1 .  ?T1 :state\#capital ?T1_capital . ?T2 :city\#population ?T2_population . FILTER(?T2_population <= 150000) .        }
geo,give me the cities in usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name .        }
geo,what is the highest point of the state with the largest area,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T2 a :state . ?T1 :highlow\#ref-state_name ?T2 .  ?T1 :highlow\#highest_point ?T1_highest_point . ?T2 :state\#state_name ?T2_state_name . FILTER(?T2_state_name in (?aggregation_T44_area_133)) .       {SELECT ?T23_state_name WHERE { ?T23 a :state . ?T23 :state\#state_name ?T23_state_name . ?T23 :state\#area ?T23_area . FILTER(?T23_area = (?aggregation_T44_area_133)) .       {SELECT (max( ?T44_area) as ?aggregation_T44_area_133 ) WHERE { ?T44 a :state . ?T44 :state\#area ?T44_area .        }    } }    } }
geo,where is massachusetts,SELECT ?T1_country_name WHERE { ?T1 a :state . ?T1 :state\#country_name ?T1_country_name . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'massachusetts') .        }
geo,what state has the largest urban population,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population .        } GROUP BY ?T1_state_name  ORDER BY DESC ((sum( ?T1_population) as ?aggregation_T1_population_134 )) LIMIT 1
geo,what are the major rivers in the us,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name .        }
geo,how many cities named austin are there in the usa,SELECT (count( ?T1_city_name) as ?aggregation_T1_city_name_6 ) WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#city_name ?T1_city_name . FILTER(?T1_city_name = 'austin') .        }
geo,how many people live in the smallest state bordering wyoming,SELECT ?T1_population WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#population ?T1_population . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_population = (?T43_state_name) && ?T1_state_name in (?T22_state_name)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_137 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'wyoming') .        }    } }    } {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'wyoming') .        }    } }
geo,what is the length of the colorado river in texas,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_river_name = 'colorado' && ?T1_traverse = 'texas') .        }
geo,what is the population density in the state with capital austin,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#capital ?T1_capital . FILTER(?T1_capital = 'austin') .        }
geo,how long is the shortest river in the usa,SELECT ?T1_length WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length . ?T1 :river\#length ?T1_length . FILTER(?T1_length = (?aggregation_T22_length_64)) .       {SELECT (min( ?T22_length) as ?aggregation_T22_length_64 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length .        }    } }
geo,what is the elevation of death valley,SELECT ?T1_lowest_elevation WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . ?T1 :highlow\#lowest_point ?T1_lowest_point . FILTER(?T1_lowest_point = 'death valley') .        }
geo,what is the average population of the us by state,SELECT (avg( ?T1_population) as ?aggregation_T1_population_126 ) WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population .        }
geo,what rivers flow through the largest state,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?aggregation_T43_area_116)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_116)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_116 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what states border states that border states that border states that border texas,SELECT ?T1_border WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = 'texas') .        }
geo,how many states border on the state whose capital is boston,SELECT (count( ?T1_border) as ?aggregation_T1_border_116 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = (?T22_capital)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#capital ?T22_capital . FILTER(?T22_capital = 'boston') .        }    } }
geo,what are the major cities in the states through which the major river in virginia runs,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population > 150000 && ?T1_state_name in (?T43_traverse)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#river_name ?T22_river_name . FILTER(?T22_river_name in (?T43_traverse)) .       {SELECT ?T43_river_name WHERE { ?T43 a :river . ?T43 :river\#river_name ?T43_river_name . ?T43 :river\#length ?T43_length . ?T43 :river\#traverse ?T43_traverse . FILTER(?T43_length > 750 && ?T43_traverse = 'virginia') .        }    } }    } }
geo,how many states border the largest state,SELECT (count( ?T1_border) as ?aggregation_T1_border_51 ) WHERE { ?T1 a :border_info . ?T1 :border_info\#border ?T1_border . ?T1 :border_info\#state_name ?T1_state_name . FILTER(?T1_state_name = (?aggregation_T43_area_173)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_173)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_173 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,which state is the largest city in montana in,SELECT ?T1_state_name WHERE { ?T1 a :city . ?T1 :city\#state_name ?T1_state_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?T22_state_name) && ?T1_state_name = 'montana') .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_76 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name = 'montana') .        }    } }
geo,what is capital of the state with the lowest point,SELECT ?T1_capital WHERE { ?T1 a :state . ?T2 a :highlow . ?T2 :highlow\#ref-state_name ?T1 .  ?T1 :state\#capital ?T1_capital . ?T2 :highlow\#lowest_elevation ?T2_lowest_elevation . FILTER(?T2_lowest_elevation = (?aggregation_T23_lowest_elevation_183)) .       {SELECT (min( ?T23_lowest_elevation) as ?aggregation_T23_lowest_elevation_183 ) WHERE { ?T23 a :highlow . ?T23 :highlow\#lowest_elevation ?T23_lowest_elevation .        }    } }
geo,what is the biggest american city in a state with a river,SELECT DISTINCT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_110)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_110 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,how many rivers are in the state with the largest population,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_135 ) WHERE { ?T1 a :river . ?T2 a :state . ?T1 :river\#ref-traverse ?T2 .  ?T1 :river\#river_name ?T1_river_name . ?T2 :state\#state_name ?T2_state_name . FILTER(?T2_state_name = (?aggregation_T44_population_164)) .       {SELECT ?T23_state_name WHERE { ?T23 a :state . ?T23 :state\#state_name ?T23_state_name . ?T23 :state\#population ?T23_population . FILTER(?T23_population = (?aggregation_T44_population_164)) .       {SELECT (max( ?T44_population) as ?aggregation_T44_population_164 ) WHERE { ?T44 a :state . ?T44 :state\#population ?T44_population .        }    } }    } }
geo,what is the largest state that borders the state with the lowest point in the usa,SELECT ?T1_state_name WHERE { ?T1 a :border_info . ?T2 a :state . ?T1 :border_info\#ref-border ?T2 .  ?T1 :border_info\#state_name ?T1_state_name . ?T2 :state\#area ?T2_area . ?T3 :highlow\#lowest_elevation ?T3_lowest_elevation . ?T3 a :highlow . ?T3 :highlow\#ref-state_name ?T2 .  ?T1 :border_info\#state_name ?T1_state_name . ?T2 :state\#area ?T2_area . ?T3 :highlow\#lowest_elevation ?T3_lowest_elevation . FILTER(?T3_lowest_elevation = (?aggregation_T24_lowest_elevation_158)) .       {SELECT (min( ?T24_lowest_elevation) as ?aggregation_T24_lowest_elevation_158 ) WHERE { ?T24 a :highlow . ?T24 :highlow\#lowest_elevation ?T24_lowest_elevation .        }    } }   ORDER BY DESC (?T2_area) LIMIT 1
geo,what is the capital of the state with the highest point,SELECT ?T1_capital WHERE { ?T1 a :state . ?T2 a :highlow . ?T2 :highlow\#ref-state_name ?T1 .  ?T1 :state\#capital ?T1_capital . ?T2 :highlow\#highest_elevation ?T2_highest_elevation . FILTER(?T2_highest_elevation = (?aggregation_T23_highest_elevation_125)) .       {SELECT (max( ?T23_highest_elevation) as ?aggregation_T23_highest_elevation_125 ) WHERE { ?T23 a :highlow . ?T23 :highlow\#highest_elevation ?T23_highest_elevation .        }    } }
geo,what is the capital of the state with the highest elevation,SELECT ?T1_capital WHERE { ?T1 a :state . ?T2 a :highlow . ?T2 :highlow\#ref-state_name ?T1 .  ?T1 :state\#capital ?T1_capital . ?T2 :highlow\#highest_elevation ?T2_highest_elevation . FILTER(?T2_highest_elevation = (?aggregation_T23_highest_elevation_56)) .       {SELECT (max( ?T23_highest_elevation) as ?aggregation_T23_highest_elevation_56 ) WHERE { ?T23 a :highlow . ?T23 :highlow\#highest_elevation ?T23_highest_elevation .        }    } }
geo,what is the highest point in the smallest state,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T2 a :state . ?T1 :highlow\#ref-state_name ?T2 .  ?T1 :highlow\#highest_point ?T1_highest_point . ?T2 :state\#area ?T2_area . FILTER(?T2_area = (?aggregation_T23_area_19)) .       {SELECT (min( ?T23_area) as ?aggregation_T23_area_19 ) WHERE { ?T23 a :state . ?T23 :state\#area ?T23_area .        }    } }
geo,how many rivers are in the state with the highest point.,SELECT (count( ?T1_river_name) as ?aggregation_T1_river_name_159 ) WHERE { ?T1 a :river . ?T13 a :state . ?T1 :river\#ref-traverse ?T13 .  ?T1 :river\#river_name ?T1_river_name . ?T2 :highlow\#highest_elevation ?T2_highest_elevation . ?T2 a :highlow . ?T2 :highlow\#ref-state_name ?T13 .  ?T1 :river\#river_name ?T1_river_name . ?T2 :highlow\#highest_elevation ?T2_highest_elevation . FILTER(?T2_highest_elevation = (?aggregation_T23_highest_elevation_183)) .       {SELECT (max( ?T23_highest_elevation) as ?aggregation_T23_highest_elevation_183 ) WHERE { ?T23 a :highlow . ?T23 :highlow\#highest_elevation ?T23_highest_elevation .        }    } }
geo,how high is the highest point in the largest state,SELECT ?T1_highest_elevation WHERE { ?T1 a :highlow . ?T2 a :state . ?T1 :highlow\#ref-state_name ?T2 .  ?T1 :highlow\#highest_elevation ?T1_highest_elevation . ?T2 :state\#area ?T2_area . FILTER(?T2_area = (?aggregation_T23_area_4)) .       {SELECT (max( ?T23_area) as ?aggregation_T23_area_4 ) WHERE { ?T23 a :state . ?T23 :state\#area ?T23_area .        }    } }
geo,what is the longest river in the state with the highest point,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T13 a :state . ?T1 :river\#ref-traverse ?T13 .  ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T2 :highlow\#highest_elevation ?T2_highest_elevation . ?T2 a :highlow . ?T2 :highlow\#ref-state_name ?T13 .  ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T2 :highlow\#highest_elevation ?T2_highest_elevation . FILTER(?T2_highest_elevation = (?aggregation_T23_highest_elevation_79)) .       {SELECT (max( ?T23_highest_elevation) as ?aggregation_T23_highest_elevation_79 ) WHERE { ?T23 a :highlow . ?T23 :highlow\#highest_elevation ?T23_highest_elevation .        }    } }   ORDER BY DESC (?T1_length) LIMIT 1
scholar,papers that are coauthored by Peter Mertens and Dina Barbian,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,What papers have Peter Mertens and Dina Barbian written ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,what paper did Peter Mertens and Dina Barbian write together ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,Has Peter Mertens and Dina Barbian written a paper together ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,When did Peter Mertens and Dina Barbian collaborate ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,what are the collaborations of Peter Mertens and Dina Barbian ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,Have Peter Mertens and Dina Barbian written a paper together ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,Does Peter Mertens ever collaborated with Dina Barbian ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,Which papers have Peter Mertens and Dina Barbian as co-authors ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,What papers have been written by Peter Mertens and Dina Barbian ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
scholar,What papers have been written by both Peter Mertens and Dina Barbian ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\#ref-aid ?T2 .  ?T1 :writes\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Peter Mertens' && ?T2_authorname = 'Dina Barbian') .        }
