kg_name,question,query
tracking_share_transactions,Show the transaction type descriptions and dates if the share count is smaller than 10.,SELECT ?T1_transaction_type_description ?T2_date_of_transaction WHERE { ?T1 a :ref_transaction_types . ?T2 a :transactions . ?T2 :transactions\#ref-transaction_type_code ?T1 .  ?T1 :ref_transaction_types\#transaction_type_description ?T1_transaction_type_description . ?T2 :transactions\#date_of_transaction ?T2_date_of_transaction . ?T2 :transactions\#share_count ?T2_share_count . FILTER(?T2_share_count < 10) .        }
tracking_share_transactions,Show details of all investors if they make any transaction with share count greater than 100.,SELECT ?T1_investor_details WHERE { ?T1 a :investors . ?T2 a :transactions . ?T2 :transactions\#ref-investor_id ?T1 .  ?T1 :investors\#investor_details ?T1_investor_details . ?T2 :transactions\#share_count ?T2_share_count . FILTER(?T2_share_count > 100) .        }
tracking_share_transactions,How many distinct transaction types are used in the transactions?,SELECT DISTINCT (count(DISTINCT ?T1_transaction_type_code) as ?aggregation_T1_transaction_type_code_155 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code .        }
tracking_share_transactions,Return the lot details and investor ids.,SELECT ?T1_lot_details ?T1_investor_id WHERE { ?T1 a :lots . ?T1 :lots\#lot_details ?T1_lot_details . ?T1 :lots\#investor_id ?T1_investor_id .        }
tracking_share_transactions,Return the lot details of lots that belong to investors with details 'l'?,SELECT ?T1_lot_details WHERE { ?T1 a :lots . ?T2 a :investors . ?T1 :lots\#ref-investor_id ?T2 .  ?T1 :lots\#lot_details ?T1_lot_details . ?T2 :investors\#investor_details ?T2_investor_details . FILTER(?T2_investor_details = 'l') .        }
tracking_share_transactions,What are the lot details of lots associated with transactions whose share count is bigger than 100 and whose type code is 'PUR'?,SELECT ?T1_lot_details WHERE { ?T1 a :lots . ?T13 a :transactions_lots . ?T13 :transactions_lots\#ref-lot_id ?T1 .  ?T1 :lots\#lot_details ?T1_lot_details . ?T2 :transactions\#share_count ?T2_share_count . ?T2 :transactions\#transaction_type_code ?T2_transaction_type_code . ?T2 a :transactions . ?T13 :transactions_lots\#ref-transaction_id ?T2 .  ?T1 :lots\#lot_details ?T1_lot_details . ?T2 :transactions\#share_count ?T2_share_count . ?T2 :transactions\#transaction_type_code ?T2_transaction_type_code . FILTER(?T2_share_count > 100 && ?T2_transaction_type_code = 'PUR') .        }
tracking_share_transactions,Show the average transaction amount for different transaction types.,SELECT ?T1_transaction_type_code (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_189 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction .        } GROUP BY ?T1_transaction_type_code
tracking_share_transactions,Show the maximum and minimum share count of different transaction types.,SELECT ?T1_transaction_type_code (max( ?T1_share_count) as ?aggregation_T1_share_count_187 ) (min( ?T1_share_count) as ?aggregation_T1_share_count_3 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . ?T1 :transactions\#share_count ?T1_share_count . ?T1 :transactions\#share_count ?T1_share_count .        } GROUP BY ?T1_transaction_type_code
tracking_share_transactions,Show the average share count of transactions for different investors.,SELECT ?T1_investor_id (avg( ?T1_share_count) as ?aggregation_T1_share_count_17 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#investor_id ?T1_investor_id . ?T1 :transactions\#share_count ?T1_share_count .        } GROUP BY ?T1_investor_id
tracking_share_transactions,"Show the average share count of transactions each each investor, ordered by average share count.",SELECT ?T1_investor_id (avg( ?T1_share_count) as ?aggregation_T1_share_count_155 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#investor_id ?T1_investor_id . ?T1 :transactions\#share_count ?T1_share_count . ?T1 :transactions\#share_count ?T1_share_count .        } GROUP BY ?T1_investor_id ORDER BY ASC ((avg( ?T1_share_count) as ?aggregation_T1_share_count_4 ))
tracking_share_transactions,Show the average amount of transactions for different investors.,SELECT ?T1_investor_id (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_23 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#investor_id ?T1_investor_id . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction .        } GROUP BY ?T1_investor_id
tracking_share_transactions,Show the average amount of transactions for different lots.,SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_184 ) WHERE { ?T1 a :transactions_lots . ?T2 a :transactions . ?T1 :transactions_lots\#ref-transaction_id ?T2 .  ?T1 :transactions_lots\#lot_id ?T1_lot_id . ?T2 :transactions\#amount_of_transaction ?T2_amount_of_transaction .        } GROUP BY ?T1_lot_id
tracking_share_transactions,"Show the average amount of transactions for different lots, ordered by average amount of transactions.",SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_160 ) WHERE { ?T1 a :transactions_lots . ?T2 a :transactions . ?T1 :transactions_lots\#ref-transaction_id ?T2 .  ?T1 :transactions_lots\#lot_id ?T1_lot_id . ?T2 :transactions\#amount_of_transaction ?T2_amount_of_transaction . ?T2 :transactions\#amount_of_transaction ?T2_amount_of_transaction .        } GROUP BY ?T1_lot_id ORDER BY ASC ((avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_200 ))
tracking_share_transactions,Show the number of transactions with transaction type code 'SALE' for different investors if it is larger than 0.,SELECT ?T1_investor_id (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :transactions\#investor_id ?T1_investor_id . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') .        } GROUP BY ?T1_investor_id
tracking_share_transactions,Show the number of transactions for different investors.,SELECT ?T1_investor_id (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :transactions\#investor_id ?T1_investor_id .        } GROUP BY ?T1_investor_id
tracking_share_transactions,Show the transaction type code that occurs the fewest times.,SELECT ?T1_transaction_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code .        } GROUP BY ?T1_transaction_type_code  ORDER BY ASC (?aggregation_all) LIMIT 1
tracking_share_transactions,Show the transaction type code that occurs the most frequently.,SELECT ?T1_transaction_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code .        } GROUP BY ?T1_transaction_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_share_transactions,Show the description of the transaction type that occurs most frequently.,SELECT ?T1_transaction_type_description (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_transaction_types . ?T2 a :transactions . ?T2 :transactions\#ref-transaction_type_code ?T1 .  ?T1 :ref_transaction_types\#transaction_type_description ?T1_transaction_type_description .        } GROUP BY ?T1_transaction_type_description  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_share_transactions,Show the id and details of the investor that has the largest number of transactions.,SELECT ?T1_investor_id (count( *) as ?aggregation_all) ?T2_investor_details WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :transactions\#ref-investor_id ?T2 .  ?T1 :transactions\#investor_id ?T1_investor_id . ?T2 :investors\#investor_details ?T2_investor_details .        } GROUP BY ?T1_investor_id ?T2_investor_details  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_share_transactions,Show the ids of the investors who have at least two transactions.,SELECT ?T1_investor_id WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :transactions\#ref-investor_id ?T2 .  ?T1 :transactions\#investor_id ?T1_investor_id .        } GROUP BY ?T1_investor_id   HAVING(count( *)  >= 2)
tracking_share_transactions,Show the ids and details of the investors who have at least two transactions with type code 'SALE'.,SELECT ?T1_investor_id ?T2_investor_details WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :transactions\#ref-investor_id ?T2 .  ?T1 :transactions\#investor_id ?T1_investor_id . ?T2 :investors\#investor_details ?T2_investor_details . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') .        } GROUP BY ?T1_investor_id ?T2_investor_details   HAVING(count( *)  >= 2)
tracking_share_transactions,What are the details of all sales and purchases?,SELECT distinct?col1 WHERE { { SELECT (?T1_sales_details as ?col1) WHERE { ?T1 a :sales . ?T1 :sales\#sales_details ?T1_sales_details .   }} UNION {SELECT (?T1_purchase_details as ?col1) WHERE { ?T1 a :purchases . ?T1 :purchases\#purchase_details ?T1_purchase_details .        }      } }
tracking_share_transactions,What are the details of the lots which are not used in any transactions?,SELECT distinct?col1 WHERE { { SELECT (?T1_lot_details as ?col1) WHERE { ?T1 a :lots . ?T1 :lots\#lot_details ?T1_lot_details .   }}  MINUS {SELECT (?T2_lot_details as ?col1) WHERE { ?T2 a :lots . ?T2 :lots\#lot_details ?T2_lot_details .        }     } }
cre_theme_park,How many available hotels are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :hotels .        }
cre_theme_park,What are the price ranges of hotels?,SELECT ?T1_price_range WHERE { ?T1 a :hotels . ?T1 :hotels\#price_range ?T1_price_range .        }
cre_theme_park,Show all distinct location names.,SELECT DISTINCT ?T1_location_name WHERE { ?T1 a :locations . ?T1 :locations\#location_name ?T1_location_name .        }
cre_theme_park,What are the distinct location names?,SELECT DISTINCT ?T1_location_name WHERE { ?T1 a :locations . ?T1 :locations\#location_name ?T1_location_name .        }
cre_theme_park,Show the names and details of all the staff members.,SELECT ?T1_name ?T1_other_details WHERE { ?T1 a :staff . ?T1 :staff\#name ?T1_name . ?T1 :staff\#other_details ?T1_other_details .        }
cre_theme_park,What is the name and detail of each staff member?,SELECT ?T1_name ?T1_other_details WHERE { ?T1 a :staff . ?T1 :staff\#name ?T1_name . ?T1 :staff\#other_details ?T1_other_details .        }
cre_theme_park,Show details of all visitors.,SELECT ?T1_tourist_details WHERE { ?T1 a :visitors . ?T1 :visitors\#tourist_details ?T1_tourist_details .        }
cre_theme_park,What is the detail of each visitor?,SELECT ?T1_tourist_details WHERE { ?T1 a :visitors . ?T1 :visitors\#tourist_details ?T1_tourist_details .        }
cre_theme_park,Show the price ranges of hotels with 5 star ratings.,SELECT ?T1_price_range WHERE { ?T1 a :hotels . ?T1 :hotels\#price_range ?T1_price_range . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . FILTER(?T1_star_rating_code = '5') .        }
cre_theme_park,What are the price ranges of five star hotels?,SELECT ?T1_price_range WHERE { ?T1 a :hotels . ?T1 :hotels\#price_range ?T1_price_range . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . FILTER(?T1_star_rating_code = '5') .        }
cre_theme_park,Show the average price range of hotels that have 5 star ratings and allow pets.,SELECT (avg( ?T1_price_range) as ?aggregation_T1_price_range_2 ) WHERE { ?T1 a :hotels . ?T1 :hotels\#price_range ?T1_price_range . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . ?T1 :hotels\#pets_allowed_yn ?T1_pets_allowed_yn . FILTER(?T1_star_rating_code = '5' && ?T1_pets_allowed_yn = 1) .        }
cre_theme_park,What is the average price range of five star hotels that allow pets?,SELECT (avg( ?T1_price_range) as ?aggregation_T1_price_range_42 ) WHERE { ?T1 a :hotels . ?T1 :hotels\#price_range ?T1_price_range . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . ?T1 :hotels\#pets_allowed_yn ?T1_pets_allowed_yn . FILTER(?T1_star_rating_code = '5' && ?T1_pets_allowed_yn = 1) .        }
cre_theme_park,What is the address of the location 'UK Gallery'?,SELECT ?T1_address WHERE { ?T1 a :locations . ?T1 :locations\#address ?T1_address . ?T1 :locations\#location_name ?T1_location_name . FILTER(?T1_location_name = 'UK Gallery') .        }
cre_theme_park,What is the detail of the location UK Gallery?,SELECT ?T1_other_details WHERE { ?T1 a :locations . ?T1 :locations\#other_details ?T1_other_details . ?T1 :locations\#location_name ?T1_location_name . FILTER(?T1_location_name = 'UK Gallery') .        }
cre_theme_park,Which location names contain the word 'film'?,"SELECT ?T1_location_name WHERE { ?T1 a :locations . ?T1 :locations\#location_name ?T1_location_name . ?T1 :locations\#location_name ?T1_location_name . FILTER(contains (?T1_location_name, 'film')) .        }"
cre_theme_park,How many distinct names are associated with all the photos?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_15 ) WHERE { ?T1 a :photos . ?T1 :photos\#name ?T1_name .        }
cre_theme_park,Count the number of distinct names associated with the photos.,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_5 ) WHERE { ?T1 a :photos . ?T1 :photos\#name ?T1_name .        }
cre_theme_park,What are the distinct visit dates?,SELECT DISTINCT ?T1_visit_date WHERE { ?T1 a :visits . ?T1 :visits\#visit_date ?T1_visit_date .        }
cre_theme_park,Which tourist attractions can we get to by bus? Tell me the names of the attractions.,SELECT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T1 :tourist_attractions\#name ?T1_name . ?T1 :tourist_attractions\#how_to_get_there ?T1_how_to_get_there . FILTER(?T1_how_to_get_there = 'bus') .        }
cre_theme_park,Find the names and opening hours of the tourist attractions that we get to by bus or walk.,SELECT ?T1_name ?T1_opening_hours WHERE { ?T1 a :tourist_attractions . ?T1 :tourist_attractions\#name ?T1_name . ?T1 :tourist_attractions\#opening_hours ?T1_opening_hours . ?T1 :tourist_attractions\#how_to_get_there ?T1_how_to_get_there . ?T1 :tourist_attractions\#how_to_get_there ?T1_how_to_get_there . FILTER(?T1_how_to_get_there = 'bus' || ?T1_how_to_get_there = 'walk') .        }
cre_theme_park,Give me the star rating descriptions of the hotels that cost more than 10000.,SELECT ?T1_star_rating_description WHERE { ?T1 a :ref_hotel_star_ratings . ?T2 a :hotels . ?T2 :hotels\#ref-star_rating_code ?T1 .  ?T1 :ref_hotel_star_ratings\#star_rating_description ?T1_star_rating_description . ?T2 :hotels\#price_range ?T2_price_range . FILTER(?T2_price_range > 10000) .        }
cre_theme_park,What are the details and opening hours of the museums?,SELECT ?T1_museum_details ?T2_opening_hours WHERE { ?T1 a :museums . ?T2 a :tourist_attractions . ?T1 :museums\#ref-museum_id ?T2 .  ?T1 :museums\#museum_details ?T1_museum_details . ?T2 :tourist_attractions\#opening_hours ?T2_opening_hours .        }
cre_theme_park,What is the name of the tourist attraction that is associated with the photo 'game1'?,SELECT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T2 a :photos . ?T2 :photos\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :photos\#name ?T2_name . FILTER(?T2_name = 'game1') .        }
cre_theme_park,What are the names and descriptions of the photos taken at the tourist attraction 'film festival'?,SELECT ?T1_name ?T1_description WHERE { ?T1 a :photos . ?T2 a :tourist_attractions . ?T1 :photos\#ref-tourist_attraction_id ?T2 .  ?T1 :photos\#name ?T1_name . ?T1 :photos\#description ?T1_description . ?T2 :tourist_attractions\#name ?T2_name . FILTER(?T2_name = 'film festival') .        }
cre_theme_park,Which tourist attractions are related to royal family? Tell me their details and how we can get there.,SELECT ?T1_royal_family_details ?T2_how_to_get_there WHERE { ?T1 a :royal_family . ?T2 a :tourist_attractions . ?T1 :royal_family\#ref-royal_family_id ?T2 .  ?T1 :royal_family\#royal_family_details ?T1_royal_family_details . ?T2 :tourist_attractions\#how_to_get_there ?T2_how_to_get_there .        }
cre_theme_park,What are the details of the shops that can be accessed by walk?,SELECT ?T1_shop_details WHERE { ?T1 a :shops . ?T2 a :tourist_attractions . ?T1 :shops\#ref-shop_id ?T2 .  ?T1 :shops\#shop_details ?T1_shop_details . ?T2 :tourist_attractions\#how_to_get_there ?T2_how_to_get_there . FILTER(?T2_how_to_get_there = 'walk') .        }
cre_theme_park,What is the name of the staff that is in charge of the attraction named 'US museum'?,SELECT ?T1_name WHERE { ?T1 a :staff . ?T2 a :tourist_attractions . ?T1 :staff\#ref-tourist_attraction_id ?T2 .  ?T1 :staff\#name ?T1_name . ?T2 :tourist_attractions\#name ?T2_name . FILTER(?T2_name = 'US museum') .        }
cre_theme_park,What are the details of the markets that can be accessed by walk or bus?,SELECT ?T1_market_details WHERE { ?T1 a :street_markets . ?T2 a :tourist_attractions . ?T1 :street_markets\#ref-market_id ?T2 .  ?T1 :street_markets\#market_details ?T1_market_details . ?T2 :tourist_attractions\#how_to_get_there ?T2_how_to_get_there . ?T2 :tourist_attractions\#how_to_get_there ?T2_how_to_get_there . FILTER(?T2_how_to_get_there = 'walk' || ?T2_how_to_get_there = 'bus') .        }
cre_theme_park,Find the visit date and details of the tourist whose detail is 'Vincent',SELECT ?T1_visit_date ?T1_visit_details WHERE { ?T1 a :visits . ?T2 a :visitors . ?T1 :visits\#ref-tourist_id ?T2 .  ?T1 :visits\#visit_date ?T1_visit_date . ?T1 :visits\#visit_details ?T1_visit_details . ?T2 :visitors\#tourist_details ?T2_tourist_details . FILTER(?T2_tourist_details = 'Vincent') .        }
cre_theme_park,Which tourist attractions does the visitor with detail 'Vincent' visit?,SELECT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T13 a :visits . ?T13 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visitors\#tourist_details ?T2_tourist_details . ?T2 a :visitors . ?T13 :visits\#ref-tourist_id ?T2 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visitors\#tourist_details ?T2_tourist_details . FILTER(?T2_tourist_details = 'Vincent') .        }
cre_theme_park,"For each tourist attraction, return its name and the date when the tourists named Vincent or Vivian visited there.",SELECT ?T1_name ?T2_visit_date WHERE { ?T1 a :tourist_attractions . ?T2 a :visits . ?T2 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visits\#visit_date ?T2_visit_date . ?T3 :visitors\#tourist_details ?T3_tourist_details . ?T3 :visitors\#tourist_details ?T3_tourist_details . ?T3 a :visitors . ?T2 :visits\#ref-tourist_id ?T3 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visits\#visit_date ?T2_visit_date . ?T3 :visitors\#tourist_details ?T3_tourist_details . ?T3 :visitors\#tourist_details ?T3_tourist_details . FILTER(?T3_tourist_details = 'Vincent' || ?T3_tourist_details = 'Vivian') .        }
cre_theme_park,Show the average price of hotels for each star rating code.,SELECT ?T1_star_rating_code (avg( ?T1_price_range) as ?aggregation_T1_price_range_122 ) WHERE { ?T1 a :hotels . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . ?T1 :hotels\#price_range ?T1_price_range .        } GROUP BY ?T1_star_rating_code
cre_theme_park,What is the average price range of hotels for each each star rating code?,SELECT ?T1_star_rating_code (avg( ?T1_price_range) as ?aggregation_T1_price_range_108 ) WHERE { ?T1 a :hotels . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . ?T1 :hotels\#price_range ?T1_price_range .        } GROUP BY ?T1_star_rating_code
cre_theme_park,Show the average price of hotels for different pet policy.,SELECT ?T1_pets_allowed_yn (avg( ?T1_price_range) as ?aggregation_T1_price_range_82 ) WHERE { ?T1 a :hotels . ?T1 :hotels\#pets_allowed_yn ?T1_pets_allowed_yn . ?T1 :hotels\#price_range ?T1_price_range .        } GROUP BY ?T1_pets_allowed_yn
cre_theme_park,What are the average prices of hotels grouped by their pet policy.,SELECT ?T1_pets_allowed_yn (avg( ?T1_price_range) as ?aggregation_T1_price_range_133 ) WHERE { ?T1 a :hotels . ?T1 :hotels\#pets_allowed_yn ?T1_pets_allowed_yn . ?T1 :hotels\#price_range ?T1_price_range .        } GROUP BY ?T1_pets_allowed_yn
cre_theme_park,"Show the id and star rating of each hotel, ordered by its price from low to high.",SELECT ?T1_hotel_id ?T1_star_rating_code WHERE { ?T1 a :hotels . ?T1 :hotels\#hotel_id ?T1_hotel_id . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . ?T1 :hotels\#price_range ?T1_price_range .        }  ORDER BY ASC (?T1_price_range)
cre_theme_park,Show the details of the top 3 most expensive hotels.,SELECT ?T1_other_hotel_details WHERE { ?T1 a :hotels . ?T1 :hotels\#other_hotel_details ?T1_other_hotel_details . ?T1 :hotels\#price_range ?T1_price_range .        }   ORDER BY DESC (?T1_price_range) LIMIT 1
cre_theme_park,What are the details of the three most expensive hotels?,SELECT ?T1_other_hotel_details WHERE { ?T1 a :hotels . ?T1 :hotels\#other_hotel_details ?T1_other_hotel_details . ?T1 :hotels\#price_range ?T1_price_range .        }   ORDER BY DESC (?T1_price_range) LIMIT 1
cre_theme_park,Show the details and star ratings of the 3 least expensive hotels.,SELECT ?T1_other_hotel_details ?T1_star_rating_code WHERE { ?T1 a :hotels . ?T1 :hotels\#other_hotel_details ?T1_other_hotel_details . ?T1 :hotels\#star_rating_code ?T1_star_rating_code . ?T1 :hotels\#price_range ?T1_price_range .        }   ORDER BY ASC (?T1_price_range) LIMIT 1
cre_theme_park,Show the transportation method most people choose to get to tourist attractions.,SELECT ?T1_how_to_get_there (count( *) as ?aggregation_all) WHERE { ?T1 a :tourist_attractions . ?T1 :tourist_attractions\#how_to_get_there ?T1_how_to_get_there .        } GROUP BY ?T1_how_to_get_there  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_theme_park,Show the description and code of the attraction type most tourist attractions belong to.,SELECT ?T1_attraction_type_description (count( *) as ?aggregation_all) ?T2_attraction_type_code WHERE { ?T1 a :ref_attraction_types . ?T2 a :tourist_attractions . ?T2 :tourist_attractions\#ref-attraction_type_code ?T1 .  ?T1 :ref_attraction_types\#attraction_type_description ?T1_attraction_type_description . ?T2 :tourist_attractions\#attraction_type_code ?T2_attraction_type_code .        } GROUP BY ?T1_attraction_type_description ?T2_attraction_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_theme_park,Show different ways to get to attractions and the number of attractions that can be accessed in the corresponding way.,SELECT ?T1_how_to_get_there (count( *) as ?aggregation_all) WHERE { ?T1 a :tourist_attractions . ?T1 :tourist_attractions\#how_to_get_there ?T1_how_to_get_there .        } GROUP BY ?T1_how_to_get_there
cre_theme_park,"Show different tourist attractions' names, ids, and the corresponding number of visits.",SELECT ?T1_name ?T2_tourist_attraction_id (count( *) as ?aggregation_all) WHERE { ?T1 a :tourist_attractions . ?T2 a :visits . ?T2 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visits\#tourist_attraction_id ?T2_tourist_attraction_id .        } GROUP BY ?T1_name ?T2_tourist_attraction_id
cre_theme_park,Show the names and ids of tourist attractions that are visited at least two times.,SELECT ?T1_name ?T2_tourist_attraction_id WHERE { ?T1 a :tourist_attractions . ?T2 a :visits . ?T2 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visits\#tourist_attraction_id ?T2_tourist_attraction_id .        } GROUP BY ?T1_name ?T2_tourist_attraction_id   HAVING(count( *)  >= 2)
cre_theme_park,Show the names and ids of tourist attractions that are visited at most once.,SELECT ?T1_name ?T1_tourist_attraction_id WHERE { ?T1 a :tourist_attractions . ?T2 a :visits . ?T2 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T1 :tourist_attractions\#tourist_attraction_id ?T1_tourist_attraction_id .        } GROUP BY ?T1_name ?T1_tourist_attraction_id   HAVING(count( *)  <= 1)
cre_theme_park,Find the names of the tourist attractions that is either accessible by walk or at address 660 Shea Crescent.,SELECT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T2 a :locations . ?T1 :tourist_attractions\#ref-location_id ?T2 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :locations\#address ?T2_address . ?T1 :tourist_attractions\#how_to_get_there ?T1_how_to_get_there . FILTER(?T2_address = '660 Shea Crescent' || ?T1_how_to_get_there = 'walk') .        }
cre_theme_park,What are the names of the tourist attractions Vincent and Marcelle visit?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :tourist_attractions . ?T13 a :visits . ?T13 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visitors\#tourist_details ?T2_tourist_details . ?T2 a :visitors . ?T13 :visits\#ref-tourist_id ?T2 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visitors\#tourist_details ?T2_tourist_details . FILTER(?T2_tourist_details = 'Vincent') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :tourist_attractions . ?T15 a :visits . ?T15 :visits\#ref-tourist_attraction_id ?T3 .  ?T3 :tourist_attractions\#name ?T3_name . ?T4 :visitors\#tourist_details ?T4_tourist_details . ?T4 a :visitors . ?T15 :visits\#ref-tourist_id ?T4 .  ?T3 :tourist_attractions\#name ?T3_name . ?T4 :visitors\#tourist_details ?T4_tourist_details .  FILTER(?T4_tourist_details = 'Marcelle') .             }
cre_theme_park,What are the names of tourist attraction that Alison visited but Rosalind did not visit?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :tourist_attractions . ?T13 a :visits . ?T13 :visits\#ref-tourist_attraction_id ?T1 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visitors\#tourist_details ?T2_tourist_details . ?T2 a :visitors . ?T13 :visits\#ref-tourist_id ?T2 .  ?T1 :tourist_attractions\#name ?T1_name . ?T2 :visitors\#tourist_details ?T2_tourist_details . FILTER(?T2_tourist_details = 'Alison') .   }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T3 a :tourist_attractions . ?T15 a :visits . ?T15 :visits\#ref-tourist_attraction_id ?T3 .  ?T3 :tourist_attractions\#name ?T3_name . ?T4 :visitors\#tourist_details ?T4_tourist_details . ?T4 a :visitors . ?T15 :visits\#ref-tourist_id ?T4 .  ?T3 :tourist_attractions\#name ?T3_name . ?T4 :visitors\#tourist_details ?T4_tourist_details . FILTER(?T4_tourist_details = 'Rosalind') .        }     } }
cre_theme_park,How many tourists did not make any visit?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :visitors . ?T1 :visitors\#tourist_id ?T1_tourist_id . FILTER(?T1_tourist_id not in (?T22_tourist_id)) .       {SELECT ?T22_tourist_id WHERE { ?T22 a :visits . ?T22 :visits\#tourist_id ?T22_tourist_id .        }    } }
game_1,How many video games exist?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games .        }
game_1,How many video games do you have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games .        }
game_1,How many video game types exist?,SELECT DISTINCT (count(DISTINCT ?T1_gtype) as ?aggregation_T1_gtype_15 ) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        }
game_1,What is the count of different game types?,SELECT DISTINCT (count(DISTINCT ?T1_gtype) as ?aggregation_T1_gtype_108 ) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        }
game_1,Show all video game types.,SELECT DISTINCT ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        }
game_1,What are the different types of video games?,SELECT DISTINCT ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        }
game_1,Show all video games and their types in the order of their names.,SELECT ?T1_gname ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :video_games\#gname ?T1_gname . ?T1 :video_games\#gtype ?T1_gtype . ?T1 :video_games\#gname ?T1_gname .        }  ORDER BY ASC (?T1_gname)
game_1,Show all video games with type Collectible card game.,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T1 :video_games\#gname ?T1_gname . ?T1 :video_games\#gtype ?T1_gtype . FILTER(?T1_gtype = 'Collectible card game') .        }
game_1,What are the names of all video games that are collectible cards?,SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T1 :video_games\#gname ?T1_gname . ?T1 :video_games\#gtype ?T1_gtype . FILTER(?T1_gtype = 'Collectible card game') .        }
game_1,What is the type of video game Call of Destiny.,SELECT ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype . ?T1 :video_games\#gname ?T1_gname . FILTER(?T1_gname = 'Call of Destiny') .        }
game_1,What type of game is Call of Destiny?,SELECT ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype . ?T1 :video_games\#gname ?T1_gname . FILTER(?T1_gname = 'Call of Destiny') .        }
game_1,How many video games have type Massively multiplayer online game?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype . FILTER(?T1_gtype = 'Massively multiplayer online game') .        }
game_1,Show all video game types and the number of video games in each type.,SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        } GROUP BY ?T1_gtype
game_1,What are the types of video games and how many are in each type?,SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        } GROUP BY ?T1_gtype
game_1,Which game type has most number of games?,SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        } GROUP BY ?T1_gtype  ORDER BY DESC (?aggregation_all) LIMIT 1
game_1,What type has the most games?,SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        } GROUP BY ?T1_gtype  ORDER BY DESC (?aggregation_all) LIMIT 1
game_1,Which game type has least number of games?,SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        } GROUP BY ?T1_gtype  ORDER BY ASC (?aggregation_all) LIMIT 1
game_1,What is the type with the fewest games?,SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :video_games\#gtype ?T1_gtype .        } GROUP BY ?T1_gtype  ORDER BY ASC (?aggregation_all) LIMIT 1
game_1,Show ids for all students who live in CHI.,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#city_code ?T1_city_code . FILTER(?T1_city_code = 'CHI') .        }
game_1,What are the ids of all students who live in CHI?,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#city_code ?T1_city_code . FILTER(?T1_city_code = 'CHI') .        }
game_1,Show ids for all students who have advisor 1121.,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#advisor ?T1_advisor . FILTER(?T1_advisor = 1121) .        }
game_1,What are the ids of all students who have advisor number 1121?,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid . ?T1 :student\#advisor ?T1_advisor . FILTER(?T1_advisor = 1121) .        }
game_1,Show first name for all students with major 600.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\#fname ?T1_fname . ?T1 :student\#major ?T1_major . FILTER(?T1_major = 600) .        }
