kg_name,question,query
wine_1,List the names of all distinct wines ordered by price.,SELECT DISTINCT ?T1_name ?T1_price WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#price ?T1_price . ?T1 :wine\#price ?T1_price .        }  ORDER BY ASC (?T1_price)
wine_1,What is the area of the appelation that produces the highest number of wines before the year of 2010?,SELECT ?T1_area (count( *) as ?aggregation_all) WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\#ref-appelation ?T1 .  ?T1 :appellations\#area ?T1_area . ?T2 :wine\#year ?T2_year . FILTER(?T2_year < 2010) .        } GROUP BY ?T1_area  ORDER BY DESC (?aggregation_all) LIMIT 1
wine_1,What is the area for the appelation which produced the most wines prior to 2010?,SELECT ?T1_area (count( *) as ?aggregation_all) WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\#ref-appelation ?T1 .  ?T1 :appellations\#area ?T1_area . ?T2 :wine\#year ?T2_year . FILTER(?T2_year < 2010) .        } GROUP BY ?T1_area  ORDER BY DESC (?aggregation_all) LIMIT 1
wine_1,What is the color of the grape whose wine products has the highest average price?,SELECT ?T1_color WHERE { ?T1 a :grapes . ?T2 a :wine . ?T2 :wine\#ref-grape ?T1 .  ?T1 :grapes\#color ?T1_color . ?T2 :wine\#price ?T2_price .        } GROUP BY ?T1_color  ORDER BY DESC ((avg( ?T2_price) as ?aggregation_T2_price_66 )) LIMIT 1
wine_1,Give the color of the grape whose wine products have the highest average price?,SELECT ?T1_color WHERE { ?T1 a :grapes . ?T2 a :wine . ?T2 :wine\#ref-grape ?T1 .  ?T1 :grapes\#color ?T1_color . ?T2 :wine\#price ?T2_price .        } GROUP BY ?T1_color  ORDER BY DESC ((avg( ?T2_price) as ?aggregation_T2_price_114 )) LIMIT 1
wine_1,Find the distinct names of wines produced before the year of 2000 or after the year of 2010.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#year ?T1_year . ?T1 :wine\#year ?T1_year . FILTER(?T1_year < 2000 || ?T1_year > 2010) .        }
wine_1,Find the distinct winery of wines having price between 50 and 100.,SELECT DISTINCT ?T1_winery WHERE { ?T1 a :wine . ?T1 :wine\#winery ?T1_winery . ?T1 :wine\#price ?T1_price . FILTER(?T1_price >= 50 && ?T1_price <= 100) .        }
wine_1,Give the average price and case of wines made from Zinfandel grapes in the year 2009.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_0 ) (avg( ?T1_cases) as ?aggregation_T1_cases_74 ) WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#cases ?T1_cases . ?T1 :wine\#year ?T1_year . ?T1 :wine\#grape ?T1_grape . FILTER(?T1_year = 2009 && ?T1_grape = 'Zinfandel') .        }
wine_1,Give the maximum price and score for wines produced in the appelation St. Helena.,SELECT (max( ?T1_price) as ?aggregation_T1_price_107 ) (max( ?T1_score) as ?aggregation_T1_score_41 ) WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#score ?T1_score . ?T1 :wine\#appelation ?T1_appelation . FILTER(?T1_appelation = 'St. Helena') .        }
wine_1,What are the maximum price and score of wines in each year?,SELECT (max( ?T1_price) as ?aggregation_T1_price_72 ) (max( ?T1_score) as ?aggregation_T1_score_82 ) ?T1_year WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#score ?T1_score . ?T1 :wine\#year ?T1_year .        } GROUP BY ?T1_year
wine_1,What are the maximum price and score of wines for each year?,SELECT (max( ?T1_price) as ?aggregation_T1_price_59 ) (max( ?T1_score) as ?aggregation_T1_score_108 ) ?T1_year WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#score ?T1_score . ?T1 :wine\#year ?T1_year .        } GROUP BY ?T1_year
wine_1,What are the average price and score of wines grouped by appelation?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_157 ) (avg( ?T1_score) as ?aggregation_T1_score_91 ) ?T1_appelation WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#score ?T1_score . ?T1 :wine\#appelation ?T1_appelation .        } GROUP BY ?T1_appelation
wine_1,What are the average price and score of wines for each appelation?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_173 ) (avg( ?T1_score) as ?aggregation_T1_score_178 ) ?T1_appelation WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#score ?T1_score . ?T1 :wine\#appelation ?T1_appelation .        } GROUP BY ?T1_appelation
wine_1,Find the wineries that have at least four wines.,SELECT ?T1_winery WHERE { ?T1 a :wine . ?T1 :wine\#winery ?T1_winery .        } GROUP BY ?T1_winery   HAVING(count( *)  >= 4)
wine_1,Which wineries produce at least four wines?,SELECT ?T1_winery WHERE { ?T1 a :wine . ?T1 :wine\#winery ?T1_winery .        } GROUP BY ?T1_winery   HAVING(count( *)  >= 4)
wine_1,Find the country of all appelations who have at most three wines.,SELECT ?T1_county WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\#ref-appelation ?T1 .  ?T1 :appellations\#county ?T1_county .        } GROUP BY ?T1_county   HAVING(count( *)  <= 3)
wine_1,What are the countries for appelations with at most 3 wines?,SELECT ?T1_county WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\#ref-appelation ?T1 .  ?T1 :appellations\#county ?T1_county .        } GROUP BY ?T1_county   HAVING(count( *)  <= 3)
wine_1,Give the names of wines with prices above any wine produced in 2006.,SELECT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#price ?T1_price . FILTER(?T1_price > (?T22_year)) .       {SELECT (max( ?T22_price) as ?aggregation_T22_price_88 ) WHERE { ?T22 a :wine . ?T22 :wine\#price ?T22_price . ?T22 :wine\#year ?T22_year . FILTER(?T22_year = 2006) .        }    } }
wine_1,Find the top 3 wineries with the greatest number of wines made of white color grapes.,SELECT ?T1_winery (count( *) as ?aggregation_all) WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\#ref-grape ?T2 .  ?T1 :wine\#winery ?T1_winery . ?T2 :grapes\#color ?T2_color . FILTER(?T2_color = 'White') .        } GROUP BY ?T1_winery  ORDER BY DESC (?aggregation_all) LIMIT 1
wine_1,Which 3 wineries produce the most wines made from white grapes?,SELECT ?T1_winery (count( *) as ?aggregation_all) WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\#ref-grape ?T2 .  ?T1 :wine\#winery ?T1_winery . ?T2 :grapes\#color ?T2_color . FILTER(?T2_color = 'White') .        } GROUP BY ?T1_winery  ORDER BY DESC (?aggregation_all) LIMIT 1
wine_1,"List the grape, winery and year of the wines whose price is bigger than 100 ordered by year.",SELECT ?T1_grape ?T1_winery ?T1_year WHERE { ?T1 a :wine . ?T1 :wine\#grape ?T1_grape . ?T1 :wine\#winery ?T1_winery . ?T1 :wine\#year ?T1_year . ?T1 :wine\#year ?T1_year . ?T1 :wine\#price ?T1_price . FILTER(?T1_price > 100) .        }  ORDER BY ASC (?T1_year)
wine_1,"List the grape, appelation and name of wines whose score is higher than 93 ordered by Name.",SELECT ?T1_grape ?T1_appelation ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#grape ?T1_grape . ?T1 :wine\#appelation ?T1_appelation . ?T1 :wine\#name ?T1_name . ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score . FILTER(?T1_score > 93) .        }  ORDER BY ASC (?T1_name)
wine_1,Find the appelations that produce wines after the year of 2008 but not in Central Coast area.,SELECT distinct?col1 WHERE { { SELECT (?T1_appelation as ?col1) WHERE { ?T1 a :wine . ?T1 :wine\#appelation ?T1_appelation . ?T1 :wine\#year ?T1_year . FILTER(?T1_year > 2008) .   }}  MINUS {SELECT (?T2_appelation as ?col1) WHERE { ?T2 a :appellations . ?T2 :appellations\#appelation ?T2_appelation . ?T2 :appellations\#area ?T2_area . FILTER(?T2_area = 'Central Coast') .        }     } }
wine_1,Find the average price of wines that are not produced from Sonoma county.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_80 ) WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#appelation ?T1_appelation . FILTER(?T1_appelation not in (?T22_county)) .       {SELECT ?T22_appelation WHERE { ?T22 a :appellations . ?T22 :appellations\#appelation ?T22_appelation . ?T22 :appellations\#county ?T22_county . FILTER(?T22_county = 'Sonoma') .        }    } }
wine_1,What is the average price for wines not produced in Sonoma county?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_118 ) WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#appelation ?T1_appelation . FILTER(?T1_appelation not in (?T22_county)) .       {SELECT ?T22_appelation WHERE { ?T22 a :appellations . ?T22 :appellations\#appelation ?T22_appelation . ?T22 :appellations\#county ?T22_county . FILTER(?T22_county = 'Sonoma') .        }    } }
wine_1,Find the county where produces the most number of wines with score higher than 90.,SELECT ?T1_county (count( *) as ?aggregation_all) WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\#ref-appelation ?T1 .  ?T1 :appellations\#county ?T1_county . ?T2 :wine\#score ?T2_score . FILTER(?T2_score > 90) .        } GROUP BY ?T1_county  ORDER BY DESC (?aggregation_all) LIMIT 1
wine_1,What is the county that produces the most wines scoring higher than 90?,SELECT ?T1_county (count( *) as ?aggregation_all) WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\#ref-appelation ?T1 .  ?T1 :appellations\#county ?T1_county . ?T2 :wine\#score ?T2_score . FILTER(?T2_score > 90) .        } GROUP BY ?T1_county  ORDER BY DESC (?aggregation_all) LIMIT 1
train_station,How many train stations are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :station .        }
train_station,"Show the name, location, and number of platforms for all stations.",SELECT ?T1_name ?T1_location ?T1_number_of_platforms WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#location ?T1_location . ?T1 :station\#number_of_platforms ?T1_number_of_platforms .        }
train_station,What are all locations of train stations?,SELECT DISTINCT ?T1_location WHERE { ?T1 a :station . ?T1 :station\#location ?T1_location .        }
train_station,Show the names and total passengers for all train stations not in London.,SELECT ?T1_name ?T1_total_passengers WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#total_passengers ?T1_total_passengers . ?T1 :station\#location ?T1_location . FILTER(?T1_location != 'London') .        }
train_station,Show the names and main services for train stations that have the top three total number of passengers.,SELECT ?T1_name ?T1_main_services WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#main_services ?T1_main_services . ?T1 :station\#total_passengers ?T1_total_passengers .        }   ORDER BY DESC (?T1_total_passengers) LIMIT 1
train_station,Show all locations and the total number of platforms and passengers for all train stations in each location.,SELECT ?T1_location (sum( ?T1_number_of_platforms) as ?aggregation_T1_number_of_platforms_166 ) (sum( ?T1_total_passengers) as ?aggregation_T1_total_passengers_199 ) WHERE { ?T1 a :station . ?T1 :station\#location ?T1_location . ?T1 :station\#number_of_platforms ?T1_number_of_platforms . ?T1 :station\#total_passengers ?T1_total_passengers .        } GROUP BY ?T1_location
train_station,Show all locations that have train stations with at least 15 platforms and train stations with more than 25 total passengers.,SELECT DISTINCT ?T1_location WHERE { ?T1 a :station . ?T1 :station\#location ?T1_location . ?T1 :station\#number_of_platforms ?T1_number_of_platforms . ?T1 :station\#total_passengers ?T1_total_passengers . FILTER(?T1_number_of_platforms >= 15 && ?T1_total_passengers > 25) .        }
train_station,Show all locations which don't have a train station with at least 15 platforms.,SELECT distinct?col1 WHERE { { SELECT (?T1_location as ?col1) WHERE { ?T1 a :station . ?T1 :station\#location ?T1_location .   }}  MINUS {SELECT (?T2_location as ?col1) WHERE { ?T2 a :station . ?T2 :station\#location ?T2_location . ?T2 :station\#number_of_platforms ?T2_number_of_platforms . FILTER(?T2_number_of_platforms >= 15) .        }     } }
train_station,Show the location with most number of train stations.,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\#location ?T1_location .        } GROUP BY ?T1_location  ORDER BY DESC (?aggregation_all) LIMIT 1
train_station,"Show the name, time, and service for all trains.",SELECT ?T1_name ?T1_time ?T1_service WHERE { ?T1 a :train . ?T1 :train\#name ?T1_name . ?T1 :train\#time ?T1_time . ?T1 :train\#service ?T1_service .        }
train_station,Show the number of trains,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :train .        }
train_station,Show the name and service for all trains in order by time.,SELECT ?T1_name ?T1_service WHERE { ?T1 a :train . ?T1 :train\#name ?T1_name . ?T1 :train\#service ?T1_service . ?T1 :train\#time ?T1_time .        }  ORDER BY ASC (?T1_time)
train_station,Show the station name and number of trains in each station.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T2 a :train_station . ?T2 :train_station\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name .        } GROUP BY ?T1_name
train_station,show the train name and station name for each train.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :station . ?T13 a :train_station . ?T13 :train_station\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T2 :train\#name ?T2_name . ?T2 a :train . ?T13 :train_station\#ref-train_id ?T2 .  ?T1 :station\#name ?T1_name . ?T2 :train\#name ?T2_name .        }
train_station,Show all train names and times in stations in London in descending order by train time.,SELECT ?T1_name ?T1_time WHERE { ?T1 a :train . ?T13 a :train_station . ?T13 :train_station\#ref-train_id ?T1 .  ?T1 :train\#name ?T1_name . ?T1 :train\#time ?T1_time . ?T1 :train\#time ?T1_time . ?T2 :station\#location ?T2_location . ?T2 a :station . ?T13 :train_station\#ref-station_id ?T2 .  ?T1 :train\#name ?T1_name . ?T1 :train\#time ?T1_time . ?T1 :train\#time ?T1_time . ?T2 :station\#location ?T2_location . FILTER(?T2_location = 'London') .        }  ORDER BY DESC (?T1_time)
train_station,Show the station name with greatest number of trains.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T2 a :train_station . ?T2 :train_station\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
train_station,Show the station name with at least two trains.,SELECT ?T1_name WHERE { ?T1 a :station . ?T2 a :train_station . ?T2 :train_station\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
train_station,Show all locations with only 1 station.,SELECT ?T1_location WHERE { ?T1 a :station . ?T1 :station\#location ?T1_location .        } GROUP BY ?T1_location   HAVING(count( *)  = 1)
train_station,Show station names without any trains.,SELECT ?T1_name WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#station_id ?T1_station_id . FILTER(?T1_station_id not in (?T22_station_id)) .       {SELECT ?T22_station_id WHERE { ?T22 a :train_station . ?T22 :train_station\#station_id ?T22_station_id .        }    } }
train_station,What are the names of the stations which serve both 'Ananthapuri Express' and 'Guruvayur Express' trains?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :station . ?T13 a :train_station . ?T13 :train_station\#ref-station_id ?T1 .  ?T1 :station\#name ?T1_name . ?T2 :train\#name ?T2_name . ?T2 a :train . ?T13 :train_station\#ref-train_id ?T2 .  ?T1 :station\#name ?T1_name . ?T2 :train\#name ?T2_name . FILTER(?T2_name = 'Ananthapuri Express') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :station . ?T15 a :train_station . ?T15 :train_station\#ref-station_id ?T3 .  ?T3 :station\#name ?T3_name . ?T4 :train\#name ?T4_name . ?T4 a :train . ?T15 :train_station\#ref-train_id ?T4 .  ?T3 :station\#name ?T3_name . ?T4 :train\#name ?T4_name .  FILTER(?T4_name = 'Guruvayur Express') .             }
train_station,Find the names of the trains that do not pass any station located in London.,SELECT ?T1_name WHERE { ?T1 a :train . ?T2 a :train_station . ?T2 :train_station\#ref-train_id ?T1 .  ?T1 :train\#name ?T1_name . ?T2 :train_station\#station_id ?T2_station_id . FILTER(?T2_station_id not in (?T23_location)) .       {SELECT ?T23_station_id WHERE { ?T23 a :station . ?T23 :station\#station_id ?T23_station_id . ?T23 :station\#location ?T23_location . FILTER(?T23_location = 'London') .        }    } }
train_station,List the names and locations of all stations ordered by their yearly entry exit and interchange amounts.,SELECT ?T1_name ?T1_location WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#location ?T1_location . ?T1 :station\#annual_entry_exit ?T1_annual_entry_exit .        }  ORDER BY ASC (?T1_annual_entry_exit)
driving_school,List all vehicle id,SELECT ?T1_vehicle_id WHERE { ?T1 a :vehicles . ?T1 :vehicles\#vehicle_id ?T1_vehicle_id .        }
driving_school,What are the ids of all vehicles?,SELECT ?T1_vehicle_id WHERE { ?T1 a :vehicles . ?T1 :vehicles\#vehicle_id ?T1_vehicle_id .        }
driving_school,How many vehicle in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vehicles .        }
driving_school,How many vehicles exist?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vehicles .        }
driving_school,Show the detail of vehicle with id 1.,SELECT ?T1_vehicle_details WHERE { ?T1 a :vehicles . ?T1 :vehicles\#vehicle_details ?T1_vehicle_details . ?T1 :vehicles\#vehicle_id ?T1_vehicle_id . FILTER(?T1_vehicle_id = 1) .        }
driving_school,What are the details of the car with id 1?,SELECT ?T1_vehicle_details WHERE { ?T1 a :vehicles . ?T1 :vehicles\#vehicle_details ?T1_vehicle_details . ?T1 :vehicles\#vehicle_id ?T1_vehicle_id . FILTER(?T1_vehicle_id = 1) .        }
driving_school,List the first name middle name and last name of all staff.,SELECT ?T1_first_name ?T1_middle_name ?T1_last_name WHERE { ?T1 a :staff . ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#middle_name ?T1_middle_name . ?T1 :staff\#last_name ?T1_last_name .        }
driving_school,What is the date of birth for the staff member named Janessa Sawayn?,SELECT ?T1_date_of_birth WHERE { ?T1 a :staff . ?T1 :staff\#date_of_birth ?T1_date_of_birth . ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Janessa' && ?T1_last_name = 'Sawayn') .        }
driving_school,When did the staff member named Janessa Sawayn join the company?,SELECT ?T1_date_joined_staff WHERE { ?T1 a :staff . ?T1 :staff\#date_joined_staff ?T1_date_joined_staff . ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Janessa' && ?T1_last_name = 'Sawayn') .        }
driving_school,When did the staff member Janessa Sawayn leave the company?,SELECT ?T1_date_left_staff WHERE { ?T1 a :staff . ?T1 :staff\#date_left_staff ?T1_date_left_staff . ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Janessa' && ?T1_last_name = 'Sawayn') .        }
driving_school,How many staff have the first name Ludie?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T1 :staff\#first_name ?T1_first_name . FILTER(?T1_first_name = 'Ludie') .        }
driving_school,How many employees have a first name of Ludie?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T1 :staff\#first_name ?T1_first_name . FILTER(?T1_first_name = 'Ludie') .        }
driving_school,What is the nickname of the employee named Janessa Sawayn?,SELECT ?T1_nickname WHERE { ?T1 a :staff . ?T1 :staff\#nickname ?T1_nickname . ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Janessa' && ?T1_last_name = 'Sawayn') .        }
driving_school,How many staff in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :staff .        }
driving_school,How many employees are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :staff .        }
driving_school,In what city does Janessa Sawayn live?,SELECT ?T1_city WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#city ?T1_city . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }
driving_school,In which country and state does Janessa Sawayn live?,SELECT ?T1_country ?T1_state_province_county WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#country ?T1_country . ?T1 :addresses\#state_province_county ?T1_state_province_county . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }
driving_school,How long is the total lesson time took by customer with first name as Rylan and last name as Goodwin?,SELECT (sum( ?T1_lesson_time) as ?aggregation_T1_lesson_time_128 ) WHERE { ?T1 a :lessons . ?T2 a :customers . ?T1 :lessons\#ref-customer_id ?T2 .  ?T1 :lessons\#lesson_time ?T1_lesson_time . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Rylan' && ?T2_last_name = 'Goodwin') .        }
driving_school,How long is the total lesson time took by the customer named Rylan Goodwin?,SELECT (sum( ?T1_lesson_time) as ?aggregation_T1_lesson_time_8 ) WHERE { ?T1 a :lessons . ?T2 a :customers . ?T1 :lessons\#ref-customer_id ?T2 .  ?T1 :lessons\#lesson_time ?T1_lesson_time . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Rylan' && ?T2_last_name = 'Goodwin') .        }
driving_school,What is the zip code of the hosue of the employee named Janessa Sawayn?,SELECT ?T1_zip_postcode WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#zip_postcode ?T1_zip_postcode . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }
driving_school,How many staff live in state Georgia?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county . FILTER(?T1_state_province_county = 'Georgia') .        }
driving_school,How many employees live in Georgia?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\#state_province_county ?T1_state_province_county . FILTER(?T1_state_province_county = 'Georgia') .        }
driving_school,Find out the first name and last name of staff lived in city Damianfort.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :staff . ?T2 a :addresses . ?T1 :staff\#ref-staff_address_id ?T2 .  ?T1 :staff\#first_name ?T1_first_name . ?T1 :staff\#last_name ?T1_last_name . ?T2 :addresses\#city ?T2_city . FILTER(?T2_city = 'Damianfort') .        }
driving_school,Which city lives most of staffs? List the city name and number of staffs.,SELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1
driving_school,In which city do the most employees live and how many of them live there?,SELECT ?T1_city (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1
driving_school,List the states which have between 2 to 4 staffs living there.,SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#state_province_county ?T1_state_province_county .        } GROUP BY ?T1_state_province_county   HAVING(count( *)  >= 2 && count( *)  <= 4)
driving_school,What are the names of the states that have 2 to 4 employees living there?,SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :staff\#ref-staff_address_id ?T1 .  ?T1 :addresses\#state_province_county ?T1_state_province_county .        } GROUP BY ?T1_state_province_county   HAVING(count( *)  >= 2 && count( *)  <= 4)
driving_school,List the first name and last name of all customers.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name .        }
driving_school,What are the first and last names for all customers?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name .        }
driving_school,List email address and birthday of customer whose first name as Carole.,SELECT ?T1_email_address ?T1_date_of_birth WHERE { ?T1 a :customers . ?T1 :customers\#email_address ?T1_email_address . ?T1 :customers\#date_of_birth ?T1_date_of_birth . ?T1 :customers\#first_name ?T1_first_name . FILTER(?T1_first_name = 'Carole') .        }
driving_school,List phone number and email address of customer with more than 2000 outstanding balance.,SELECT ?T1_phone_number ?T1_email_address WHERE { ?T1 a :customers . ?T1 :customers\#phone_number ?T1_phone_number . ?T1 :customers\#email_address ?T1_email_address . ?T1 :customers\#amount_outstanding ?T1_amount_outstanding . FILTER(?T1_amount_outstanding > 2000) .        }
driving_school,When did Carole Bernhard first become a customer?,SELECT ?T1_date_became_customer WHERE { ?T1 a :customers . ?T1 :customers\#date_became_customer ?T1_date_became_customer . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . FILTER(?T1_first_name = 'Carole' && ?T1_last_name = 'Bernhard') .        }
driving_school,How many customers in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }
driving_school,How many customers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }
driving_school,List all customer status codes and the number of customers having each status code.,SELECT ?T1_customer_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_status_code ?T1_customer_status_code .        } GROUP BY ?T1_customer_status_code
driving_school,Which customer status code has least number of customers?,SELECT ?T1_customer_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_status_code ?T1_customer_status_code .        } GROUP BY ?T1_customer_status_code  ORDER BY ASC (?aggregation_all) LIMIT 1
driving_school,What is the status code with the least number of customers?,SELECT ?T1_customer_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_status_code ?T1_customer_status_code .        } GROUP BY ?T1_customer_status_code  ORDER BY ASC (?aggregation_all) LIMIT 1
driving_school,How many lessons did the customer Ryan Goodwin complete?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lessons . ?T2 a :customers . ?T1 :lessons\#ref-customer_id ?T2 .  ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . ?T1 :lessons\#lesson_status_code ?T1_lesson_status_code . FILTER(?T2_first_name = 'Rylan' && ?T2_last_name = 'Goodwin' && ?T1_lesson_status_code = 'Completed') .        }
driving_school,List the first name and last name of customers have the amount of outstanding between 1000 and 3000.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T1 :customers\#amount_outstanding ?T1_amount_outstanding . FILTER(?T1_amount_outstanding >= 1000 && ?T1_amount_outstanding <= 3000) .        }
driving_school,List first name and last name of customers lived in city Lockmanfurt.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\#ref-address_id ?T2 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name . ?T2 :addresses\#city ?T2_city . FILTER(?T2_city = 'Lockmanfurt') .        }
driving_school,What is the country in which the customer Carole Bernhard lived?,SELECT ?T1_country WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\#ref-address_id ?T1 .  ?T1 :addresses\#country ?T1_country . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Carole' && ?T2_last_name = 'Bernhard') .        }
driving_school,What is the zip code of the customer Carole Bernhard?,SELECT ?T1_zip_postcode WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\#ref-address_id ?T1 .  ?T1 :addresses\#zip_postcode ?T1_zip_postcode . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Carole' && ?T2_last_name = 'Bernhard') .        }
driving_school,Which city does has most number of customers?,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\#ref-address_id ?T1 .  ?T1 :addresses\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1
driving_school,What is the city with the most customers?,SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\#ref-address_id ?T1 .  ?T1 :addresses\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1
driving_school,What is the total amount of moeny paid by the customer Carole Bernhard?,SELECT (sum( ?T1_amount_payment) as ?aggregation_T1_amount_payment_178 ) WHERE { ?T1 a :customer_payments . ?T2 a :customers . ?T1 :customer_payments\#ref-customer_id ?T2 .  ?T1 :customer_payments\#amount_payment ?T1_amount_payment . ?T2 :customers\#first_name ?T2_first_name . ?T2 :customers\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Carole' && ?T2_last_name = 'Bernhard') .        }
driving_school,List the number of customers that did not have any payment history.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :customer_payments . ?T22 :customer_payments\#customer_id ?T22_customer_id .        }    } }
driving_school,How many customers have no payment histories?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :customer_payments . ?T22 :customer_payments\#customer_id ?T22_customer_id .        }    } }
driving_school,List first name and last name of customers that have more than 2 payments.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :customer_payments . ?T2 :customer_payments\#ref-customer_id ?T1 .  ?T1 :customers\#first_name ?T1_first_name . ?T1 :customers\#last_name ?T1_last_name .        } GROUP BY ?T1_first_name ?T1_last_name   HAVING(count( *)  > 2)
driving_school,List all payment methods and number of payments using each payment methods.,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customer_payments . ?T1 :customer_payments\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code
driving_school,How many lessons were in cancelled state?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lessons . ?T1 :lessons\#lesson_status_code ?T1_lesson_status_code . FILTER(?T1_lesson_status_code = 'Cancelled') .        }
driving_school,How many lessons have been cancelled?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lessons . ?T1 :lessons\#lesson_status_code ?T1_lesson_status_code . FILTER(?T1_lesson_status_code = 'Cancelled') .        }
