kg_name,question,query
small_bank_1,Find the name of accounts whose checking balance is higher than corresponding saving balance.,"SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :checking\#balance ?T2_balance . FILTER(?T2_balance > [0, 18, False]) .        }"
small_bank_1,Find the name and total checking and savings balance of the accounts whose savings balance is lower than corresponding checking balance.,"SELECT ?T1_name ?T2_balance + ?T3_balance WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :savings\#balance ?T2_balance . ?T3 :checking\#balance ?T3_balance . ?T2 :savings\#balance ?T2_balance . ?T3 a :checking . ?T3 :checking\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :savings\#balance ?T2_balance . ?T3 :checking\#balance ?T3_balance . ?T2 :savings\#balance ?T2_balance . FILTER(?T2_balance < [0, 16, False]) .        }"
small_bank_1,Find the name and savings balance of the top 3 accounts with the highest saving balance sorted by savings balance in descending order.,SELECT ?T1_name ?T2_balance WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :savings\#ref-custid ?T1 .  ?T1 :accounts\#name ?T1_name . ?T2 :savings\#balance ?T2_balance . ?T2 :savings\#balance ?T2_balance .        }   ORDER BY DESC (?T2_balance) LIMIT 1
browser_web,How many main stream browsers whose market share is at least 5 exist?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :browser . ?T1 :browser\#market_share ?T1_market_share . FILTER(?T1_market_share >= 5) .        }
browser_web,List the name of browsers in descending order by market share.,SELECT ?T1_name WHERE { ?T1 a :browser . ?T1 :browser\#name ?T1_name . ?T1 :browser\#market_share ?T1_market_share .        }  ORDER BY DESC (?T1_market_share)
browser_web,"List the ids, names and market shares of all browsers.",SELECT ?T1_id ?T1_name ?T1_market_share WHERE { ?T1 a :browser . ?T1 :browser\#id ?T1_id . ?T1 :browser\#name ?T1_name . ?T1 :browser\#market_share ?T1_market_share .        }
browser_web,What is the id and market share of the browser Safari?,SELECT ?T1_id ?T1_market_share WHERE { ?T1 a :browser . ?T1 :browser\#id ?T1_id . ?T1 :browser\#market_share ?T1_market_share . ?T1 :browser\#name ?T1_name . FILTER(?T1_name = 'Safari') .        }
browser_web,How many accelerators are not compatible with the browsers listed ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :web_client_accelerator . ?T1 :web_client_accelerator\#id ?T1_id . FILTER(?T1_id not in (?T22_accelerator_id)) .       {SELECT ?T22_accelerator_id WHERE { ?T22 a :accelerator_compatible_browser . ?T22 :accelerator_compatible_browser\#accelerator_id ?T22_accelerator_id .        }    } }
browser_web,List the names of the browser that are compatible with both 'CACHEbox' and 'Fasterfox'.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :browser . ?T13 a :accelerator_compatible_browser . ?T13 :accelerator_compatible_browser\#ref-browser_id ?T1 .  ?T1 :browser\#name ?T1_name . ?T2 :web_client_accelerator\#name ?T2_name . ?T2 a :web_client_accelerator . ?T13 :accelerator_compatible_browser\#ref-accelerator_id ?T2 .  ?T1 :browser\#name ?T1_name . ?T2 :web_client_accelerator\#name ?T2_name . FILTER(?T2_name = 'CACHEbox') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :browser . ?T15 a :accelerator_compatible_browser . ?T15 :accelerator_compatible_browser\#ref-browser_id ?T3 .  ?T3 :browser\#name ?T3_name . ?T4 :web_client_accelerator\#name ?T4_name . ?T4 a :web_client_accelerator . ?T15 :accelerator_compatible_browser\#ref-accelerator_id ?T4 .  ?T3 :browser\#name ?T3_name . ?T4 :web_client_accelerator\#name ?T4_name .  FILTER(?T4_name = 'Fasterfox') .             }
browser_web,Show the accelerator names and supporting operating systems that are not compatible with the browser named 'Opera'.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_operating_system as ?col2) WHERE { ?T1 a :web_client_accelerator . ?T1 :web_client_accelerator\#name ?T1_name . ?T1 :web_client_accelerator\#operating_system ?T1_operating_system .   }}  MINUS {SELECT (?T2_name as ?col1) (?T2_operating_system as ?col2) WHERE { ?T2 a :web_client_accelerator . ?T14 a :accelerator_compatible_browser . ?T14 :accelerator_compatible_browser\#ref-accelerator_id ?T2 .  ?T2 :web_client_accelerator\#name ?T2_name . ?T2 :web_client_accelerator\#operating_system ?T2_operating_system . ?T3 :browser\#name ?T3_name . ?T3 a :browser . ?T14 :accelerator_compatible_browser\#ref-browser_id ?T3 .  ?T2 :web_client_accelerator\#name ?T2_name . ?T2 :web_client_accelerator\#operating_system ?T2_operating_system . ?T3 :browser\#name ?T3_name . FILTER(?T3_name = 'Opera') .        }     } }
browser_web,Which accelerator name contains substring 'Opera'?,"SELECT ?T1_name WHERE { ?T1 a :web_client_accelerator . ?T1 :web_client_accelerator\#name ?T1_name . ?T1 :web_client_accelerator\#name ?T1_name . FILTER(contains (?T1_name, 'Opera')) .        }"
browser_web,Find the number of web accelerators used for each Operating system.,SELECT ?T1_operating_system (count( *) as ?aggregation_all) WHERE { ?T1 a :web_client_accelerator . ?T1 :web_client_accelerator\#operating_system ?T1_operating_system .        } GROUP BY ?T1_operating_system
browser_web,give me names of all compatible browsers and accelerators in the descending order of compatible year,SELECT ?T1_name ?T2_name WHERE { ?T1 a :browser . ?T3 a :accelerator_compatible_browser . ?T3 :accelerator_compatible_browser\#ref-browser_id ?T1 .  ?T1 :browser\#name ?T1_name . ?T2 :web_client_accelerator\#name ?T2_name . ?T3 :accelerator_compatible_browser\#compatible_since_year ?T3_compatible_since_year . ?T2 a :web_client_accelerator . ?T3 :accelerator_compatible_browser\#ref-accelerator_id ?T2 .  ?T1 :browser\#name ?T1_name . ?T2 :web_client_accelerator\#name ?T2_name . ?T3 :accelerator_compatible_browser\#compatible_since_year ?T3_compatible_since_year .        }  ORDER BY DESC (?T3_compatible_since_year)
wrestler,How many wrestlers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :wrestler .        }
wrestler,List the names of wrestlers in descending order of days held.,SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :wrestler\#name ?T1_name . ?T1 :wrestler\#days_held ?T1_days_held .        }  ORDER BY DESC (?T1_days_held)
wrestler,What is the name of the wrestler with the fewest days held?,SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :wrestler\#name ?T1_name . ?T1 :wrestler\#days_held ?T1_days_held .        }   ORDER BY ASC (?T1_days_held) LIMIT 1
wrestler,"What are the distinct reigns of wrestlers whose location is not 'Tokyo,Japan' ?","SELECT DISTINCT ?T1_reign WHERE { ?T1 a :wrestler . ?T1 :wrestler\#reign ?T1_reign . ?T1 :wrestler\#location ?T1_location . FILTER(?T1_location != 'Tokyo , Japan') .        }"
wrestler,What are the names and location of the wrestlers?,SELECT ?T1_name ?T1_location WHERE { ?T1 a :wrestler . ?T1 :wrestler\#name ?T1_name . ?T1 :wrestler\#location ?T1_location .        }
wrestler,What are the elimination moves of wrestlers whose team is 'Team Orton'?,SELECT ?T1_elimination_move WHERE { ?T1 a :elimination . ?T1 :elimination\#elimination_move ?T1_elimination_move . ?T1 :elimination\#team ?T1_team . FILTER(?T1_team = 'Team Orton') .        }
wrestler,What are the names of wrestlers and the elimination moves?,SELECT ?T1_name ?T2_elimination_move WHERE { ?T1 a :wrestler . ?T2 a :elimination . ?T2 :elimination\#ref-wrestler_id ?T1 .  ?T1 :wrestler\#name ?T1_name . ?T2 :elimination\#elimination_move ?T2_elimination_move .        }
wrestler,List the names of wrestlers and the teams in elimination in descending order of days held.,SELECT ?T1_name ?T2_team WHERE { ?T1 a :wrestler . ?T2 a :elimination . ?T2 :elimination\#ref-wrestler_id ?T1 .  ?T1 :wrestler\#name ?T1_name . ?T2 :elimination\#team ?T2_team . ?T1 :wrestler\#days_held ?T1_days_held .        }  ORDER BY DESC (?T1_days_held)
wrestler,List the time of elimination of the wrestlers with largest days held.,SELECT ?T1_time WHERE { ?T1 a :elimination . ?T2 a :wrestler . ?T1 :elimination\#ref-wrestler_id ?T2 .  ?T1 :elimination\#time ?T1_time . ?T2 :wrestler\#days_held ?T2_days_held .        }   ORDER BY DESC (?T2_days_held) LIMIT 1
wrestler,What is the time of elimination for the wrestler with the most days held?,SELECT ?T1_time WHERE { ?T1 a :elimination . ?T2 a :wrestler . ?T1 :elimination\#ref-wrestler_id ?T2 .  ?T1 :elimination\#time ?T1_time . ?T2 :wrestler\#days_held ?T2_days_held .        }   ORDER BY DESC (?T2_days_held) LIMIT 1
wrestler,Show times of elimination of wrestlers with days held more than 50.,SELECT ?T1_time WHERE { ?T1 a :elimination . ?T2 a :wrestler . ?T1 :elimination\#ref-wrestler_id ?T2 .  ?T1 :elimination\#time ?T1_time . ?T2 :wrestler\#days_held ?T2_days_held . FILTER(?T2_days_held > 50) .        }
wrestler,What are the times of elimination for wrestlers with over 50 days held?,SELECT ?T1_time WHERE { ?T1 a :elimination . ?T2 a :wrestler . ?T1 :elimination\#ref-wrestler_id ?T2 .  ?T1 :elimination\#time ?T1_time . ?T2 :wrestler\#days_held ?T2_days_held . FILTER(?T2_days_held > 50) .        }
wrestler,Show different teams in eliminations and the number of eliminations from each team.,SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team .        } GROUP BY ?T1_team
wrestler,How many eliminations did each team have?,SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team .        } GROUP BY ?T1_team
wrestler,Show teams that have suffered more than three eliminations.,SELECT ?T1_team WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team .        } GROUP BY ?T1_team   HAVING(count( *)  > 3)
wrestler,Which teams had more than 3 eliminations?,SELECT ?T1_team WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team .        } GROUP BY ?T1_team   HAVING(count( *)  > 3)
wrestler,Show the reign and days held of wrestlers.,SELECT ?T1_reign ?T1_days_held WHERE { ?T1 a :wrestler . ?T1 :wrestler\#reign ?T1_reign . ?T1 :wrestler\#days_held ?T1_days_held .        }
wrestler,What are the reigns and days held of all wrestlers?,SELECT ?T1_reign ?T1_days_held WHERE { ?T1 a :wrestler . ?T1 :wrestler\#reign ?T1_reign . ?T1 :wrestler\#days_held ?T1_days_held .        }
wrestler,What are the names of wrestlers days held less than 100?,SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :wrestler\#name ?T1_name . ?T1 :wrestler\#days_held ?T1_days_held . FILTER(?T1_days_held < 100) .        }
wrestler,Please show the most common reigns of wrestlers.,SELECT ?T1_reign (count( *) as ?aggregation_all) WHERE { ?T1 a :wrestler . ?T1 :wrestler\#reign ?T1_reign .        } GROUP BY ?T1_reign  ORDER BY DESC (?aggregation_all) LIMIT 1
wrestler,Which reign is the most common among wrestlers?,SELECT ?T1_reign (count( *) as ?aggregation_all) WHERE { ?T1 a :wrestler . ?T1 :wrestler\#reign ?T1_reign .        } GROUP BY ?T1_reign  ORDER BY DESC (?aggregation_all) LIMIT 1
wrestler,List the locations that are shared by more than two wrestlers.,SELECT ?T1_location WHERE { ?T1 a :wrestler . ?T1 :wrestler\#location ?T1_location .        } GROUP BY ?T1_location   HAVING(count( *)  > 2)
wrestler,Which locations are shared by more than two wrestlers?,SELECT ?T1_location WHERE { ?T1 a :wrestler . ?T1 :wrestler\#location ?T1_location .        } GROUP BY ?T1_location   HAVING(count( *)  > 2)
wrestler,List the names of wrestlers that have not been eliminated.,SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :wrestler\#name ?T1_name . ?T1 :wrestler\#wrestler_id ?T1_wrestler_id . FILTER(?T1_wrestler_id not in (?T22_wrestler_id)) .       {SELECT ?T22_wrestler_id WHERE { ?T22 a :elimination . ?T22 :elimination\#wrestler_id ?T22_wrestler_id .        }    } }
wrestler,What are the names of wrestlers who have never been eliminated?,SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :wrestler\#name ?T1_name . ?T1 :wrestler\#wrestler_id ?T1_wrestler_id . FILTER(?T1_wrestler_id not in (?T22_wrestler_id)) .       {SELECT ?T22_wrestler_id WHERE { ?T22 a :elimination . ?T22 :elimination\#wrestler_id ?T22_wrestler_id .        }    } }
wrestler,Show the teams that have both wrestlers eliminated by 'Orton' and wrestlers eliminated by 'Benjamin'.,SELECT DISTINCT ?T1_team WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team . ?T1 :elimination\#eliminated_by ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Orton') . FILTER (?T1_team in (?T2_team)) .   ?T2 a :elimination . ?T2 :elimination\#team ?T2_team . ?T2 :elimination\#eliminated_by ?T2_eliminated_by .  FILTER(?T2_eliminated_by = 'Benjamin') .             }
wrestler,What are the teams that have both wrestlers eliminated by Orton and wrestlers eliminated by Benjamin?,SELECT DISTINCT ?T1_team WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team . ?T1 :elimination\#eliminated_by ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Orton') . FILTER (?T1_team in (?T2_team)) .   ?T2 a :elimination . ?T2 :elimination\#team ?T2_team . ?T2 :elimination\#eliminated_by ?T2_eliminated_by .  FILTER(?T2_eliminated_by = 'Benjamin') .             }
wrestler,What is the number of distinct teams that suffer elimination?,SELECT DISTINCT (count(DISTINCT ?T1_team) as ?aggregation_T1_team_148 ) WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team .        }
wrestler,How many different teams have had eliminated wrestlers?,SELECT DISTINCT (count(DISTINCT ?T1_team) as ?aggregation_T1_team_48 ) WHERE { ?T1 a :elimination . ?T1 :elimination\#team ?T1_team .        }
wrestler,Show the times of elimination by 'Punk' or 'Orton'.,SELECT ?T1_time WHERE { ?T1 a :elimination . ?T1 :elimination\#time ?T1_time . ?T1 :elimination\#eliminated_by ?T1_eliminated_by . ?T1 :elimination\#eliminated_by ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Punk' || ?T1_eliminated_by = 'Orton') .        }
school_finance,How many schools are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :school .        }
school_finance,Show all school names in alphabetical order.,SELECT ?T1_school_name WHERE { ?T1 a :school . ?T1 :school\#school_name ?T1_school_name . ?T1 :school\#school_name ?T1_school_name .        }  ORDER BY ASC (?T1_school_name)
school_finance,"List the name, location, mascot for all schools.",SELECT ?T1_school_name ?T1_location ?T1_mascot WHERE { ?T1 a :school . ?T1 :school\#school_name ?T1_school_name . ?T1 :school\#location ?T1_location . ?T1 :school\#mascot ?T1_mascot .        }
school_finance,What are the total and average enrollment of all schools?,SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_6 ) (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_76 ) WHERE { ?T1 a :school . ?T1 :school\#enrollment ?T1_enrollment . ?T1 :school\#enrollment ?T1_enrollment .        }
school_finance,What are the mascots for schools with enrollments above the average?,SELECT ?T1_mascot WHERE { ?T1 a :school . ?T1 :school\#mascot ?T1_mascot . ?T1 :school\#enrollment ?T1_enrollment . FILTER(?T1_enrollment > (?aggregation_T22_enrollment_84)) .       {SELECT (avg( ?T22_enrollment) as ?aggregation_T22_enrollment_84 ) WHERE { ?T22 a :school . ?T22 :school\#enrollment ?T22_enrollment .        }    } }
school_finance,List the name of the school with the smallest enrollment.,SELECT ?T1_school_name WHERE { ?T1 a :school . ?T1 :school\#school_name ?T1_school_name . ?T1 :school\#enrollment ?T1_enrollment .        }   ORDER BY ASC (?T1_enrollment) LIMIT 1
school_finance,"Show the average, maximum, minimum enrollment of all schools.",SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_188 ) (max( ?T1_enrollment) as ?aggregation_T1_enrollment_66 ) (min( ?T1_enrollment) as ?aggregation_T1_enrollment_144 ) WHERE { ?T1 a :school . ?T1 :school\#enrollment ?T1_enrollment . ?T1 :school\#enrollment ?T1_enrollment . ?T1 :school\#enrollment ?T1_enrollment .        }
school_finance,Show each county along with the number of schools and total enrollment in each county.,SELECT ?T1_county (count( *) as ?aggregation_all) (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_93 ) WHERE { ?T1 a :school . ?T1 :school\#county ?T1_county . ?T1 :school\#enrollment ?T1_enrollment .        } GROUP BY ?T1_county
school_finance,How many donors have endowment for school named 'Glenn'?,SELECT DISTINCT (count(DISTINCT ?T1_donator_name) as ?aggregation_T1_donator_name_106 ) WHERE { ?T1 a :endowment . ?T2 a :school . ?T1 :endowment\#ref-school_id ?T2 .  ?T1 :endowment\#donator_name ?T1_donator_name . ?T2 :school\#school_name ?T2_school_name . FILTER(?T2_school_name = 'Glenn') .        }
school_finance,List each donator name and the amount of endowment in descending order of the amount of endowment.,SELECT ?T1_donator_name (sum( ?T1_amount) as ?aggregation_T1_amount_155 ) WHERE { ?T1 a :endowment . ?T1 :endowment\#donator_name ?T1_donator_name . ?T1 :endowment\#amount ?T1_amount . ?T1 :endowment\#amount ?T1_amount .        } GROUP BY ?T1_donator_name ORDER BY DESC ((sum( ?T1_amount) as ?aggregation_T1_amount_179 ))
school_finance,List the names of the schools without any endowment.,SELECT ?T1_school_name WHERE { ?T1 a :school . ?T1 :school\#school_name ?T1_school_name . ?T1 :school\#school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) .       {SELECT ?T22_school_id WHERE { ?T22 a :endowment . ?T22 :endowment\#school_id ?T22_school_id .        }    } }
school_finance,List all the names of schools with an endowment amount smaller than or equal to 10.,SELECT ?T1_school_name WHERE { ?T1 a :school . ?T2 a :endowment . ?T2 :endowment\#ref-school_id ?T1 .  ?T1 :school\#school_name ?T1_school_name . ?T2 :endowment\#amount ?T2_amount .        } GROUP BY ?T1_school_name   HAVING(sum( ?T2_amount)  <= 10)
school_finance,Show the names of donors who donated to both school 'Glenn' and 'Triton.',SELECT DISTINCT ?T1_donator_name WHERE { ?T1 a :endowment . ?T2 a :school . ?T1 :endowment\#ref-school_id ?T2 .  ?T1 :endowment\#donator_name ?T1_donator_name . ?T2 :school\#school_name ?T2_school_name . FILTER(?T2_school_name = 'Glenn') . FILTER (?T1_donator_name in (?T3_donator_name)) .   ?T3 a :endowment . ?T4 a :school . ?T3 :endowment\#ref-school_id ?T4 .  ?T3 :endowment\#donator_name ?T3_donator_name . ?T4 :school\#school_name ?T4_school_name .  FILTER(?T4_school_name = 'Triton') .             }
school_finance,Show the names of all the donors except those whose donation amount less than 9.,SELECT distinct?col1 WHERE { { SELECT (?T1_donator_name as ?col1) WHERE { ?T1 a :endowment . ?T1 :endowment\#donator_name ?T1_donator_name .   }}  MINUS {SELECT (?T2_donator_name as ?col1) WHERE { ?T2 a :endowment . ?T2 :endowment\#donator_name ?T2_donator_name . ?T2 :endowment\#amount ?T2_amount . FILTER(?T2_amount < 9) .        }     } }
school_finance,List the amount and donor name for the largest amount of donation.,SELECT ?T1_amount ?T1_donator_name WHERE { ?T1 a :endowment . ?T1 :endowment\#amount ?T1_amount . ?T1 :endowment\#donator_name ?T1_donator_name . ?T1 :endowment\#amount ?T1_amount .        }   ORDER BY DESC (?T1_amount) LIMIT 1
school_finance,How many budgets are above 3000 in year 2001 or before?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :budget . ?T1 :budget\#budgeted ?T1_budgeted . ?T1 :budget\#year ?T1_year . FILTER(?T1_budgeted > 3000 && ?T1_year <= 2001) .        }
school_finance,"Show each school name, its budgeted amount, and invested amount in year 2002 or after.",SELECT ?T1_school_name ?T2_budgeted ?T2_invested WHERE { ?T1 a :school . ?T2 a :budget . ?T2 :budget\#ref-school_id ?T1 .  ?T1 :school\#school_name ?T1_school_name . ?T2 :budget\#budgeted ?T2_budgeted . ?T2 :budget\#invested ?T2_invested . ?T2 :budget\#year ?T2_year . FILTER(?T2_year >= 2002) .        }
school_finance,Show all donor names.,SELECT DISTINCT ?T1_donator_name WHERE { ?T1 a :endowment . ?T1 :endowment\#donator_name ?T1_donator_name .        }
school_finance,What is the total budget amount for school 'Glenn' in all years?,SELECT (sum( ?T1_budgeted) as ?aggregation_T1_budgeted_113 ) WHERE { ?T1 a :budget . ?T2 a :school . ?T1 :budget\#ref-school_id ?T2 .  ?T1 :budget\#budgeted ?T1_budgeted . ?T2 :school\#school_name ?T2_school_name . FILTER(?T2_school_name = 'Glenn') .        }
school_finance,Show the names of schools with a total budget amount greater than 100 or a total endowment greater than 10.,SELECT ?T1_school_name WHERE { ?T1 a :school . ?T2 a :budget . ?T2 :budget\#ref-school_id ?T1 .  ?T1 :school\#school_name ?T1_school_name . ?T2 :budget\#budgeted ?T2_budgeted . ?T3 :endowment\#amount ?T3_amount . ?T3 a :endowment . ?T3 :endowment\#ref-school_id ?T1 .  ?T1 :school\#school_name ?T1_school_name . ?T2 :budget\#budgeted ?T2_budgeted . ?T3 :endowment\#amount ?T3_amount .        } GROUP BY ?T1_school_name   HAVING(sum( ?T2_budgeted)  > 100 (sum( ?T3_amount)  > 10)
school_finance,Find the names of schools that have more than one donator with donation amount above 8.5.,SELECT ?T1_school_name WHERE { ?T1 a :school . ?T2 a :endowment . ?T2 :endowment\#ref-school_id ?T1 .  ?T1 :school\#school_name ?T1_school_name . ?T2 :endowment\#amount ?T2_amount . FILTER(?T2_amount > 8.5) .        } GROUP BY ?T1_school_name   HAVING(count( *)  > 1)
school_finance,Find the number of schools that have more than one donator whose donation amount is less than 8.5.,SELECT (count (*) as ?agg) WHERE {SELECT * WHERE {?t1 a :endowment . ?t1 :endowment#amount ?t1_amount . ?t1 :endowment#endowment_id ?t1_endowment_id . ?t1 :endowment#school_id ?t1_school_id. FILTER (?t1_amount > 8.5) }} GROUP BY ?t1_endowment_id ?t1_school_id HAVING (?agg >1)
school_finance,"List the name, IHSAA Football Class, and Mascot of the schools that have more than 6000 of budgeted amount or were founded before 2003, in the order of percent of total invested budget and total budgeted budget.",SELECT ?T1_school_name ?T1_mascot ?T1_ihsaa_football_class WHERE { ?T1 a :school . ?T2 a :budget . ?T2 :budget\#ref-school_id ?T1 .  ?T1 :school\#school_name ?T1_school_name . ?T1 :school\#mascot ?T1_mascot . ?T1 :school\#ihsaa_football_class ?T1_ihsaa_football_class . ?T2 :budget\#total_budget_percent_invested ?T2_total_budget_percent_invested . ?T2 :budget\#budgeted ?T2_budgeted . ?T2 :budget\#year ?T2_year . FILTER(?T2_budgeted > 6000 || ?T2_year < 2003) .        }  ORDER BY ASC (?T2_total_budget_percent_invested)
protein_institute,How many buildings are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :building .        }
protein_institute,"Show the name, street address, and number of floors for all buildings ordered by the number of floors.",SELECT ?T1_name ?T1_street_address ?T1_floors WHERE { ?T1 a :building . ?T1 :building\#name ?T1_name . ?T1 :building\#street_address ?T1_street_address . ?T1 :building\#floors ?T1_floors . ?T1 :building\#floors ?T1_floors .        }  ORDER BY ASC (?T1_floors)
protein_institute,What is the name of the tallest building?,SELECT ?T1_name WHERE { ?T1 a :building . ?T1 :building\#name ?T1_name . ?T1 :building\#height_feet ?T1_height_feet .        }   ORDER BY DESC (?T1_height_feet) LIMIT 1
protein_institute,Show the number of buildings with a height above the average or a number of floors above the average.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :building . ?T1 :building\#height_feet ?T1_height_feet . ?T1 :building\#floors ?T1_floors . FILTER(?T1_height_feet > (?aggregation_T22_height_feet_107) || ?T1_floors > (?aggregation_T22_floors_26)) .       {SELECT (avg( ?T22_height_feet) as ?aggregation_T22_height_feet_107 ) WHERE { ?T22 a :building . ?T22 :building\#height_feet ?T22_height_feet .        }    } {SELECT (avg( ?T22_floors) as ?aggregation_T22_floors_26 ) WHERE { ?T22 a :building . ?T22 :building\#floors ?T22_floors .        }    } }
protein_institute,List the names of buildings with at least 200 feet of height and with at least 20 floors.,SELECT ?T1_name WHERE { ?T1 a :building . ?T1 :building\#name ?T1_name . ?T1 :building\#height_feet ?T1_height_feet . ?T1 :building\#floors ?T1_floors . FILTER(?T1_height_feet >= 200 && ?T1_floors >= 20) .        }
protein_institute,Show the names and locations of institutions that are founded after 1990 and have the type 'Private'.,SELECT ?T1_institution ?T1_location WHERE { ?T1 a :institution . ?T1 :institution\#institution ?T1_institution . ?T1 :institution\#location ?T1_location . ?T1 :institution\#founded ?T1_founded . ?T1 :institution\#type ?T1_type . FILTER(?T1_founded > 1990 && ?T1_type = 'Private') .        }
protein_institute,"Show institution types, along with the number of institutions and total enrollment for each type.",SELECT ?T1_type (count( *) as ?aggregation_all) (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_49 ) WHERE { ?T1 a :institution . ?T1 :institution\#type ?T1_type . ?T1 :institution\#enrollment ?T1_enrollment .        } GROUP BY ?T1_type
protein_institute,Show the institution type with the largest number of institutions.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :institution . ?T1 :institution\#type ?T1_type .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
protein_institute,Show the institution type with an institution founded after 1990 and an institution with at least 1000 enrollment.,SELECT ?T1_type WHERE { ?T1 a :institution . ?T1 :institution\#type ?T1_type . ?T1 :institution\#founded ?T1_founded . ?T1 :institution\#enrollment ?T1_enrollment . FILTER(?T1_founded > 1990 && ?T1_enrollment >= 1000) .        }
protein_institute,Show the name of buildings that do not have any institution.,SELECT ?T1_name WHERE { ?T1 a :building . ?T1 :building\#name ?T1_name . ?T1 :building\#building_id ?T1_building_id . FILTER(?T1_building_id not in (?T22_building_id)) .       {SELECT ?T22_building_id WHERE { ?T22 a :institution . ?T22 :institution\#building_id ?T22_building_id .        }    } }
protein_institute,Show the names of buildings except for those having an institution founded in 2003.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :building . ?T1 :building\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :building . ?T3 a :institution . ?T3 :institution\#ref-building_id ?T2 .  ?T2 :building\#name ?T2_name . ?T3 :institution\#founded ?T3_founded . FILTER(?T3_founded = 2003) .        }     } }
protein_institute,"For each building, show the name of the building and the number of institutions in it.",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :building . ?T2 a :institution . ?T2 :institution\#ref-building_id ?T1 .  ?T1 :building\#name ?T1_name .        } GROUP BY ?T1_name
protein_institute,Show the names and heights of buildings with at least two institutions founded after 1880.,SELECT ?T1_name ?T1_height_feet WHERE { ?T1 a :building . ?T2 a :institution . ?T2 :institution\#ref-building_id ?T1 .  ?T1 :building\#name ?T1_name . ?T1 :building\#height_feet ?T1_height_feet . ?T2 :institution\#founded ?T2_founded . FILTER(?T2_founded > 1880) .        } GROUP BY ?T1_name ?T1_height_feet   HAVING(count( *)  >= 2)
protein_institute,Show all the distinct institution types.,SELECT DISTINCT ?T1_type WHERE { ?T1 a :institution . ?T1 :institution\#type ?T1_type .        }
protein_institute,Show institution names along with the number of proteins for each institution.,SELECT ?T1_institution (count( *) as ?aggregation_all) WHERE { ?T1 a :institution . ?T2 a :protein . ?T2 :protein\#ref-institution_id ?T1 .  ?T1 :institution\#institution ?T1_institution .        } GROUP BY ?T1_institution
protein_institute,How many proteins are associated with an institution founded after 1880 or an institution with type 'Private'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :protein . ?T2 a :institution . ?T1 :protein\#ref-institution_id ?T2 .  ?T2 :institution\#founded ?T2_founded . ?T2 :institution\#type ?T2_type . FILTER(?T2_founded > 1880 || ?T2_type = 'Private') .        }
protein_institute,Show the protein name and the institution name.,SELECT ?T1_protein_name ?T2_institution WHERE { ?T1 a :protein . ?T2 a :institution . ?T1 :protein\#ref-institution_id ?T2 .  ?T1 :protein\#protein_name ?T1_protein_name . ?T2 :institution\#institution ?T2_institution .        }
protein_institute,How many institutions do not have an associated protein in our record?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :institution . ?T1 :institution\#institution_id ?T1_institution_id . FILTER(?T1_institution_id not in (?T22_institution_id)) .       {SELECT ?T22_institution_id WHERE { ?T22 a :protein . ?T22 :protein\#institution_id ?T22_institution_id .        }    } }
cinema,Show all the locations where no cinema has capacity over 800.,SELECT distinct?col1 WHERE { { SELECT (?T1_location as ?col1) WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location .   }}  MINUS {SELECT (?T2_location as ?col1) WHERE { ?T2 a :cinema . ?T2 :cinema\#location ?T2_location . ?T2 :cinema\#capacity ?T2_capacity . FILTER(?T2_capacity > 800) .        }     } }
cinema,Show all the locations where some cinemas were opened in both year 2010 and year 2011.,SELECT DISTINCT ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#openning_year ?T1_openning_year . FILTER(?T1_openning_year = 2010) . FILTER (?T1_location in (?T2_location)) .   ?T2 a :cinema . ?T2 :cinema\#location ?T2_location . ?T2 :cinema\#openning_year ?T2_openning_year .  FILTER(?T2_openning_year = 2011) .             }
cinema,How many cinema do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :cinema .        }
cinema,"Show name, opening year, and capacity for each cinema.",SELECT ?T1_name ?T1_openning_year ?T1_capacity WHERE { ?T1 a :cinema . ?T1 :cinema\#name ?T1_name . ?T1 :cinema\#openning_year ?T1_openning_year . ?T1 :cinema\#capacity ?T1_capacity .        }
cinema,Show the cinema name and location for cinemas with capacity above average.,SELECT ?T1_name ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#name ?T1_name . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#capacity ?T1_capacity . FILTER(?T1_capacity > (?aggregation_T22_capacity_104)) .       {SELECT (avg( ?T22_capacity) as ?aggregation_T22_capacity_104 ) WHERE { ?T22 a :cinema . ?T22 :cinema\#capacity ?T22_capacity .        }    } }
cinema,What are all the locations with a cinema?,SELECT DISTINCT ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location .        }
cinema,Show all the cinema names and opening years in descending order of opening year.,SELECT ?T1_name ?T1_openning_year WHERE { ?T1 a :cinema . ?T1 :cinema\#name ?T1_name . ?T1 :cinema\#openning_year ?T1_openning_year . ?T1 :cinema\#openning_year ?T1_openning_year .        }  ORDER BY DESC (?T1_openning_year)
cinema,What are the name and location of the cinema with the largest capacity?,SELECT ?T1_name ?T1_location WHERE { ?T1 a :cinema . ?T1 :cinema\#name ?T1_name . ?T1 :cinema\#location ?T1_location . ?T1 :cinema\#capacity ?T1_capacity .        }   ORDER BY DESC (?T1_capacity) LIMIT 1
cinema,"Show the average, minimum, and maximum capacity for all the cinemas opened in year 2011 or later.",SELECT (avg( ?T1_capacity) as ?aggregation_T1_capacity_113 ) (min( ?T1_capacity) as ?aggregation_T1_capacity_152 ) (max( ?T1_capacity) as ?aggregation_T1_capacity_75 ) WHERE { ?T1 a :cinema . ?T1 :cinema\#capacity ?T1_capacity . ?T1 :cinema\#capacity ?T1_capacity . ?T1 :cinema\#capacity ?T1_capacity . ?T1 :cinema\#openning_year ?T1_openning_year . FILTER(?T1_openning_year >= 2011) .        }
cinema,Show each location and the number of cinemas there.,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :cinema . ?T1 :cinema\#location ?T1_location .        } GROUP BY ?T1_location
