kg_name,question,query
hospital_1,How many rooms are located for each block code?,SELECT (count( *) as ?aggregation_all) ?T2_blockcode WHERE { ?T1 a :room . ?T2 a :block . ?T1 :room\#ref-blockfloor ?T2 .  ?T2 :block\#blockcode ?T2_blockcode .        } GROUP BY ?T2_blockcode
hospital_1,What are the unique block codes that have available rooms?,SELECT DISTINCT blockcode FROM room WHERE unavailable  =  False
hospital_1,How many different types of rooms are there?,SELECT DISTINCT (count(DISTINCT ?T1_roomtype) as ?aggregation_T1_roomtype_191 ) WHERE { ?T1 a :room . ?T1 :room\#roomtype ?T1_roomtype .        }
hospital_1,Find the number of distinct room types available.,SELECT DISTINCT (count(DISTINCT ?T1_roomtype) as ?aggregation_T1_roomtype_69 ) WHERE { ?T1 a :room . ?T1 :room\#roomtype ?T1_roomtype .        }
hospital_1,What is the names of the physicians who prescribe medication Thesisin?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :physician . ?T13 a :prescribes . ?T13 :prescribes\#ref-physician ?T1 .  ?T1 :physician\#name ?T1_name . ?T2 :medication\#name ?T2_name . ?T2 a :medication . ?T13 :prescribes\#ref-medication ?T2 .  ?T1 :physician\#name ?T1_name . ?T2 :medication\#name ?T2_name . FILTER(?T2_name = 'Thesisin') .        }
hospital_1,Which physicians prescribe a medication of brand X? Tell me the name and position of those physicians.,SELECT DISTINCT ?T1_name ?T1_position WHERE { ?T1 a :physician . ?T13 a :prescribes . ?T13 :prescribes\#ref-physician ?T1 .  ?T1 :physician\#name ?T1_name . ?T1 :physician\#position ?T1_position . ?T2 :medication\#brand ?T2_brand . ?T2 a :medication . ?T13 :prescribes\#ref-medication ?T2 .  ?T1 :physician\#name ?T1_name . ?T1 :physician\#position ?T1_position . ?T2 :medication\#brand ?T2_brand . FILTER(?T2_brand = 'X') .        }
hospital_1,Find the number of medications prescribed for each brand.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :prescribes . ?T2 a :medication . ?T1 :prescribes\#ref-medication ?T2 .  ?T2 :medication\#name ?T2_name .        } GROUP BY ?T2_name
hospital_1,How many medications are prescribed for each brand?,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :prescribes . ?T2 a :medication . ?T1 :prescribes\#ref-medication ?T2 .  ?T2 :medication\#name ?T2_name .        } GROUP BY ?T2_name
hospital_1,Find the name of physicians whose position title contains the word 'senior'.,"SELECT ?T1_name WHERE { ?T1 a :physician . ?T1 :physician\#name ?T1_name . ?T1 :physician\#position ?T1_position . FILTER(contains (?T1_position, 'senior')) .        }"
hospital_1,Find the patient who has the most recent undergoing treatment?,SELECT ?T1_patient WHERE { ?T1 a :undergoes . ?T1 :undergoes\#patient ?T1_patient . ?T1 :undergoes\#dateundergoes ?T1_dateundergoes .        }   ORDER BY ASC (?T1_dateundergoes) LIMIT 1
hospital_1,Which patient is undergoing the most recent treatment?,SELECT ?T1_patient WHERE { ?T1 a :undergoes . ?T1 :undergoes\#patient ?T1_patient . ?T1 :undergoes\#dateundergoes ?T1_dateundergoes .        }   ORDER BY ASC (?T1_dateundergoes) LIMIT 1
hospital_1,Find the names of all patients who have an undergoing treatment and are staying in room 111.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :patient . ?T2 a :stay . ?T2 :stay\#ref-patient ?T1 .  ?T1 :patient\#name ?T1_name . ?T2 :stay\#room ?T2_room . FILTER(?T2_room = 111) .        }
hospital_1,List the names of all distinct nurses ordered by alphabetical order?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :nurse . ?T1 :nurse\#name ?T1_name . ?T1 :nurse\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
hospital_1,Find the names of nurses who are nursing an undergoing treatment.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :nurse . ?T1 :nurse\#name ?T1_name .        }
hospital_1,Which nurses are in charge of patients undergoing treatments?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :nurse . ?T1 :nurse\#name ?T1_name .        }
hospital_1,"List the names of all distinct medications, ordered in an alphabetical order.",SELECT DISTINCT ?T1_name WHERE { ?T1 a :medication . ?T1 :medication\#name ?T1_name . ?T1 :medication\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
hospital_1,What is the alphabetically ordered list of all distinct medications?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :medication . ?T1 :medication\#name ?T1_name . ?T1 :medication\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
hospital_1,What are the names of the physician who prescribed the highest dose?,SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :prescribes . ?T2 :prescribes\#ref-physician ?T1 .  ?T1 :physician\#name ?T1_name . ?T2 :prescribes\#dose ?T2_dose .        }   ORDER BY DESC (?T2_dose) LIMIT 1
hospital_1,List the physicians' employee ids together with their primary affiliation departments' ids.,SELECT ?t1_physician ?t1_department WHERE {?t1 a :affiliated_with . ?t1 :affiliated_with\#primaryaffiliation ?t1_primaryaffiliation. FILTER (?t1_primaryaffiliation  =  True)}
hospital_1,List the names of departments where some physicians are primarily affiliated with.,SELECT ?t2_name WHERE {?t1 a :affiliated_with . ?t1 :affiliated_with\#primaryaffiliation ?t1_primaryaffiliation. ?t2 a :department . ?t1 :affiliated_with\#ref-department ?t2 . ?t2 :department\#name ?t2_name . FILTER (?t1_primaryaffiliation  =  True)}
hospital_1,What nurses are on call with block floor 1 and block code 1? Tell me their names.,SELECT ?T1_nurse WHERE { ?T1 a :on_call . ?T1 :on_call\#nurse ?T1_nurse . ?T1 :on_call\#blockfloor ?T1_blockfloor . ?T1 :on_call\#blockcode ?T1_blockcode . FILTER(?T1_blockfloor = 1 && ?T1_blockcode = 1) .        }
hospital_1,"Tell me the highest, lowest, and average cost of procedures.",SELECT (max( ?T1_cost) as ?aggregation_T1_cost_111 ) (min( ?T1_cost) as ?aggregation_T1_cost_84 ) (avg( ?T1_cost) as ?aggregation_T1_cost_35 ) WHERE { ?T1 a :procedures . ?T1 :procedures\#cost ?T1_cost . ?T1 :procedures\#cost ?T1_cost . ?T1 :procedures\#cost ?T1_cost .        }
hospital_1,List the name and cost of all procedures sorted by the cost from the highest to the lowest.,SELECT ?T1_name ?T1_cost WHERE { ?T1 a :procedures . ?T1 :procedures\#name ?T1_name . ?T1 :procedures\#cost ?T1_cost . ?T1 :procedures\#cost ?T1_cost .        }  ORDER BY DESC (?T1_cost)
hospital_1,Find the three most expensive procedures.,SELECT ?T1_name WHERE { ?T1 a :procedures . ?T1 :procedures\#name ?T1_name . ?T1 :procedures\#cost ?T1_cost .        }   ORDER BY ASC (?T1_cost) LIMIT 1
hospital_1,What are the three most costly procedures?,SELECT ?T1_name WHERE { ?T1 a :procedures . ?T1 :procedures\#name ?T1_name . ?T1 :procedures\#cost ?T1_cost .        }   ORDER BY ASC (?T1_cost) LIMIT 1
hospital_1,Find the physicians who are trained in a procedure that costs more than 5000.,SELECT ?T1_name WHERE { ?T1 a :physician . ?T13 a :trained_in . ?T13 :trained_in\#ref-physician ?T1 .  ?T1 :physician\#name ?T1_name . ?T2 :procedures\#cost ?T2_cost . ?T2 a :procedures . ?T13 :trained_in\#ref-treatment ?T2 .  ?T1 :physician\#name ?T1_name . ?T2 :procedures\#cost ?T2_cost . FILTER(?T2_cost > 5000) .        }
hospital_1,Find the physician who was trained in the most expensive procedure?,SELECT ?T1_name WHERE { ?T1 a :physician . ?T13 a :trained_in . ?T13 :trained_in\#ref-physician ?T1 .  ?T1 :physician\#name ?T1_name . ?T2 :procedures\#cost ?T2_cost . ?T2 a :procedures . ?T13 :trained_in\#ref-treatment ?T2 .  ?T1 :physician\#name ?T1_name . ?T2 :procedures\#cost ?T2_cost .        }   ORDER BY DESC (?T2_cost) LIMIT 1
hospital_1,Compute the mean price of procedures physician John Wen was trained in.,SELECT (avg( ?T1_cost) as ?aggregation_T1_cost_43 ) WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :trained_in\#ref-treatment ?T1 .  ?T1 :procedures\#cost ?T1_cost . ?T2 :physician\#name ?T2_name . ?T2 a :physician . ?T13 :trained_in\#ref-physician ?T2 .  ?T1 :procedures\#cost ?T1_cost . ?T2 :physician\#name ?T2_name . FILTER(?T2_name = 'John Wen') .        }
hospital_1,Find the names of procedures which physician John Wen was trained in.,SELECT ?T1_name WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :trained_in\#ref-treatment ?T1 .  ?T1 :procedures\#name ?T1_name . ?T2 :physician\#name ?T2_name . ?T2 a :physician . ?T13 :trained_in\#ref-physician ?T2 .  ?T1 :procedures\#name ?T1_name . ?T2 :physician\#name ?T2_name . FILTER(?T2_name = 'John Wen') .        }
hospital_1,What are the names of procedures physician John Wen was trained in?,SELECT ?T1_name WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :trained_in\#ref-treatment ?T1 .  ?T1 :procedures\#name ?T1_name . ?T2 :physician\#name ?T2_name . ?T2 a :physician . ?T13 :trained_in\#ref-physician ?T2 .  ?T1 :procedures\#name ?T1_name . ?T2 :physician\#name ?T2_name . FILTER(?T2_name = 'John Wen') .        }
hospital_1,Find all procedures which cost more than 1000 or which physician John Wen was trained in.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :procedures . ?T1 :procedures\#name ?T1_name . ?T1 :procedures\#cost ?T1_cost . FILTER(?T1_cost > 1000) .   }} UNION {SELECT (?T1_name as ?col1) WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :trained_in\#ref-treatment ?T1 .  ?T1 :procedures\#name ?T1_name . ?T2 :physician\#name ?T2_name . ?T2 a :physician . ?T13 :trained_in\#ref-physician ?T2 .  ?T1 :procedures\#name ?T1_name . ?T2 :physician\#name ?T2_name . FILTER(?T2_name = 'John Wen') .        }      } }
hospital_1,Find the names of all procedures such that the cost is less than 5000 and physician John Wen was trained in.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :procedures . ?T1 :procedures\#name ?T1_name . ?T1 :procedures\#cost ?T1_cost . FILTER(?T1_cost < 5000) . FILTER (?T1_name in (?T2_name)) .   ?T2 a :procedures . ?T14 a :trained_in . ?T14 :trained_in\#ref-treatment ?T2 .  ?T2 :procedures\#name ?T2_name . ?T3 :physician\#name ?T3_name . ?T3 a :physician . ?T14 :trained_in\#ref-physician ?T3 .  ?T2 :procedures\#name ?T2_name . ?T3 :physician\#name ?T3_name .  FILTER(?T3_name = 'John Wen') .             }
hospital_1,Find the name of physicians who are affiliated with both Surgery and Psychiatry departments.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :department\#ref-head ?T1 .  ?T1 :physician\#name ?T1_name . ?T2 :department\#name ?T2_name . FILTER(?T2_name = 'Surgery') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :physician . ?T4 a :department . ?T4 :department\#ref-head ?T3 .  ?T3 :physician\#name ?T3_name . ?T4 :department\#name ?T4_name .  FILTER(?T4_name = 'Psychiatry') .             }
hospital_1,Find the name of physicians who are affiliated with Surgery or Psychiatry department.,SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :department\#ref-head ?T1 .  ?T1 :physician\#name ?T1_name . ?T2 :department\#name ?T2_name . ?T2 :department\#name ?T2_name . FILTER(?T2_name = 'Surgery' || ?T2_name = 'Psychiatry') .        }
hospital_1,Find the names of patients who are not using the medication of Procrastin-X.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :patient . ?T1 :patient\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :patient . ?T14 a :prescribes . ?T14 :prescribes\#ref-patient ?T2 .  ?T2 :patient\#name ?T2_name . ?T3 :medication\#name ?T3_name . ?T3 a :medication . ?T14 :prescribes\#ref-medication ?T3 .  ?T2 :patient\#name ?T2_name . ?T3 :medication\#name ?T3_name . FILTER(?T3_name = 'Procrastin-X') .        }     } }
hospital_1,Find the number of patients who are not using the medication of Procrastin-X.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :patient . ?T1 :patient\#ssn ?T1_ssn . FILTER(?T1_ssn not in (?T23_name)) .       {SELECT ?T22_patient WHERE { ?T22 a :prescribes . ?T23 a :medication . ?T22 :prescribes\#ref-medication ?T23 .  ?T22 :prescribes\#patient ?T22_patient . ?T23 :medication\#name ?T23_name . FILTER(?T23_name = 'Procrastin-X') .        }    } }
hospital_1,How many patients are not using Procrastin-X as medication?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :patient . ?T1 :patient\#ssn ?T1_ssn . FILTER(?T1_ssn not in (?T23_name)) .       {SELECT ?T22_patient WHERE { ?T22 a :prescribes . ?T23 a :medication . ?T22 :prescribes\#ref-medication ?T23 .  ?T22 :prescribes\#patient ?T22_patient . ?T23 :medication\#name ?T23_name . FILTER(?T23_name = 'Procrastin-X') .        }    } }
hospital_1,How many appointments are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :appointment .        }
hospital_1,What are the distinct names of nurses on call?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :nurse . ?T1 :nurse\#name ?T1_name .        }
ship_mission,How many ships are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ship .        }
ship_mission,What is the number of ships?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ship .        }
ship_mission,List the name of ships in ascending order of tonnage.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#tonnage ?T1_tonnage .        }  ORDER BY ASC (?T1_tonnage)
ship_mission,what are the names of the ships ordered by ascending tonnage?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#tonnage ?T1_tonnage .        }  ORDER BY ASC (?T1_tonnage)
ship_mission,What are the type and nationality of ships?,SELECT ?T1_type ?T1_nationality WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type . ?T1 :ship\#nationality ?T1_nationality .        }
ship_mission,What are the types and nationalities of every ship?,SELECT ?T1_type ?T1_nationality WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type . ?T1 :ship\#nationality ?T1_nationality .        }
ship_mission,List the name of ships whose nationality is not 'United States'.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#nationality ?T1_nationality . FILTER(?T1_nationality != 'United States') .        }
ship_mission,What are the names of the ships that are not from the United States?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#nationality ?T1_nationality . FILTER(?T1_nationality != 'United States') .        }
ship_mission,Show the name of ships whose nationality is either United States or United Kingdom.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#nationality ?T1_nationality . ?T1 :ship\#nationality ?T1_nationality . FILTER(?T1_nationality = 'United States' || ?T1_nationality = 'United Kingdom') .        }
ship_mission,What are the names of the ships  that are from either the US or the UK?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#nationality ?T1_nationality . ?T1 :ship\#nationality ?T1_nationality . FILTER(?T1_nationality = 'United States' || ?T1_nationality = 'United Kingdom') .        }
ship_mission,What is the name of the ship with the largest tonnage?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#tonnage ?T1_tonnage .        }   ORDER BY DESC (?T1_tonnage) LIMIT 1
ship_mission,What is the ship with the largest amount of tonnage called?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#tonnage ?T1_tonnage .        }   ORDER BY DESC (?T1_tonnage) LIMIT 1
ship_mission,Show different types of ships and the number of ships of each type.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type .        } GROUP BY ?T1_type
ship_mission,Please show the most common type of ships.,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
ship_mission,What is the most common type of ships?,SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1
ship_mission,List the nations that have more than two ships.,SELECT ?T1_nationality WHERE { ?T1 a :ship . ?T1 :ship\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality   HAVING(count( *)  > 2)
ship_mission,What are the nations that have more than two ships?,SELECT ?T1_nationality WHERE { ?T1 a :ship . ?T1 :ship\#nationality ?T1_nationality .        } GROUP BY ?T1_nationality   HAVING(count( *)  > 2)
ship_mission,Show different types of ships and the average tonnage of ships of each type.,SELECT ?T1_type (avg( ?T1_tonnage) as ?aggregation_T1_tonnage_77 ) WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type . ?T1 :ship\#tonnage ?T1_tonnage .        } GROUP BY ?T1_type
ship_mission,"Show codes and fates of missions, and names of ships involved.",SELECT ?T1_code ?T1_fate ?T2_name WHERE { ?T1 a :mission . ?T2 a :ship . ?T1 :mission\#ref-ship_id ?T2 .  ?T1 :mission\#code ?T1_code . ?T1 :mission\#fate ?T1_fate . ?T2 :ship\#name ?T2_name .        }
ship_mission,Show names of ships involved in a mission launched after 1928.,SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :mission . ?T2 :mission\#ref-ship_id ?T1 .  ?T1 :ship\#name ?T1_name . ?T2 :mission\#launched_year ?T2_launched_year . FILTER(?T2_launched_year > 1928) .        }
ship_mission,Show the distinct fate of missions that involve ships with nationality 'United States',SELECT DISTINCT ?T1_fate WHERE { ?T1 a :mission . ?T2 a :ship . ?T1 :mission\#ref-ship_id ?T2 .  ?T1 :mission\#fate ?T1_fate . ?T2 :ship\#nationality ?T2_nationality . FILTER(?T2_nationality = 'United States') .        }
ship_mission,List the name of ships that are not involved in any mission,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#ship_id ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_ship_id)) .       {SELECT ?T22_ship_id WHERE { ?T22 a :mission . ?T22 :mission\#ship_id ?T22_ship_id .        }    } }
ship_mission,What are the names of the ships that are not involved in any missions?,SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :ship\#name ?T1_name . ?T1 :ship\#ship_id ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_ship_id)) .       {SELECT ?T22_ship_id WHERE { ?T22 a :mission . ?T22 :mission\#ship_id ?T22_ship_id .        }    } }
ship_mission,Show the types of ships that have both ships with tonnage larger than 6000 and ships with tonnage smaller than 4000.,SELECT DISTINCT ?T1_type WHERE { ?T1 a :ship . ?T1 :ship\#type ?T1_type . ?T1 :ship\#tonnage ?T1_tonnage . FILTER(?T1_tonnage > 6000) . FILTER (?T1_type in (?T2_type)) .   ?T2 a :ship . ?T2 :ship\#type ?T2_type . ?T2 :ship\#tonnage ?T2_tonnage .  FILTER(?T2_tonnage < 4000) .             }
student_1,Find the number of students in total.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :list .        }
student_1,How many students are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :list .        }
student_1,Find the last names of students studying in room 111.,SELECT ?T1_lastname WHERE { ?T1 a :list . ?T1 :list\#lastname ?T1_lastname . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 111) .        }
student_1,What are the last names of students in room 111?,SELECT ?T1_lastname WHERE { ?T1 a :list . ?T1 :list\#lastname ?T1_lastname . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 111) .        }
student_1,Find the first names of students studying in room 108.,SELECT ?T1_firstname WHERE { ?T1 a :list . ?T1 :list\#firstname ?T1_firstname . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 108) .        }
student_1,What are the first names of students in room 108?,SELECT ?T1_firstname WHERE { ?T1 a :list . ?T1 :list\#firstname ?T1_firstname . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 108) .        }
student_1,What are the first names of students studying in room 107?,SELECT DISTINCT ?T1_firstname WHERE { ?T1 a :list . ?T1 :list\#firstname ?T1_firstname . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 107) .        }
student_1,For each classroom report the grade that is taught in it. Report just the classroom number and the grade number.,SELECT DISTINCT ?T1_classroom ?T1_grade WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade .        }
student_1,What are the grade number and classroom number of each class in the list?,SELECT DISTINCT ?T1_classroom ?T1_grade WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade .        }
student_1,Which grade is studying in classroom 103?,SELECT DISTINCT ?T1_grade WHERE { ?T1 a :list . ?T1 :list\#grade ?T1_grade . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 103) .        }
student_1,Find the grade studying in room 105.,SELECT DISTINCT ?T1_grade WHERE { ?T1 a :list . ?T1 :list\#grade ?T1_grade . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 105) .        }
student_1,Which grade is studying in room 105?,SELECT DISTINCT ?T1_grade WHERE { ?T1 a :list . ?T1 :list\#grade ?T1_grade . ?T1 :list\#classroom ?T1_classroom . FILTER(?T1_classroom = 105) .        }
student_1,Which classrooms are used by grade 4?,SELECT DISTINCT ?T1_classroom WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade . FILTER(?T1_grade = 4) .        }
student_1,Which classrooms are used by grade 5?,SELECT DISTINCT ?T1_classroom WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade . FILTER(?T1_grade = 5) .        }
student_1,Find the last names of the teachers that teach fifth grade.,SELECT DISTINCT ?T1_lastname WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_grade = 5) .        }
student_1,what are the last names of the teachers who teach grade 5?,SELECT DISTINCT ?T1_lastname WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_grade = 5) .        }
student_1,Find the first names of the teachers that teach first grade.,SELECT DISTINCT ?T1_firstname WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_grade = 1) .        }
student_1,What are the first names of the teachers who teach grade 1?,SELECT DISTINCT ?T1_firstname WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_grade = 1) .        }
student_1,Find the first names of all the teachers that teach in classroom 110.,SELECT ?T1_firstname WHERE { ?T1 a :teachers . ?T1 :teachers\#firstname ?T1_firstname . ?T1 :teachers\#classroom ?T1_classroom . FILTER(?T1_classroom = 110) .        }
student_1,Find the last names of teachers teaching in classroom 109.,SELECT ?T1_lastname WHERE { ?T1 a :teachers . ?T1 :teachers\#lastname ?T1_lastname . ?T1 :teachers\#classroom ?T1_classroom . FILTER(?T1_classroom = 109) .        }
student_1,Report the first name and last name of all the teachers.,SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a :teachers . ?T1 :teachers\#firstname ?T1_firstname . ?T1 :teachers\#lastname ?T1_lastname .        }
student_1,What are the first name and last name of all the teachers?,SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a :teachers . ?T1 :teachers\#firstname ?T1_firstname . ?T1 :teachers\#lastname ?T1_lastname .        }
student_1,Report the first name and last name of all the students.,SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a :list . ?T1 :list\#firstname ?T1_firstname . ?T1 :list\#lastname ?T1_lastname .        }
student_1,Find all students taught by OTHA MOYER. Output the first and last names of the students.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T2_firstname = 'OTHA' && ?T2_lastname = 'MOYER') .        }
student_1,Find all students taught by MARROTTE KIRK. Output first and last names of students.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T2_firstname = 'MARROTTE' && ?T2_lastname = 'KIRK') .        }
student_1,Find the first and last name of all the teachers that teach EVELINA BROMLEY.,SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_firstname = 'EVELINA' && ?T2_lastname = 'BROMLEY') .        }
student_1,Find the last names of all the teachers that teach GELL TAMI.,SELECT ?T1_lastname WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_firstname = 'GELL' && ?T2_lastname = 'TAMI') .        }
student_1,How many students does LORIA ONDERSMA teaches?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T2_firstname = 'LORIA' && ?T2_lastname = 'ONDERSMA') .        }
student_1,How many students does KAWA GORDON teaches?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T2_firstname = 'KAWA' && ?T2_lastname = 'GORDON') .        }
student_1,Find the number of students taught by TARRING LEIA.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T2_firstname = 'TARRING' && ?T2_lastname = 'LEIA') .        }
student_1,How many students are taught by teacher TARRING LEIA?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T2_firstname = 'TARRING' && ?T2_lastname = 'LEIA') .        }
student_1,How many teachers does the student named CHRISSY NABOZNY have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_firstname = 'CHRISSY' && ?T2_lastname = 'NABOZNY') .        }
student_1,How many teachers does the student named MADLOCK RAY have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :teachers\#ref-list_id ?T2 . FILTER(?T2_firstname = 'MADLOCK' && ?T2_lastname = 'RAY') .        }
student_1,Find all first-grade students who are NOT taught by OTHA MOYER. Report their first and last names.,SELECT distinct?col1?col2 WHERE { { SELECT DISTINCT (?T1_firstname as ?col1) (?T1_lastname as ?col2) WHERE { ?T1 a :list . ?T1 :list\#firstname ?T1_firstname . ?T1 :list\#lastname ?T1_lastname . ?T1 :list\#grade ?T1_grade . FILTER(?T1_grade = 1) .   }}  MINUS {SELECT (?T2_firstname as ?col1) (?T2_lastname as ?col2) WHERE { ?T2 :list\#ref-teachers_id ?T3 . FILTER(?T3_firstname = 'OTHA' && ?T3_lastname = 'MOYER') .        }     } }
student_1,What are the first and last names of the first-grade students who are NOT taught by teacher OTHA MOYER?,SELECT distinct?col1?col2 WHERE { { SELECT DISTINCT (?T1_firstname as ?col1) (?T1_lastname as ?col2) WHERE { ?T1 a :list . ?T1 :list\#firstname ?T1_firstname . ?T1 :list\#lastname ?T1_lastname . ?T1 :list\#grade ?T1_grade . FILTER(?T1_grade = 1) .   }}  MINUS {SELECT (?T2_firstname as ?col1) (?T2_lastname as ?col2) WHERE { ?T2 :list\#ref-teachers_id ?T3 . FILTER(?T3_firstname = 'OTHA' && ?T3_lastname = 'MOYER') .        }     } }
student_1,Find the last names of the students in third grade that are not taught by COVIN JEROME.,SELECT DISTINCT ?T1_lastname WHERE { ?T1 :list\#ref-teachers_id ?T2 . FILTER(?T1_grade = 3 && ?T2_firstname != 'COVIN' && ?T2_lastname != 'JEROME') .        }
student_1,"For each grade, report the grade, the number of classrooms in which it is taught and the total number of students in the grade.",SELECT DISTINCT ?T1_grade (count(DISTINCT ?T1_classroom) as ?aggregation_T1_classroom_190 ) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :list\#grade ?T1_grade . ?T1 :list\#classroom ?T1_classroom .        } GROUP BY ?T1_grade
student_1,"For each grade, return the grade number, the number of classrooms used for the grade, and the total number of students enrolled in the grade.",SELECT DISTINCT ?T1_grade (count(DISTINCT ?T1_classroom) as ?aggregation_T1_classroom_187 ) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :list\#grade ?T1_grade . ?T1 :list\#classroom ?T1_classroom .        } GROUP BY ?T1_grade
student_1,"For each classroom, report the classroom number and the number of grades using it.",SELECT DISTINCT ?T1_classroom (count(DISTINCT ?T1_grade) as ?aggregation_T1_grade_0 ) WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade .        } GROUP BY ?T1_classroom
student_1,"For each classroom, show the classroom number and count the number of distinct grades that use the room.",SELECT DISTINCT ?T1_classroom (count(DISTINCT ?T1_grade) as ?aggregation_T1_grade_184 ) WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade .        } GROUP BY ?T1_classroom
student_1,Which classroom has the most students?,SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom .        } GROUP BY ?T1_classroom  ORDER BY DESC (?aggregation_all) LIMIT 1
student_1,Report the number of students in each classroom.,SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom .        } GROUP BY ?T1_classroom
student_1,"For each grade 0 classroom, report the total number of students.",SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade . FILTER(?T1_grade = 0) .        } GROUP BY ?T1_classroom
student_1,Report the total number of students for each fourth-grade classroom.,SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom . ?T1 :list\#grade ?T1_grade . FILTER(?T1_grade = 4) .        } GROUP BY ?T1_classroom
student_1,Find the name of the teacher who teaches the largest number of students.,SELECT ?T1_firstname (count( *) as ?aggregation_all) ?T1_lastname WHERE { ?T1 :teachers\#ref-list_id ?T2 .        } GROUP BY ?T1_firstname ?T1_lastname  ORDER BY DESC (?aggregation_all) LIMIT 1
student_1,Find the number of students in one classroom.,SELECT (count( *) as ?aggregation_all) ?T1_classroom WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom .        } GROUP BY ?T1_classroom
student_1,How many students does one classroom have?,SELECT (count( *) as ?aggregation_all) ?T1_classroom WHERE { ?T1 a :list . ?T1 :list\#classroom ?T1_classroom .        } GROUP BY ?T1_classroom
company_employee,How many companies are headquartered in the US?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters . FILTER(?T1_headquarters = 'USA') .        }
company_employee,List the names of companies by ascending number of sales.,SELECT ?T1_name WHERE { ?T1 a :company . ?T1 :company\#name ?T1_name . ?T1 :company\#sales_in_billion ?T1_sales_in_billion .        }  ORDER BY ASC (?T1_sales_in_billion)
company_employee,What are the headquarters and industries of all companies?,SELECT ?T1_headquarters ?T1_industry WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters . ?T1 :company\#industry ?T1_industry .        }
company_employee,Show the names of companies in the banking or retailing industry?,SELECT ?T1_name WHERE { ?T1 a :company . ?T1 :company\#name ?T1_name . ?T1 :company\#industry ?T1_industry . ?T1 :company\#industry ?T1_industry . FILTER(?T1_industry = 'Banking' || ?T1_industry = 'Retailing') .        }
company_employee,What is the maximum and minimum market value of companies?,SELECT (max( ?T1_market_value_in_billion) as ?aggregation_T1_market_value_in_billion_142 ) (min( ?T1_market_value_in_billion) as ?aggregation_T1_market_value_in_billion_176 ) WHERE { ?T1 a :company . ?T1 :company\#market_value_in_billion ?T1_market_value_in_billion . ?T1 :company\#market_value_in_billion ?T1_market_value_in_billion .        }
company_employee,What is the headquarter of the company with the largest sales?,SELECT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters . ?T1 :company\#sales_in_billion ?T1_sales_in_billion .        }   ORDER BY DESC (?T1_sales_in_billion) LIMIT 1
company_employee,Show the most common headquarter for companies.,SELECT ?T1_headquarters (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters .        } GROUP BY ?T1_headquarters  ORDER BY DESC (?aggregation_all) LIMIT 1
company_employee,Show the headquarters that have at least two companies.,SELECT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company\#headquarters ?T1_headquarters .        } GROUP BY ?T1_headquarters   HAVING(count( *)  >= 2)
