kg_name,question,query
college_1,How many departments does the college has?,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_165 ) WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name .        }
college_1,How many different departments are there?,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_39 ) WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name .        }
college_1,How many courses are offered by the Computer Info. Systems department?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T2 a :department . ?T1 :course\#ref-dept_code ?T2 .  ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Computer Info. Systems') .        }
college_1,How many sections does course ACCT-211 has?,SELECT DISTINCT (count(DISTINCT ?T1_class_section) as ?aggregation_T1_class_section_138 ) WHERE { ?T1 a :class . ?T1 :class\#class_section ?T1_class_section . ?T1 :class\#crs_code ?T1_crs_code . FILTER(?T1_crs_code = 'ACCT-211') .        }
college_1,Find the total credits of all classes offered by each department.,SELECT (sum( ?T1_crs_credit) as ?aggregation_T1_crs_credit_130 ) ?T1_dept_code WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,What are the total number of credits offered by each department?,SELECT (sum( ?T1_crs_credit) as ?aggregation_T1_crs_credit_194 ) ?T1_dept_code WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,Find the name of the department that offers the largest number of credits of all classes.,SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :course\#crs_credit ?T2_crs_credit .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T2_crs_credit) as ?aggregation_T2_crs_credit_113 )) LIMIT 1
college_1,Which department offers the most credits all together?,SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :course\#crs_credit ?T2_crs_credit .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T2_crs_credit) as ?aggregation_T2_crs_credit_32 )) LIMIT 1
college_1,How many students enrolled in class ACCT-211?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :enroll . ?T2 a :class . ?T1 :enroll\#ref-class_code ?T2 .  ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'ACCT-211') .        }
college_1,What are the total number of students enrolled in ACCT-211?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :enroll . ?T2 a :class . ?T1 :enroll\#ref-class_code ?T2 .  ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'ACCT-211') .        }
college_1,What is the first name of each student enrolled in class ACCT-211?,SELECT ?T1_stu_fname WHERE { ?T1 a :student . ?T13 a :enroll . ?T13 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :class\#crs_code ?T2_crs_code . ?T2 a :class . ?T13 :enroll\#ref-class_code ?T2 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'ACCT-211') .        }
college_1,What are the first names of all students in course ACCT-211?,SELECT ?T1_stu_fname WHERE { ?T1 a :student . ?T13 a :enroll . ?T13 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :class\#crs_code ?T2_crs_code . ?T2 a :class . ?T13 :enroll\#ref-class_code ?T2 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'ACCT-211') .        }
college_1,How many employees are there all together?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employee .        }
college_1,How many professors do have a Ph.D. degree?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.') .        }
college_1,What is the total number of professors with a Ph.D. ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.') .        }
college_1,What is the name of the department that has the largest number of students enrolled?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T13 a :employee . ?T1 :department\#ref-emp_num ?T13 .  ?T1 :department\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,What is the name of the department with the most students enrolled?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T13 a :employee . ?T1 :department\#ref-emp_num ?T13 .  ?T1 :department\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,list names of all departments ordered by their names.,SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_name ?T1_dept_name .        }  ORDER BY ASC (?T1_dept_name)
college_1,What are the names of all departments in alphabetical order?,SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_name ?T1_dept_name .        }  ORDER BY ASC (?T1_dept_name)
college_1,List the codes of all courses that take place in room KLR209.,SELECT ?T1_class_code WHERE { ?T1 a :class . ?T1 :class\#class_code ?T1_class_code . ?T1 :class\#class_room ?T1_class_room . FILTER(?T1_class_room = 'KLR209') .        }
college_1,What are the codes of all the courses that are located in room KLR209?,SELECT ?T1_class_code WHERE { ?T1 a :class . ?T1 :class\#class_code ?T1_class_code . ?T1 :class\#class_room ?T1_class_room . FILTER(?T1_class_room = 'KLR209') .        }
college_1,List the first name of all employees with job code PROF ordered by their date of birth.,SELECT ?T1_emp_fname WHERE { ?T1 a :employee . ?T1 :employee\#emp_fname ?T1_emp_fname . ?T1 :employee\#emp_dob ?T1_emp_dob . ?T1 :employee\#emp_jobcode ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') .        }  ORDER BY ASC (?T1_emp_dob)
college_1,Find the first names and offices of all professors sorted by alphabetical order of their first name.,SELECT ?T1_emp_fname ?T2_prof_office WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T1 :employee\#emp_fname ?T1_emp_fname .        }  ORDER BY ASC (?T1_emp_fname)
college_1,What is the first and last name of the oldest employee?,SELECT ?T1_emp_fname ?T1_emp_lname WHERE { ?T1 a :employee . ?T1 :employee\#emp_fname ?T1_emp_fname . ?T1 :employee\#emp_lname ?T1_emp_lname . ?T1 :employee\#emp_dob ?T1_emp_dob .        }   ORDER BY ASC (?T1_emp_dob) LIMIT 1
college_1,What is the first name of students who got grade C in any class?,SELECT DISTINCT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C') .        }
college_1,What are the first names of all students who got a grade C in a class?,SELECT DISTINCT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C') .        }
college_1,What is the name of the department with the fewest professors?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY ASC (?aggregation_all) LIMIT 1
college_1,What is the name of department where has the largest number of professors with a Ph.D. degree?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :professor\#dept_code ?T2_dept_code . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . FILTER(?T2_prof_high_degree = 'Ph.D.') .        } GROUP BY ?T1_dept_name ?T2_dept_code  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,Which department has the most professors with a Ph.D.?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :professor\#dept_code ?T2_dept_code . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . FILTER(?T2_prof_high_degree = 'Ph.D.') .        } GROUP BY ?T1_dept_name ?T2_dept_code  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,What are the first names of the professors who do not teach a class.,SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T1 :employee\#emp_fname ?T1_emp_fname . ?T1 :employee\#emp_jobcode ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') .   }}  MINUS {SELECT (?T2_emp_fname as ?col1) WHERE { ?T2 a :employee . ?T2 :employee\#emp_fname ?T2_emp_fname .        }     } }
college_1,What are the first names of all professors not teaching any classes?,SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T1 :employee\#emp_fname ?T1_emp_fname . ?T1 :employee\#emp_jobcode ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') .   }}  MINUS {SELECT (?T2_emp_fname as ?col1) WHERE { ?T2 a :employee . ?T2 :employee\#emp_fname ?T2_emp_fname .        }     } }
college_1,What is the first names of the professors from the history department who do not teach a class.,SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T2 a :department . ?T2 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'History') .   }}  MINUS {SELECT (?T3_emp_fname as ?col1) WHERE { ?T3 a :employee . ?T3 :employee\#emp_fname ?T3_emp_fname .        }     } }
college_1,What are the first names of all history professors who do not teach?,SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T2 a :department . ?T2 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'History') .   }}  MINUS {SELECT (?T3_emp_fname as ?col1) WHERE { ?T3 a :employee . ?T3 :employee\#emp_fname ?T3_emp_fname .        }     } }
college_1,What are the last name and office of all history professors?,SELECT ?T1_emp_lname ?T2_prof_office WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_lname ?T1_emp_lname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :department\#dept_name ?T3_dept_name . ?T3 a :department . ?T2 :professor\#ref-dept_code ?T3 .  ?T1 :employee\#emp_lname ?T1_emp_lname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :department\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'History') .        }
college_1,Find the last name and hire date of the professor who is in office DRE 102.,SELECT ?T1_emp_lname ?T1_emp_hiredate WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_lname ?T1_emp_lname . ?T1 :employee\#emp_hiredate ?T1_emp_hiredate . ?T2 :professor\#prof_office ?T2_prof_office . FILTER(?T2_prof_office = 'DRE 102') .        }
college_1,How many professors who has a either Ph.D. or MA degree?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.' || ?T1_prof_high_degree = 'MA') .        }
college_1,How many professors attained either Ph.D. or Masters degrees?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.' || ?T1_prof_high_degree = 'MA') .        }
college_1,Find the first name of the professor who is teaching two courses with code CIS-220 and QM-261.,SELECT DISTINCT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'CIS-220') . FILTER (?T1_emp_fname in (?T3_emp_fname)) .   ?T3 a :employee . ?T4 a :class . ?T4 :class\#ref-prof_num ?T3 .  ?T3 :employee\#emp_fname ?T3_emp_fname . ?T4 :class\#crs_code ?T4_crs_code .  FILTER(?T4_crs_code = 'QM-261') .             }
college_1,What is the first name of the professor who is teaching CIS-220 and QM-261?,SELECT DISTINCT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'CIS-220') . FILTER (?T1_emp_fname in (?T3_emp_fname)) .   ?T3 a :employee . ?T4 a :class . ?T4 :class\#ref-prof_num ?T3 .  ?T3 :employee\#emp_fname ?T3_emp_fname . ?T4 :class\#crs_code ?T4_crs_code .  FILTER(?T4_crs_code = 'QM-261') .             }
college_1,Find the first name of student who is taking classes from accounting and Computer Info. Systems departments,SELECT DISTINCT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :department . ?T1 :student\#ref-dept_name ?T2 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') . FILTER (?T1_stu_fname in (?T3_stu_fname)) .   ?T3 a :student . ?T4 a :department . ?T3 :student\#ref-dept_name ?T4 .  ?T3 :student\#stu_fname ?T3_stu_fname . ?T4 :department\#dept_name ?T4_dept_name .  FILTER(?T4_dept_name = 'Computer Info. Systems') .             }
college_1,What is the average GPA of students taking ACCT-211?,SELECT (avg( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_130 ) WHERE { ?T1 a :student . ?T13 a :enroll . ?T13 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_gpa ?T1_stu_gpa . ?T2 :class\#crs_code ?T2_crs_code . ?T2 a :class . ?T13 :enroll\#ref-class_code ?T2 .  ?T1 :student\#stu_gpa ?T1_stu_gpa . ?T2 :class\#crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'ACCT-211') .        }
college_1,What is the department name of the students with lowest gpa belongs to?,SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\#ref-dept_name ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :student\#stu_gpa ?T2_stu_gpa .        }   ORDER BY ASC (?T2_stu_gpa) LIMIT 1
college_1,Find the first name and gpa of the students whose gpa is lower than the average gpa of all students.,SELECT ?T1_stu_fname ?T1_stu_gpa WHERE { ?T1 a :student . ?T1 :student\#stu_fname ?T1_stu_fname . ?T1 :student\#stu_gpa ?T1_stu_gpa . ?T1 :student\#stu_gpa ?T1_stu_gpa . FILTER(?T1_stu_gpa < (?aggregation_T22_stu_gpa_95)) .       {SELECT (avg( ?T22_stu_gpa) as ?aggregation_T22_stu_gpa_95 ) WHERE { ?T22 a :student . ?T22 :student\#stu_gpa ?T22_stu_gpa .        }    } }
college_1,Find the name and address of the department that has the highest number of students.,SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T1_dept_address WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\#ref-dept_name ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_address ?T1_dept_address .        } GROUP BY ?T1_dept_name ?T1_dept_address  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,What is the name and address of the department with the most students?,SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T1_dept_address WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\#ref-dept_name ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_address ?T1_dept_address .        } GROUP BY ?T1_dept_name ?T1_dept_address  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,"Find the name, address, number of students in the departments that have the top 3 highest number of students.",SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T1_dept_address (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\#ref-dept_name ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#dept_address ?T1_dept_address .        } GROUP BY ?T1_dept_name ?T1_dept_address  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,Find the first name and office of the professor who is in the history department and has a Ph.D. degree.,SELECT ?T1_emp_fname ?T2_prof_office WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :department\#dept_name ?T3_dept_name . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . ?T3 a :department . ?T2 :professor\#ref-dept_code ?T3 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :department\#dept_name ?T3_dept_name . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . FILTER(?T3_dept_name = 'History' && ?T2_prof_high_degree = 'Ph.D.') .        }
college_1,Find the first names of all instructors who have taught some course and the course code.,SELECT ?T1_emp_fname ?T2_crs_code WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#crs_code ?T2_crs_code .        }
college_1,Find the first names of all instructors who have taught some course and the course description.,SELECT ?T1_emp_fname ?T2_crs_description WHERE { ?T1 a :employee . ?T13 a :department . ?T13 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :course\#crs_description ?T2_crs_description . ?T2 a :course . ?T2 :course\#ref-dept_code ?T13 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :course\#crs_description ?T2_crs_description .        }
college_1,Find the first names and offices of all instructors who have taught some course and also find the course description.,SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T14 a :department . ?T2 :professor\#ref-dept_code ?T14 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T3 a :course . ?T3 :course\#ref-dept_code ?T14 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description .        }
college_1,"What are the first names, office locations of all lecturers who have taught some course?",SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T14 a :department . ?T2 :professor\#ref-dept_code ?T14 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T3 a :course . ?T3 :course\#ref-dept_code ?T14 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description .        }
college_1,Find the first names and offices of all instructors who have taught some course and the course description and the department name.,SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description ?T4_dept_name WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T4 :department\#dept_name ?T4_dept_name . ?T4 a :department . ?T2 :professor\#ref-dept_code ?T4 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T4 :department\#dept_name ?T4_dept_name . ?T3 a :course . ?T3 :course\#ref-dept_code ?T4 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T4 :department\#dept_name ?T4_dept_name .        }
college_1,"What are the first names, office locations, and departments of all instructors, and also what are the descriptions of the courses they teach?",SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description ?T4_dept_name WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T4 :department\#dept_name ?T4_dept_name . ?T4 a :department . ?T2 :professor\#ref-dept_code ?T4 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T4 :department\#dept_name ?T4_dept_name . ?T3 a :course . ?T3 :course\#ref-dept_code ?T4 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_office ?T2_prof_office . ?T3 :course\#crs_description ?T3_crs_description . ?T4 :department\#dept_name ?T4_dept_name .        }
college_1,Find names of all students who took some course and the course description.,SELECT ?T1_stu_fname ?T1_stu_lname ?T2_crs_description WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\#ref-dept_name ?T13 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T1 :student\#stu_lname ?T1_stu_lname . ?T2 :course\#crs_description ?T2_crs_description . ?T2 a :course . ?T2 :course\#ref-dept_code ?T13 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T1 :student\#stu_lname ?T1_stu_lname . ?T2 :course\#crs_description ?T2_crs_description .        }
college_1,Find names of all students who took some course and got A or C.,SELECT ?T1_stu_fname ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T1 :student\#stu_lname ?T1_stu_lname . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C' || ?T2_enroll_grade = 'A') .        }
college_1,What are the names of all students taking a course who received an A or C?,SELECT ?T1_stu_fname ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname . ?T1 :student\#stu_lname ?T1_stu_lname . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C' || ?T2_enroll_grade = 'A') .        }
college_1,Find the first names of all professors in the Accounting department who is teaching some course and the class room.,SELECT ?T1_emp_fname ?T2_class_room WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#class_room ?T2_class_room . ?T3 :department\#dept_name ?T3_dept_name . ?T3 a :department . ?T3 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#class_room ?T2_class_room . ?T3 :department\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Accounting') .        }
college_1,What are the first names of all Accounting professors who teach and what are the classrooms of the courses they teach?,SELECT ?T1_emp_fname ?T2_class_room WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#class_room ?T2_class_room . ?T3 :department\#dept_name ?T3_dept_name . ?T3 a :department . ?T3 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :class\#class_room ?T2_class_room . ?T3 :department\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Accounting') .        }
college_1,Find the first names and degree of all professors who are teaching some class in Computer Info. Systems department.,SELECT DISTINCT ?T1_emp_fname ?T2_prof_high_degree WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . ?T3 :department\#dept_name ?T3_dept_name . ?T3 a :department . ?T2 :professor\#ref-dept_code ?T3 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . ?T3 :department\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Computer Info. Systems') .        }
college_1,What are the different first names and highest degree attained for professors teaching in the Computer Information Systems department?,SELECT DISTINCT ?T1_emp_fname ?T2_prof_high_degree WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :professor\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . ?T3 :department\#dept_name ?T3_dept_name . ?T3 a :department . ?T2 :professor\#ref-dept_code ?T3 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T2 :professor\#prof_high_degree ?T2_prof_high_degree . ?T3 :department\#dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Computer Info. Systems') .        }
college_1,What is the last name of the student who got a grade A in the class with code 10018.,SELECT ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_lname ?T1_stu_lname . ?T2 :enroll\#enroll_grade ?T2_enroll_grade . ?T2 :enroll\#class_code ?T2_class_code . FILTER(?T2_enroll_grade = 'A' && ?T2_class_code = '10018') .        }
college_1,Find the first names of professors who are teaching more than one class.,SELECT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname .        } GROUP BY ?T1_emp_fname   HAVING(count( *)  > 1)
college_1,What are the first names of all professors who teach more than one class?,SELECT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :class\#ref-prof_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname .        } GROUP BY ?T1_emp_fname   HAVING(count( *)  > 1)
college_1,Find the first names of students who took exactly one class.,SELECT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname .        } GROUP BY ?T1_stu_fname   HAVING(count( *)  = 1)
college_1,What are the first names of student who only took one course?,SELECT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :enroll\#ref-stu_num ?T1 .  ?T1 :student\#stu_fname ?T1_stu_fname .        } GROUP BY ?T1_stu_fname   HAVING(count( *)  = 1)
college_1,Find the name of department that offers the class whose description has the word 'Statistics'.,"SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :course\#crs_description ?T2_crs_description . FILTER(contains (?T2_crs_description, 'Statistics')) .        }"
college_1,What is the name of the department that offers a course that has a description including the word 'Statistics'?,"SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\#ref-dept_code ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :course\#crs_description ?T2_crs_description . FILTER(contains (?T2_crs_description, 'Statistics')) .        }"
sports_competition,How many clubs are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club .        }
sports_competition,What is the total number of clubs?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club .        }
sports_competition,List the distinct region of clubs in ascending alphabetical order.,SELECT DISTINCT ?T1_region WHERE { ?T1 a :club . ?T1 :club\#region ?T1_region . ?T1 :club\#region ?T1_region .        }  ORDER BY ASC (?T1_region)
sports_competition,What is the average number of gold medals for clubs?,SELECT (avg( ?T1_gold) as ?aggregation_T1_gold_22 ) WHERE { ?T1 a :club_rank . ?T1 :club_rank\#gold ?T1_gold .        }
sports_competition,What is the average number of gold medals for a club?,SELECT (avg( ?T1_gold) as ?aggregation_T1_gold_112 ) WHERE { ?T1 a :club_rank . ?T1 :club_rank\#gold ?T1_gold .        }
sports_competition,What are the types and countries of competitions?,SELECT ?T1_competition_type ?T1_country WHERE { ?T1 a :competition . ?T1 :competition\#competition_type ?T1_competition_type . ?T1 :competition\#country ?T1_country .        }
sports_competition,What are the distinct years in which the competitions type is not 'Tournament'?,SELECT DISTINCT ?T1_year WHERE { ?T1 a :competition . ?T1 :competition\#year ?T1_year . ?T1 :competition\#competition_type ?T1_competition_type . FILTER(?T1_competition_type != 'Tournament') .        }
sports_competition,What are the maximum and minimum number of silver medals for clubs.,SELECT (max( ?T1_silver) as ?aggregation_T1_silver_157 ) (min( ?T1_silver) as ?aggregation_T1_silver_76 ) WHERE { ?T1 a :club_rank . ?T1 :club_rank\#silver ?T1_silver . ?T1 :club_rank\#silver ?T1_silver .        }
sports_competition,How many clubs have total medals less than 10?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club_rank . ?T1 :club_rank\#total ?T1_total . FILTER(?T1_total < 10) .        }
sports_competition,What is the total number of clubs that have less than 10 medals in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club_rank . ?T1 :club_rank\#total ?T1_total . FILTER(?T1_total < 10) .        }
sports_competition,List all club names in ascending order of start year.,SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :club\#name ?T1_name . ?T1 :club\#start_year ?T1_start_year .        }  ORDER BY ASC (?T1_start_year)
sports_competition,What are the names of all the clubs starting with the oldest?,SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :club\#name ?T1_name . ?T1 :club\#start_year ?T1_start_year .        }  ORDER BY ASC (?T1_start_year)
sports_competition,List all club names in descending alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :club\#name ?T1_name . ?T1 :club\#name ?T1_name .        }  ORDER BY DESC (?T1_name)
sports_competition,Please show the names and the players of clubs.,SELECT ?T1_name ?T2_player_id WHERE { ?T1 a :club . ?T2 a :player . ?T2 :player\#ref-club_id ?T1 .  ?T1 :club\#name ?T1_name . ?T2 :player\#player_id ?T2_player_id .        }
sports_competition,What are the names and players of all the clubs?,SELECT ?T1_name ?T2_player_id WHERE { ?T1 a :club . ?T2 a :player . ?T2 :player\#ref-club_id ?T1 .  ?T1 :club\#name ?T1_name . ?T2 :player\#player_id ?T2_player_id .        }
sports_competition,Show the names of clubs that have players with position 'Right Wing'.,SELECT ?T1_name WHERE { ?T1 a :club . ?T2 a :player . ?T2 :player\#ref-club_id ?T1 .  ?T1 :club\#name ?T1_name . ?T2 :player\#position ?T2_position . FILTER(?T2_position = 'Right Wing') .        }
sports_competition,What are the names of the clubs that have players in the position of 'Right Wing'?,SELECT ?T1_name WHERE { ?T1 a :club . ?T2 a :player . ?T2 :player\#ref-club_id ?T1 .  ?T1 :club\#name ?T1_name . ?T2 :player\#position ?T2_position . FILTER(?T2_position = 'Right Wing') .        }
sports_competition,What is the average points of players from club with name 'AIB'.,SELECT (avg( ?T1_points) as ?aggregation_T1_points_187 ) WHERE { ?T1 a :player . ?T2 a :club . ?T1 :player\#ref-club_id ?T2 .  ?T1 :player\#points ?T1_points . ?T2 :club\#name ?T2_name . FILTER(?T2_name = 'AIB') .        }
