kg_name,question,query
college_2,What are the names of instructors who didn't teach?,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#id ?T1_id . FILTER(?T1_id not in (?T22_id)) .       {SELECT ?T22_id WHERE { ?T22 a :teaches . ?T22 :teaches\#id ?T22_id .        }    } }
college_2,Find the id of instructors who didn't teach any courses?,SELECT distinct?col1 WHERE { { SELECT (?T1_id as ?col1) WHERE { ?T1 a :instructor . ?T1 :instructor\#id ?T1_id .   }}  MINUS {SELECT (?T2_id as ?col1) WHERE { ?T2 a :teaches . ?T2 :teaches\#id ?T2_id .        }     } }
college_2,What are the ids of instructors who didnt' teach?,SELECT distinct?col1 WHERE { { SELECT (?T1_id as ?col1) WHERE { ?T1 a :instructor . ?T1 :instructor\#id ?T1_id .   }}  MINUS {SELECT (?T2_id as ?col1) WHERE { ?T2 a :teaches . ?T2 :teaches\#id ?T2_id .        }     } }
college_2,Find the names of instructors who didn't each any courses in any Spring semester.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#id ?T1_id . FILTER(?T1_id not in (?T22_semester)) .       {SELECT ?T22_id WHERE { ?T22 a :teaches . ?T22 :teaches\#id ?T22_id . ?T22 :teaches\#semester ?T22_semester . FILTER(?T22_semester = 'Spring') .        }    } }
college_2,What are the names of instructors who didn't teach courses in the Spring?,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#id ?T1_id . FILTER(?T1_id not in (?T22_semester)) .       {SELECT ?T22_id WHERE { ?T22 a :teaches . ?T22 :teaches\#id ?T22_id . ?T22 :teaches\#semester ?T22_semester . FILTER(?T22_semester = 'Spring') .        }    } }
college_2,Find the name of the department which has the highest average salary of professors.,SELECT ?T1_dept_name WHERE { ?T1 a :instructor . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#salary ?T1_salary .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((avg( ?T1_salary) as ?aggregation_T1_salary_133 )) LIMIT 1
college_2,Which department has the highest average instructor salary?,SELECT ?T1_dept_name WHERE { ?T1 a :instructor . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#salary ?T1_salary .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((avg( ?T1_salary) as ?aggregation_T1_salary_18 )) LIMIT 1
college_2,Find the number and averaged salary of all instructors who are in the department with the highest budget.,SELECT (avg( ?T1_salary) as ?aggregation_T1_salary_195 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :instructor . ?T2 a :department . ?T1 :instructor\#ref-dept_name ?T2 .  ?T1 :instructor\#salary ?T1_salary . ?T2 :department\#budget ?T2_budget .        }   ORDER BY DESC (?T2_budget) LIMIT 1
college_2,What is the title and credits of the course that is taught in the largest classroom (with the highest capacity)?,SELECT ?T1_title ?T1_credits WHERE { ?T1 a :course . ?T13 a :section . ?T13 :section\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title . ?T1 :course\#credits ?T1_credits . ?T2 :classroom\#capacity ?T2_capacity . ?T2 a :classroom . ?T13 :section\#ref-building ?T2 .  ?T1 :course\#title ?T1_title . ?T1 :course\#credits ?T1_credits . ?T2 :classroom\#capacity ?T2_capacity . FILTER(?T2_capacity = (?aggregation_T23_capacity_141)) .       {SELECT (max( ?T23_capacity) as ?aggregation_T23_capacity_141 ) WHERE { ?T23 a :classroom . ?T23 :classroom\#capacity ?T23_capacity .        }    } }
college_2,Give the title and credits for the course that is taught in the classroom with the greatest capacity.,SELECT ?T1_title ?T1_credits WHERE { ?T1 a :course . ?T13 a :section . ?T13 :section\#ref-course_id ?T1 .  ?T1 :course\#title ?T1_title . ?T1 :course\#credits ?T1_credits . ?T2 :classroom\#capacity ?T2_capacity . ?T2 a :classroom . ?T13 :section\#ref-building ?T2 .  ?T1 :course\#title ?T1_title . ?T1 :course\#credits ?T1_credits . ?T2 :classroom\#capacity ?T2_capacity . FILTER(?T2_capacity = (?aggregation_T23_capacity_187)) .       {SELECT (max( ?T23_capacity) as ?aggregation_T23_capacity_187 ) WHERE { ?T23 a :classroom . ?T23 :classroom\#capacity ?T23_capacity .        }    } }
college_2,Find the name of students who didn't take any course from Biology department.,SELECT ?T1_name WHERE { ?T1 a :student . ?T1 :student\#name ?T1_name . ?T1 :student\#id ?T1_id . FILTER(?T1_id not in (?T23_dept_name)) .       {SELECT ?T22_id WHERE { ?T22 a :takes . ?T34 a :section . ?T22 :takes\#ref-course_id ?T34 .  ?T22 :takes\#id ?T22_id . ?T23 :course\#dept_name ?T23_dept_name . ?T23 a :course . ?T34 :section\#ref-course_id ?T23 .  ?T22 :takes\#id ?T22_id . ?T23 :course\#dept_name ?T23_dept_name . FILTER(?T23_dept_name = 'Biology') .        }    } }
college_2,What are the names of students who haven't taken any Biology courses?,SELECT ?T1_name WHERE { ?T1 a :student . ?T1 :student\#name ?T1_name . ?T1 :student\#id ?T1_id . FILTER(?T1_id not in (?T23_dept_name)) .       {SELECT ?T22_id WHERE { ?T22 a :takes . ?T34 a :section . ?T22 :takes\#ref-course_id ?T34 .  ?T22 :takes\#id ?T22_id . ?T23 :course\#dept_name ?T23_dept_name . ?T23 a :course . ?T34 :section\#ref-course_id ?T23 .  ?T22 :takes\#id ?T22_id . ?T23 :course\#dept_name ?T23_dept_name . FILTER(?T23_dept_name = 'Biology') .        }    } }
college_2,Find the total number of students and total number of instructors for each department.,SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_129 ) (count(DISTINCT ?T2_id) as ?aggregation_T2_id_146 ) ?T2_dept_name WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\#ref-dept_name ?T13 .  ?T1 :student\#id ?T1_id . ?T2 :instructor\#id ?T2_id . ?T2 :instructor\#dept_name ?T2_dept_name . ?T2 a :instructor . ?T2 :instructor\#ref-dept_name ?T13 .  ?T1 :student\#id ?T1_id . ?T2 :instructor\#id ?T2_id . ?T2 :instructor\#dept_name ?T2_dept_name .        } GROUP BY ?T2_dept_name
college_2,How many students and instructors are in each department?,SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_95 ) (count(DISTINCT ?T2_id) as ?aggregation_T2_id_3 ) ?T2_dept_name WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\#ref-dept_name ?T13 .  ?T1 :student\#id ?T1_id . ?T2 :instructor\#id ?T2_id . ?T2 :instructor\#dept_name ?T2_dept_name . ?T2 a :instructor . ?T2 :instructor\#ref-dept_name ?T13 .  ?T1 :student\#id ?T1_id . ?T2 :instructor\#id ?T2_id . ?T2 :instructor\#dept_name ?T2_dept_name .        } GROUP BY ?T2_dept_name
college_2,Find the name of students who have taken the prerequisite course of the course with title International Finance.,SELECT ?T1_name WHERE { ?T1 a :student . ?T2 a :takes . ?T2 :takes\#ref-id ?T1 .  ?T1 :student\#name ?T1_name . ?T2 :takes\#course_id ?T2_course_id . FILTER(?T2_course_id in (?T24_title)) .       {SELECT ?T23_prereq_id WHERE { ?T23 a :prereq . ?T24 a :course . ?T23 :prereq\#ref-course_id ?T24 .  ?T23 :prereq\#prereq_id ?T23_prereq_id . ?T24 :course\#title ?T24_title . FILTER(?T24_title = 'International Finance') .        }    } }
college_2,Find the name and salary of instructors whose salary is below the average salary of the instructors in the Physics department.,SELECT ?T1_name ?T1_salary WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary . ?T1 :instructor\#salary ?T1_salary . FILTER(?T1_salary < (?T22_dept_name)) .       {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_142 ) WHERE { ?T22 a :instructor . ?T22 :instructor\#salary ?T22_salary . ?T22 :instructor\#dept_name ?T22_dept_name . FILTER(?T22_dept_name = 'Physics') .        }    } }
college_2,Find the name of students who took some course offered by Statistics department.,SELECT ?T1_name WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\#ref-dept_name ?T13 .  ?T1 :student\#name ?T1_name . ?T2 :course\#dept_name ?T2_dept_name . ?T2 a :course . ?T2 :course\#ref-dept_code ?T13 .  ?T1 :student\#name ?T1_name . ?T2 :course\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Statistics') .        }
college_2,What are the names of students who have taken Statistics courses?,SELECT ?T1_name WHERE { ?T1 a :student . ?T13 a :department . ?T1 :student\#ref-dept_name ?T13 .  ?T1 :student\#name ?T1_name . ?T2 :course\#dept_name ?T2_dept_name . ?T2 a :course . ?T2 :course\#ref-dept_code ?T13 .  ?T1 :student\#name ?T1_name . ?T2 :course\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Statistics') .        }
college_2,"Find the building, room number, semester and year of all courses offered by Psychology department sorted by course titles.",SELECT ?T1_building ?T1_room_number ?T1_semester ?T1_year WHERE { ?T1 a :section . ?T2 a :course . ?T1 :section\#ref-course_id ?T2 .  ?T1 :section\#building ?T1_building . ?T1 :section\#room_number ?T1_room_number . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . ?T2 :course\#title ?T2_title . ?T2 :course\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Psychology') .        }  ORDER BY ASC (?T2_title)
college_2,Find the names of all instructors in computer science department,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Comp. Sci.') .        }
college_2,What are the names of all instructors in the Comp. Sci. department?,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Comp. Sci.') .        }
college_2,Find the names of all instructors in Comp. Sci. department with salary > 80000.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#salary ?T1_salary . FILTER(?T1_dept_name = 'Comp. Sci.' && ?T1_salary > 80000) .        }
college_2,Find the names of all instructors who have taught some course and the course_id.,SELECT ?T1_name ?T2_course_id WHERE { ?T1 a :instructor . ?T2 a :teaches . ?T2 :teaches\#ref-id ?T1 .  ?T1 :instructor\#name ?T1_name . ?T2 :teaches\#course_id ?T2_course_id .        }
college_2,Find the names of all instructors in the Art department who have taught some course and the course_id.,SELECT ?T1_name ?T2_course_id WHERE { ?T1 a :instructor . ?T2 a :teaches . ?T2 :teaches\#ref-id ?T1 .  ?T1 :instructor\#name ?T1_name . ?T2 :teaches\#course_id ?T2_course_id . ?T1 :instructor\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Art') .        }
college_2,Find the names of all instructors whose name includes the substring dar.,"SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#name ?T1_name . FILTER(contains (?T1_name, 'dar')) .        }"
college_2,What are the names of all instructors with names that include 'dar'?,"SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#name ?T1_name . FILTER(contains (?T1_name, 'dar')) .        }"
college_2,List in alphabetic order the names of all distinct instructors.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
college_2,Find courses that ran in Fall 2009 or in Spring 2010.,SELECT distinct?col1 WHERE { { SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :section . ?T1 :section\#course_id ?T1_course_id . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . FILTER(?T1_semester = 'Fall' && ?T1_year = 2009) .   }} UNION {SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :section . ?T1 :section\#course_id ?T1_course_id . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . FILTER(?T1_semester = 'Spring' && ?T1_year = 2010) .        }      } }
college_2,What are the ids for courses in the Fall of 2009 or the Spring of 2010?,SELECT distinct?col1 WHERE { { SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :section . ?T1 :section\#course_id ?T1_course_id . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . FILTER(?T1_semester = 'Fall' && ?T1_year = 2009) .   }} UNION {SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :section . ?T1 :section\#course_id ?T1_course_id . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . FILTER(?T1_semester = 'Spring' && ?T1_year = 2010) .        }      } }
college_2,Find courses that ran in Fall 2009 and in Spring 2010.,SELECT DISTINCT ?T1_course_id WHERE { ?T1 a :section . ?T1 :section\#course_id ?T1_course_id . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . FILTER(?T1_semester = 'Fall' && ?T1_year = 2009) . FILTER (?T1_course_id in (?T2_course_id)) .   ?T2 a :section . ?T2 :section\#course_id ?T2_course_id . ?T2 :section\#semester ?T2_semester . ?T2 :section\#year ?T2_year .  FILTER(?T2_semester = 'Spring' && ?T2_year = 2010) .             }
college_2,Find courses that ran in Fall 2009 but not in Spring 2010.,SELECT distinct?col1 WHERE { { SELECT (?T1_course_id as ?col1) WHERE { ?T1 a :section . ?T1 :section\#course_id ?T1_course_id . ?T1 :section\#semester ?T1_semester . ?T1 :section\#year ?T1_year . FILTER(?T1_semester = 'Fall' && ?T1_year = 2009) .   }}  MINUS {SELECT (?T2_course_id as ?col1) WHERE { ?T2 a :section . ?T2 :section\#course_id ?T2_course_id . ?T2 :section\#semester ?T2_semester . ?T2 :section\#year ?T2_year . FILTER(?T2_semester = 'Spring' && ?T2_year = 2010) .        }     } }
college_2,Find the salaries of all distinct instructors that are less than the largest salary.,SELECT DISTINCT ?T1_salary WHERE { ?T1 a :instructor . ?T1 :instructor\#salary ?T1_salary . ?T1 :instructor\#salary ?T1_salary . FILTER(?T1_salary < (?aggregation_T22_salary_166)) .       {SELECT (max( ?T22_salary) as ?aggregation_T22_salary_166 ) WHERE { ?T22 a :instructor . ?T22 :instructor\#salary ?T22_salary .        }    } }
college_2,Find the total number of instructors who teach a course in the Spring 2010 semester.,SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_1 ) WHERE { ?T1 a :teaches . ?T1 :teaches\#id ?T1_id . ?T1 :teaches\#semester ?T1_semester . ?T1 :teaches\#year ?T1_year . FILTER(?T1_semester = 'Spring' && ?T1_year = 2010) .        }
college_2,How many instructors teach a course in the Spring of 2010?,SELECT DISTINCT (count(DISTINCT ?T1_id) as ?aggregation_T1_id_159 ) WHERE { ?T1 a :teaches . ?T1 :teaches\#id ?T1_id . ?T1 :teaches\#semester ?T1_semester . ?T1 :teaches\#year ?T1_year . FILTER(?T1_semester = 'Spring' && ?T1_year = 2010) .        }
college_2,Find the names and average salaries of all departments whose average salary is greater than 42000.,SELECT ?T1_dept_name (avg( ?T1_salary) as ?aggregation_T1_salary_9 ) WHERE { ?T1 a :instructor . ?T1 :instructor\#dept_name ?T1_dept_name . ?T1 :instructor\#salary ?T1_salary . ?T1 :instructor\#salary ?T1_salary .        } GROUP BY ?T1_dept_name   HAVING(avg( ?T1_salary)  > 42000)
college_2,Find names of instructors with salary greater than that of some (at least one) instructor in the Biology department.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary . FILTER(?T1_salary > (?T22_dept_name)) .       {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_184 ) WHERE { ?T22 a :instructor . ?T22 :instructor\#salary ?T22_salary . ?T22 :instructor\#dept_name ?T22_dept_name . FILTER(?T22_dept_name = 'Biology') .        }    } }
college_2,Find the names of all instructors whose salary is greater than the salary of all instructors in the Biology department.,SELECT ?T1_name WHERE { ?T1 a :instructor . ?T1 :instructor\#name ?T1_name . ?T1 :instructor\#salary ?T1_salary . FILTER(?T1_salary > (?T22_dept_name)) .       {SELECT (max( ?T22_salary) as ?aggregation_T22_salary_142 ) WHERE { ?T22 a :instructor . ?T22 :instructor\#salary ?T22_salary . ?T22 :instructor\#dept_name ?T22_dept_name . FILTER(?T22_dept_name = 'Biology') .        }    } }
debate,How many debates are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :debate .        }
debate,List the venues of debates in ascending order of the number of audience.,SELECT ?T1_venue WHERE { ?T1 a :debate . ?T1 :debate\#venue ?T1_venue . ?T1 :debate\#num_of_audience ?T1_num_of_audience .        }  ORDER BY ASC (?T1_num_of_audience)
debate,What are the date and venue of each debate?,SELECT ?T1_date ?T1_venue WHERE { ?T1 a :debate . ?T1 :debate\#date ?T1_date . ?T1 :debate\#venue ?T1_venue .        }
debate,List the dates of debates with number of audience bigger than 150,SELECT ?T1_date WHERE { ?T1 a :debate . ?T1 :debate\#date ?T1_date . ?T1 :debate\#num_of_audience ?T1_num_of_audience . FILTER(?T1_num_of_audience > 150) .        }
debate,Show the names of people aged either 35 or 36.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#age ?T1_age . ?T1 :people\#age ?T1_age . FILTER(?T1_age = 35 || ?T1_age = 36) .        }
debate,What is the party of the youngest people?,SELECT ?T1_party WHERE { ?T1 a :people . ?T1 :people\#party ?T1_party . ?T1 :people\#age ?T1_age .        }   ORDER BY ASC (?T1_age) LIMIT 1
debate,Show different parties of people along with the number of people in each party.,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#party ?T1_party .        } GROUP BY ?T1_party
debate,Show the party that has the most people.,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :people\#party ?T1_party .        } GROUP BY ?T1_party  ORDER BY DESC (?aggregation_all) LIMIT 1
debate,Show the distinct venues of debates,SELECT DISTINCT ?T1_venue WHERE { ?T1 a :debate . ?T1 :debate\#venue ?T1_venue .        }
debate,"Show the names of people, and dates and venues of debates they are on the affirmative side.",SELECT ?T1_name ?T2_date ?T2_venue WHERE { ?T1 a :people . ?T13 a :debate_people . ?T13 :debate_people\#ref-affirmative ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :debate\#date ?T2_date . ?T2 :debate\#venue ?T2_venue . ?T2 a :debate . ?T13 :debate_people\#ref-debate_id ?T2 .  ?T1 :people\#name ?T1_name . ?T2 :debate\#date ?T2_date . ?T2 :debate\#venue ?T2_venue .        }
debate,"Show the names of people, and dates and venues of debates they are on the negative side, ordered in ascending alphabetical order of name.",SELECT ?T1_name ?T2_date ?T2_venue WHERE { ?T1 a :people . ?T13 a :debate_people . ?T13 :debate_people\#ref-affirmative ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :debate\#date ?T2_date . ?T2 :debate\#venue ?T2_venue . ?T1 :people\#name ?T1_name . ?T2 a :debate . ?T13 :debate_people\#ref-debate_id ?T2 .  ?T1 :people\#name ?T1_name . ?T2 :debate\#date ?T2_date . ?T2 :debate\#venue ?T2_venue . ?T1 :people\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
debate,Show the names of people that are on affirmative side of debates with number of audience bigger than 200.,SELECT ?T1_name WHERE { ?T1 a :people . ?T13 a :debate_people . ?T13 :debate_people\#ref-affirmative ?T1 .  ?T1 :people\#name ?T1_name . ?T2 :debate\#num_of_audience ?T2_num_of_audience . ?T2 a :debate . ?T13 :debate_people\#ref-debate_id ?T2 .  ?T1 :people\#name ?T1_name . ?T2 :debate\#num_of_audience ?T2_num_of_audience . FILTER(?T2_num_of_audience > 200) .        }
debate,Show the names of people and the number of times they have been on the affirmative side of debates.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T2 a :debate_people . ?T2 :debate_people\#ref-affirmative ?T1 .  ?T1 :people\#name ?T1_name .        } GROUP BY ?T1_name
debate,Show the names of people who have been on the negative side of debates at least twice.,SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :debate_people . ?T2 :debate_people\#ref-affirmative ?T1 .  ?T1 :people\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
debate,List the names of people that have not been on the affirmative side of debates.,SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :people\#name ?T1_name . ?T1 :people\#people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_affirmative)) .       {SELECT ?T22_affirmative WHERE { ?T22 a :debate_people . ?T22 :debate_people\#affirmative ?T22_affirmative .        }    } }
insurance_and_eclaims,List the names of all the customers in alphabetical order.,SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details . ?T1 :customers\#customer_details ?T1_customer_details .        }  ORDER BY ASC (?T1_customer_details)
insurance_and_eclaims,Find all the policy type codes associated with the customer 'Dayana Robel',SELECT ?T1_policy_type_code WHERE { ?T1 a :policies . ?T2 a :customers . ?T1 :policies\#ref-customer_id ?T2 .  ?T1 :policies\#policy_type_code ?T1_policy_type_code . ?T2 :customers\#customer_details ?T2_customer_details . FILTER(?T2_customer_details = 'Dayana Robel') .        }
insurance_and_eclaims,What are the type codes of the policies used by the customer 'Dayana Robel'?,SELECT ?T1_policy_type_code WHERE { ?T1 a :policies . ?T2 a :customers . ?T1 :policies\#ref-customer_id ?T2 .  ?T1 :policies\#policy_type_code ?T1_policy_type_code . ?T2 :customers\#customer_details ?T2_customer_details . FILTER(?T2_customer_details = 'Dayana Robel') .        }
insurance_and_eclaims,Which type of policy is most frequently used? Give me the policy type code.,SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :policies . ?T1 :policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_and_eclaims,Find all the policy types that are used by more than 2 customers.,SELECT ?T1_policy_type_code WHERE { ?T1 a :policies . ?T1 :policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code   HAVING(count( *)  > 2)
insurance_and_eclaims,Find the total and average amount paid in claim headers.,SELECT (sum( ?T1_amount_piad) as ?aggregation_T1_amount_piad_12 ) (avg( ?T1_amount_piad) as ?aggregation_T1_amount_piad_196 ) WHERE { ?T1 a :claim_headers . ?T1 :claim_headers\#amount_piad ?T1_amount_piad . ?T1 :claim_headers\#amount_piad ?T1_amount_piad .        }
insurance_and_eclaims,What are the total amount and average amount paid in claim headers?,SELECT (sum( ?T1_amount_piad) as ?aggregation_T1_amount_piad_15 ) (avg( ?T1_amount_piad) as ?aggregation_T1_amount_piad_77 ) WHERE { ?T1 a :claim_headers . ?T1 :claim_headers\#amount_piad ?T1_amount_piad . ?T1 :claim_headers\#amount_piad ?T1_amount_piad .        }
insurance_and_eclaims,Find the total amount claimed in the most recently created document.,SELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_179 ) WHERE { ?T1 a :claim_headers . ?T2 a :claims_documents . ?T2 :claims_documents\#ref-claim_id ?T1 .  ?T1 :claim_headers\#amount_claimed ?T1_amount_claimed . ?T2 :claims_documents\#created_date ?T2_created_date . FILTER(?T2_created_date = (?T23_created_date)) .       {SELECT ?T23_created_date WHERE { ?T23 a :claims_documents . ?T23 :claims_documents\#created_date ?T23_created_date . ?T23 :claims_documents\#created_date ?T23_created_date .        }   ORDER BY ASC (?T23_created_date) LIMIT 1 } }
insurance_and_eclaims,Which customer made the largest amount of claim in a single claim? Return the customer details.,SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T13 a :policies . ?T13 :policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :claim_headers\#amount_claimed ?T2_amount_claimed . ?T2 a :claim_headers . ?T2 :claim_headers\#ref-policy_id ?T13 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :claim_headers\#amount_claimed ?T2_amount_claimed . FILTER(?T2_amount_claimed = (?aggregation_T23_amount_claimed_39)) .       {SELECT (max( ?T23_amount_claimed) as ?aggregation_T23_amount_claimed_39 ) WHERE { ?T23 a :claim_headers . ?T23 :claim_headers\#amount_claimed ?T23_amount_claimed .        }    } }
insurance_and_eclaims,Which customer made the smallest amount of claim in one claim? Return the customer details.,SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T13 a :policies . ?T13 :policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :claim_headers\#amount_piad ?T2_amount_piad . ?T2 a :claim_headers . ?T2 :claim_headers\#ref-policy_id ?T13 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :claim_headers\#amount_piad ?T2_amount_piad . FILTER(?T2_amount_piad = (?aggregation_T23_amount_piad_16)) .       {SELECT (min( ?T23_amount_piad) as ?aggregation_T23_amount_piad_16 ) WHERE { ?T23 a :claim_headers . ?T23 :claim_headers\#amount_piad ?T23_amount_piad .        }    } }
insurance_and_eclaims,Find the names of customers who have no policies associated.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_details as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details .   }}  MINUS {SELECT (?T2_customer_details as ?col1) WHERE { ?T2 a :customers . ?T2 :customers\#customer_details ?T2_customer_details .        }     } }
insurance_and_eclaims,What are the names of customers who do not have any policies?,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_details as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details .   }}  MINUS {SELECT (?T2_customer_details as ?col1) WHERE { ?T2 a :customers . ?T2 :customers\#customer_details ?T2_customer_details .        }     } }
insurance_and_eclaims,How many claim processing stages are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :claims_processing_stages .        }
insurance_and_eclaims,What is the name of the claim processing stage that most of the claims are on?,SELECT ?T1_claim_status_name (count( *) as ?aggregation_all) WHERE { ?T1 :claims_processing_stages\#ref-claims_processing_id ?T2 .        } GROUP BY ?T1_claim_status_name  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_and_eclaims,Find the names of customers whose name contains 'Diana'.,"SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details . ?T1 :customers\#customer_details ?T1_customer_details . FILTER(contains (?T1_customer_details, 'Diana')) .        }"
insurance_and_eclaims,Find the names of the customers who have an deputy policy.,SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :policies . ?T2 :policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :policies\#policy_type_code ?T2_policy_type_code . FILTER(?T2_policy_type_code = 'Deputy') .        }
insurance_and_eclaims,Find the names of all the customers and staff members.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_details as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details .   }} UNION {SELECT (?T1_staff_details as ?col1) WHERE { ?T1 a :staff . ?T1 :staff\#staff_details ?T1_staff_details .        }      } }
insurance_and_eclaims,What are the names of the customers and staff members?,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_details as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details .   }} UNION {SELECT (?T1_staff_details as ?col1) WHERE { ?T1 a :staff . ?T1 :staff\#staff_details ?T1_staff_details .        }      } }
insurance_and_eclaims,Find the number of records of each policy type and its type code.,SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :policies . ?T1 :policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code
insurance_and_eclaims,Find the name of the customer that has been involved in the most policies.,SELECT ?T1_customer_details (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :policies . ?T2 :policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details .        } GROUP BY ?T1_customer_details  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_and_eclaims,What is the description of the claim status 'Open'?,SELECT ?T1_claim_status_description WHERE { ?T1 a :claims_processing_stages . ?T1 :claims_processing_stages\#claim_status_description ?T1_claim_status_description . ?T1 :claims_processing_stages\#claim_status_name ?T1_claim_status_name . FILTER(?T1_claim_status_name = 'Open') .        }
insurance_and_eclaims,How many distinct claim outcome codes are there?,SELECT DISTINCT (count(DISTINCT ?T1_claim_outcome_code) as ?aggregation_T1_claim_outcome_code_110 ) WHERE { ?T1 a :claims_processing . ?T1 :claims_processing\#claim_outcome_code ?T1_claim_outcome_code .        }
insurance_and_eclaims,Count the number of distinct claim outcome codes.,SELECT DISTINCT (count(DISTINCT ?T1_claim_outcome_code) as ?aggregation_T1_claim_outcome_code_112 ) WHERE { ?T1 a :claims_processing . ?T1 :claims_processing\#claim_outcome_code ?T1_claim_outcome_code .        }
insurance_and_eclaims,Which customer is associated with the latest policy?,SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :policies . ?T2 :policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :policies\#start_date ?T2_start_date . FILTER(?T2_start_date = (?aggregation_T23_start_date_171)) .       {SELECT (max( ?T23_start_date) as ?aggregation_T23_start_date_171 ) WHERE { ?T23 a :policies . ?T23 :policies\#start_date ?T23_start_date .        }    } }
insurance_and_eclaims,Find the customer who started a policy most recently.,SELECT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :policies . ?T2 :policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T2 :policies\#start_date ?T2_start_date . FILTER(?T2_start_date = (?aggregation_T23_start_date_190)) .       {SELECT (max( ?T23_start_date) as ?aggregation_T23_start_date_190 ) WHERE { ?T23 a :policies . ?T23 :policies\#start_date ?T23_start_date .        }    } }
customers_and_invoices,How many accounts are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts .        }
customers_and_invoices,How many customers have opened an account?,SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_182 ) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        }
customers_and_invoices,Count the number of customers who have an account.,SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_83 ) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        }
customers_and_invoices,"Show the id, the date of account opened, the account name, and other account detail for all accounts.",SELECT ?T1_account_id ?T1_date_account_opened ?T1_account_name ?T1_other_account_details WHERE { ?T1 a :accounts . ?T1 :accounts\#account_id ?T1_account_id . ?T1 :accounts\#date_account_opened ?T1_date_account_opened . ?T1 :accounts\#account_name ?T1_account_name . ?T1 :accounts\#other_account_details ?T1_other_account_details .        }
customers_and_invoices,"Show the id, the account name, and other account details for all accounts by the customer with first name 'Meaghan'.",SELECT ?T1_account_id ?T1_date_account_opened ?T1_account_name ?T1_other_account_details WHERE { ?T1 a :accounts . ?T2 a :customers . ?T1 :accounts\#ref-customer_id ?T2 .  ?T1 :accounts\#account_id ?T1_account_id . ?T1 :accounts\#date_account_opened ?T1_date_account_opened . ?T1 :accounts\#account_name ?T1_account_name . ?T1 :accounts\#other_account_details ?T1_other_account_details . ?T2 :customers\#customer_first_name ?T2_customer_first_name . FILTER(?T2_customer_first_name = 'Meaghan') .        }
