kg_name,question,query
dorm_1,What is the average age for each dorm and what are the names of each dorm?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_34 ) ?T2_dorm_name WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :dorm\#dorm_name ?T2_dorm_name .        } GROUP BY ?T2_dorm_name
dorm_1,Find the number of amenities for each of the dorms that can accommodate more than 100 students.,SELECT (count( *) as ?aggregation_all) ?T2_dormid WHERE { ?T1 a :has_amenity . ?T2 a :dorm . ?T1 :has_amenity\#ref-dormid ?T2 .  ?T2 :dorm\#dormid ?T2_dormid . ?T2 :dorm\#student_capacity ?T2_student_capacity . FILTER(?T2_student_capacity > 100) .        } GROUP BY ?T2_dormid
dorm_1,Find the number of students who is older than 20 in each dorm.,SELECT (count( *) as ?aggregation_all) ?T2_dorm_name WHERE { ?T1 a :lives_in . ?T2 a :dorm . ?T1 :lives_in\#ref-dormid ?T2 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#age ?T3_age . ?T3 a :student . ?T1 :lives_in\#ref-stuid ?T3 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#age ?T3_age . FILTER(?T3_age > 20) .        } GROUP BY ?T2_dorm_name
dorm_1,How many students are older than 20 in each dorm?,SELECT (count( *) as ?aggregation_all) ?T2_dorm_name WHERE { ?T1 a :lives_in . ?T2 a :dorm . ?T1 :lives_in\#ref-dormid ?T2 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#age ?T3_age . ?T3 a :student . ?T1 :lives_in\#ref-stuid ?T3 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#age ?T3_age . FILTER(?T3_age > 20) .        } GROUP BY ?T2_dorm_name
dorm_1,Find the first name of students who are living in the Smith Hall.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T2 :dorm\#dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') .        }
dorm_1,What are the first names of all students in Smith Hall?,SELECT ?T1_fname WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T2 :dorm\#dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') .        }
dorm_1,Find the average age of students who are living in the dorm with the largest capacity.,SELECT (avg( ?T1_age) as ?aggregation_T1_age_148 ) WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#age ?T1_age . ?T2 :dorm\#student_capacity ?T2_student_capacity . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T1 :student\#age ?T1_age . ?T2 :dorm\#student_capacity ?T2_student_capacity . FILTER(?T2_student_capacity = (?aggregation_T23_student_capacity_158)) .       {SELECT (max( ?T23_student_capacity) as ?aggregation_T23_student_capacity_158 ) WHERE { ?T23 a :dorm . ?T23 :dorm\#student_capacity ?T23_student_capacity .        }    } }
dorm_1,Find the total number of students living in the male dorm (with gender M).,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :lives_in . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T2 :dorm\#gender ?T2_gender . FILTER(?T2_gender = 'M') .        }
dorm_1,What are the total number of students who are living in a male dorm?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :lives_in . ?T2 a :dorm . ?T13 :lives_in\#ref-dormid ?T2 .  ?T2 :dorm\#gender ?T2_gender . FILTER(?T2_gender = 'M') .        }
dorm_1,Find the number of female students (with F sex) living in Smith Hall,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lives_in . ?T2 a :dorm . ?T1 :lives_in\#ref-dormid ?T2 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#sex ?T3_sex . ?T3 a :student . ?T1 :lives_in\#ref-stuid ?T3 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#sex ?T3_sex . FILTER(?T2_dorm_name = 'Smith Hall' && ?T3_sex = 'F') .        }
dorm_1,How many female students live in Smith Hall?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lives_in . ?T2 a :dorm . ?T1 :lives_in\#ref-dormid ?T2 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#sex ?T3_sex . ?T3 a :student . ?T1 :lives_in\#ref-stuid ?T3 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :student\#sex ?T3_sex . FILTER(?T2_dorm_name = 'Smith Hall' && ?T3_sex = 'F') .        }
dorm_1,Find the name of amenities Smith Hall dorm have.,SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :has_amenity\#ref-dormid ?T2 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') .        }
dorm_1,What are the names of the amenities that Smith Hall has?,SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :has_amenity\#ref-dormid ?T2 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') .        }
dorm_1,What amenities does Smith Hall have in alphabetical order?,SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :has_amenity\#ref-dormid ?T2 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :dorm\#dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') .        }  ORDER BY ASC (?T1_amenity_name)
dorm_1,Find the name of amenity that is most common in all dorms.,SELECT ?T1_amenity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm_amenity . ?T2 a :has_amenity . ?T2 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name .        } GROUP BY ?T1_amenity_name  ORDER BY DESC (?aggregation_all) LIMIT 1
dorm_1,What is the most common amenity in the dorms?,SELECT ?T1_amenity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm_amenity . ?T2 a :has_amenity . ?T2 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name .        } GROUP BY ?T1_amenity_name  ORDER BY DESC (?aggregation_all) LIMIT 1
dorm_1,Find the first name of students who are living in the dorm that has most number of amenities.,SELECT ?T1_fname WHERE { ?T1 a :student . ?T2 a :lives_in . ?T2 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T2 :lives_in\#dormid ?T2_dormid . FILTER(?T2_dormid in (?T23_dormid)) .       {SELECT ?T23_dormid (count( *) as ?aggregation_all) WHERE { ?T23 a :lives_in . ?T24 a :dorm . ?T23 :lives_in\#ref-dormid ?T24 .  ?T23 :lives_in\#dormid ?T23_dormid .        } GROUP BY ?T23_dormid  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
dorm_1,What are the first names of all students who live in the dorm with the most amenities?,SELECT ?T1_fname WHERE { ?T1 a :student . ?T2 a :lives_in . ?T2 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T2 :lives_in\#dormid ?T2_dormid . FILTER(?T2_dormid in (?T23_dormid)) .       {SELECT ?T23_dormid (count( *) as ?aggregation_all) WHERE { ?T23 a :lives_in . ?T24 a :dorm . ?T23 :lives_in\#ref-dormid ?T24 .  ?T23 :lives_in\#dormid ?T23_dormid .        } GROUP BY ?T23_dormid  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
dorm_1,Find the name and capacity of the dorm with least number of amenities.,SELECT ?T1_dorm_name (count( *) as ?aggregation_all) ?T1_student_capacity WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name . ?T1 :dorm\#student_capacity ?T1_student_capacity .        } GROUP BY ?T1_dorm_name  ?T1_student_capacity  ORDER BY ASC (?aggregation_all) LIMIT 1
dorm_1,Find the name of dorms that do not have amenity TV Lounge.,SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name .   }}  MINUS {SELECT (?T2_dorm_name as ?col1) WHERE { ?T2 a :dorm . ?T14 a :has_amenity . ?T14 :has_amenity\#ref-dormid ?T2 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :dorm_amenity\#amenity_name ?T3_amenity_name . ?T3 a :dorm_amenity . ?T14 :has_amenity\#ref-amenid ?T3 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :dorm_amenity\#amenity_name ?T3_amenity_name . FILTER(?T3_amenity_name = 'TV Lounge') .        }     } }
dorm_1,What are the names of the dorm that does not have a TV Lounge?,SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a :dorm . ?T1 :dorm\#dorm_name ?T1_dorm_name .   }}  MINUS {SELECT (?T2_dorm_name as ?col1) WHERE { ?T2 a :dorm . ?T14 a :has_amenity . ?T14 :has_amenity\#ref-dormid ?T2 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :dorm_amenity\#amenity_name ?T3_amenity_name . ?T3 a :dorm_amenity . ?T14 :has_amenity\#ref-amenid ?T3 .  ?T2 :dorm\#dorm_name ?T2_dorm_name . ?T3 :dorm_amenity\#amenity_name ?T3_amenity_name . FILTER(?T3_amenity_name = 'TV Lounge') .        }     } }
dorm_1,Find the first and last name of students who are living in the dorms that have amenity TV Lounge.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T2 a :lives_in . ?T2 :lives_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :lives_in\#dormid ?T2_dormid . FILTER(?T2_dormid in (?T24_amenity_name)) .       {SELECT ?T23_dormid WHERE { ?T23 a :has_amenity . ?T24 a :dorm_amenity . ?T23 :has_amenity\#ref-amenid ?T24 .  ?T23 :has_amenity\#dormid ?T23_dormid . ?T24 :dorm_amenity\#amenity_name ?T24_amenity_name . FILTER(?T24_amenity_name = 'TV Lounge') .        }    } }
dorm_1,Find the name of amenities of the dorm where the student with last name Smith is living in.,SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :has_amenity\#ref-amenid ?T1 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :student\#lname ?T2_lname . ?T14 a :dorm . ?T13 :has_amenity\#ref-dormid ?T14 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :student\#lname ?T2_lname . ?T15 a :lives_in . ?T15 :lives_in\#ref-dormid ?T14 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T15 :lives_in\#ref-stuid ?T2 .  ?T1 :dorm_amenity\#amenity_name ?T1_amenity_name . ?T2 :student\#lname ?T2_lname . FILTER(?T2_lname = 'Smith') .        }
customer_complaints,How many customers are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }
customer_complaints,"Find the emails and phone numbers of all the customers, ordered by email address and phone number.",SELECT ?T1_email_address ?T1_phone_number WHERE { ?T1 a :customers . ?T1 :customers\#email_address ?T1_email_address . ?T1 :customers\#phone_number ?T1_phone_number . ?T1 :customers\#email_address ?T1_email_address .        }  ORDER BY ASC (?T1_email_address)
customer_complaints,Which city has the least number of customers whose type code is 'Good Credit Rating'?,SELECT ?T1_town_city (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#town_city ?T1_town_city . ?T1 :customers\#customer_type_code ?T1_customer_type_code . FILTER(?T1_customer_type_code = 'Good Credit Rating') .        } GROUP BY ?T1_town_city  ORDER BY ASC (?aggregation_all) LIMIT 1
customer_complaints,List the name of all products along with the number of complaints that they have received.,SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :complaints . ?T2 :complaints\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name
customer_complaints,Find the emails of customers who has filed a complaints of the product with the most complaints.,SELECT ?T1_email_address (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :complaints . ?T2 :complaints\#ref-customer_id ?T1 .  ?T1 :customers\#email_address ?T1_email_address .        } GROUP BY ?T1_email_address  ORDER BY ASC (?aggregation_all) LIMIT 1
customer_complaints,Which products has been complained by the customer who has filed least amount of complaints?,SELECT DISTINCT ?T1_product_name (count( *) as ?aggregation_all) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name .        } GROUP BY ?T1_product_name  ORDER BY ASC (?aggregation_all) LIMIT 1
customer_complaints,Return the phone number of the customer who filed the complaint that was raised most recently.,SELECT ?T1_phone_number WHERE { ?T1 a :customers . ?T2 a :complaints . ?T2 :complaints\#ref-customer_id ?T1 .  ?T1 :customers\#phone_number ?T1_phone_number . ?T2 :complaints\#date_complaint_raised ?T2_date_complaint_raised .        }   ORDER BY DESC (?T2_date_complaint_raised) LIMIT 1
customer_complaints,Find the email and phone number of the customers who have never filed a complaint before.,SELECT ?T1_email_address ?T1_phone_number WHERE { ?T1 a :customers . ?T1 :customers\#email_address ?T1_email_address . ?T1 :customers\#phone_number ?T1_phone_number . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :complaints . ?T22 :complaints\#customer_id ?T22_customer_id .        }    } }
customer_complaints,Find the phone number of all the customers and staff.,SELECT distinct?col1 WHERE { { SELECT (?T1_phone_number as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#phone_number ?T1_phone_number .   }} UNION {SELECT (?T1_phone_number as ?col1) WHERE { ?T1 a :staff . ?T1 :staff\#phone_number ?T1_phone_number .        }      } }
customer_complaints,What are the phone numbers of all customers and all staff members?,SELECT distinct?col1 WHERE { { SELECT (?T1_phone_number as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#phone_number ?T1_phone_number .   }} UNION {SELECT (?T1_phone_number as ?col1) WHERE { ?T1 a :staff . ?T1 :staff\#phone_number ?T1_phone_number .        }      } }
customer_complaints,What is the description of the product named 'Chocolate'?,SELECT ?T1_product_description WHERE { ?T1 a :products . ?T1 :products\#product_description ?T1_product_description . ?T1 :products\#product_name ?T1_product_name . FILTER(?T1_product_name = 'Chocolate') .        }
customer_complaints,Find the name and category of the most expensive product.,SELECT ?T1_product_name ?T1_product_category_code WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_category_code ?T1_product_category_code . ?T1 :products\#product_price ?T1_product_price .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
customer_complaints,What is the name and category code of the product with the highest price?,SELECT ?T1_product_name ?T1_product_category_code WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_category_code ?T1_product_category_code . ?T1 :products\#product_price ?T1_product_price .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
customer_complaints,Find the prices of products which has never received a single complaint.,SELECT ?T1_product_price WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_id ?T1_product_id . FILTER(?T1_product_id not in (?T22_product_id)) .       {SELECT ?T22_product_id WHERE { ?T22 a :complaints . ?T22 :complaints\#product_id ?T22_product_id .        }    } }
customer_complaints,What are the prices of products that have never gotten a complaint?,SELECT ?T1_product_price WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_id ?T1_product_id . FILTER(?T1_product_id not in (?T22_product_id)) .       {SELECT ?T22_product_id WHERE { ?T22 a :complaints . ?T22 :complaints\#product_id ?T22_product_id .        }    } }
customer_complaints,What is the average price of the products for each category?,SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_92 ) ?T1_product_category_code WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_category_code ?T1_product_category_code .        } GROUP BY ?T1_product_category_code
customer_complaints,Return the average price of products that have each category code.,SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_148 ) ?T1_product_category_code WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_category_code ?T1_product_category_code .        } GROUP BY ?T1_product_category_code
customer_complaints,Find the last name of the staff member who processed the complaint of the cheapest product.,SELECT ?T1_last_name WHERE { ?T1 a :staff . ?T13 a :complaints . ?T13 :complaints\#ref-staff_id ?T1 .  ?T1 :staff\#last_name ?T1_last_name . ?T2 :products\#product_price ?T2_product_price . ?T2 a :products . ?T13 :complaints\#ref-product_id ?T2 .  ?T1 :staff\#last_name ?T1_last_name . ?T2 :products\#product_price ?T2_product_price .        }   ORDER BY ASC (?T2_product_price) LIMIT 1
customer_complaints,Which complaint status has more than 3 records on file?,SELECT ?T1_complaint_status_code WHERE { ?T1 a :complaints . ?T1 :complaints\#complaint_status_code ?T1_complaint_status_code .        } GROUP BY ?T1_complaint_status_code   HAVING(count( *)  > 3)
customer_complaints,Find the last name of the staff whose email address contains 'wrau'.,"SELECT ?T1_last_name WHERE { ?T1 a :staff . ?T1 :staff\#last_name ?T1_last_name . ?T1 :staff\#email_address ?T1_email_address . FILTER(contains (?T1_email_address, 'wrau')) .        }"
customer_complaints,What are the last names of staff with email addressed containing the substring 'wrau'?,"SELECT ?T1_last_name WHERE { ?T1 a :staff . ?T1 :staff\#last_name ?T1_last_name . ?T1 :staff\#email_address ?T1_email_address . FILTER(contains (?T1_email_address, 'wrau')) .        }"
customer_complaints,Count the number of customers that have the customer type that is most common.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }   ORDER BY DESC (?aggregation_all) LIMIT 1
customer_complaints,Return the last name of the staff member who handled the complaint with the earliest date raised.,SELECT ?T1_last_name WHERE { ?T1 a :staff . ?T2 a :complaints . ?T2 :complaints\#ref-staff_id ?T1 .  ?T1 :staff\#last_name ?T1_last_name . ?T2 :complaints\#date_complaint_raised ?T2_date_complaint_raised .        }   ORDER BY ASC (?T2_date_complaint_raised) LIMIT 1
customer_complaints,How many distinct complaint type codes are there in the database?,SELECT DISTINCT (count(DISTINCT ?T1_complaint_type_code) as ?aggregation_T1_complaint_type_code_107 ) WHERE { ?T1 a :complaints . ?T1 :complaints\#complaint_type_code ?T1_complaint_type_code .        }
customer_complaints,Count the number of different complaint type codes.,SELECT DISTINCT (count(DISTINCT ?T1_complaint_type_code) as ?aggregation_T1_complaint_type_code_81 ) WHERE { ?T1 a :complaints . ?T1 :complaints\#complaint_type_code ?T1_complaint_type_code .        }
customer_complaints,Find the address line 1 and 2 of the customer with email 'vbogisich@example.org'.,SELECT ?T1_address_line_1 ?T1_address_line_2 WHERE { ?T1 a :customers . ?T1 :customers\#address_line_1 ?T1_address_line_1 . ?T1 :customers\#address_line_2 ?T1_address_line_2 . ?T1 :customers\#email_address ?T1_email_address . FILTER(?T1_email_address = 'vbogisich@example.org') .        }
customer_complaints,What are lines 1 and 2 of the addressed of the customer with the email 'vbogisich@example.org'?,SELECT ?T1_address_line_1 ?T1_address_line_2 WHERE { ?T1 a :customers . ?T1 :customers\#address_line_1 ?T1_address_line_1 . ?T1 :customers\#address_line_2 ?T1_address_line_2 . ?T1 :customers\#email_address ?T1_email_address . FILTER(?T1_email_address = 'vbogisich@example.org') .        }
customer_complaints,Find the number of complaints with Product Failure type for each complaint status.,SELECT ?T1_complaint_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :complaints . ?T1 :complaints\#complaint_status_code ?T1_complaint_status_code . ?T1 :complaints\#complaint_type_code ?T1_complaint_type_code . FILTER(?T1_complaint_type_code = 'Product Failure') .        } GROUP BY ?T1_complaint_status_code
customer_complaints,"Of complaints with the type code 'Product Failure', how many had each different status code?",SELECT ?T1_complaint_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :complaints . ?T1 :complaints\#complaint_status_code ?T1_complaint_status_code . ?T1 :complaints\#complaint_type_code ?T1_complaint_type_code . FILTER(?T1_complaint_type_code = 'Product Failure') .        } GROUP BY ?T1_complaint_status_code
customer_complaints,Return the first names of the 5 staff members who have handled the most complaints.,SELECT ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T2 a :complaints . ?T2 :complaints\#ref-staff_id ?T1 .  ?T1 :staff\#first_name ?T1_first_name .        } GROUP BY ?T1_first_name  ORDER BY ASC (?aggregation_all) LIMIT 1
customer_complaints,Which state has the most customers?,SELECT ?T1_state (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#state ?T1_state .        } GROUP BY ?T1_state  ORDER BY ASC (?aggregation_all) LIMIT 1
workshop_paper,How many submissions are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :submission .        }
workshop_paper,List the authors of submissions in ascending order of scores.,SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#scores ?T1_scores .        }  ORDER BY ASC (?T1_scores)
workshop_paper,What are the authors of submissions and their colleges?,SELECT ?T1_author ?T1_college WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#college ?T1_college .        }
workshop_paper,Show the names of authors from college 'Florida' or 'Temple',SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#college ?T1_college . ?T1 :submission\#college ?T1_college . FILTER(?T1_college = 'Florida' || ?T1_college = 'Temple') .        }
workshop_paper,Which authors with submissions are from college 'Florida' or 'Temple'?,SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#college ?T1_college . ?T1 :submission\#college ?T1_college . FILTER(?T1_college = 'Florida' || ?T1_college = 'Temple') .        }
workshop_paper,What is the average score of submissions?,SELECT (avg( ?T1_scores) as ?aggregation_T1_scores_186 ) WHERE { ?T1 a :submission . ?T1 :submission\#scores ?T1_scores .        }
workshop_paper,Compute the average score of submissions.,SELECT (avg( ?T1_scores) as ?aggregation_T1_scores_167 ) WHERE { ?T1 a :submission . ?T1 :submission\#scores ?T1_scores .        }
workshop_paper,What is the author of the submission with the highest score?,SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#scores ?T1_scores .        }   ORDER BY DESC (?T1_scores) LIMIT 1
workshop_paper,Show different colleges along with the number of authors of submission from each college.,SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :submission . ?T1 :submission\#college ?T1_college .        } GROUP BY ?T1_college
workshop_paper,Show the most common college of authors of submissions.,SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :submission . ?T1 :submission\#college ?T1_college .        } GROUP BY ?T1_college  ORDER BY DESC (?aggregation_all) LIMIT 1
workshop_paper,Which college has the most authors with submissions?,SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :submission . ?T1 :submission\#college ?T1_college .        } GROUP BY ?T1_college  ORDER BY DESC (?aggregation_all) LIMIT 1
workshop_paper,Show the colleges that have both authors with submission score larger than 90 and authors with submission score smaller than 80.,SELECT DISTINCT ?T1_college WHERE { ?T1 a :submission . ?T1 :submission\#college ?T1_college . ?T1 :submission\#scores ?T1_scores . FILTER(?T1_scores > 90) . FILTER (?T1_college in (?T2_college)) .   ?T2 a :submission . ?T2 :submission\#college ?T2_college . ?T2 :submission\#scores ?T2_scores .  FILTER(?T2_scores < 80) .             }
workshop_paper,Show the authors of submissions and the acceptance results of their submissions.,SELECT ?T1_author ?T2_result WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :acceptance\#ref-submission_id ?T1 .  ?T1 :submission\#author ?T1_author . ?T2 :acceptance\#result ?T2_result .        }
workshop_paper,Show the result of the submission with the highest score.,SELECT ?T1_result WHERE { ?T1 a :acceptance . ?T2 a :submission . ?T1 :acceptance\#ref-submission_id ?T2 .  ?T1 :acceptance\#result ?T1_result . ?T2 :submission\#scores ?T2_scores .        }   ORDER BY DESC (?T2_scores) LIMIT 1
workshop_paper,Show each author and the number of workshops they submitted to.,SELECT DISTINCT ?T1_author (count(DISTINCT ?T2_workshop_id) as ?aggregation_T2_workshop_id_107 ) WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :acceptance\#ref-submission_id ?T1 .  ?T1 :submission\#author ?T1_author . ?T2 :acceptance\#workshop_id ?T2_workshop_id .        } GROUP BY ?T1_author
workshop_paper,How many workshops did each author submit to? Return the author name and the number of workshops.,SELECT DISTINCT ?T1_author (count(DISTINCT ?T2_workshop_id) as ?aggregation_T2_workshop_id_15 ) WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :acceptance\#ref-submission_id ?T1 .  ?T1 :submission\#author ?T1_author . ?T2 :acceptance\#workshop_id ?T2_workshop_id .        } GROUP BY ?T1_author
workshop_paper,Show the authors who have submissions to more than one workshop.,SELECT ?T1_author WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :acceptance\#ref-submission_id ?T1 .  ?T1 :submission\#author ?T1_author . ?T2 :acceptance\#workshop_id ?T2_workshop_id .        } GROUP BY ?T1_author   HAVING(count( ?T2_workshop_id) as ?aggregation_T2_workshop_id_112 ) > 1)
workshop_paper,Which authors have submitted to more than one workshop?,SELECT ?T1_author WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :acceptance\#ref-submission_id ?T1 .  ?T1 :submission\#author ?T1_author . ?T2 :acceptance\#workshop_id ?T2_workshop_id .        } GROUP BY ?T1_author   HAVING(count( ?T2_workshop_id) as ?aggregation_T2_workshop_id_20 ) > 1)
workshop_paper,Show the date and venue of each workshop in ascending alphabetical order of the venue.,SELECT ?T1_date ?T1_venue WHERE { ?T1 a :workshop . ?T1 :workshop\#date ?T1_date . ?T1 :workshop\#venue ?T1_venue . ?T1 :workshop\#venue ?T1_venue .        }  ORDER BY ASC (?T1_venue)
workshop_paper,List the authors who do not have submission to any workshop.,SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#submission_id ?T1_submission_id . FILTER(?T1_submission_id not in (?T22_submission_id)) .       {SELECT ?T22_submission_id WHERE { ?T22 a :acceptance . ?T22 :acceptance\#submission_id ?T22_submission_id .        }    } }
workshop_paper,Which authors did not submit to any workshop?,SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\#author ?T1_author . ?T1 :submission\#submission_id ?T1_submission_id . FILTER(?T1_submission_id not in (?T22_submission_id)) .       {SELECT ?T22_submission_id WHERE { ?T22 a :acceptance . ?T22 :acceptance\#submission_id ?T22_submission_id .        }    } }
tracking_share_transactions,Find the number of investors in total.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :investors .        }
tracking_share_transactions,Show all investor details.,SELECT ?T1_investor_details WHERE { ?T1 a :investors . ?T1 :investors\#investor_details ?T1_investor_details .        }
tracking_share_transactions,Show all distinct lot details.,SELECT DISTINCT ?T1_lot_details WHERE { ?T1 a :lots . ?T1 :lots\#lot_details ?T1_lot_details .        }
tracking_share_transactions,Show the maximum amount of transaction.,SELECT (max( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_118 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction .        }
tracking_share_transactions,Show all date and share count of transactions.,SELECT ?T1_date_of_transaction ?T1_share_count WHERE { ?T1 a :transactions . ?T1 :transactions\#date_of_transaction ?T1_date_of_transaction . ?T1 :transactions\#share_count ?T1_share_count .        }
tracking_share_transactions,What is the total share of transactions?,SELECT (sum( ?T1_share_count) as ?aggregation_T1_share_count_95 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#share_count ?T1_share_count .        }
tracking_share_transactions,Show all transaction ids with transaction code 'PUR'.,SELECT ?T1_transaction_id WHERE { ?T1 a :transactions . ?T1 :transactions\#transaction_id ?T1_transaction_id . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'PUR') .        }
tracking_share_transactions,Show all dates of transactions whose type code is 'SALE'.,SELECT ?T1_date_of_transaction WHERE { ?T1 a :transactions . ?T1 :transactions\#date_of_transaction ?T1_date_of_transaction . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') .        }
tracking_share_transactions,Show the average amount of transactions with type code 'SALE'.,SELECT (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_26 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') .        }
tracking_share_transactions,Show the description of transaction type with code 'PUR'.,SELECT ?T1_transaction_type_description WHERE { ?T1 a :ref_transaction_types . ?T1 :ref_transaction_types\#transaction_type_description ?T1_transaction_type_description . ?T1 :ref_transaction_types\#transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'PUR') .        }
tracking_share_transactions,Show the minimum amount of transactions whose type code is 'PUR' and whose share count is bigger than 50.,SELECT (min( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_190 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction . ?T1 :transactions\#transaction_type_code ?T1_transaction_type_code . ?T1 :transactions\#share_count ?T1_share_count . FILTER(?T1_transaction_type_code = 'PUR' && ?T1_share_count > 50) .        }
tracking_share_transactions,Show the maximum share count of transactions where the amount is smaller than 10000,SELECT (max( ?T1_share_count) as ?aggregation_T1_share_count_53 ) WHERE { ?T1 a :transactions . ?T1 :transactions\#share_count ?T1_share_count . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction . FILTER(?T1_amount_of_transaction < 10000) .        }
tracking_share_transactions,Show the dates of transactions if the share count is bigger than 100 or the amount is bigger than 1000.,SELECT ?T1_date_of_transaction WHERE { ?T1 a :transactions . ?T1 :transactions\#date_of_transaction ?T1_date_of_transaction . ?T1 :transactions\#share_count ?T1_share_count . ?T1 :transactions\#amount_of_transaction ?T1_amount_of_transaction . FILTER(?T1_share_count > 100 || ?T1_amount_of_transaction > 1000) .        }
