kg_name,question,query
academic,return me the author in the ' University of Michigan ' whose papers have the most total citations .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#citation_num ?T2_citation_num . ?T3 :organization\#name ?T3_name . ?T2 a :publication . ?T14 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#citation_num ?T2_citation_num . ?T3 :organization\#name ?T3_name . FILTER(?T3_name = 'University of Michigan') .        } GROUP BY ?T1_name  ORDER BY DESC ((sum( ?T2_citation_num) as ?aggregation_T2_citation_num_10 )) LIMIT 1
academic,return me the author in the ' University of Michigan ' whose papers in Databases area have the most total citations .,SELECT ?T1_name WHERE { ?T1 a :author . ?T15 a :writes . ?T15 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#citation_num ?T2_citation_num . ?T3 :domain\#name ?T3_name . ?T4 :organization\#name ?T4_name . ?T2 a :publication . ?T15 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#citation_num ?T2_citation_num . ?T3 :domain\#name ?T3_name . ?T4 :organization\#name ?T4_name . ?T16 a :domain_publication . ?T16 :domain_publication\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#citation_num ?T2_citation_num . ?T3 :domain\#name ?T3_name . ?T4 :organization\#name ?T4_name . ?T3 a :domain . ?T16 :domain_publication\#ref-did ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#citation_num ?T2_citation_num . ?T3 :domain\#name ?T3_name . ?T4 :organization\#name ?T4_name . FILTER(?T3_name = 'Databases' && ?T4_name = 'University of Michigan') .        } GROUP BY ?T1_name  ORDER BY DESC ((sum( ?T2_citation_num) as ?aggregation_T2_citation_num_47 )) LIMIT 1
academic,return me the papers written by ' H. V. Jagadish ' and ' Divesh Srivastava ' with the most number of citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :author\#name ?T2_name . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'Divesh Srivastava' && ?T2_name = 'H. V. Jagadish') .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,"return me the conferences, which have more than 10 papers by ' H. V. Jagadish ' .",SELECT ?T1_name WHERE { ?T1 a :conference . ?T3 a :publication . ?T3 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T14 a :writes . ?T14 :writes\#ref-pid ?T3 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :conference\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'H. V. Jagadish') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_23 ) > '10')
academic,"return me the conference, which have the most number of papers by ' H. V. Jagadish ' .",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :conference . ?T2 a :publication . ?T2 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T14 a :writes . ?T14 :writes\#ref-pid ?T2 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T3 a :author . ?T14 :writes\#ref-aid ?T3 .  ?T1 :conference\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . FILTER(?T3_name = 'H. V. Jagadish') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_192 )) LIMIT 1
academic,"return me the journals, which have more than 10 papers by ' H. V. Jagadish ' .",SELECT ?T1_name WHERE { ?T1 a :journal . ?T3 a :publication . ?T3 :publication\#ref-jid ?T1 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T14 a :writes . ?T14 :writes\#ref-pid ?T3 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :journal\#name ?T1_name . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'H. V. Jagadish') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_146 ) > '10')
academic,"return me the journal, which have the most number of papers by ' H. V. Jagadish ' .",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :journal . ?T2 a :publication . ?T2 :publication\#ref-jid ?T1 .  ?T1 :journal\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T14 a :writes . ?T14 :writes\#ref-pid ?T2 .  ?T1 :journal\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . ?T3 a :author . ?T14 :writes\#ref-aid ?T3 .  ?T1 :journal\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :author\#name ?T3_name . FILTER(?T3_name = 'H. V. Jagadish') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_70 )) LIMIT 1
academic,return me the paper with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper in Databases area with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :domain_publication . ?T13 :domain_publication\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :domain\#name ?T2_name . ?T2 a :domain . ?T13 :domain_publication\#ref-did ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :domain\#name ?T2_name . FILTER(?T2_name = 'Databases') .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper in PVLDB with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . FILTER(?T2_name = 'PVLDB') .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper in VLDB conference with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . FILTER(?T2_name = 'VLDB') .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper by ' H. V. Jagadish ' with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T13 a :writes . ?T13 :writes\#ref-pid ?T1 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :author\#name ?T2_name . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :author\#name ?T2_name . FILTER(?T2_name = 'H. V. Jagadish') .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper after 2000 with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T1 :publication\#year ?T1_year . FILTER(?T1_year > 2000) .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper after 2000 in PVLDB with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :journal . ?T1 :publication\#ref-jid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :journal\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'PVLDB' && ?T1_year > 2000) .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the paper after 2000 in VLDB conference with the most citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T2 a :conference . ?T1 :publication\#ref-cid ?T2 .  ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . ?T2 :conference\#name ?T2_name . ?T1 :publication\#year ?T1_year . FILTER(?T2_name = 'VLDB' && ?T1_year > 2000) .        }   ORDER BY DESC (?T1_citation_num) LIMIT 1
academic,return me the authors who have more than 10 papers in PVLDB .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T3 a :publication . ?T14 :writes\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :journal . ?T3 :publication\#ref-jid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'PVLDB') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_139 ) > '10')
academic,return me the authors who have the most number of papers in PVLDB .,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :journal\#name ?T3_name . ?T2 a :publication . ?T14 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :journal\#name ?T3_name . ?T3 a :journal . ?T2 :publication\#ref-jid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :journal\#name ?T3_name . FILTER(?T3_name = 'PVLDB') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_183 )) LIMIT 1
academic,return me the authors who have more than 10 papers containing keyword ' Relational Database ' .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :domain_author . ?T14 :domain_author\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T15 a :domain . ?T14 :domain_author\#ref-did ?T15 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T16 a :domain_keyword . ?T16 :domain_keyword\#ref-did ?T15 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T2 a :keyword . ?T16 :domain_keyword\#ref-kid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T17 a :publication_keyword . ?T17 :publication_keyword\#ref-kid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T3 a :publication . ?T17 :publication_keyword\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . FILTER(?T2_keyword = 'Relational Database') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_155 ) > '10')
academic,"return me the conferences, which have more than 60 papers containing keyword ' Relational Database ' .",SELECT ?T1_name WHERE { ?T1 a :conference . ?T3 a :publication . ?T3 :publication\#ref-cid ?T1 .  ?T1 :conference\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T3 .  ?T1 :conference\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T2 a :keyword . ?T14 :publication_keyword\#ref-kid ?T2 .  ?T1 :conference\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . FILTER(?T2_keyword = 'Relational Database') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_64 ) > '60')
academic,"return me the journals, which have more than 60 papers containing keyword ' Relational Database ' .",SELECT ?T1_name WHERE { ?T1 a :journal . ?T3 a :publication . ?T3 :publication\#ref-jid ?T1 .  ?T1 :journal\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-pid ?T3 .  ?T1 :journal\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . ?T2 a :keyword . ?T14 :publication_keyword\#ref-kid ?T2 .  ?T1 :journal\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T3 :publication\#title ?T3_title . FILTER(?T2_keyword = 'Relational Database') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_44 ) > '60')
academic,"return me the keywords, which have been contained by more than 100 papers in VLDB conference .",SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T3 a :publication . ?T14 :publication_keyword\#ref-pid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :conference . ?T3 :publication\#ref-cid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :conference\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'VLDB') .        } GROUP BY ?T1_keyword   HAVING(count( ?T3_title) as ?aggregation_T3_title_155 ) > '100')
academic,"return me the keywords, which have been contained by more than 100 papers in PVLDB .",SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T3 a :publication . ?T14 :publication_keyword\#ref-pid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :journal . ?T3 :publication\#ref-jid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :journal\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'PVLDB') .        } GROUP BY ?T1_keyword   HAVING(count( ?T3_title) as ?aggregation_T3_title_66 ) > '100')
academic,"return me the keywords, which have been contained by more than 10 papers of ' H. V. Jagadish ' .",SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T14 a :publication_keyword . ?T14 :publication_keyword\#ref-kid ?T1 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T3 a :publication . ?T14 :publication_keyword\#ref-pid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T15 a :writes . ?T15 :writes\#ref-pid ?T3 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :author . ?T15 :writes\#ref-aid ?T2 .  ?T1 :keyword\#keyword ?T1_keyword . ?T2 :author\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'H. V. Jagadish') .        } GROUP BY ?T1_keyword   HAVING(count( ?T3_title) as ?aggregation_T3_title_195 ) > '10')
academic,return me the authors who have more than 10 papers in the VLDB conference .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T3 a :publication . ?T14 :writes\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#title ?T3_title . ?T2 a :conference . ?T3 :publication\#ref-cid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :conference\#name ?T2_name . ?T3 :publication\#title ?T3_title . FILTER(?T2_name = 'VLDB') .        } GROUP BY ?T1_name   HAVING(count( ?T3_title) as ?aggregation_T3_title_112 ) > '10')
academic,return me the author who has the most number of papers in the VLDB conference .,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :conference\#name ?T3_name . ?T2 a :publication . ?T14 :writes\#ref-pid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :conference\#name ?T3_name . ?T3 a :conference . ?T2 :publication\#ref-cid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :publication\#title ?T2_title . ?T3 :conference\#name ?T3_name . FILTER(?T3_name = 'VLDB') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_title) as ?aggregation_T2_title_142 )) LIMIT 1
academic,return me the author in the ' University of Michigan ' whose papers have more than 5000 total citations .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :organization\#name ?T2_name . ?T3 :publication\#citation_num ?T3_citation_num . ?T3 a :publication . ?T14 :writes\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :organization\#name ?T2_name . ?T3 :publication\#citation_num ?T3_citation_num . FILTER(?T2_name = 'University of Michigan') .        } GROUP BY ?T1_name   HAVING(sum( ?T3_citation_num)  > 5000)
academic,return me the author in the ' University of Michigan ' in Databases area whose papers have more than 5000 total citations .,SELECT ?T1_name WHERE { ?T1 a :author . ?T15 a :domain_author . ?T15 :domain_author\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T4 :publication\#citation_num ?T4_citation_num . ?T2 a :domain . ?T15 :domain_author\#ref-did ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T4 :publication\#citation_num ?T4_citation_num . ?T16 a :domain_publication . ?T16 :domain_publication\#ref-did ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T4 :publication\#citation_num ?T4_citation_num . ?T4 a :publication . ?T16 :domain_publication\#ref-pid ?T4 .  ?T1 :author\#name ?T1_name . ?T2 :domain\#name ?T2_name . ?T3 :organization\#name ?T3_name . ?T4 :publication\#citation_num ?T4_citation_num . FILTER(?T2_name = 'Databases' && ?T3_name = 'University of Michigan') .        } GROUP BY ?T1_name   HAVING(sum( ?T4_citation_num)  > 5000)
imdb,What year is the movie ' The Imitation Game ' from ?,SELECT ?T1_release_year WHERE { ?T1 a :movie . ?T1 :movie\#release_year ?T1_release_year . ?T1 :movie\#title ?T1_title . FILTER(?T1_title = 'The Imitation Game') .        }
imdb,What year was ' Benedict Cumberbatch ' born ?,SELECT ?T1_birth_year WHERE { ?T1 a :actor . ?T1 :actor\#birth_year ?T1_birth_year . ?T1 :actor\#name ?T1_name . FILTER(?T1_name = 'Benedict Cumberbatch') .        }
imdb,What is the nationality of the actress ' Christoph Waltz ' ?,SELECT ?T1_nationality WHERE { ?T1 a :actor . ?T1 :actor\#nationality ?T1_nationality . ?T1 :actor\#name ?T1_name . FILTER(?T1_name = 'Christoph Waltz') .        }
imdb,What is the nationality of the actor ' Christoph Waltz ' ?,SELECT ?T1_nationality WHERE { ?T1 a :actor . ?T1 :actor\#nationality ?T1_nationality . ?T1 :actor\#name ?T1_name . FILTER(?T1_name = 'Christoph Waltz') .        }
imdb,Find all movies produced in 2015,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#release_year ?T1_release_year . FILTER(?T1_release_year = 2015) .        }
imdb,Find all actors born in ' Tehran ',SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . FILTER(?T1_birth_city = 'Tehran') .        }
imdb,Find all actors who are from Afghanistan,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#nationality ?T1_nationality . FILTER(?T1_nationality = 'Afghanistan') .        }
imdb,Find all actors who were born in 1984,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_year ?T1_birth_year . FILTER(?T1_birth_year = 1984) .        }
imdb,When was ' Kevin Spacey ' born ?,SELECT ?T1_birth_year WHERE { ?T1 a :actor . ?T1 :actor\#birth_year ?T1_birth_year . ?T1 :actor\#name ?T1_name . FILTER(?T1_name = 'actor_name0') .        }
imdb,In what year was ' Kevin Spacey ' born ?,SELECT ?T1_birth_year WHERE { ?T1 a :actor . ?T1 :actor\#birth_year ?T1_birth_year . ?T1 :actor\#name ?T1_name . FILTER(?T1_name = 'actor_name0') .        }
imdb,Where is the birth place of ' Kevin Spacey ',SELECT ?T1_birth_city WHERE { ?T1 a :director . ?T1 :director\#birth_city ?T1_birth_city . ?T1 :director\#name ?T1_name . FILTER(?T1_name = 'director_name0') .        }
imdb,In what city was ' Kevin Spacey ' born ?,SELECT ?T1_birth_city WHERE { ?T1 a :director . ?T1 :director\#birth_city ?T1_birth_city . ?T1 :director\#name ?T1_name . FILTER(?T1_name = 'director_name0') .        }
imdb,What is the nationality of ' Kevin Spacey ' ?,SELECT ?T1_nationality WHERE { ?T1 a :director . ?T1 :director\#nationality ?T1_nationality . ?T1 :director\#name ?T1_name . FILTER(?T1_name = 'director_name0') .        }
imdb,How much was the budget of ' Finding Nemo ',SELECT ?T1_budget WHERE { ?T1 a :movie . ?T1 :movie\#budget ?T1_budget . ?T1 :movie\#title ?T1_title . FILTER(?T1_title = 'Finding Nemo') .        }
imdb,Find all movies directed by ' Steven Spielberg ' after 2006,SELECT ?T1_title WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Steven Spielberg' && ?T1_release_year > 2006) .        }
imdb,Who is the director of the movie ' James Bond ' ?,SELECT ?T1_name WHERE { ?T2 :movie\#ref-director_id ?T1 . FILTER(?T2_title = 'James Bond') .        }
imdb,Who directed the movie ' James Bond ' ?,SELECT ?T1_name WHERE { ?T2 :movie\#ref-director_id ?T1 . FILTER(?T2_title = 'James Bond') .        }
imdb,Find the actor who played ' Alan Turing ' in the movie ' The Imitation Game ',SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . ?T3 :movie\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }
imdb,Who acted ' Alan Turing ' in the movie ' The Imitation Game ' ?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . ?T3 :movie\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }
imdb,Who was the actor that played ' Alan Turing ' in the movie ' The Imitation Game ' ?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . ?T3 :movie\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }
imdb,Who acts as ' Alan Turing ' in the movie ' The Imitation Game ' ?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . ?T3 :movie\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }
imdb,Who is the actor playing ' Alan Turing ' in ' The Imitation Game ' ?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . ?T3 :movie\#title ?T3_title . FILTER(?T2_role = 'Alan Turing' && ?T3_title = 'The Imitation Game') .        }
imdb,What is the genre of the movie ' Jurassic Park ' ?,SELECT ?T1_genre WHERE { ?T2 :movie\#ref-genre_id ?T1 . FILTER(?T2_title = 'Jurassic Park') .        }
imdb,Who was the director of the movie Joy from 2015 ?,SELECT ?T1_name WHERE { ?T2 :movie\#ref-director_id ?T1 . FILTER(?T2_release_year = 2015 && ?T2_title = 'Joy') .        }
imdb,Find all movies written by ' Matt Damon ',SELECT ?T1_title WHERE { ?T1 :movie\#ref-writer_id ?T2 . FILTER(?T2_name = 'Matt Damon') .        }
imdb,Find all movies written and produced by ' Woody Allen ',SELECT ?T1_title WHERE { ?T2 a :producer . ?T14 a :made_by . ?T14 :made_by\#ref-pid ?T2 .  ?T1 :movie\#title ?T1_title . ?T2 :producer\#name ?T2_name . ?T3 :writer\#name ?T3_name . ?T15 a :copyright . ?T14 :made_by\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :producer\#name ?T2_name . ?T3 :writer\#name ?T3_name . ?T16 a :written_by . ?T16 :written_by\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :producer\#name ?T2_name . ?T3 :writer\#name ?T3_name . ?T3 a :writer . ?T16 :written_by\#ref-wid ?T3 .  ?T1 :movie\#title ?T1_title . ?T2 :producer\#name ?T2_name . ?T3 :writer\#name ?T3_name . FILTER(?T2_name = 'Woody Allen' && ?T3_name = 'Woody Allen') .        }
imdb,Find all movies featuring ' Robin Wright ',SELECT ?T1_title WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Robin Wright') .        }
imdb,What are all the movies featuring ' Robin Wright ' ?,SELECT ?T1_title WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Robin Wright') .        }
imdb,What was the budget of the movie Juno from 2007 ?,SELECT ?T1_budget WHERE { ?T1 a :movie . ?T1 :movie\#budget ?T1_budget . ?T1 :movie\#release_year ?T1_release_year . ?T1 :movie\#title ?T1_title . FILTER(?T1_release_year = 2007 && ?T1_title = 'Juno') .        }
imdb,Find all Sci-Fi produced in year 2010,SELECT ?T1_title WHERE { ?T1 :movie\#ref-genre_id ?T2 . FILTER(?T2_genre = 'Sci-Fi' && ?T1_release_year = 2010) .        }
imdb,Find all actors born in ' Austin ' after 1980,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#birth_year ?T1_birth_year . FILTER(?T1_birth_city = 'Austin' && ?T1_birth_year > 1980) .        }
imdb,Who are the actors born in ' Austin ' after 1980 ?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#birth_year ?T1_birth_year . FILTER(?T1_birth_city = 'Austin' && ?T1_birth_year > 1980) .        }
imdb,Find all movies by directors born in ' Los Angeles ',SELECT ?T1_title WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_birth_city = 'Los Angeles') .        }
imdb,Find all actors who were born in ' New York City ' in 1984,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#birth_year ?T1_birth_year . FILTER(?T1_birth_city = 'New York City' && ?T1_birth_year = 1984) .        }
imdb,Find all movies about nuclear weapons,SELECT ?T1_title WHERE { ?T1 :movie\#ref-keyword_id ?T2 . FILTER(?T2_keyword = 'nuclear weapons') .        }
imdb,Which movies did ' Alfred Hitchcock ' direct ?,SELECT ?T1_title WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Alfred Hitchcock') .        }
imdb,Find all movies directed by ' Asghar Farhadi ' and featuring ' Taraneh Alidoosti ',SELECT ?T1_title WHERE { ?T2 a :actor . ?T14 a :cast_of_actors . ?T14 :cast_of_actors\#ref-aid ?T2 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T15 a :copyright . ?T14 :cast_of_actors\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T16 a :directed_by . ?T16 :directed_by\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T3 a :director . ?T16 :directed_by\#ref-did ?T3 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . FILTER(?T2_name = 'Taraneh Alidoosti' && ?T3_name = 'Asghar Farhadi') .        }
imdb,What are all the movies directed by ' Asghar Farhadi ' featuring ' Taraneh Alidoosti ' ?,SELECT ?T1_title WHERE { ?T2 a :actor . ?T14 a :cast_of_actors . ?T14 :cast_of_actors\#ref-aid ?T2 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T15 a :copyright . ?T14 :cast_of_actors\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T16 a :directed_by . ?T16 :directed_by\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T3 a :director . ?T16 :directed_by\#ref-did ?T3 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . FILTER(?T2_name = 'Taraneh Alidoosti' && ?T3_name = 'Asghar Farhadi') .        }
imdb,How many movies are there that are directed by ' Asghar Farhadi ' and featuring ' Taraneh Alidoosti ' ?,SELECT ?T1_title WHERE { ?T2 a :actor . ?T14 a :cast_of_actors . ?T14 :cast_of_actors\#ref-aid ?T2 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T15 a :copyright . ?T14 :cast_of_actors\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T16 a :directed_by . ?T16 :directed_by\#ref-msid ?T15 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . ?T3 a :director . ?T16 :directed_by\#ref-did ?T3 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :director\#name ?T3_name . FILTER(?T2_name = 'Taraneh Alidoosti' && ?T3_name = 'Asghar Farhadi') .        }
imdb,What are all the tv series created by ' Shonda Rhimes ' ?,SELECT ?T1_title WHERE { ?T1 :tv_series\#ref-producer_id ?T2 . FILTER(?T2_name = 'Shonda Rhimes') .        }
imdb,Who acts ' Olivia Pope ' in the series Scandal ?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . ?T3 :tv_series\#title ?T3_title . FILTER(?T2_role = 'Olivia Pope' && ?T3_title = 'Scandal') .        }
imdb,Who is the writer of the movie ' The Truman Show ',SELECT ?T1_name WHERE { ?T2 :movie\#ref-writer_id ?T1 . FILTER(?T2_title = 'The Truman Show') .        }
imdb,What are the series featuring ' Scott Foley ' ?,SELECT ?T1_title WHERE { ?T1 :tv_series\#ref-actor_id ?T2 . FILTER(?T2_name = 'Scott Foley') .        }
imdb,What are the series in which ' Scott Foley ' is an actor ?,SELECT ?T1_title WHERE { ?T1 :tv_series\#ref-actor_id ?T2 . FILTER(?T2_name = 'Scott Foley') .        }
imdb,Find the directors of all movies featuring ' Kate Winslet ',SELECT ?T1_name WHERE { ?T1 a :director . ?T13 a :directed_by . ?T13 :directed_by\#ref-did ?T1 .  ?T1 :director\#name ?T1_name . ?T2 :actor\#name ?T2_name . ?T14 a :copyright . ?T13 :directed_by\#ref-msid ?T14 .  ?T1 :director\#name ?T1_name . ?T2 :actor\#name ?T2_name . ?T15 a :cast_of_actors . ?T15 :cast_of_actors\#ref-msid ?T14 .  ?T1 :director\#name ?T1_name . ?T2 :actor\#name ?T2_name . ?T2 a :actor . ?T15 :cast_of_actors\#ref-aid ?T2 .  ?T1 :director\#name ?T1_name . ?T2 :actor\#name ?T2_name . FILTER(?T2_name = 'Kate Winslet') .        }
imdb,Find the producers of all movies in which ' Kate Winslet ' is an actor,SELECT ?T1_name WHERE { ?T1 a :producer . ?T13 a :made_by . ?T13 :made_by\#ref-pid ?T1 .  ?T1 :producer\#name ?T1_name . ?T2 :actor\#name ?T2_name . ?T14 a :copyright . ?T13 :made_by\#ref-msid ?T14 .  ?T1 :producer\#name ?T1_name . ?T2 :actor\#name ?T2_name . ?T15 a :cast_of_actors . ?T15 :cast_of_actors\#ref-msid ?T14 .  ?T1 :producer\#name ?T1_name . ?T2 :actor\#name ?T2_name . ?T2 a :actor . ?T15 :cast_of_actors\#ref-aid ?T2 .  ?T1 :producer\#name ?T1_name . ?T2 :actor\#name ?T2_name . FILTER(?T2_name = 'Kate Winslet') .        }
imdb,Who is the director of the tv series ' House of Cards ' from 2013 ?,SELECT ?T1_name WHERE { ?T2 :tv_series\#ref-director_id ?T1 . FILTER(?T2_release_year = 2013 && ?T2_title = 'House of Cards') .        }
imdb,Find all the female actors from Austin,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#gender ?T1_gender . FILTER(?T1_birth_city = 'Austin' && ?T1_gender = 'female') .        }
