kg_name,question,query
imdb,Find all actors from Italy born after 1980,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_year ?T1_birth_year . ?T1 :actor\#nationality ?T1_nationality . FILTER(?T1_birth_year > 1980 && ?T1_nationality = 'Italy') .        }
imdb,Find all the female actors born in ' New York City ' after 1980,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#birth_year ?T1_birth_year . ?T1 :actor\#gender ?T1_gender . FILTER(?T1_birth_city = 'New York City' && ?T1_birth_year > 1980 && ?T1_gender = 'female') .        }
imdb,Find all the female actors in the movie ' Saving Private Ryan ',SELECT ?T1_name WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T1_gender = 'female' && ?T2_title = 'Saving Private Ryan') .        }
imdb,Find all the directors who are from Afghanistan,SELECT ?T1_name WHERE { ?T1 a :director . ?T1 :director\#name ?T1_name . ?T1 :director\#nationality ?T1_nationality . FILTER(?T1_nationality = 'Afghanistan') .        }
imdb,Find the actors who played in the movie ' Camp X-Ray ',SELECT ?T1_name WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T2_title = 'Camp X-Ray') .        }
imdb,Find all actors from Canada who acted in ' James Bond ' movies,SELECT ?T1_name WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T1_nationality = 'Canada' && ?T2_title = 'James Bond') .        }
imdb,find all films in which ' Rowan Atkinson ' acted as ' Mr. Bean ',SELECT ?T1_title WHERE { ?T2 a :actor . ?T3 a :cast_of_actors . ?T3 :cast_of_actors\#ref-aid ?T2 .  ?T1 :movie\#title ?T1_title . ?T2 :actor\#name ?T2_name . ?T3 :cast_of_actors\#role ?T3_role . FILTER(?T2_name = 'Rowan Atkinson' && ?T3_role = 'Mr. Bean') .        }
imdb,where is the director of ' The Past ' from,SELECT ?T1_birth_city WHERE { ?T2 :movie\#ref-director_id ?T1 . FILTER(?T2_title = 'The Past') .        }
imdb,who acted the role of ' Mr. Bean ',SELECT ?T1_name WHERE { ?T1 a :actor . ?T2 a :cast_of_actors . ?T2 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :cast_of_actors\#role ?T2_role . FILTER(?T2_role = 'Mr. Bean') .        }
imdb,what are the genres of movies directed by ' Asghar Farhadi ',SELECT ?T1_genre WHERE { ?T1 a :genre . ?T13 a :classification . ?T13 :classification\#ref-gid ?T1 .  ?T1 :genre\#genre ?T1_genre . ?T2 :director\#name ?T2_name . ?T14 a :copyright . ?T13 :classification\#ref-msid ?T14 .  ?T1 :genre\#genre ?T1_genre . ?T2 :director\#name ?T2_name . ?T15 a :directed_by . ?T15 :directed_by\#ref-msid ?T14 .  ?T1 :genre\#genre ?T1_genre . ?T2 :director\#name ?T2_name . ?T2 a :director . ?T15 :directed_by\#ref-did ?T2 .  ?T1 :genre\#genre ?T1_genre . ?T2 :director\#name ?T2_name . FILTER(?T2_name = 'Asghar Farhadi') .        }
imdb,Which movie had the character ' Daffy Duck ',SELECT ?T1_title WHERE { ?T1 :movie\#ref-cast_of_actors_id ?T2 . FILTER(?T2_role = 'Daffy Duck') .        }
imdb,What are the major roles in the movie ' Daddy Long Legs ',SELECT ?T1_role WHERE { ?T2 :movie\#ref-cast_of_actors_id ?T1 . FILTER(?T2_title = 'Daddy Long Legs') .        }
imdb,List all the directors of movies about nuclear weapons,SELECT ?T1_name WHERE { ?T1 a :director . ?T13 a :directed_by . ?T13 :directed_by\#ref-did ?T1 .  ?T1 :director\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T14 a :copyright . ?T13 :directed_by\#ref-msid ?T14 .  ?T1 :director\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T15 a :tags . ?T15 :tags\#ref-msid ?T14 .  ?T1 :director\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . ?T2 a :keyword . ?T15 :tags\#ref-kid ?T2 .  ?T1 :director\#name ?T1_name . ?T2 :keyword\#keyword ?T2_keyword . FILTER(?T2_keyword = 'nuclear weapons') .        }
imdb,What is the number of movies in which ' Jennifer Aniston ' acted after 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_18 ) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Jennifer Aniston' && ?T1_release_year > 2010) .        }
imdb,What is the number of actors in the movie ' Saving Private Ryan ' ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_12 ) WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T2_title = 'Saving Private Ryan') .        }
imdb,How many actors are in the movie ' Saving Private Ryan ' ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_15 ) WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T2_title = 'Saving Private Ryan') .        }
imdb,How many movies did ' Steven Spielberg ' direct ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_84 ) WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Steven Spielberg') .        }
imdb,How many movies were produced in the year 2013 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_85 ) WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#release_year ?T1_release_year . FILTER(?T1_release_year = 2013) .        }
imdb,What is the number of movies produced in 2013 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_72 ) WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#release_year ?T1_release_year . FILTER(?T1_release_year = 2013) .        }
imdb,What is the number of movies directed by ' Woody Allen ' per year ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_28 ) ?T1_release_year WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Woody Allen') .        } GROUP BY ?T1_release_year
imdb,How many movies did ' Shahab Hosseini ' act in ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_176 ) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }
imdb,What is the number of movies in which ' Shahab Hosseini ' acted ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_117 ) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }
imdb,What is the number of movies featuring ' Shahab Hosseini ' ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_193 ) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }
imdb,How many movies did ' Shahab Hosseini ' act in,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_1 ) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Shahab Hosseini') .        }
imdb,How many actors were born in ' Los Angeles ' after 2000 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_0 ) WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#birth_year ?T1_birth_year . FILTER(?T1_birth_city = 'Los Angeles' && ?T1_birth_year > 2000) .        }
imdb,How many movies did ' Humphrey Bogart ' act in before 1942 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_11 ) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Humphrey Bogart' && ?T1_release_year < 1942) .        }
imdb,What is the number of movies that ' Brad Pitt ' acts in per year ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_0 ) ?T1_release_year WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Brad Pitt') .        } GROUP BY ?T1_release_year
imdb,How many movies about Iraq war were produced in 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_188 ) WHERE { ?T1 :movie\#ref-keyword_id ?T2 . FILTER(?T2_keyword = 'Iraq war' && ?T1_release_year = 2015) .        }
imdb,How many movies about Persians were released after 1990 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_184 ) WHERE { ?T1 :movie\#ref-keyword_id ?T2 . FILTER(?T2_keyword = 'Persians' && ?T1_release_year > 1990) .        }
imdb,How many movies did ' Quentin Tarantino ' direct after 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_158 ) WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Quentin Tarantino' && ?T1_release_year > 2010) .        }
imdb,How many movies did ' Quentin Tarantino ' direct before 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_50 ) WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Quentin Tarantino' && ?T1_release_year < 2010) .        }
imdb,How many movies did ' Quentin Tarantino ' direct before 2002 and after 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_105 ) WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Quentin Tarantino' && ?T1_release_year < 2010 && ?T1_release_year > 2002) .        }
imdb,How many female actors were born in ' New York City ' after 1980 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_70 ) WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#birth_city ?T1_birth_city . ?T1 :actor\#birth_year ?T1_birth_year . ?T1 :actor\#gender ?T1_gender . FILTER(?T1_birth_city = 'New York City' && ?T1_birth_year > 1980 && ?T1_gender = 'female') .        }
imdb,find the number of actors from Iran who played in ' Jim Jarmusch ' movies,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_56 ) WHERE { ?T1 a :actor . ?T13 a :cast_of_actors . ?T13 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T1 :actor\#nationality ?T1_nationality . ?T2 :director\#name ?T2_name . ?T14 a :copyright . ?T13 :cast_of_actors\#ref-msid ?T14 .  ?T1 :actor\#name ?T1_name . ?T1 :actor\#nationality ?T1_nationality . ?T2 :director\#name ?T2_name . ?T15 a :directed_by . ?T15 :directed_by\#ref-msid ?T14 .  ?T1 :actor\#name ?T1_name . ?T1 :actor\#nationality ?T1_nationality . ?T2 :director\#name ?T2_name . ?T2 a :director . ?T15 :directed_by\#ref-did ?T2 .  ?T1 :actor\#name ?T1_name . ?T1 :actor\#nationality ?T1_nationality . ?T2 :director\#name ?T2_name . FILTER(?T1_nationality = 'Iran' && ?T2_name = 'Jim Jarmusch') .        }
imdb,How many actors from China have acted in ' Rush Hour 3 ',SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_151 ) WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T1_nationality = 'China' && ?T2_title = 'Rush Hour 3') .        }
imdb,Find all movies that star both ' Woody Strode ' and ' Jason Robards ',SELECT ?T1_title WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_name = 'Woody Strode' && ?T2_name = 'Jason Robards') .        }
imdb,Find all actors who acted in the same movie as ' Tom Hanks ',SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#name ?T1_name . FILTER(?T1_name = 'Tom Hanks') .        }
imdb,What movies have the same director as the movie ' Revolutionary Road ' ?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#title ?T1_title . FILTER(?T1_title = 'Revolutionary Road') .        }
imdb,Find the movie which is classified in the most number of genres,SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 :movie\#ref-genre_id ?T2 .        } GROUP BY ?T1_title  ORDER BY DESC ((count( ?T2_genre) as ?aggregation_T2_genre_99 )) LIMIT 1
imdb,which movie has the most number of actors from China ?,SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 :movie\#ref-actor_id ?T2 . FILTER(?T2_nationality = 'China') .        } GROUP BY ?T1_title  ORDER BY DESC ((count( ?T2_name) as ?aggregation_T2_name_92 )) LIMIT 1
imdb,Find the actors who played in the latest movie by ' Quentin Tarantino ',SELECT ?T1_name WHERE { ?T1 a :actor . ?T14 a :cast_of_actors . ?T14 :cast_of_actors\#ref-aid ?T1 .  ?T1 :actor\#name ?T1_name . ?T2 :movie\#release_year ?T2_release_year . ?T3 :director\#name ?T3_name . ?T15 a :copyright . ?T14 :cast_of_actors\#ref-msid ?T15 .  ?T1 :actor\#name ?T1_name . ?T2 :movie\#release_year ?T2_release_year . ?T3 :director\#name ?T3_name . ?T16 a :directed_by . ?T16 :directed_by\#ref-msid ?T15 .  ?T1 :actor\#name ?T1_name . ?T2 :movie\#release_year ?T2_release_year . ?T3 :director\#name ?T3_name . ?T3 a :director . ?T16 :directed_by\#ref-did ?T3 .  ?T1 :actor\#name ?T1_name . ?T2 :movie\#release_year ?T2_release_year . ?T3 :director\#name ?T3_name . FILTER(?T3_name = 'Quentin Tarantino') .        }   ORDER BY DESC (?T2_release_year) LIMIT 1
imdb,Find the name and budget of the latest movie by ' Quentin Tarantino ',SELECT ?T1_budget ?T1_title WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Quentin Tarantino') .        }   ORDER BY DESC (?T1_release_year) LIMIT 1
imdb,What is the latest movie by ' Jim Jarmusch ',SELECT ?T1_title WHERE { ?T1 :movie\#ref-director_id ?T2 . FILTER(?T2_name = 'Jim Jarmusch') .        }   ORDER BY DESC (?T1_release_year) LIMIT 1
imdb,Which producer has worked with the most number of directors ?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :producer . ?T13 a :made_by . ?T13 :made_by\#ref-pid ?T1 .  ?T1 :producer\#name ?T1_name . ?T2 :director\#name ?T2_name . ?T14 a :copyright . ?T13 :made_by\#ref-msid ?T14 .  ?T1 :producer\#name ?T1_name . ?T2 :director\#name ?T2_name . ?T15 a :directed_by . ?T15 :directed_by\#ref-msid ?T14 .  ?T1 :producer\#name ?T1_name . ?T2 :director\#name ?T2_name . ?T2 a :director . ?T15 :directed_by\#ref-did ?T2 .  ?T1 :producer\#name ?T1_name . ?T2 :director\#name ?T2_name .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_name) as ?aggregation_T2_name_152 )) LIMIT 1
imdb,Find the latest movie which ' Gabriele Ferzetti ' acted in,SELECT ?T1_name WHERE { ?T2 :movie\#ref-actor_id ?T1 . FILTER(?T1_name = 'Gabriele Ferzetti') .        }   ORDER BY DESC (?T2_release_year) LIMIT 1
restaurants,how many buttercup kitchen are there in san francisco ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :location . ?T2 :location\#ref-restaurant_id ?T1 .  ?T2 :location\#city_name ?T2_city_name . ?T1 :restaurant\#name ?T1_name . FILTER(?T2_city_name = 'san francisco' && ?T1_name = 'buttercup kitchen') .        }
restaurants,how many chinese restaurants are there in the bay area ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#region ?T2_region . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_region = 'bay area' && ?T1_food_type = 'chinese') .        }
restaurants,how many places for chinese food are there in the bay area ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#region ?T2_region . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_region = 'bay area' && ?T1_food_type = 'chinese') .        }
restaurants,how many chinese places are there in the bay area ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#region ?T2_region . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_region = 'bay area' && ?T1_food_type = 'chinese') .        }
restaurants,how many places for chinese are there in the bay area ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#region ?T2_region . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_region = 'bay area' && ?T1_food_type = 'chinese') .        }
restaurants,how many jamerican cuisine are there in santa cruz county ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#county ?T2_county . ?T1 :restaurant\#name ?T1_name . FILTER(?T2_county = 'santa cruz county' && ?T1_name = 'jamerican cuisine') .        }
restaurants,where is jamerican cuisine ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#name ?T2_name . FILTER(?T2_name = 'jamerican cuisine') .        }
restaurants,what is the best french restaurant in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_148 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,What is the best french in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_149 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,What is the best place in san francisco for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_103 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Give me the best place in san francisco for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_92 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Where is the best french in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_2 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Give me the best french in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_180 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Where is the best french restaurant in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_37 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Give me the best restaurant in san francisco for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_174 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Give me the best french restaurant in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_70 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,What is the best restaurant in san francisco for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_4 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,Where is the best restaurant in san francisco for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T2_food_type = 'french' && ?T2_rating = (?T23_food_type)) .       {SELECT (max( ?T23_rating) as ?aggregation_T23_rating_70 ) WHERE { ?T23 a :restaurant . ?T24 a :location . ?T24 :location\#ref-restaurant_id ?T23 .  ?T23 :restaurant\#rating ?T23_rating . ?T24 :location\#city_name ?T24_city_name . ?T23 :restaurant\#food_type ?T23_food_type . FILTER(?T24_city_name = 'san francisco' && ?T23_food_type = 'french') .        }    } }
restaurants,where is denny in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#name ?T2_name . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#name ?T2_name . FILTER(?T3_region = 'bay area' && ?T2_name = 'denny') .        }
restaurants,what are some good restaurants on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd' && ?T2_rating > 2.5) .        }
restaurants,give me some good restaurants on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd' && ?T2_rating > 2.5) .        }
restaurants,give me a good restaurant on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd' && ?T2_rating > 2.5) .        }
restaurants,what is a good restaurant on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd' && ?T2_rating > 2.5) .        }
restaurants,where can we find a restaurant in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . FILTER(?T1_city_name = 'alameda') .        }
restaurants,give me a restaurant in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . FILTER(?T1_city_name = 'alameda') .        }
restaurants,where can we find some restaurants in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . FILTER(?T1_city_name = 'alameda') .        }
restaurants,where is a restaurant in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . FILTER(?T1_city_name = 'alameda') .        }
restaurants,give me some restaurants in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . FILTER(?T1_city_name = 'alameda') .        }
restaurants,give me some restaurants good for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
restaurants,where are some restaurants good for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
restaurants,how many places for french food are there in palo alto ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :location . ?T2 :location\#ref-restaurant_id ?T1 .  ?T2 :location\#city_name ?T2_city_name . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_city_name = 'palo alto' && ?T1_food_type = 'french') .        }
restaurants,how many french restaurants are there in palo alto ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :location . ?T2 :location\#ref-restaurant_id ?T1 .  ?T2 :location\#city_name ?T2_city_name . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_city_name = 'palo alto' && ?T1_food_type = 'french') .        }
restaurants,how many french restaurant are there in palo alto ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :location . ?T2 :location\#ref-restaurant_id ?T1 .  ?T2 :location\#city_name ?T2_city_name . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_city_name = 'palo alto' && ?T1_food_type = 'french') .        }
restaurants,how many places for french are there in palo alto ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :location . ?T2 :location\#ref-restaurant_id ?T1 .  ?T2 :location\#city_name ?T2_city_name . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_city_name = 'palo alto' && ?T1_food_type = 'french') .        }
