kg_name,question,query
yelp,Find all users who have written tips for ' Barrio Cafe ' in 2015,SELECT ?T1_name WHERE { ?T2 a :business . ?T3 a :tip . ?T3 :tip\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#name ?T2_name . ?T3 :tip\#year ?T3_year . FILTER(?T2_name = 'Barrio Cafe' && ?T3_year = 2015) .        }
yelp,Find all businesses in Texas with a rating below 2,SELECT ?T1_name WHERE { ?T1 a :business . ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . ?T1 :business\#state ?T1_state . FILTER(?T1_rating < 2 && ?T1_state = 'Texas') .        }
yelp,Find all restaurant Seafood in Los Angeles,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Los Angeles' && ?T2_category_name = 'Seafood' && ?T2_category_name = 'restaurant') .        }
yelp,Find all reviews by Patrick with a rating above 4,SELECT ?T1_text WHERE { ?T2 :users\#ref-review_id ?T1 . FILTER(?T1_rating > 4 && ?T2_name = 'Patrick') .        }
yelp,Find all Apple Store in ' Los Angeles ',SELECT ?T1_business_id WHERE { ?T1 a :business . ?T1 :business\#business_id ?T1_business_id . ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . FILTER(?T1_city = 'Los Angeles' && ?T1_name = 'Apple Store') .        }
yelp,Find all Dallas restaurant with a rating above 4.5,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Dallas' && ?T1_rating > 4.5 && ?T2_category_name = 'restaurant') .        }
yelp,What neighbourhood is restaurant ' Flat Top Grill ' in ?,SELECT ?T1_neighbourhood_name WHERE { ?T1 a :neighbourhood . ?T2 a :business . ?T1 :neighbourhood\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_name = 'Flat Top Grill' && ?T3_category_name = 'category_category_name0') .        }
yelp,Find all tips about ' Vintner Grill ' that received more than 9 likes,SELECT ?T1_text WHERE { ?T1 a :tip . ?T2 a :business . ?T1 :tip\#ref-business_id ?T2 .  ?T1 :tip\#text ?T1_text . ?T2 :business\#name ?T2_name . ?T1 :tip\#likes ?T1_likes . FILTER(?T2_name = 'Vintner Grill' && ?T1_likes > 9) .        }
yelp,Find all reviews about ' Kabob Palace ' in year 2014,SELECT ?T1_text WHERE { ?T1 a :review . ?T2 a :business . ?T1 :review\#ref-business_id ?T2 .  ?T1 :review\#text ?T1_text . ?T2 :business\#name ?T2_name . ?T1 :review\#year ?T1_year . FILTER(?T2_name = 'Kabob Palace' && ?T1_year = 2014) .        }
yelp,Find all users who have written tips about businesses in Dallas,SELECT ?T1_name WHERE { ?T1 :users\#ref-business_id ?T2 . FILTER(?T2_city = 'Dallas') .        }
yelp,Find all cities in Texas in which there is a restaurant called ' MGM Grand Buffet ',SELECT ?T1_city WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . ?T1 :business\#state ?T1_state . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_name = 'MGM Grand Buffet' && ?T1_state = 'Texas' && ?T2_category_name = 'restaurant') .        }
yelp,Find the users who have given tips on Pet Groomers,SELECT ?T1_name WHERE { ?T1 :users\#ref-category_id ?T2 . FILTER(?T2_category_name = 'Pet Groomers') .        }
yelp,Find all tips for ' Cafe Zinho ' in Texas .,SELECT ?T1_text WHERE { ?T1 a :tip . ?T2 a :business . ?T1 :tip\#ref-business_id ?T2 .  ?T1 :tip\#text ?T1_text . ?T2 :business\#name ?T2_name . ?T2 :business\#state ?T2_state . FILTER(?T2_name = 'Cafe Zinho' && ?T2_state = 'Texas') .        }
yelp,List all users who reviewed businesses that are restaurant .,SELECT ?T1_name WHERE { ?T1 :users\#ref-category_id ?T2 . FILTER(?T2_category_name = 'restaurant') .        }
yelp,List all tips for ' Cafe Zinho ' in Pennsylvania in 2010 .,SELECT ?T1_text WHERE { ?T1 a :tip . ?T2 a :business . ?T1 :tip\#ref-business_id ?T2 .  ?T1 :tip\#text ?T1_text . ?T2 :business\#name ?T2_name . ?T2 :business\#state ?T2_state . ?T1 :tip\#year ?T1_year . FILTER(?T2_name = 'Cafe Zinho' && ?T2_state = 'Pennsylvania' && ?T1_year = 2010) .        }
yelp,List all users who reviewed businesses that are restaurant in 2010 .,SELECT ?T1_name WHERE { ?T2 a :category . ?T14 a :business . ?T2 :category\#ref-business_id ?T14 .  ?T1 :users\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name . ?T3 :review\#year ?T3_year . ?T3 a :review . ?T3 :review\#ref-business_id ?T14 .  ?T1 :users\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name . ?T3 :review\#year ?T3_year . FILTER(?T2_category_name = 'restaurant' && ?T3_year = 2010) .        }
yelp,Find all the tips from a user who has written a review in 2012,SELECT ?T1_text WHERE { ?T1 a :tip . ?T13 a :business . ?T1 :tip\#ref-business_id ?T13 .  ?T1 :tip\#text ?T1_text . ?T2 :review\#year ?T2_year . ?T2 a :review . ?T2 :review\#ref-business_id ?T13 .  ?T1 :tip\#text ?T1_text . ?T2 :review\#year ?T2_year . FILTER(?T2_year = 2012) .        }
yelp,Find all reviews for businesses rated 2.5,SELECT ?T1_text WHERE { ?T1 a :review . ?T2 a :business . ?T1 :review\#ref-business_id ?T2 .  ?T1 :review\#text ?T1_text . ?T2 :business\#rating ?T2_rating . FILTER(?T2_rating = 2.5) .        }
yelp,find the number of escape games in Madison,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_108 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Madison' && ?T2_category_name = 'escape games') .        }
yelp,What is the number of escape games in Madison,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_191 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Madison' && ?T2_category_name = 'escape games') .        }
yelp,How many escape games exist in Madison,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_58 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Madison' && ?T2_category_name = 'escape games') .        }
yelp,What is the number of escape games in ' Madison ' ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_19 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Madison' && ?T2_category_name = 'escape games') .        }
yelp,How many escape games are there in Madison ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_102 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Madison' && ?T2_category_name = 'escape games') .        }
yelp,find the number of restaurant rated more than 3.5,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_69 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_rating > 3.5 && ?T2_category_name = 'restaurant') .        }
yelp,find the total checkins in Moroccan restaurant in ' Los Angeles ',SELECT (sum( ?T1_count) as ?aggregation_T1_count_118 ) WHERE { ?T1 a :checkin . ?T2 a :business . ?T1 :checkin\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_city = 'Los Angeles' && ?T3_category_name = 'restaurant' && ?T3_category_name = 'Moroccan') .        }
yelp,find the total checkins in Moroccan restaurant in ' Los Angeles ' on Friday,SELECT (sum( ?T1_count) as ?aggregation_T1_count_149 ) WHERE { ?T1 a :checkin . ?T2 a :business . ?T1 :checkin\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T1 :checkin\#day ?T1_day . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T1 :checkin\#day ?T1_day . FILTER(?T2_city = 'Los Angeles' && ?T3_category_name = 'Moroccan' && ?T3_category_name = 'restaurant' && ?T1_day = 'Friday') .        }
yelp,find the total checkins in Moroccan restaurant in ' Los Angeles ' per day,SELECT ?T1_day (sum( ?T1_count) as ?aggregation_T1_count_23 ) WHERE { ?T1 a :checkin . ?T2 a :business . ?T1 :checkin\#ref-business_id ?T2 .  ?T1 :checkin\#day ?T1_day . ?T1 :checkin\#count ?T1_count . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :checkin\#day ?T1_day . ?T1 :checkin\#count ?T1_count . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_city = 'Los Angeles' && ?T3_category_name = 'Moroccan' && ?T3_category_name = 'restaurant') .        } GROUP BY ?T1_day
yelp,find the total checkins in Italian Delis in each state on Sunday,SELECT ?T1_state (sum( ?T2_count) as ?aggregation_T2_count_157 ) WHERE { ?T1 a :business . ?T2 a :checkin . ?T2 :checkin\#ref-business_id ?T1 .  ?T1 :business\#state ?T1_state . ?T2 :checkin\#count ?T2_count . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T2 :checkin\#day ?T2_day . ?T3 a :category . ?T3 :category\#ref-business_id ?T1 .  ?T1 :business\#state ?T1_state . ?T2 :checkin\#count ?T2_count . ?T3 :category\#category_name ?T3_category_name . ?T3 :category\#category_name ?T3_category_name . ?T2 :checkin\#day ?T2_day . FILTER(?T3_category_name = 'Italian' && ?T3_category_name = 'Delis' && ?T2_day = 'Sunday') .        } GROUP BY ?T1_state
yelp,How many reviews has Niloofar written in 2015,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_66 ) WHERE { ?T2 :users\#ref-review_id ?T1 . FILTER(?T1_year = 2015 && ?T2_name = 'Niloofar') .        }
yelp,what is the average rating given in Michelle reviews,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_136 ) WHERE { ?T2 :users\#ref-review_id ?T1 . FILTER(?T2_name = 'Michelle') .        }
yelp,What is the number of checkins for ' Cafe Zinho ' on Friday,SELECT ?T1_count WHERE { ?T1 a :checkin . ?T2 a :business . ?T1 :checkin\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T2 :business\#name ?T2_name . ?T1 :checkin\#day ?T1_day . FILTER(?T2_name = 'Cafe Zinho' && ?T1_day = 'Friday') .        }
yelp,how many users reviewed ' Sushi Too ' in Pittsburgh,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_139 ) WHERE { ?T1 :users\#ref-business_id ?T2 . FILTER(?T2_city = 'Pittsburgh' && ?T2_name = 'Sushi Too') .        }
yelp,What is the number of restaurant in Pittsburgh rated 4.5,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_109 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Pittsburgh' && ?T1_rating = 4.5 && ?T2_category_name = 'restaurant') .        }
yelp,How many tips have been written in 2015,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_70 ) WHERE { ?T1 a :tip . ?T1 :tip\#text ?T1_text . ?T1 :tip\#year ?T1_year . FILTER(?T1_year = 2015) .        }
yelp,What is the total likes on tips from Niloofar,SELECT (sum( ?T1_likes) as ?aggregation_T1_likes_137 ) WHERE { ?T2 :users\#ref-tip_id ?T1 . FILTER(?T2_name = 'Niloofar') .        }
yelp,What is the total likes on tips about ' Cafe Zinho ',SELECT (sum( ?T1_likes) as ?aggregation_T1_likes_120 ) WHERE { ?T1 a :tip . ?T2 a :business . ?T1 :tip\#ref-business_id ?T2 .  ?T1 :tip\#likes ?T1_likes . ?T2 :business\#name ?T2_name . FILTER(?T2_name = 'Cafe Zinho') .        }
yelp,What is the total likes on tips from Niloofar about ' Cafe Zinho ',SELECT (sum( ?T1_likes) as ?aggregation_T1_likes_72 ) WHERE { ?T1 a :tip . ?T2 a :business . ?T1 :tip\#ref-business_id ?T2 .  ?T1 :tip\#likes ?T1_likes . ?T2 :business\#name ?T2_name . ?T3 :users\#name ?T3_name . FILTER(?T2_name = 'Cafe Zinho' && ?T3_name = 'Niloofar') .        }
yelp,How many tips has Michelle written in 2010,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_200 ) WHERE { ?T2 :users\#ref-tip_id ?T1 . FILTER(?T1_year = 2010 && ?T2_name = 'Michelle') .        }
yelp,Return me the number of tips that are written by Michelle in 2010 .,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_98 ) WHERE { ?T2 :users\#ref-tip_id ?T1 . FILTER(?T1_year = 2010 && ?T2_name = 'Michelle') .        }
yelp,How many tips has Michelle written in April,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_13 ) WHERE { ?T2 :users\#ref-tip_id ?T1 . FILTER(?T1_month = 'April' && ?T2_name = 'Michelle') .        }
yelp,what is the number of restaurant in Texas,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_99 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#state ?T1_state . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_state = 'Texas' && ?T2_category_name = 'restaurant') .        }
yelp,How many Bars in ' Dallas ' have a rating above 3.5 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_127 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T1 :business\#rating ?T1_rating . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Dallas' && ?T1_rating > 3.5 && ?T2_category_name = 'Bars') .        }
yelp,How many people reviewed the restaurant ' Texas de Brazil ' in Dallas Texas ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_106 ) WHERE { ?T2 a :business . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#city ?T2_city . ?T2 :business\#name ?T2_name . ?T2 :business\#state ?T2_state . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_city = 'Dallas' && ?T2_name = 'Texas de Brazil' && ?T2_state = 'Texas' && ?T3_category_name = 'restaurant') .        }
yelp,How many people reviewed ' Bistro Di Napoli ' in 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_155 ) WHERE { ?T2 a :business . ?T3 a :review . ?T3 :review\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#name ?T2_name . ?T3 :review\#year ?T3_year . FILTER(?T2_name = 'Bistro Di Napoli' && ?T3_year = 2015) .        }
yelp,How many restaurant are there in the Hazelwood district of Dallas ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_148 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . ?T3 :neighbourhood\#neighbourhood_name ?T3_neighbourhood_name . ?T3 a :neighbourhood . ?T3 :neighbourhood\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . ?T3 :neighbourhood\#neighbourhood_name ?T3_neighbourhood_name . FILTER(?T1_city = 'Dallas' && ?T2_category_name = 'restaurant' && ?T3_neighbourhood_name = 'Hazelwood') .        }
yelp,How many Starbucks are there in Dallas Texas ?,SELECT DISTINCT (count(DISTINCT ?T1_business_id) as ?aggregation_T1_business_id_46 ) WHERE { ?T1 a :business . ?T1 :business\#business_id ?T1_business_id . ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . ?T1 :business\#state ?T1_state . FILTER(?T1_city = 'Dallas' && ?T1_name = 'Starbucks' && ?T1_state = 'Texas') .        }
yelp,How many reviews does ' Acacia Cafe ' have ?,SELECT ?T1_review_count WHERE { ?T1 a :business . ?T1 :business\#review_count ?T1_review_count . ?T1 :business\#name ?T1_name . FILTER(?T1_name = 'Acacia Cafe') .        }
yelp,Find the average number of checkins in restaurant ' Barrio Cafe ' per day,SELECT (avg( ?T1_count) as ?aggregation_T1_count_41 ) ?T1_day WHERE { ?T1 a :checkin . ?T2 a :business . ?T1 :checkin\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T1 :checkin\#day ?T1_day . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :checkin\#count ?T1_count . ?T1 :checkin\#day ?T1_day . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_name = 'Barrio Cafe' && ?T3_category_name = 'restaurant') .        } GROUP BY ?T1_day
yelp,How many businesses are there in the ' Stone Meadows ' neighbourhood in Madison ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_158 ) WHERE { ?T1 a :business . ?T2 a :neighbourhood . ?T2 :neighbourhood\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :neighbourhood\#neighbourhood_name ?T2_neighbourhood_name . FILTER(?T1_city = 'Madison' && ?T2_neighbourhood_name = 'Stone Meadows') .        }
yelp,How many reviews has Adrienne written ?,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_136 ) WHERE { ?T2 :users\#ref-review_id ?T1 . FILTER(?T2_name = 'Adrienne') .        }
yelp,How many reviews has Michelle written in March 2014 ?,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_88 ) WHERE { ?T2 :users\#ref-review_id ?T1 . FILTER(?T1_month = 'March' && ?T1_year = 2014 && ?T2_name = 'Michelle') .        }
yelp,How many businesses has Michelle reviewed in 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_144 ) WHERE { ?T1 a :business . ?T2 a :review . ?T2 :review\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :review\#year ?T2_year . ?T3 :users\#name ?T3_name . FILTER(?T2_year = 2010 && ?T3_name = 'Michelle') .        }
yelp,How many businesses in ' San Diego ' has Christine reviewed in 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_101 ) WHERE { ?T1 a :business . ?T2 a :review . ?T2 :review\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :review\#year ?T2_year . ?T3 :users\#name ?T3_name . FILTER(?T1_city = 'San Diego' && ?T2_year = 2010 && ?T3_name = 'Christine') .        }
yelp,How many Target are there in ' Los Angeles ' ?,SELECT DISTINCT (count(DISTINCT ?T1_business_id) as ?aggregation_T1_business_id_39 ) WHERE { ?T1 a :business . ?T1 :business\#business_id ?T1_business_id . ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . FILTER(?T1_city = 'Los Angeles' && ?T1_name = 'Target') .        }
yelp,How many users have reviewed Irish Pub in Dallas ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_118 ) WHERE { ?T2 a :business . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#city ?T2_city . ?T3 :category\#category_name ?T3_category_name . FILTER(?T2_city = 'Dallas' && ?T3_category_name = 'Irish Pub') .        }
yelp,What is the average rating of reviews written in year 2014 ?,SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_41 ) WHERE { ?T1 a :review . ?T1 :review\#rating ?T1_rating . ?T1 :review\#year ?T1_year . FILTER(?T1_year = 2014) .        }
yelp,How many people reviewed restaurant ' Vintner Grill ' in 2010 ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_52 ) WHERE { ?T2 a :business . ?T3 a :category . ?T3 :category\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . ?T4 :review\#year ?T4_year . ?T4 a :review . ?T4 :review\#ref-business_id ?T2 .  ?T1 :users\#name ?T1_name . ?T2 :business\#name ?T2_name . ?T3 :category\#category_name ?T3_category_name . ?T4 :review\#year ?T4_year . FILTER(?T2_name = 'Vintner Grill' && ?T3_category_name = 'category_category_name0' && ?T4_year = 2010) .        }
yelp,Find the number of reviews on businesses located in ' South Summerlin ' neighbourhood,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_92 ) WHERE { ?T1 a :review . ?T13 a :business . ?T1 :review\#ref-business_id ?T13 .  ?T1 :review\#text ?T1_text . ?T2 :neighbourhood\#neighbourhood_name ?T2_neighbourhood_name . ?T2 a :neighbourhood . ?T2 :neighbourhood\#ref-business_id ?T13 .  ?T1 :review\#text ?T1_text . ?T2 :neighbourhood\#neighbourhood_name ?T2_neighbourhood_name . FILTER(?T2_neighbourhood_name = 'South Summerlin') .        }
yelp,Find the number of users called Michelle,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_102 ) WHERE { ?T1 a :users . ?T1 :users\#name ?T1_name . ?T1 :users\#name ?T1_name . FILTER(?T1_name = 'Michelle') .        }
yelp,Return me the number of businesses that are restaurant .,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_61 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T2_category_name = 'restaurant') .        }
yelp,Return me the number of cities that has ' Panda Express ' .,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_191 ) WHERE { ?T1 a :business . ?T1 :business\#city ?T1_city . ?T1 :business\#name ?T1_name . FILTER(?T1_name = 'Panda Express') .        }
yelp,Return me the number of tips that are written by Michelle .,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_66 ) WHERE { ?T2 :users\#ref-tip_id ?T1 . FILTER(?T2_name = 'Michelle') .        }
yelp,Find the total checkins in ' Brighton Heights ' neighbourhood,SELECT (sum( ?T1_count) as ?aggregation_T1_count_166 ) WHERE { ?T1 a :checkin . ?T13 a :business . ?T1 :checkin\#ref-business_id ?T13 .  ?T1 :checkin\#count ?T1_count . ?T2 :neighbourhood\#neighbourhood_name ?T2_neighbourhood_name . ?T2 a :neighbourhood . ?T2 :neighbourhood\#ref-business_id ?T13 .  ?T1 :checkin\#count ?T1_count . ?T2 :neighbourhood\#neighbourhood_name ?T2_neighbourhood_name . FILTER(?T2_neighbourhood_name = 'Brighton Heights') .        }
yelp,Find the total number of reviews written in March,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_18 ) WHERE { ?T1 a :review . ?T1 :review\#text ?T1_text . ?T1 :review\#month ?T1_month . FILTER(?T1_month = 'March') .        }
yelp,Find the number of tips written in each month,SELECT DISTINCT (count(DISTINCT ?T1_text) as ?aggregation_T1_text_11 ) ?T1_month WHERE { ?T1 a :tip . ?T1 :tip\#text ?T1_text . ?T1 :tip\#month ?T1_month .        } GROUP BY ?T1_month
yelp,How many neighbourhoods have a business with rating 5 in Madison ?,SELECT DISTINCT (count(DISTINCT ?T1_neighbourhood_name) as ?aggregation_T1_neighbourhood_name_67 ) WHERE { ?T1 a :neighbourhood . ?T2 a :business . ?T1 :neighbourhood\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#city ?T2_city . ?T2 :business\#rating ?T2_rating . FILTER(?T2_city = 'Madison' && ?T2_rating = 5) .        }
yelp,Give me all the Moroccan restaurant in Texas,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#state ?T1_state . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_state = 'Texas' && ?T2_category_name = 'Moroccan' && ?T2_category_name = 'restaurant') .        }
yelp,which business has the most number of checkins,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :business . ?T2 a :checkin . ?T2 :checkin\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :checkin\#count ?T2_count .        } GROUP BY ?T1_name  ORDER BY DESC ((sum( ?T2_count) as ?aggregation_T2_count_177 )) LIMIT 1
yelp,which neighbourhood has the most number of businesses in Madison,SELECT ?T1_neighbourhood_name (count( *) as ?aggregation_all) WHERE { ?T1 a :neighbourhood . ?T2 a :business . ?T1 :neighbourhood\#ref-business_id ?T2 .  ?T1 :neighbourhood\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\#name ?T2_name . ?T2 :business\#city ?T2_city . FILTER(?T2_city = 'Madison') .        } GROUP BY ?T1_neighbourhood_name  ORDER BY DESC ((count( ?T2_name) as ?aggregation_T2_name_155 )) LIMIT 1
yelp,Find all restaurant with Valet Service in Dallas Texas,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T1 :business\#state ?T1_state . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Dallas' && ?T1_state = 'Texas' && ?T2_category_name = 'Valet Service' && ?T2_category_name = 'restaurant') .        }
yelp,Find all Bars in ' Los Angeles ' with at least 30 reviews and average rating above 3 stars,SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T1 :business\#rating ?T1_rating . ?T1 :business\#review_count ?T1_review_count . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Los Angeles' && ?T1_rating > 3 && ?T1_review_count > 30 && ?T2_category_name = 'Bars') .        }
yelp,How many Egyptian restaurant are there in Edinburgh ?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_59 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T1 :business\#city ?T1_city . ?T2 :category\#category_name ?T2_category_name . ?T2 :category\#category_name ?T2_category_name . FILTER(?T1_city = 'Edinburgh' && ?T2_category_name = 'restaurant' && ?T2_category_name = 'Egyptian') .        }
yelp,Find users whose average review rating is below 3,SELECT ?T1_name WHERE { ?T1 :users\#ref-review_id ?T2 .        } GROUP BY ?T1_name   HAVING(avg( ?T2_rating)  < 3)
yelp,Find the business with the most number of reviews in April,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :business . ?T2 a :review . ?T2 :review\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :review\#text ?T2_text . ?T2 :review\#month ?T2_month . FILTER(?T2_month = 'April') .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_text) as ?aggregation_T2_text_146 )) LIMIT 1
yelp,Find the business which has the most number of categories,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\#ref-business_id ?T1 .  ?T1 :business\#name ?T1_name . ?T2 :category\#category_name ?T2_category_name .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T2_category_name) as ?aggregation_T2_category_name_155 )) LIMIT 1
academic,return me the homepage of PVLDB .,SELECT ?T1_homepage WHERE { ?T1 a :journal . ?T1 :journal\#homepage ?T1_homepage . ?T1 :journal\#name ?T1_name . FILTER(?T1_name = 'PVLDB') .        }
academic,return me the homepage of ' H. V. Jagadish ' .,SELECT ?T1_homepage WHERE { ?T1 a :author . ?T1 :author\#homepage ?T1_homepage . ?T1 :author\#name ?T1_name . FILTER(?T1_name = 'H. V. Jagadish') .        }
academic,return me the abstract of ' Making database systems usable ' .,SELECT ?T1_abstract WHERE { ?T1 a :publication . ?T1 :publication\#abstract ?T1_abstract . ?T1 :publication\#title ?T1_title . FILTER(?T1_title = 'Making database systems usable') .        }
academic,return me the year of ' Making database systems usable ',SELECT ?T1_year WHERE { ?T1 a :publication . ?T1 :publication\#year ?T1_year . ?T1 :publication\#title ?T1_title . FILTER(?T1_title = 'Making database systems usable') .        }
academic,return me the papers after 2000 .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#year ?T1_year . FILTER(?T1_year > 2000) .        }
academic,return me the homepage of the VLDB conference .,SELECT ?T1_homepage WHERE { ?T1 a :conference . ?T1 :conference\#homepage ?T1_homepage . ?T1 :conference\#name ?T1_name . FILTER(?T1_name = 'VLDB') .        }
academic,return me all the keywords .,SELECT ?T1_keyword WHERE { ?T1 a :keyword . ?T1 :keyword\#keyword ?T1_keyword .        }
academic,return me all the organizations .,SELECT ?T1_name WHERE { ?T1 a :organization . ?T1 :organization\#name ?T1_name .        }
academic,return me all the organizations in ' North America ' .,SELECT ?T1_name WHERE { ?T1 a :organization . ?T1 :organization\#name ?T1_name . ?T1 :organization\#continent ?T1_continent . FILTER(?T1_continent = 'North America') .        }
academic,return me the homepage of ' University of Michigan ' .,SELECT ?T1_homepage WHERE { ?T1 a :organization . ?T1 :organization\#homepage ?T1_homepage . ?T1 :organization\#name ?T1_name . FILTER(?T1_name = 'University of Michigan') .        }
academic,return me the number of references of ' Making database systems usable ' .,SELECT ?T1_reference_num WHERE { ?T1 a :publication . ?T1 :publication\#reference_num ?T1_reference_num . ?T1 :publication\#title ?T1_title . FILTER(?T1_title = 'Making database systems usable') .        }
academic,return me the number of citations of ' Making database systems usable ' .,SELECT ?T1_citation_num WHERE { ?T1 a :publication . ?T1 :publication\#citation_num ?T1_citation_num . ?T1 :publication\#title ?T1_title . FILTER(?T1_title = 'Making database systems usable') .        }
academic,return me the paper with more than 200 citations .,SELECT ?T1_title WHERE { ?T1 a :publication . ?T1 :publication\#title ?T1_title . ?T1 :publication\#citation_num ?T1_citation_num . FILTER(?T1_citation_num > 200) .        }
academic,return me the authors who have papers in PVLDB 2010 .,SELECT ?T1_name WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T3 a :publication . ?T14 :writes\#ref-pid ?T3 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T3 :publication\#year ?T3_year . ?T2 a :journal . ?T3 :publication\#ref-jid ?T2 .  ?T1 :author\#name ?T1_name . ?T2 :journal\#name ?T2_name . ?T3 :publication\#year ?T3_year . FILTER(?T2_name = 'PVLDB' && ?T3_year = 2010) .        }
