kg_name,question,query
insurance_fnol,How many policies are listed for the customer named 'Dayana Robel'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :customers_policies\#ref-customer_id ?T2 .  ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') .        }
insurance_fnol,What is the name of the customer who has the most policies listed?,SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :customers_policies . ?T2 :customers_policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_fnol,What are all the policy types of the customer named 'Dayana Robel'?,SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :customers_policies\#ref-policy_id ?T1 .  ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . ?T2 :customers\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customers_policies\#ref-customer_id ?T2 .  ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') .        }
insurance_fnol,List all the policy types used by the customer enrolled in the most policies.,SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :customers_policies\#ref-policy_id ?T1 .  ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . ?T2 :customers\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customers_policies\#ref-customer_id ?T2 .  ?T1 :available_policies\#policy_type_code ?T1_policy_type_code . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = (?T23_customer_name)) .       {SELECT ?T23_customer_name (count( *) as ?aggregation_all) WHERE { ?T23 a :customers . ?T24 a :customers_policies . ?T24 :customers_policies\#ref-customer_id ?T23 .  ?T23 :customers\#customer_name ?T23_customer_name .        } GROUP BY ?T23_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
insurance_fnol,List all the services in the alphabetical order.,SELECT ?T1_service_name WHERE { ?T1 a :services . ?T1 :services\#service_name ?T1_service_name . ?T1 :services\#service_name ?T1_service_name .        }  ORDER BY ASC (?T1_service_name)
insurance_fnol,How many services are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :services .        }
insurance_fnol,Find the names of users who do not have a first notification of loss record.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name .   }}  MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :customers . ?T2 :customers\#customer_name ?T2_customer_name .        }     } }
insurance_fnol,Find the names of customers who have used either the service 'Close a policy' or the service 'Upgrade a policy'.,SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customers_policies . ?T13 :customers_policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :services\#service_name ?T2_service_name . ?T2 :services\#service_name ?T2_service_name . ?T14 a :first_notification_of_loss . ?T14 :first_notification_of_loss\#ref-customer_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :services\#service_name ?T2_service_name . ?T2 :services\#service_name ?T2_service_name . ?T2 a :services . ?T14 :first_notification_of_loss\#ref-service_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :services\#service_name ?T2_service_name . ?T2 :services\#service_name ?T2_service_name . FILTER(?T2_service_name = 'Close a policy' || ?T2_service_name = 'Upgrade a policy') .        }
insurance_fnol,Find the names of customers who have used both the service 'Close a policy' and the service 'New policy application'.,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customers_policies . ?T13 :customers_policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :services\#service_name ?T2_service_name . ?T14 a :first_notification_of_loss . ?T14 :first_notification_of_loss\#ref-customer_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :services\#service_name ?T2_service_name . ?T2 a :services . ?T14 :first_notification_of_loss\#ref-service_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :services\#service_name ?T2_service_name . FILTER(?T2_service_name = 'Close a policy') . FILTER (?T1_customer_name in (?T3_customer_name)) .   ?T3 a :customers . ?T15 a :customers_policies . ?T15 :customers_policies\#ref-customer_id ?T3 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :services\#service_name ?T4_service_name . ?T16 a :first_notification_of_loss . ?T16 :first_notification_of_loss\#ref-customer_id ?T15 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :services\#service_name ?T4_service_name . ?T4 a :services . ?T16 :first_notification_of_loss\#ref-service_id ?T4 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T4 :services\#service_name ?T4_service_name .  FILTER(?T4_service_name = 'New policy application') .             }
insurance_fnol,Find the IDs of customers whose name contains 'Diana'.,"SELECT ?T1_customer_id WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_name ?T1_customer_name . FILTER(contains (?T1_customer_name, 'Diana')) .        }"
insurance_fnol,What are the IDs of customers who have 'Diana' in part of their names?,"SELECT ?T1_customer_id WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_name ?T1_customer_name . FILTER(contains (?T1_customer_name, 'Diana')) .        }"
insurance_fnol,What are the maximum and minimum settlement amount on record?,SELECT (max( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_124 ) (min( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_100 ) WHERE { ?T1 a :settlements . ?T1 :settlements\#settlement_amount ?T1_settlement_amount . ?T1 :settlements\#settlement_amount ?T1_settlement_amount .        }
insurance_fnol,Find the maximum and minimum settlement amount.,SELECT (max( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_65 ) (min( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_164 ) WHERE { ?T1 a :settlements . ?T1 :settlements\#settlement_amount ?T1_settlement_amount . ?T1 :settlements\#settlement_amount ?T1_settlement_amount .        }
insurance_fnol,List all the customers in increasing order of IDs.,SELECT ?T1_customer_id ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_id ?T1_customer_id .        }  ORDER BY ASC (?T1_customer_id)
insurance_fnol,What is the ordered list of customer ids?,SELECT ?T1_customer_id ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_id ?T1_customer_id .        }  ORDER BY ASC (?T1_customer_id)
insurance_fnol,Retrieve the open and close dates of all the policies associated with the customer whose name contains 'Diana',"SELECT ?T1_date_opened ?T1_date_closed WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :customers_policies\#ref-customer_id ?T2 .  ?T1 :customers_policies\#date_opened ?T1_date_opened . ?T1 :customers_policies\#date_closed ?T1_date_closed . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(contains (?T2_customer_name, 'Diana')) .        }"
insurance_fnol,What are the open and close dates of all the policies used by the customer who have 'Diana' in part of their names?,"SELECT ?T1_date_opened ?T1_date_closed WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :customers_policies\#ref-customer_id ?T2 .  ?T1 :customers_policies\#date_opened ?T1_date_opened . ?T1 :customers_policies\#date_closed ?T1_date_closed . ?T2 :customers\#customer_name ?T2_customer_name . FILTER(contains (?T2_customer_name, 'Diana')) .        }"
medicine_enzyme_interaction,How many kinds of enzymes are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :enzyme .        }
medicine_enzyme_interaction,What is the total count of enzymes?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :enzyme .        }
medicine_enzyme_interaction,List the name of enzymes in descending lexicographical order.,SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#name ?T1_name .        }  ORDER BY DESC (?T1_name)
medicine_enzyme_interaction,What are the names of enzymes in descending order?,SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#name ?T1_name .        }  ORDER BY DESC (?T1_name)
medicine_enzyme_interaction,List the names and the locations that the enzymes can make an effect.,SELECT ?T1_name ?T1_location WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#location ?T1_location .        }
medicine_enzyme_interaction,What are the names and locations of all enzymes listed?,SELECT ?T1_name ?T1_location WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#location ?T1_location .        }
medicine_enzyme_interaction,What is the maximum OMIM value in the database?,SELECT (max( ?T1_omim) as ?aggregation_T1_omim_71 ) WHERE { ?T1 a :enzyme . ?T1 :enzyme\#omim ?T1_omim .        }
medicine_enzyme_interaction,What are the names of enzymes who does not produce 'Heme'?,SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#product ?T1_product . FILTER(?T1_product != 'Heme') .        }
medicine_enzyme_interaction,What are the names of enzymes whose product is not 'Heme'?,SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#product ?T1_product . FILTER(?T1_product != 'Heme') .        }
medicine_enzyme_interaction,What are the names and trade names of the medcines that are FDA approved?,SELECT ?T1_name ?T1_trade_name WHERE { ?T1 a :medicine . ?T1 :medicine\#name ?T1_name . ?T1 :medicine\#trade_name ?T1_trade_name . ?T1 :medicine\#fda_approved ?T1_fda_approved . FILTER(?T1_fda_approved = 'Yes') .        }
medicine_enzyme_interaction,"What are the ids, names and FDA approval status of medicines in descending order of the number of enzymes that it can interact with.",SELECT ?T1_id ?T1_name ?T1_fda_approved WHERE { ?T1 a :medicine . ?T2 a :medicine_enzyme_interaction . ?T2 :medicine_enzyme_interaction\#ref-medicine_id ?T1 .  ?T1 :medicine\#id ?T1_id . ?T1 :medicine\#name ?T1_name . ?T1 :medicine\#fda_approved ?T1_fda_approved .        } GROUP BY ?T1_id ?T1_name ?T1_fda_approved ORDER BY DESC ((count( *) as ?aggregation_all))
medicine_enzyme_interaction,How many medicines have the FDA approval status 'No' ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :medicine . ?T1 :medicine\#fda_approved ?T1_fda_approved . FILTER(?T1_fda_approved = 'No') .        }
medicine_enzyme_interaction,How many medicines were not approved by the FDA?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :medicine . ?T1 :medicine\#fda_approved ?T1_fda_approved . FILTER(?T1_fda_approved = 'No') .        }
medicine_enzyme_interaction,How many enzymes do not have any interactions?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :enzyme . ?T1 :enzyme\#id ?T1_id . FILTER(?T1_id not in (?T22_enzyme_id)) .       {SELECT ?T22_enzyme_id WHERE { ?T22 a :medicine_enzyme_interaction . ?T22 :medicine_enzyme_interaction\#enzyme_id ?T22_enzyme_id .        }    } }
medicine_enzyme_interaction,What is the count of enzymes without any interactions?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :enzyme . ?T1 :enzyme\#id ?T1_id . FILTER(?T1_id not in (?T22_enzyme_id)) .       {SELECT ?T22_enzyme_id WHERE { ?T22 a :medicine_enzyme_interaction . ?T22 :medicine_enzyme_interaction\#enzyme_id ?T22_enzyme_id .        }    } }
medicine_enzyme_interaction,List the medicine name and trade name which can both interact as 'inhibitor' and 'activitor' with enzymes.,SELECT DISTINCT ?T1_name ?T1_trade_name WHERE { ?T1 a :medicine . ?T2 a :medicine_enzyme_interaction . ?T2 :medicine_enzyme_interaction\#ref-medicine_id ?T1 .  ?T1 :medicine\#name ?T1_name . ?T1 :medicine\#trade_name ?T1_trade_name . ?T2 :medicine_enzyme_interaction\#interaction_type ?T2_interaction_type . FILTER(?T2_interaction_type = 'inhibitor') . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_trade_name in (?T3_trade_name)) .   ?T3 a :medicine . ?T4 a :medicine_enzyme_interaction . ?T4 :medicine_enzyme_interaction\#ref-medicine_id ?T3 .  ?T3 :medicine\#name ?T3_name . ?T3 :medicine\#trade_name ?T3_trade_name . ?T4 :medicine_enzyme_interaction\#interaction_type ?T4_interaction_type .  FILTER(?T4_interaction_type = 'activitor') .             }
medicine_enzyme_interaction,Show the medicine names and trade names that cannot interact with the enzyme with product 'Heme'.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_trade_name as ?col2) WHERE { ?T1 a :medicine . ?T1 :medicine\#name ?T1_name . ?T1 :medicine\#trade_name ?T1_trade_name .   }}  MINUS {SELECT (?T2_name as ?col1) (?T2_trade_name as ?col2) WHERE { ?T2 a :medicine . ?T14 a :medicine_enzyme_interaction . ?T14 :medicine_enzyme_interaction\#ref-medicine_id ?T2 .  ?T2 :medicine\#name ?T2_name . ?T2 :medicine\#trade_name ?T2_trade_name . ?T3 :enzyme\#product ?T3_product . ?T3 a :enzyme . ?T14 :medicine_enzyme_interaction\#ref-enzyme_id ?T3 .  ?T2 :medicine\#name ?T2_name . ?T2 :medicine\#trade_name ?T2_trade_name . ?T3 :enzyme\#product ?T3_product . FILTER(?T3_product = 'Protoporphyrinogen IX') .        }     } }
medicine_enzyme_interaction,How many distinct FDA approval statuses are there for the medicines?,SELECT DISTINCT (count(DISTINCT ?T1_fda_approved) as ?aggregation_T1_fda_approved_126 ) WHERE { ?T1 a :medicine . ?T1 :medicine\#fda_approved ?T1_fda_approved .        }
medicine_enzyme_interaction,How many different FDA approval statuses exist for medicines?,SELECT DISTINCT (count(DISTINCT ?T1_fda_approved) as ?aggregation_T1_fda_approved_29 ) WHERE { ?T1 a :medicine . ?T1 :medicine\#fda_approved ?T1_fda_approved .        }
medicine_enzyme_interaction,Which enzyme names have the substring 'ALA'?,"SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#name ?T1_name . FILTER(contains (?T1_name, 'ALA')) .        }"
medicine_enzyme_interaction,What are the names of enzymes that include the string 'ALA'?,"SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :enzyme\#name ?T1_name . ?T1 :enzyme\#name ?T1_name . FILTER(contains (?T1_name, 'ALA')) .        }"
medicine_enzyme_interaction,find the number of medicines offered by each trade.,SELECT ?T1_trade_name (count( *) as ?aggregation_all) WHERE { ?T1 a :medicine . ?T1 :medicine\#trade_name ?T1_trade_name .        } GROUP BY ?T1_trade_name
medicine_enzyme_interaction,How many medicines are offered by each trade name?,SELECT ?T1_trade_name (count( *) as ?aggregation_all) WHERE { ?T1 a :medicine . ?T1 :medicine\#trade_name ?T1_trade_name .        } GROUP BY ?T1_trade_name
university_basketball,List all schools and their nicknames in the order of founded year.,SELECT ?T1_school ?T1_nickname WHERE { ?T1 a :university . ?T1 :university\#school ?T1_school . ?T1 :university\#nickname ?T1_nickname . ?T1 :university\#founded ?T1_founded .        }  ORDER BY ASC (?T1_founded)
university_basketball,List all public schools and their locations.,SELECT ?T1_school ?T1_location WHERE { ?T1 a :university . ?T1 :university\#school ?T1_school . ?T1 :university\#location ?T1_location . ?T1 :university\#affiliation ?T1_affiliation . FILTER(?T1_affiliation = 'Public') .        }
university_basketball,What are the public schools and what are their locations?,SELECT ?T1_school ?T1_location WHERE { ?T1 a :university . ?T1 :university\#school ?T1_school . ?T1 :university\#location ?T1_location . ?T1 :university\#affiliation ?T1_affiliation . FILTER(?T1_affiliation = 'Public') .        }
university_basketball,When was the school with the largest enrollment founded?,SELECT ?T1_founded WHERE { ?T1 a :university . ?T1 :university\#founded ?T1_founded . ?T1 :university\#enrollment ?T1_enrollment .        }   ORDER BY DESC (?T1_enrollment) LIMIT 1
university_basketball,Return the founded year for the school with the largest enrollment.,SELECT ?T1_founded WHERE { ?T1 a :university . ?T1 :university\#founded ?T1_founded . ?T1 :university\#enrollment ?T1_enrollment .        }   ORDER BY DESC (?T1_enrollment) LIMIT 1
university_basketball,Find the founded year of the newest non public school.,SELECT ?T1_founded WHERE { ?T1 a :university . ?T1 :university\#founded ?T1_founded . ?T1 :university\#founded ?T1_founded . ?T1 :university\#affiliation ?T1_affiliation . FILTER(?T1_affiliation != 'Public') .        }   ORDER BY DESC (?T1_founded) LIMIT 1
university_basketball,How many schools are in the basketball match?,SELECT DISTINCT (count(DISTINCT ?T1_school_id) as ?aggregation_T1_school_id_95 ) WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\#school_id ?T1_school_id .        }
university_basketball,Count the number of schools that have had basketball matches.,SELECT DISTINCT (count(DISTINCT ?T1_school_id) as ?aggregation_T1_school_id_1 ) WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\#school_id ?T1_school_id .        }
university_basketball,What is the highest acc percent score in the competition?,SELECT ?T1_acc_percent WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\#acc_percent ?T1_acc_percent . ?T1 :basketball_match\#acc_percent ?T1_acc_percent .        }   ORDER BY DESC (?T1_acc_percent) LIMIT 1
university_basketball,Return the highest acc percent across all basketball matches.,SELECT ?T1_acc_percent WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\#acc_percent ?T1_acc_percent . ?T1 :basketball_match\#acc_percent ?T1_acc_percent .        }   ORDER BY DESC (?T1_acc_percent) LIMIT 1
university_basketball,Return the primary conference of the school with the lowest acc percentage score.,SELECT ?T1_primary_conference WHERE { ?T1 a :university . ?T2 a :basketball_match . ?T2 :basketball_match\#ref-school_id ?T1 .  ?T1 :university\#primary_conference ?T1_primary_conference . ?T2 :basketball_match\#acc_percent ?T2_acc_percent .        }   ORDER BY ASC (?T2_acc_percent) LIMIT 1
university_basketball,Return the name of the team and the acc during the regular season for the school that was founded the earliest.,SELECT ?T1_team_name ?T1_acc_regular_season WHERE { ?T1 a :basketball_match . ?T2 a :university . ?T1 :basketball_match\#ref-school_id ?T2 .  ?T1 :basketball_match\#team_name ?T1_team_name . ?T1 :basketball_match\#acc_regular_season ?T1_acc_regular_season . ?T2 :university\#founded ?T2_founded .        }   ORDER BY ASC (?T2_founded) LIMIT 1
university_basketball,Find the location and all games score of the school that has Clemson as its team name.,SELECT ?T1_all_games ?T2_location WHERE { ?T1 a :basketball_match . ?T2 a :university . ?T1 :basketball_match\#ref-school_id ?T2 .  ?T1 :basketball_match\#all_games ?T1_all_games . ?T2 :university\#location ?T2_location . ?T1 :basketball_match\#team_name ?T1_team_name . FILTER(?T1_team_name = 'Clemson') .        }
university_basketball,What are the all games score and location of the school called Clemson?,SELECT ?T1_all_games ?T2_location WHERE { ?T1 a :basketball_match . ?T2 a :university . ?T1 :basketball_match\#ref-school_id ?T2 .  ?T1 :basketball_match\#all_games ?T1_all_games . ?T2 :university\#location ?T2_location . ?T1 :basketball_match\#team_name ?T1_team_name . FILTER(?T1_team_name = 'Clemson') .        }
university_basketball,Return the average enrollment of universities founded before 1850.,SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_72 ) WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment . ?T1 :university\#founded ?T1_founded . FILTER(?T1_founded < 1850) .        }
university_basketball,Show the enrollment and primary_conference of the oldest college.,SELECT ?T1_enrollment ?T1_primary_conference WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment . ?T1 :university\#primary_conference ?T1_primary_conference . ?T1 :university\#founded ?T1_founded .        }   ORDER BY ASC (?T1_founded) LIMIT 1
university_basketball,What is the total and minimum enrollment of all schools?,SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_139 ) (min( ?T1_enrollment) as ?aggregation_T1_enrollment_35 ) WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment . ?T1 :university\#enrollment ?T1_enrollment .        }
university_basketball,Return the total and minimum enrollments across all schools.,SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_151 ) (min( ?T1_enrollment) as ?aggregation_T1_enrollment_49 ) WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment . ?T1 :university\#enrollment ?T1_enrollment .        }
university_basketball,Find the total student enrollment for different affiliation type schools.,SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_8 ) ?T1_affiliation WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment . ?T1 :university\#affiliation ?T1_affiliation .        } GROUP BY ?T1_affiliation
university_basketball,How many schools do not participate in the basketball match?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :university . ?T1 :university\#school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) .       {SELECT ?T22_school_id WHERE { ?T22 a :basketball_match . ?T22 :basketball_match\#school_id ?T22_school_id .        }    } }
university_basketball,Find the schools that were either founded after 1850 or public.,SELECT ?T1_school WHERE { ?T1 a :university . ?T1 :university\#school ?T1_school . ?T1 :university\#founded ?T1_founded . ?T1 :university\#affiliation ?T1_affiliation . FILTER(?T1_founded > 1850 || ?T1_affiliation = 'Public') .        }
university_basketball,What are the schools that were either founded before 1850 or are public?,SELECT ?T1_school WHERE { ?T1 a :university . ?T1 :university\#school ?T1_school . ?T1 :university\#founded ?T1_founded . ?T1 :university\#affiliation ?T1_affiliation . FILTER(?T1_founded > 1850 || ?T1_affiliation = 'Public') .        }
university_basketball,Find how many different affiliation types there are.,SELECT DISTINCT (count(DISTINCT ?T1_affiliation) as ?aggregation_T1_affiliation_176 ) WHERE { ?T1 a :university . ?T1 :university\#affiliation ?T1_affiliation .        }
university_basketball,Count the number of different affiliation types.,SELECT DISTINCT (count(DISTINCT ?T1_affiliation) as ?aggregation_T1_affiliation_30 ) WHERE { ?T1 a :university . ?T1 :university\#affiliation ?T1_affiliation .        }
university_basketball,Find how many school locations have the word 'NY'.,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :university . ?T1 :university\#location ?T1_location . FILTER(contains (?T1_location, 'NY')) .        }"
university_basketball,How many universities have a location that contains NY?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :university . ?T1 :university\#location ?T1_location . FILTER(contains (?T1_location, 'NY')) .        }"
university_basketball,Find the team names of the universities whose enrollments are smaller than the average enrollment size.,SELECT ?T1_team_name WHERE { ?T1 a :basketball_match . ?T2 a :university . ?T1 :basketball_match\#ref-school_id ?T2 .  ?T1 :basketball_match\#team_name ?T1_team_name . ?T2 :university\#enrollment ?T2_enrollment . FILTER(?T2_enrollment < (?aggregation_T23_enrollment_68)) .       {SELECT (avg( ?T23_enrollment) as ?aggregation_T23_enrollment_68 ) WHERE { ?T23 a :university . ?T23 :university\#enrollment ?T23_enrollment .        }    } }
university_basketball,Find the number of universities that have over a 20000 enrollment size for each affiliation type.,SELECT (count( *) as ?aggregation_all) ?T1_affiliation WHERE { ?T1 a :university . ?T1 :university\#affiliation ?T1_affiliation . ?T1 :university\#enrollment ?T1_enrollment . FILTER(?T1_enrollment > 20000) .        } GROUP BY ?T1_affiliation
university_basketball,Find the total number of students enrolled in the colleges that were founded after the year of 1850 for each affiliation type.,SELECT (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_191 ) ?T1_affiliation WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment . ?T1 :university\#affiliation ?T1_affiliation . ?T1 :university\#founded ?T1_founded . FILTER(?T1_founded > 1850) .        } GROUP BY ?T1_affiliation
university_basketball,What is the maximum enrollment across all schools?,SELECT (max( ?T1_enrollment) as ?aggregation_T1_enrollment_178 ) WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment .        }
university_basketball,Return the maximum enrollment across all schools.,SELECT (max( ?T1_enrollment) as ?aggregation_T1_enrollment_104 ) WHERE { ?T1 a :university . ?T1 :university\#enrollment ?T1_enrollment .        }
university_basketball,List all information regarding the basketball match.,SELECT * WHERE { ?T1 a :basketball_match .        }
university_basketball,What is all the information about the basketball match?,SELECT * WHERE { ?T1 a :basketball_match .        }
university_basketball,"List names of all teams in the basketball competition, ordered by all home scores in descending order.",SELECT ?T1_team_name WHERE { ?T1 a :basketball_match . ?T1 :basketball_match\#team_name ?T1_team_name . ?T1 :basketball_match\#all_home ?T1_all_home .        }  ORDER BY DESC (?T1_all_home)
phone_1,the names of models that launched between 2002 and 2004.,SELECT ?T1_model_name WHERE { ?T1 a :chip_model . ?T1 :chip_model\#model_name ?T1_model_name . ?T1 :chip_model\#launch_year ?T1_launch_year . FILTER(?T1_launch_year >= 2002 && ?T1_launch_year <= 2004) .        }
phone_1,Which model has the least amount of RAM? List the model name and the amount of RAM.,SELECT ?T1_model_name ?T1_ram_mib WHERE { ?T1 a :chip_model . ?T1 :chip_model\#model_name ?T1_model_name . ?T1 :chip_model\#ram_mib ?T1_ram_mib . ?T1 :chip_model\#ram_mib ?T1_ram_mib .        }   ORDER BY ASC (?T1_ram_mib) LIMIT 1
phone_1,What are the chip model and screen mode of the phone with hardware model name 'LG-P760'?,SELECT ?T1_chip_model ?T1_screen_mode WHERE { ?T1 a :phone . ?T1 :phone\#chip_model ?T1_chip_model . ?T1 :phone\#screen_mode ?T1_screen_mode . ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . FILTER(?T1_hardware_model_name = 'LG-P760') .        }
phone_1,How many phone hardware models are produced by the company named 'Nokia Corporation'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :phone\#company_name ?T1_company_name . FILTER(?T1_company_name = 'Nokia Corporation') .        }
phone_1,What is maximum and minimum RAM size of phone produced by company named 'Nokia Corporation'?,SELECT (max( ?T1_ram_mib) as ?aggregation_T1_ram_mib_65 ) (min( ?T1_ram_mib) as ?aggregation_T1_ram_mib_20 ) WHERE { ?T1 a :chip_model . ?T2 a :phone . ?T2 :phone\#ref-chip_model ?T1 .  ?T1 :chip_model\#ram_mib ?T1_ram_mib . ?T1 :chip_model\#ram_mib ?T1_ram_mib . ?T2 :phone\#company_name ?T2_company_name . FILTER(?T2_company_name = 'Nokia Corporation') .        }
phone_1,What is the average ROM size of phones produced by the company named 'Nokia Corporation'?,SELECT (avg( ?T1_rom_mib) as ?aggregation_T1_rom_mib_130 ) WHERE { ?T1 a :chip_model . ?T2 a :phone . ?T2 :phone\#ref-chip_model ?T1 .  ?T1 :chip_model\#rom_mib ?T1_rom_mib . ?T2 :phone\#company_name ?T2_company_name . FILTER(?T2_company_name = 'Nokia Corporation') .        }
phone_1,List the hardware model name and company name for all the phones that were launched in year 2002 or have RAM size greater than 32.,SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :chip_model . ?T1 :phone\#ref-chip_model ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\#company_name ?T1_company_name . ?T2 :chip_model\#launch_year ?T2_launch_year . ?T2 :chip_model\#ram_mib ?T2_ram_mib . FILTER(?T2_launch_year = 2002 || ?T2_ram_mib > 32) .        }
phone_1,Find all phones that have word 'Full' in their accreditation types. List the Hardware Model name and Company name.,"SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\#company_name ?T1_company_name . ?T1 :phone\#accreditation_type ?T1_accreditation_type . FILTER(contains (?T1_accreditation_type, 'Full')) .        }"
phone_1,"Find the Char cells, Pixels and Hardware colours for the screen of the phone whose hardware model name is 'LG-P760'.",SELECT ?T1_char_cells ?T1_pixels ?T1_hardware_colours WHERE { ?T1 a :screen_mode . ?T2 a :phone . ?T2 :phone\#ref-screen_mode ?T1 .  ?T1 :screen_mode\#char_cells ?T1_char_cells . ?T1 :screen_mode\#pixels ?T1_pixels . ?T1 :screen_mode\#hardware_colours ?T1_hardware_colours . ?T2 :phone\#hardware_model_name ?T2_hardware_model_name . FILTER(?T2_hardware_model_name = 'LG-P760') .        }
phone_1,List the hardware model name and company name for the phone whose screen mode type is 'Graphics.',SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :phone\#ref-screen_mode ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T1 :phone\#company_name ?T1_company_name . ?T2 :screen_mode\#type ?T2_type . FILTER(?T2_type = 'Graphics') .        }
phone_1,Find the name of the company that has the least number of phone models. List the company name and the number of phone model produced by that company.,SELECT ?T1_company_name (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :phone\#company_name ?T1_company_name .        } GROUP BY ?T1_company_name  ORDER BY ASC (?aggregation_all) LIMIT 1
phone_1,List the name of the company that produced more than one phone model.,SELECT ?T1_company_name WHERE { ?T1 a :phone . ?T1 :phone\#company_name ?T1_company_name .        } GROUP BY ?T1_company_name   HAVING(count( *)  > 1)
phone_1,"List the maximum, minimum and average number of used kb in screen mode.",SELECT (max( ?T1_used_kb) as ?aggregation_T1_used_kb_163 ) (min( ?T1_used_kb) as ?aggregation_T1_used_kb_74 ) (avg( ?T1_used_kb) as ?aggregation_T1_used_kb_41 ) WHERE { ?T1 a :screen_mode . ?T1 :screen_mode\#used_kb ?T1_used_kb . ?T1 :screen_mode\#used_kb ?T1_used_kb . ?T1 :screen_mode\#used_kb ?T1_used_kb .        }
phone_1,List the name of the phone model launched in year 2002 and with the highest RAM size.,SELECT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :chip_model . ?T1 :phone\#ref-chip_model ?T2 .  ?T1 :phone\#hardware_model_name ?T1_hardware_model_name . ?T2 :chip_model\#ram_mib ?T2_ram_mib . ?T2 :chip_model\#launch_year ?T2_launch_year . FILTER(?T2_launch_year = 2002) .        }   ORDER BY DESC (?T2_ram_mib) LIMIT 1
phone_1,What are the wifi and screen mode type of the hardware model named 'LG-P760'?,SELECT ?T1_wifi ?T2_type WHERE { ?T1 a :chip_model . ?T3 a :phone . ?T3 :phone\#ref-chip_model ?T1 .  ?T1 :chip_model\#wifi ?T1_wifi . ?T2 :screen_mode\#type ?T2_type . ?T3 :phone\#hardware_model_name ?T3_hardware_model_name . ?T2 a :screen_mode . ?T3 :phone\#ref-screen_mode ?T2 .  ?T1 :chip_model\#wifi ?T1_wifi . ?T2 :screen_mode\#type ?T2_type . ?T3 :phone\#hardware_model_name ?T3_hardware_model_name . FILTER(?T3_hardware_model_name = 'LG-P760') .        }
