[
    {
        "kg_name": "music_2",
        "question": "Hom many musicians performed in the song 'Flash'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T2 a :songs . ?T1 :performance\\#ref-songid ?T2 .  ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Flash') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many musicians play in the song 'Flash'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T2 a :songs . ?T1 :performance\\#ref-songid ?T2 .  ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Flash') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What is the label that has the most albums?",
        "query": "SELECT ?T1_label (count( *) as ?aggregation_all) WHERE { ?T1 a :albums . ?T1 :albums\\#label ?T1_label .        } GROUP BY ?T1_label  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "music_2",
        "question": "What is the label with the most albums?",
        "query": "SELECT ?T1_label (count( *) as ?aggregation_all) WHERE { ?T1 a :albums . ?T1 :albums\\#label ?T1_label .        } GROUP BY ?T1_label  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "music_2",
        "question": "What are the names of the songs whose title has the word 'the'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :songs . ?T1 :songs\\#title ?T1_title . ?T1 :songs\\#title ?T1_title . FILTER(contains (?T1_title, ' the ')) .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many songs have used the instrument 'drums'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :instruments . ?T1 :instruments\\#instrument ?T1_instrument . FILTER(?T1_instrument = 'drums') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What instruments does the the song 'Le Pop' use?",
        "query": "SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\\#ref-songid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the instruments are used in the song 'Le Pop'?",
        "query": "SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\\#ref-songid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many instruments does the song 'Le Pop' use?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_159 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\\#ref-songid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many different instruments are used in the song 'Le Pop'?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_66 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\\#ref-songid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many instrument does the musician with last name 'Heilo' use?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_63 ) WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\\#ref-bandmateid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :band\\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "Find all the instruments ever used by the musician with last name 'Heilo'?",
        "query": "SELECT ?T1_instrument WHERE { ?T1 a :instruments . ?T2 a :band . ?T1 :instruments\\#ref-bandmateid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :band\\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "Which song has the most vocals?",
        "query": "SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\\#ref-songid ?T1 .  ?T1 :songs\\#title ?T1_title .        } GROUP BY ?T1_title  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "music_2",
        "question": "What is the song with the most vocals?",
        "query": "SELECT ?T1_title (count( *) as ?aggregation_all) WHERE { ?T1 a :songs . ?T2 a :vocals . ?T2 :vocals\\#ref-songid ?T1 .  ?T1 :songs\\#title ?T1_title .        } GROUP BY ?T1_title  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "music_2",
        "question": "Which vocal type has the band mate with last name 'Heilo' played the most?",
        "query": "SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :band . ?T1 :vocals\\#ref-bandmate ?T2 .  ?T1 :vocals\\#type ?T1_type . ?T2 :band\\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        } GROUP BY ?T1_type  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "music_2",
        "question": "What are the vocal types used in song 'Le Pop'?",
        "query": "SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T1 :vocals\\#type ?T1_type . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the types of vocals used in the song 'Le Pop'?",
        "query": "SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T1 :vocals\\#type ?T1_type . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "Find the number of vocal types used in song 'Demon Kitty Rag'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Demon Kitty Rag') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the types of vocals used in the song 'Demon Kitty Rag'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Demon Kitty Rag') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "Who performed the song named 'Le Pop'?",
        "query": "SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T13 a :performance . ?T13 :performance\\#ref-bandmate ?T1 .  ?T1 :band\\#firstname ?T1_firstname . ?T1 :band\\#lastname ?T1_lastname . ?T2 :songs\\#title ?T2_title . ?T2 a :songs . ?T13 :performance\\#ref-songid ?T2 .  ?T1 :band\\#firstname ?T1_firstname . ?T1 :band\\#lastname ?T1_lastname . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What is the first and last name of artist who performed 'Le Pop'?",
        "query": "SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :band . ?T13 a :performance . ?T13 :performance\\#ref-bandmate ?T1 .  ?T1 :band\\#firstname ?T1_firstname . ?T1 :band\\#lastname ?T1_lastname . ?T2 :songs\\#title ?T2_title . ?T2 a :songs . ?T13 :performance\\#ref-songid ?T2 .  ?T1 :band\\#firstname ?T1_firstname . ?T1 :band\\#lastname ?T1_lastname . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many instruments does the song 'Badlands' use?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_15 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\\#ref-songid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many different instruments are used in the song 'Badlands'?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_instrument) as ?aggregation_T1_instrument_144 ) WHERE { ?T1 a :instruments . ?T2 a :songs . ?T1 :instruments\\#ref-songid ?T2 .  ?T1 :instruments\\#instrument ?T1_instrument . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the vocal types used in song 'Badlands'?",
        "query": "SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T1 :vocals\\#type ?T1_type . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What types of vocals are used in the song 'Badlands'?",
        "query": "SELECT ?T1_type WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T1 :vocals\\#type ?T1_type . ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Badlands') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "How many vocal types are used in the song 'Le Pop'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :vocals . ?T2 a :songs . ?T1 :vocals\\#ref-songid ?T2 .  ?T2 :songs\\#title ?T2_title . FILTER(?T2_title = 'Le Pop') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the songs in album 'A Kiss Before You Go: Live in Hamburg'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\\#ref-songid ?T1 .  ?T1 :songs\\#title ?T1_title . ?T2 :albums\\#title ?T2_title . ?T2 a :albums . ?T13 :tracklists\\#ref-albumid ?T2 .  ?T1 :songs\\#title ?T1_title . ?T2 :albums\\#title ?T2_title . FILTER(?T2_title = 'A Kiss Before You Go: Live in Hamburg') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the song titles on the album 'A Kiss Before You Go: Live in Hamburg'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\\#ref-songid ?T1 .  ?T1 :songs\\#title ?T1_title . ?T2 :albums\\#title ?T2_title . ?T2 a :albums . ?T13 :tracklists\\#ref-albumid ?T2 .  ?T1 :songs\\#title ?T1_title . ?T2 :albums\\#title ?T2_title . FILTER(?T2_title = 'A Kiss Before You Go: Live in Hamburg') .        }"
    },
    {
        "kg_name": "music_2",
        "question": "What are all the songs in albums under label 'Universal Music Group'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :tracklists . ?T13 :tracklists\\#ref-songid ?T1 .  ?T1 :songs\\#title ?T1_title . ?T2 :albums\\#label ?T2_label . ?T2 a :albums . ?T13 :tracklists\\#ref-albumid ?T2 .  ?T1 :songs\\#title ?T1_title . ?T2 :albums\\#label ?T2_label . FILTER(?T2_label = 'Universal Music Group') .        }"
    },
    {
        "kg_name": "manufactory_1",
        "question": "Select all the data from the products and each product's manufacturer.",
        "query": "SELECT * WHERE { ?T1 a :products .        }"
    },
    {
        "kg_name": "manufactory_1",
        "question": "Select the names of manufacturer whose products have an average price higher than or equal to $150.",
        "query": "SELECT (avg( ?T1_price) as ?aggregation_T1_price_194 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\\#ref-manufacturer ?T2 .  ?T1 :products\\#price ?T1_price . ?T2 :manufacturers\\#name ?T2_name . ?T1 :products\\#price ?T1_price .        } GROUP BY ?T2_name   HAVING(avg( ?T1_price)  >= 150)"
    },
    {
        "kg_name": "manufactory_1",
        "question": "Select the name of each manufacturer along with the name and price of its most expensive product.",
        "query": "SELECT ?T1_name (max( ?T1_price) as ?aggregation_T1_price_103 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :products\\#ref-manufacturer ?T2 .  ?T1 :products\\#name ?T1_name . ?T1 :products\\#price ?T1_price . ?T2 :manufacturers\\#name ?T2_name .        } GROUP BY ?T1_name ?T2_name"
    },
    {
        "kg_name": "manufactory_1",
        "question": "Select the code of the product that is cheapest in each product category.",
        "query": "SELECT ?T1_code ?T1_name (min( ?T1_price) as ?aggregation_T1_price_175 ) WHERE { ?T1 a :products . ?T1 :products\\#code ?T1_code . ?T1 :products\\#name ?T1_name . ?T1 :products\\#price ?T1_price .        } GROUP BY ?T1_name"
    },
    {
        "kg_name": "manufactory_1",
        "question": "What are the codes and names of the cheapest products in each category?",
        "query": "SELECT ?T1_code ?T1_name (min( ?T1_price) as ?aggregation_T1_price_134 ) WHERE { ?T1 a :products . ?T1 :products\\#code ?T1_code . ?T1 :products\\#name ?T1_name . ?T1 :products\\#price ?T1_price .        } GROUP BY ?T1_name"
    },
    {
        "kg_name": "tracking_software_problems",
        "question": "How many problems did the product called 'voluptatem' have in record?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :problems . ?T2 a :product . ?T1 :problems\\#ref-product_id ?T2 .  ?T2 :product\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'voluptatem') .        }"
    },
    {
        "kg_name": "voter_2",
        "question": "Who are the advisors for students that live in a city with city code 'BAL'?",
        "query": "SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :student\\#advisor ?T1_advisor . ?T1 :student\\#city_code ?T1_city_code . FILTER(?T1_city_code = 'BAL') .        }"
    },
    {
        "kg_name": "voter_2",
        "question": "What is the city_code of the city that the most students live in?",
        "query": "SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What are the names of products with category 'Spices'?",
        "query": "SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\\#product_name ?T1_product_name . ?T1 :products\\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "How many products are there under the category 'Seeds'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Seeds') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "Which category does the product named 'flax' belong to?",
        "query": "SELECT ?T1_product_category_code WHERE { ?T1 a :products . ?T1 :products\\#product_category_code ?T1_product_category_code . ?T1 :products\\#product_name ?T1_product_name . FILTER(?T1_product_name = 'flax') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What is the color description of the product with name 'catnip'?",
        "query": "SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :products\\#ref-color_code ?T1 .  ?T1 :ref_colors\\#color_description ?T1_color_description . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'catnip') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What is the color code and description of the product named 'chervil'?",
        "query": "SELECT ?T1_color_code ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :products\\#ref-color_code ?T2 .  ?T1 :products\\#color_code ?T1_color_code . ?T2 :ref_colors\\#color_description ?T2_color_description . ?T1 :products\\#product_name ?T1_product_name . FILTER(?T1_product_name = 'chervil') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "How many characteristics does the product named 'sesame' have?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :product_characteristics . ?T2 a :products . ?T1 :product_characteristics\\#ref-product_id ?T2 .  ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "How many distinct characteristic names does the product 'cumin' have?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_22 ) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\\#ref-product_id ?T2 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What are all the characteristic names of product 'sesame'?",
        "query": "SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T1 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_characteristics\\#ref-product_id ?T2 .  ?T1 :characteristics\\#characteristic_name ?T1_characteristic_name . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "How many characteristics does the product named 'laurel' have?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :products\\#product_name ?T1_product_name . FILTER(?T1_product_name = 'laurel') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "How many products have the characteristic named 'hot'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :product_characteristics . ?T2 a :characteristics . ?T13 :product_characteristics\\#ref-characteristic_id ?T2 .  ?T2 :characteristics\\#characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'hot') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What is the unit of measuerment of the product category code 'Herbs'?",
        "query": "SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T1 :ref_product_categories\\#unit_of_measure ?T1_unit_of_measure . ?T1 :ref_product_categories\\#product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What is the unit of measurement of product named 'cumin'?",
        "query": "SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :products\\#ref-product_category_code ?T1 .  ?T1 :ref_product_categories\\#unit_of_measure ?T1_unit_of_measure . ?T2 :products\\#product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') .        }"
    },
    {
        "kg_name": "products_gen_characteristics",
        "question": "What is the description of the color used by least products?",
        "query": "SELECT ?T1_color_description (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :products\\#ref-color_code ?T1 .  ?T1 :ref_colors\\#color_description ?T1_color_description .        } GROUP BY ?T1_color_description  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "swimming",
        "question": "How many stadiums are not in country 'Russia'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T1 :stadium\\#country ?T1_country . FILTER(?T1_country != 'Russia') .        }"
    },
    {
        "kg_name": "swimming",
        "question": "What is the name of the stadium which held the most events?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T2 a :event . ?T2 :event\\#ref-stadium_id ?T1 .  ?T1 :stadium\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "dorm_1",
        "question": "What is the code of the city with the most students?",
        "query": "SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :student\\#city_code ?T1_city_code .        } GROUP BY ?T1_city_code  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "customer_complaints",
        "question": "What is the description of the product named 'Chocolate'?",
        "query": "SELECT ?T1_product_description WHERE { ?T1 a :products . ?T1 :products\\#product_description ?T1_product_description . ?T1 :products\\#product_name ?T1_product_name . FILTER(?T1_product_name = 'Chocolate') .        }"
    },
    {
        "kg_name": "workshop_paper",
        "question": "Which authors with submissions are from college 'Florida' or 'Temple'?",
        "query": "SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :submission\\#author ?T1_author . ?T1 :submission\\#college ?T1_college . ?T1 :submission\\#college ?T1_college . FILTER(?T1_college = 'Florida' || ?T1_college = 'Temple') .        }"
    },
    {
        "kg_name": "tracking_share_transactions",
        "question": "What is the total share of transactions?",
        "query": "SELECT (sum( ?T1_share_count) as ?aggregation_T1_share_count_95 ) WHERE { ?T1 a :transactions . ?T1 :transactions\\#share_count ?T1_share_count .        }"
    },
    {
        "kg_name": "tracking_share_transactions",
        "question": "Return the lot details of lots that belong to investors with details 'l'?",
        "query": "SELECT ?T1_lot_details WHERE { ?T1 a :lots . ?T2 a :investors . ?T1 :lots\\#ref-investor_id ?T2 .  ?T1 :lots\\#lot_details ?T1_lot_details . ?T2 :investors\\#investor_details ?T2_investor_details . FILTER(?T2_investor_details = 'l') .        }"
    },
    {
        "kg_name": "cre_theme_park",
        "question": "What is the address of the location 'UK Gallery'?",
        "query": "SELECT ?T1_address WHERE { ?T1 a :locations . ?T1 :locations\\#address ?T1_address . ?T1 :locations\\#location_name ?T1_location_name . FILTER(?T1_location_name = 'UK Gallery') .        }"
    },
    {
        "kg_name": "cre_theme_park",
        "question": "Which location names contain the word 'film'?",
        "query": "SELECT ?T1_location_name WHERE { ?T1 a :locations . ?T1 :locations\\#location_name ?T1_location_name . ?T1 :locations\\#location_name ?T1_location_name . FILTER(contains (?T1_location_name, 'film')) .        }"
    },
    {
        "kg_name": "game_1",
        "question": "What is the first and last name of the student who played the most sports?",
        "query": "SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :sportsinfo\\#ref-stuid ?T1 .  ?T1 :student\\#fname ?T1_fname . ?T1 :student\\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "game_1",
        "question": "What is the name of the game that has been played the most?",
        "query": "SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T2 a :plays_games . ?T2 :plays_games\\#ref-gameid ?T1 .  ?T1 :video_games\\#gname ?T1_gname . ?T2 :plays_games\\#hours_played ?T2_hours_played . } GROUP BY ?T1_gname  ORDER BY DESC (sum( ?T2_hours_played) ) LIMIT 1"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "What are the names of customers who use payment method 'Cash'?",
        "query": "SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\\#customer_name ?T1_customer_name . ?T1 :customers\\#payment_method ?T1_payment_method . FILTER(?T1_payment_method = 'Cash') .        }"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "What is the address content of the customer named 'Maudie Kertzmann'?",
        "query": "SELECT ?T1_address_content WHERE { ?T1 a :addresses . ?T2 a :customers . ?T2 :customers\\#ref-address_id ?T1 .  ?T1 :addresses\\#address_content ?T1_address_content . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Maudie Kertzmann') .        }"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "How many customers are living in city 'Lake Geovannyton'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :addresses . ?T1 :customers\\#ref-address_id ?T2 .  ?T2 :addresses\\#city ?T2_city . FILTER(?T2_city = 'Lake Geovannyton') .        }"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "What is the name of the customer that has purchased the most items?",
        "query": "SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :order_items\\#order_quantity ?T2_order_quantity . ?T2 a :order_items . ?T2 :order_items\\#ref-order_id ?T13 .  ?T1 :customers\\#customer_name ?T1_customer_name . ?T2 :order_items\\#order_quantity ?T2_order_quantity .        } GROUP BY ?T1_customer_name  ORDER BY DESC ((sum( ?T2_order_quantity) as ?aggregation_T2_order_quantity_87 )) LIMIT 1"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "What is the total quantity of products purchased by 'Rodrick Heaney'?",
        "query": "SELECT (sum( ?T1_order_quantity) as ?aggregation_T1_order_quantity_130 ) WHERE { ?T1 a :order_items . ?T13 a :customer_orders . ?T1 :order_items\\#ref-order_id ?T13 .  ?T1 :order_items\\#order_quantity ?T1_order_quantity . ?T2 :customers\\#customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :customer_orders\\#ref-customer_id ?T2 .  ?T1 :order_items\\#order_quantity ?T1_order_quantity . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Rodrick Heaney') .        }"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "How many customers have at least one order with status 'Cancelled'?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_145 ) WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\\#customer_id ?T1_customer_id . ?T1 :customer_orders\\#order_status ?T1_order_status . FILTER(?T1_order_status = 'Cancelled') .        }"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "How many orders have detail 'Second time'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\\#order_details ?T1_order_details . FILTER(?T1_order_details = 'Second time') .        }"
    },
    {
        "kg_name": "customers_and_addresses",
        "question": "What is the most frequently ordered product? Tell me the detail of the product",
        "query": "SELECT ?T2_product_details (count( *) as ?aggregation_all) WHERE { ?T1 a :order_items . ?T2 a :products . ?T1 :order_items\\#ref-product_id ?T2 .  ?T2 :products\\#product_details ?T2_product_details .} GROUP BY ?T2_product_details  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "music_4",
        "question": "What are the famous titles of the artist 'Triumfall'?",
        "query": "SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T1 :artist\\#famous_title ?T1_famous_title . ?T1 :artist\\#artist ?T1_artist . FILTER(?T1_artist = 'Triumfall') .        }"
    },
    {
        "kg_name": "music_4",
        "question": "What are the category of music festivals with result 'Awarded'?",
        "query": "SELECT ?T1_category WHERE { ?T1 a :music_festival . ?T1 :music_festival\\#category ?T1_category . ?T1 :music_festival\\#result ?T1_result . FILTER(?T1_result = 'Awarded') .        }"
    },
    {
        "kg_name": "city_record",
        "question": "Which city has hosted the most events?",
        "query": "SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :hosting_city\\#ref-host_city ?T1 .  ?T1 :city\\#city ?T1_city .        } GROUP BY ?T1_city  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "city_record",
        "question": "What is the temperature of 'Shanghai' city in January?",
        "query": "SELECT ?T1_jan WHERE { ?T1 a :temperature . ?T2 a :city . ?T1 :temperature\\#ref-city_id ?T2 .  ?T1 :temperature\\#jan ?T1_jan . ?T2 :city\\#city ?T2_city . FILTER(?T2_city = 'Shanghai') .        }"
    },
    {
        "kg_name": "city_record",
        "question": "What is the host year of city 'Taizhou ( Zhejiang )'?",
        "query": "SELECT ?T1_year WHERE { ?T1 a :hosting_city . ?T2 a :city . ?T1 :hosting_city\\#ref-host_city ?T2 .  ?T1 :hosting_city\\#year ?T1_year . ?T2 :city\\#city ?T2_city . FILTER(?T2_city = 'Taizhou ( Zhejiang )') .        }"
    },
    {
        "kg_name": "city_record",
        "question": "IN which year did city 'Taizhou ( Zhejiang )' serve as a host city?",
        "query": "SELECT ?T1_year WHERE { ?T1 a :hosting_city . ?T2 a :city . ?T1 :hosting_city\\#ref-host_city ?T2 .  ?T1 :hosting_city\\#year ?T1_year . ?T2 :city\\#city ?T2_city . FILTER(?T2_city = 'Taizhou ( Zhejiang )') .        }"
    },
    {
        "kg_name": "e_government",
        "question": "What is the name of the party form that is most common?",
        "query": "SELECT ?T1_form_name (count( *) as ?aggregation_all) WHERE { ?T1 a :forms . ?T2 a :party_forms . ?T2 :party_forms\\#ref-form_id ?T1 .  ?T1 :forms\\#form_name ?T1_form_name .        } GROUP BY ?T1_form_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "e_government",
        "question": "How many cities are there in state 'Colorado'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :addresses . ?T1 :addresses\\#state_province_county ?T1_state_province_county . FILTER(?T1_state_province_county = 'Colorado') .        }"
    },
    {
        "kg_name": "e_government",
        "question": "What are the names of organizations that contain the word 'Party'?",
        "query": "SELECT ?T1_organization_name WHERE { ?T1 a :organizations . ?T1 :organizations\\#organization_name ?T1_organization_name . ?T1 :organizations\\#organization_name ?T1_organization_name . FILTER(contains (?T1_organization_name, 'Party')) .        }"
    },
    {
        "kg_name": "e_government",
        "question": "Which state can address '6862 Kaitlyn Knolls' possibly be in?",
        "query": "SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T1 :addresses\\#state_province_county ?T1_state_province_county . ?T1 :addresses\\#line_1_number_building ?T1_line_1_number_building . FILTER(contains (?T1_line_1_number_building, '6862 Kaitlyn Knolls')) .        }"
    }
]