kg_name,question,query
election_representative,What is the average number of votes of representatives from party 'Republican'?,SELECT (avg( ?T1_votes) as ?aggregation_T1_votes_82 ) WHERE { ?T1 a :election . ?T2 a :representative . ?T1 :election\#ref-representative_id ?T2 .  ?T1 :election\#votes ?T1_votes . ?T2 :representative\#party ?T2_party . FILTER(?T2_party = 'Republican') .        }
election_representative,What are the different parties of representative? Show the party name and the number of representatives in each party.,SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :representative . ?T1 :representative\#party ?T1_party .        } GROUP BY ?T1_party
election_representative,What is the party that has the largest number of representatives?,SELECT ?T1_party (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :representative . ?T1 :representative\#party ?T1_party .        } GROUP BY ?T1_party  ORDER BY DESC (?aggregation_all) LIMIT 1
election_representative,What parties have at least three representatives?,SELECT ?T1_party WHERE { ?T1 a :representative . ?T1 :representative\#party ?T1_party .        } GROUP BY ?T1_party   HAVING(count( *)  >= 3)
election_representative,What states have at least two representatives?,SELECT ?T1_state WHERE { ?T1 a :representative . ?T1 :representative\#state ?T1_state .        } GROUP BY ?T1_state   HAVING(count( *)  >= 2)
election_representative,List the names of representatives that have not participated in elections listed here.,SELECT ?T1_name WHERE { ?T1 a :representative . ?T1 :representative\#name ?T1_name . ?T1 :representative\#representative_id ?T1_representative_id . FILTER(?T1_representative_id not in (?T22_representative_id)) .       {SELECT ?T22_representative_id WHERE { ?T22 a :election . ?T22 :election\#representative_id ?T22_representative_id .        }    } }
election_representative,Show the parties that have both representatives in New York state and representatives in Pennsylvania state.,SELECT DISTINCT ?T1_party WHERE { ?T1 a :representative . ?T1 :representative\#party ?T1_party . ?T1 :representative\#state ?T1_state . FILTER(?T1_state = 'New York') . FILTER (?T1_party in (?T2_party)) .   ?T2 a :representative . ?T2 :representative\#party ?T2_party . ?T2 :representative\#state ?T2_state .  FILTER(?T2_state = 'Pennsylvania') .             }
election_representative,How many distinct parties are there for representatives?,SELECT DISTINCT (count(DISTINCT ?T1_party) as ?aggregation_T1_party_141 ) WHERE { ?T1 a :representative . ?T1 :representative\#party ?T1_party .        }
apartment_rentals,How many apartment bookings are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :apartment_bookings .        }
apartment_rentals,Show the start dates and end dates of all the apartment bookings.,SELECT ?T1_booking_start_date ?T1_booking_end_date WHERE { ?T1 a :apartment_bookings . ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\#booking_end_date ?T1_booking_end_date .        }
apartment_rentals,What are the start date and end date of each apartment booking?,SELECT ?T1_booking_start_date ?T1_booking_end_date WHERE { ?T1 a :apartment_bookings . ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\#booking_end_date ?T1_booking_end_date .        }
apartment_rentals,Show all distinct building descriptions.,SELECT DISTINCT ?T1_building_description WHERE { ?T1 a :apartment_buildings . ?T1 :apartment_buildings\#building_description ?T1_building_description .        }
apartment_rentals,Show the short names of the buildings managed by 'Emma'.,SELECT ?T1_building_short_name WHERE { ?T1 a :apartment_buildings . ?T1 :apartment_buildings\#building_short_name ?T1_building_short_name . ?T1 :apartment_buildings\#building_manager ?T1_building_manager . FILTER(?T1_building_manager = 'Emma') .        }
apartment_rentals,Show the addresses and phones of all the buildings managed by 'Brenden'.,SELECT ?T1_building_address ?T1_building_phone WHERE { ?T1 a :apartment_buildings . ?T1 :apartment_buildings\#building_address ?T1_building_address . ?T1 :apartment_buildings\#building_phone ?T1_building_phone . ?T1 :apartment_buildings\#building_manager ?T1_building_manager . FILTER(?T1_building_manager = 'Brenden') .        }
apartment_rentals,What are the address and phone number of the buildings managed by 'Brenden'?,SELECT ?T1_building_address ?T1_building_phone WHERE { ?T1 a :apartment_buildings . ?T1 :apartment_buildings\#building_address ?T1_building_address . ?T1 :apartment_buildings\#building_phone ?T1_building_phone . ?T1 :apartment_buildings\#building_manager ?T1_building_manager . FILTER(?T1_building_manager = 'Brenden') .        }
apartment_rentals,What are the building full names that contain the word 'court'?,"SELECT ?T1_building_full_name WHERE { ?T1 a :apartment_buildings . ?T1 :apartment_buildings\#building_full_name ?T1_building_full_name . ?T1 :apartment_buildings\#building_full_name ?T1_building_full_name . FILTER(contains (?T1_building_full_name, 'court')) .        }"
apartment_rentals,Give me the minimum and maximum bathroom count among all the apartments.,SELECT (min( ?T1_bathroom_count) as ?aggregation_T1_bathroom_count_102 ) (max( ?T1_bathroom_count) as ?aggregation_T1_bathroom_count_171 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#bathroom_count ?T1_bathroom_count . ?T1 :apartments\#bathroom_count ?T1_bathroom_count .        }
apartment_rentals,What is the average number of bedrooms of all apartments?,SELECT (avg( ?T1_bedroom_count) as ?aggregation_T1_bedroom_count_43 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#bedroom_count ?T1_bedroom_count .        }
apartment_rentals,Find the average number of bedrooms of all the apartments.,SELECT (avg( ?T1_bedroom_count) as ?aggregation_T1_bedroom_count_183 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#bedroom_count ?T1_bedroom_count .        }
apartment_rentals,Return the apartment number and the number of rooms for each apartment.,SELECT ?T1_apt_number ?T1_room_count WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_number ?T1_apt_number . ?T1 :apartments\#room_count ?T1_room_count .        }
apartment_rentals,What are the apartment number and the room count of each apartment?,SELECT ?T1_apt_number ?T1_room_count WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_number ?T1_apt_number . ?T1 :apartments\#room_count ?T1_room_count .        }
apartment_rentals,What is the average number of rooms of apartments with type code 'Studio'?,SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_168 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#room_count ?T1_room_count . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Studio') .        }
apartment_rentals,Find the average room count of the apartments that have the 'Studio' type code.,SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_176 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#room_count ?T1_room_count . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Studio') .        }
apartment_rentals,Return the apartment numbers of the apartments with type code 'Flat'.,SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_number ?T1_apt_number . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Flat') .        }
apartment_rentals,Return the first names and last names of all guests,SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a :guests . ?T1 :guests\#guest_first_name ?T1_guest_first_name . ?T1 :guests\#guest_last_name ?T1_guest_last_name .        }
apartment_rentals,What are the first names and last names of all the guests?,SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a :guests . ?T1 :guests\#guest_first_name ?T1_guest_first_name . ?T1 :guests\#guest_last_name ?T1_guest_last_name .        }
apartment_rentals,Return the date of birth for all the guests with gender code 'Male'.,SELECT ?T1_date_of_birth WHERE { ?T1 a :guests . ?T1 :guests\#date_of_birth ?T1_date_of_birth . ?T1 :guests\#gender_code ?T1_gender_code . FILTER(?T1_gender_code = 'Male') .        }
apartment_rentals,What are dates of birth of all the guests whose gender is 'Male'?,SELECT ?T1_date_of_birth WHERE { ?T1 a :guests . ?T1 :guests\#date_of_birth ?T1_date_of_birth . ?T1 :guests\#gender_code ?T1_gender_code . FILTER(?T1_gender_code = 'Male') .        }
apartment_rentals,"Show the apartment numbers, start dates, and end dates of all the apartment bookings.",SELECT ?T1_apt_number ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\#ref-apt_id ?T1 .  ?T1 :apartments\#apt_number ?T1_apt_number . ?T2 :apartment_bookings\#booking_start_date ?T2_booking_start_date . ?T2 :apartment_bookings\#booking_start_date ?T2_booking_start_date .        }
apartment_rentals,What are the booking start and end dates of the apartments with type code 'Duplex'?,SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :apartment_bookings\#ref-apt_id ?T2 .  ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T2 :apartments\#apt_type_code ?T2_apt_type_code . FILTER(?T2_apt_type_code = 'Duplex') .        }
apartment_rentals,What is the booking status code of the apartment with apartment number 'Suite 634'?,SELECT ?T1_booking_status_code WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :apartment_bookings\#ref-apt_id ?T2 .  ?T1 :apartment_bookings\#booking_status_code ?T1_booking_status_code . ?T2 :apartments\#apt_number ?T2_apt_number . FILTER(?T2_apt_number = 'Suite 634') .        }
apartment_rentals,Show the distinct apartment numbers of the apartments that have bookings with status code 'Confirmed'.,SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\#ref-apt_id ?T1 .  ?T1 :apartments\#apt_number ?T1_apt_number . ?T2 :apartment_bookings\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') .        }
apartment_rentals,Show the average room count of the apartments that have booking status code 'Provisional'.,SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_104 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\#ref-apt_id ?T1 .  ?T1 :apartments\#room_count ?T1_room_count . ?T2 :apartment_bookings\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Provisional') .        }
apartment_rentals,What is the average room count of the apartments whose booking status code is 'Provisional'?,SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_124 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\#ref-apt_id ?T1 .  ?T1 :apartments\#room_count ?T1_room_count . ?T2 :apartment_bookings\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Provisional') .        }
apartment_rentals,"Show the guest first names, start dates, and end dates of all the apartment bookings.",SELECT ?T1_guest_first_name ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a :guests . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\#ref-guest_id ?T1 .  ?T1 :guests\#guest_first_name ?T1_guest_first_name . ?T2 :apartment_bookings\#booking_start_date ?T2_booking_start_date . ?T2 :apartment_bookings\#booking_start_date ?T2_booking_start_date .        }
apartment_rentals,Show the start dates and end dates of all the apartment bookings made by guests with gender code 'Female'.,SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :guests . ?T1 :apartment_bookings\#ref-guest_id ?T2 .  ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T2 :guests\#gender_code ?T2_gender_code . FILTER(?T2_gender_code = 'Female') .        }
apartment_rentals,What are the start date and end date of the apartment bookings made by female guests (gender code 'Female')?,SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :guests . ?T1 :apartment_bookings\#ref-guest_id ?T2 .  ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T1 :apartment_bookings\#booking_start_date ?T1_booking_start_date . ?T2 :guests\#gender_code ?T2_gender_code . FILTER(?T2_gender_code = 'Female') .        }
apartment_rentals,Show the first names and last names of all the guests that have apartment bookings with status code 'Confirmed'.,SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a :guests . ?T2 a :apartment_bookings . ?T2 :apartment_bookings\#ref-guest_id ?T1 .  ?T1 :guests\#guest_first_name ?T1_guest_first_name . ?T1 :guests\#guest_last_name ?T1_guest_last_name . ?T2 :apartment_bookings\#booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') .        }
apartment_rentals,Show the facility codes of apartments with more than 4 bedrooms.,SELECT ?T1_facility_code WHERE { ?T1 a :apartment_facilities . ?T2 a :apartments . ?T1 :apartment_facilities\#ref-apt_id ?T2 .  ?T1 :apartment_facilities\#facility_code ?T1_facility_code . ?T2 :apartments\#bedroom_count ?T2_bedroom_count . FILTER(?T2_bedroom_count > 4) .        }
apartment_rentals,Show the total number of rooms of all apartments with facility code 'Gym'.,SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_83 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_facilities . ?T2 :apartment_facilities\#ref-apt_id ?T1 .  ?T1 :apartments\#room_count ?T1_room_count . ?T2 :apartment_facilities\#facility_code ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') .        }
apartment_rentals,Find the total number of rooms in the apartments that have facility code 'Gym'.,SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_32 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_facilities . ?T2 :apartment_facilities\#ref-apt_id ?T1 .  ?T1 :apartments\#room_count ?T1_room_count . ?T2 :apartment_facilities\#facility_code ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') .        }
apartment_rentals,Show the total number of rooms of the apartments in the building with short name 'Columbus Square'.,SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_58 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :apartments\#ref-building_id ?T2 .  ?T1 :apartments\#room_count ?T1_room_count . ?T2 :apartment_buildings\#building_short_name ?T2_building_short_name . FILTER(?T2_building_short_name = 'Columbus Square') .        }
apartment_rentals,How many rooms in total are there in the apartments in the building with short name 'Columbus Square'?,SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_96 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :apartments\#ref-building_id ?T2 .  ?T1 :apartments\#room_count ?T1_room_count . ?T2 :apartment_buildings\#building_short_name ?T2_building_short_name . FILTER(?T2_building_short_name = 'Columbus Square') .        }
apartment_rentals,Show the addresses of the buildings that have apartments with more than 2 bathrooms.,SELECT ?T1_building_address WHERE { ?T1 a :apartment_buildings . ?T2 a :apartments . ?T2 :apartments\#ref-building_id ?T1 .  ?T1 :apartment_buildings\#building_address ?T1_building_address . ?T2 :apartments\#bathroom_count ?T2_bathroom_count . FILTER(?T2_bathroom_count > 2) .        }
apartment_rentals,Show the apartment type codes and apartment numbers in the buildings managed by 'Kyle'.,SELECT ?T1_apt_type_code ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :apartments\#ref-building_id ?T2 .  ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#apt_number ?T1_apt_number . ?T2 :apartment_buildings\#building_manager ?T2_building_manager . FILTER(?T2_building_manager = 'Kyle') .        }
apartment_rentals,What apartment type codes and apartment numbers do the buildings managed by 'Kyle' have?,SELECT ?T1_apt_type_code ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :apartments\#ref-building_id ?T2 .  ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#apt_number ?T1_apt_number . ?T2 :apartment_buildings\#building_manager ?T2_building_manager . FILTER(?T2_building_manager = 'Kyle') .        }
apartment_rentals,Show the booking status code and the corresponding number of bookings.,SELECT ?T1_booking_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartment_bookings . ?T1 :apartment_bookings\#booking_status_code ?T1_booking_status_code .        } GROUP BY ?T1_booking_status_code
apartment_rentals,Return all the apartment numbers sorted by the room count in ascending order.,SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_number ?T1_apt_number . ?T1 :apartments\#room_count ?T1_room_count .        }  ORDER BY ASC (?T1_room_count)
apartment_rentals,Return the apartment number with the largest number of bedrooms.,SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_number ?T1_apt_number . ?T1 :apartments\#bedroom_count ?T1_bedroom_count .        }   ORDER BY DESC (?T1_bedroom_count) LIMIT 1
apartment_rentals,What is the apartment number of the apartment with the most beds?,SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_number ?T1_apt_number . ?T1 :apartments\#bedroom_count ?T1_bedroom_count .        }   ORDER BY DESC (?T1_bedroom_count) LIMIT 1
apartment_rentals,Show the apartment type codes and the corresponding number of apartments sorted by the number of apartments in ascending order.,SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code .        } GROUP BY ?T1_apt_type_code ORDER BY ASC ((count( *) as ?aggregation_all))
apartment_rentals,Show the top 3 apartment type codes sorted by the average number of rooms in descending order.,SELECT ?T1_apt_type_code WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#room_count ?T1_room_count .        } GROUP BY ?T1_apt_type_code  ORDER BY DESC ((avg( ?T1_room_count) as ?aggregation_T1_room_count_152 )) LIMIT 1
apartment_rentals,"Show the apartment type code that has the largest number of total rooms, together with the number of bathrooms and number of bedrooms.",SELECT ?T1_apt_type_code ?T1_bathroom_count ?T1_bedroom_count WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#bathroom_count ?T1_bathroom_count . ?T1 :apartments\#bedroom_count ?T1_bedroom_count . ?T1 :apartments\#room_count ?T1_room_count .        } GROUP BY ?T1_apt_type_code  ?T1_bathroom_count  ?T1_bedroom_count  ORDER BY DESC ((sum( ?T1_room_count) as ?aggregation_T1_room_count_102 )) LIMIT 1
apartment_rentals,Show the most common apartment type code.,SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code .        } GROUP BY ?T1_apt_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
apartment_rentals,Which apartment type code appears the most often?,SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code .        } GROUP BY ?T1_apt_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
apartment_rentals,Show the most common apartment type code among apartments with more than 1 bathroom.,SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#bathroom_count ?T1_bathroom_count . FILTER(?T1_bathroom_count > 1) .        } GROUP BY ?T1_apt_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
apartment_rentals,"Show each apartment type code, and the maximum and minimum number of rooms for each type.",SELECT ?T1_apt_type_code (max( ?T1_room_count) as ?aggregation_T1_room_count_129 ) (min( ?T1_room_count) as ?aggregation_T1_room_count_103 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#room_count ?T1_room_count . ?T1 :apartments\#room_count ?T1_room_count .        } GROUP BY ?T1_apt_type_code
apartment_rentals,Return each apartment type code along with the maximum and minimum number of rooms among each type.,SELECT ?T1_apt_type_code (max( ?T1_room_count) as ?aggregation_T1_room_count_124 ) (min( ?T1_room_count) as ?aggregation_T1_room_count_96 ) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_type_code ?T1_apt_type_code . ?T1 :apartments\#room_count ?T1_room_count . ?T1 :apartments\#room_count ?T1_room_count .        } GROUP BY ?T1_apt_type_code
apartment_rentals,Show each gender code and the corresponding count of guests sorted by the count in descending order.,SELECT ?T1_gender_code (count( *) as ?aggregation_all) WHERE { ?T1 a :guests . ?T1 :guests\#gender_code ?T1_gender_code .        } GROUP BY ?T1_gender_code ORDER BY DESC ((count( *) as ?aggregation_all))
apartment_rentals,How many apartments do not have any facility?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apartments\#apt_id ?T1_apt_id . FILTER(?T1_apt_id not in (?T22_apt_id)) .       {SELECT ?T22_apt_id WHERE { ?T22 a :apartment_facilities . ?T22 :apartment_facilities\#apt_id ?T22_apt_id .        }    } }
apartment_rentals,Show the apartment numbers of apartments with unit status availability of both 0 and 1.,SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :view_unit_status . ?T2 :view_unit_status\#ref-apt_id ?T1 .  ?T1 :apartments\#apt_number ?T1_apt_number . ?T2 :view_unit_status\#available_yn ?T2_available_yn . FILTER(?T2_available_yn = 0) . FILTER (?T1_apt_number in (?T3_apt_number)) .   ?T3 a :apartments . ?T4 a :view_unit_status . ?T4 :view_unit_status\#ref-apt_id ?T3 .  ?T3 :apartments\#apt_number ?T3_apt_number . ?T4 :view_unit_status\#available_yn ?T4_available_yn .  FILTER(?T4_available_yn = 1) .             }
game_injury,How many games are held after season 2007?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :game . ?T1 :game\#season ?T1_season . FILTER(?T1_season > 2007) .        }
game_injury,List the dates of games by the home team name in descending order.,SELECT ?T1_date WHERE { ?T1 a :game . ?T1 :game\#date ?T1_date . ?T1 :game\#home_team ?T1_home_team .        }  ORDER BY DESC (?T1_home_team)
game_injury,"List the season, home team, away team of all the games.",SELECT ?T1_season ?T1_home_team ?T1_away_team WHERE { ?T1 a :game . ?T1 :game\#season ?T1_season . ?T1 :game\#home_team ?T1_home_team . ?T1 :game\#away_team ?T1_away_team .        }
game_injury,Find the id and name of the stadium where the largest number of injury accidents occurred.,SELECT ?T1_id (count( *) as ?aggregation_all) ?T1_name WHERE { ?T1 a :stadium . ?T1 :stadium\#id ?T1_id . ?T1 :stadium\#name ?T1_name .        } GROUP BY ?T1_id  ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
game_injury,How many games are free of injury accidents?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :game . ?T1 :game\#id ?T1_id . FILTER(?T1_id not in (?T22_game_id)) .       {SELECT ?T22_game_id WHERE { ?T22 a :injury_accident . ?T22 :injury_accident\#game_id ?T22_game_id .        }    } }
game_injury,How many distinct kinds of injuries happened after season 2010?,SELECT DISTINCT (count(DISTINCT ?T1_injury) as ?aggregation_T1_injury_39 ) WHERE { ?T1 a :injury_accident . ?T2 a :game . ?T1 :injury_accident\#ref-game_id ?T2 .  ?T1 :injury_accident\#injury ?T1_injury . ?T2 :game\#season ?T2_season . FILTER(?T2_season > 2010) .        }
game_injury,List the name of the stadium where both the player 'Walter Samuel' and the player 'Thiago Motta' got injured.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :stadium . ?T13 a :game . ?T13 :game\#ref-stadium_id ?T1 .  ?T1 :stadium\#name ?T1_name . ?T2 :injury_accident\#player ?T2_player . ?T2 a :injury_accident . ?T2 :injury_accident\#ref-game_id ?T13 .  ?T1 :stadium\#name ?T1_name . ?T2 :injury_accident\#player ?T2_player . FILTER(?T2_player = 'Walter Samuel') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :stadium . ?T15 a :game . ?T15 :game\#ref-stadium_id ?T3 .  ?T3 :stadium\#name ?T3_name . ?T4 :injury_accident\#player ?T4_player . ?T4 a :injury_accident . ?T4 :injury_accident\#ref-game_id ?T15 .  ?T3 :stadium\#name ?T3_name . ?T4 :injury_accident\#player ?T4_player .  FILTER(?T4_player = 'Thiago Motta') .             }
game_injury,"Show the name, average attendance, total attendance for stadiums where no accidents happened.",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_name as ?col1) (?T1_average_attendance as ?col2) (?T1_total_attendance as ?col3) WHERE { ?T1 a :stadium . ?T1 :stadium\#name ?T1_name . ?T1 :stadium\#average_attendance ?T1_average_attendance . ?T1 :stadium\#total_attendance ?T1_total_attendance .   }}  MINUS {SELECT (?T2_name as ?col1) (?T2_average_attendance as ?col2) (?T2_total_attendance as ?col3) WHERE { ?T2 a :stadium . ?T2 :stadium\#name ?T2_name . ?T2 :stadium\#average_attendance ?T2_average_attendance . ?T2 :stadium\#total_attendance ?T2_total_attendance .        }     } }
game_injury,Which stadium name contains the substring 'Bank'?,"SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :stadium\#name ?T1_name . ?T1 :stadium\#name ?T1_name . FILTER(contains (?T1_name, 'Bank')) .        }"
game_injury,How many games has each stadium held?,SELECT ?T1_id (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T2 a :game . ?T2 :game\#ref-stadium_id ?T1 .  ?T1 :stadium\#id ?T1_id .        } GROUP BY ?T1_id
game_injury,"For each injury accident, find the date of the game and the name of the injured player in the game, and sort the results in descending order of game season.",SELECT ?T1_date ?T2_player WHERE { ?T1 a :game . ?T2 a :injury_accident . ?T2 :injury_accident\#ref-game_id ?T1 .  ?T1 :game\#date ?T1_date . ?T2 :injury_accident\#player ?T2_player . ?T1 :game\#season ?T1_season .        }  ORDER BY DESC (?T1_season)
soccer_1,List all country and league names.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :country . ?T2 a :league . ?T2 :league\#ref-country_id ?T1 .  ?T1 :country\#name ?T1_name . ?T2 :league\#name ?T2_name .        }
soccer_1,How many leagues are there in England?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :league . ?T2 a :country . ?T1 :league\#ref-country_id ?T2 .  ?T2 :country\#name ?T2_name . FILTER(?T2_name = 'England') .        }
soccer_1,What is the average weight of all players?,SELECT (avg( ?T1_weight) as ?aggregation_T1_weight_3 ) WHERE { ?T1 a :player . ?T1 :player\#weight ?T1_weight .        }
soccer_1,What is the maximum and minimum height of all players?,SELECT (max( ?T1_weight) as ?aggregation_T1_weight_56 ) (min( ?T1_weight) as ?aggregation_T1_weight_183 ) WHERE { ?T1 a :player . ?T1 :player\#weight ?T1_weight . ?T1 :player\#weight ?T1_weight .        }
soccer_1,List all player names who have an overall rating higher than the average.,SELECT DISTINCT ?T1_player_name WHERE { ?T1 a :player . ?T2 a :player_attributes . ?T2 :player_attributes\#ref-player_api_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :player_attributes\#overall_rating ?T2_overall_rating . FILTER(?T2_overall_rating > (?aggregation_T23_overall_rating_28)) .       {SELECT (avg( ?T23_overall_rating) as ?aggregation_T23_overall_rating_28 ) WHERE { ?T23 a :player_attributes . ?T23 :player_attributes\#overall_rating ?T23_overall_rating .        }    } }
soccer_1,What are the names of players who have the best dribbling?,SELECT DISTINCT ?T1_player_name WHERE { ?T1 a :player . ?T2 a :player_attributes . ?T2 :player_attributes\#ref-player_api_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :player_attributes\#dribbling ?T2_dribbling . FILTER(?T2_dribbling = (?aggregation_T23_overall_rating_0)) .       {SELECT (max( ?T23_overall_rating) as ?aggregation_T23_overall_rating_0 ) WHERE { ?T23 a :player_attributes . ?T23 :player_attributes\#overall_rating ?T23_overall_rating .        }    } }
soccer_1,List the names of all players who have a crossing score higher than 90 and prefer their right foot.,SELECT DISTINCT ?T1_player_name WHERE { ?T1 a :player . ?T2 a :player_attributes . ?T2 :player_attributes\#ref-player_api_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :player_attributes\#crossing ?T2_crossing . ?T2 :player_attributes\#preferred_foot ?T2_preferred_foot . FILTER(?T2_crossing > 90 && ?T2_preferred_foot = 'right') .        }
soccer_1,List the names of all left-footed players who have overall rating between 85 and 90.,SELECT DISTINCT ?T1_player_name WHERE { ?T1 a :player . ?T2 a :player_attributes . ?T2 :player_attributes\#ref-player_api_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :player_attributes\#preferred_foot ?T2_preferred_foot . ?T2 :player_attributes\#overall_rating ?T2_overall_rating . ?T2 :player_attributes\#overall_rating ?T2_overall_rating . FILTER(?T2_preferred_foot = 'left' && ?T2_overall_rating >= 85 && ?T2_overall_rating <= 90) .        }
soccer_1,List all of the player ids with a height of at least 180cm and an overall rating higher than 85.,SELECT DISTINCT ?T1_player_api_id WHERE { ?T1 a :player . ?T1 :player\#player_api_id ?T1_player_api_id . ?T1 :player\#height ?T1_height . FILTER(?T1_height >= 180) . FILTER (?T1_player_api_id in (?T2_player_api_id)) .   ?T2 a :player_attributes . ?T2 :player_attributes\#player_api_id ?T2_player_api_id . ?T2 :player_attributes\#overall_rating ?T2_overall_rating .  FILTER(?T2_overall_rating > 85) .             }
soccer_1,List all of the ids for left-footed players with a height between 180cm and 190cm.,SELECT DISTINCT ?T1_player_api_id WHERE { ?T1 a :player . ?T1 :player\#player_api_id ?T1_player_api_id . ?T1 :player\#height ?T1_height . ?T1 :player\#height ?T1_height . FILTER(?T1_height >= 180 && ?T1_height <= 190) . FILTER (?T1_player_api_id in (?T2_player_api_id)) .   ?T2 a :player_attributes . ?T2 :player_attributes\#player_api_id ?T2_player_api_id . ?T2 :player_attributes\#preferred_foot ?T2_preferred_foot .  FILTER(?T2_preferred_foot = 'left') .             }
soccer_1,Who are the top 3 players in terms of overall rating?,SELECT DISTINCT ?T1_player_name ?T2_overall_rating WHERE { ?T1 a :player . ?T2 a :player_attributes . ?T2 :player_attributes\#ref-player_api_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T2 :player_attributes\#overall_rating ?T2_overall_rating . ?T2 :player_attributes\#overall_rating ?T2_overall_rating .        }   ORDER BY DESC (?T2_overall_rating) LIMIT 1
soccer_1,List the names and birthdays of the top five players in terms of potential.,SELECT DISTINCT ?T1_player_name ?T1_birthday ?T2_potential WHERE { ?T1 a :player . ?T2 a :player_attributes . ?T2 :player_attributes\#ref-player_api_id ?T1 .  ?T1 :player\#player_name ?T1_player_name . ?T1 :player\#birthday ?T1_birthday . ?T2 :player_attributes\#potential ?T2_potential . ?T2 :player_attributes\#potential ?T2_potential .        }   ORDER BY DESC (?T2_potential) LIMIT 1
performance_attendance,How many performances are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :performance .        }
performance_attendance,List the hosts of performances in ascending order of attendance.,SELECT ?T1_host WHERE { ?T1 a :performance . ?T1 :performance\#host ?T1_host . ?T1 :performance\#attendance ?T1_attendance .        }  ORDER BY ASC (?T1_attendance)
performance_attendance,What are the dates and locations of performances?,SELECT ?T1_date ?T1_location WHERE { ?T1 a :performance . ?T1 :performance\#date ?T1_date . ?T1 :performance\#location ?T1_location .        }
