kg_name,question,query
store_1,Find the name of tracks which are in Movies playlist but not in music playlist.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :tracks . ?T13 a :playlist_tracks . ?T13 :playlist_tracks\#ref-track_id ?T1 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . ?T2 a :playlists . ?T13 :playlist_tracks\#ref-playlist_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . FILTER(?T2_name = 'Movies') .   }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T3 a :tracks . ?T15 a :playlist_tracks . ?T15 :playlist_tracks\#ref-track_id ?T3 .  ?T3 :tracks\#name ?T3_name . ?T4 :playlists\#name ?T4_name . ?T4 a :playlists . ?T15 :playlist_tracks\#ref-playlist_id ?T4 .  ?T3 :tracks\#name ?T3_name . ?T4 :playlists\#name ?T4_name . FILTER(?T4_name = 'Music') .        }     } }
store_1,Find the name of tracks which are in both Movies and music playlists.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :tracks . ?T13 a :playlist_tracks . ?T13 :playlist_tracks\#ref-track_id ?T1 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . ?T2 a :playlists . ?T13 :playlist_tracks\#ref-playlist_id ?T2 .  ?T1 :tracks\#name ?T1_name . ?T2 :playlists\#name ?T2_name . FILTER(?T2_name = 'Movies') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :tracks . ?T15 a :playlist_tracks . ?T15 :playlist_tracks\#ref-track_id ?T3 .  ?T3 :tracks\#name ?T3_name . ?T4 :playlists\#name ?T4_name . ?T4 a :playlists . ?T15 :playlist_tracks\#ref-playlist_id ?T4 .  ?T3 :tracks\#name ?T3_name . ?T4 :playlists\#name ?T4_name .  FILTER(?T4_name = 'Music') .             }
store_1,Find number of tracks in each genre?,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T2 :genres\#name ?T2_name .        } GROUP BY ?T2_name
store_1,How many tracks are in each genre?,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :tracks . ?T2 a :genres . ?T1 :tracks\#ref-genre_id ?T2 .  ?T2 :genres\#name ?T2_name .        } GROUP BY ?T2_name
journal_committee,How many editors are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :editor .        }
journal_committee,List the names of editors in ascending order of age.,SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age .        }  ORDER BY ASC (?T1_age)
journal_committee,What are the names and ages of editors?,SELECT ?T1_name ?T1_age WHERE { ?T1 a :editor . ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age .        }
journal_committee,List the names of editors who are older than 25.,SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age . FILTER(?T1_age > 25) .        }
journal_committee,Show the names of editors of age either 24 or 25.,SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age . ?T1 :editor\#age ?T1_age . FILTER(?T1_age = 24 || ?T1_age = 25) .        }
journal_committee,What is the name of the youngest editor?,SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age .        }   ORDER BY ASC (?T1_age) LIMIT 1
journal_committee,What are the different ages of editors? Show each age along with the number of editors of that age.,SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T1 :editor\#age ?T1_age .        } GROUP BY ?T1_age
journal_committee,Please show the most common age of editors.,SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T1 :editor\#age ?T1_age .        } GROUP BY ?T1_age  ORDER BY DESC (?aggregation_all) LIMIT 1
journal_committee,Show the distinct themes of journals.,SELECT DISTINCT ?T1_theme WHERE { ?T1 a :journal . ?T1 :journal\#theme ?T1_theme .        }
journal_committee,Show the names of editors and the theme of journals for which they serve on committees.,SELECT ?T1_name ?T2_theme WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :journal_committee\#ref-editor_id ?T1 .  ?T1 :editor\#name ?T1_name . ?T2 :journal\#theme ?T2_theme . ?T2 a :journal . ?T13 :journal_committee\#ref-journal_id ?T2 .  ?T1 :editor\#name ?T1_name . ?T2 :journal\#theme ?T2_theme .        }
journal_committee,"Show the names and ages of editors and the theme of journals for which they serve on committees, in ascending alphabetical order of theme.",SELECT ?T1_name ?T1_age ?T2_theme WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :journal_committee\#ref-editor_id ?T1 .  ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age . ?T2 :journal\#theme ?T2_theme . ?T2 :journal\#theme ?T2_theme . ?T2 a :journal . ?T13 :journal_committee\#ref-journal_id ?T2 .  ?T1 :editor\#name ?T1_name . ?T1 :editor\#age ?T1_age . ?T2 :journal\#theme ?T2_theme . ?T2 :journal\#theme ?T2_theme .        }  ORDER BY ASC (?T2_theme)
journal_committee,Show the names of editors that are on the committee of journals with sales bigger than 3000.,SELECT ?T1_name WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :journal_committee\#ref-editor_id ?T1 .  ?T1 :editor\#name ?T1_name . ?T2 :journal\#sales ?T2_sales . ?T2 a :journal . ?T13 :journal_committee\#ref-journal_id ?T2 .  ?T1 :editor\#name ?T1_name . ?T2 :journal\#sales ?T2_sales . FILTER(?T2_sales > 3000) .        }
journal_committee,"Show the id, name of each editor and the number of journal committees they are on.",SELECT ?T1_editor_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T2 a :journal_committee . ?T2 :journal_committee\#ref-editor_id ?T1 .  ?T1 :editor\#editor_id ?T1_editor_id . ?T1 :editor\#name ?T1_name .        } GROUP BY ?T1_editor_id ?T1_name
journal_committee,Show the names of editors that are on at least two journal committees.,SELECT ?T1_name WHERE { ?T1 a :editor . ?T2 a :journal_committee . ?T2 :journal_committee\#ref-editor_id ?T1 .  ?T1 :editor\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 2)
journal_committee,List the names of editors that are not on any journal committee.,SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :editor\#name ?T1_name . ?T1 :editor\#editor_id ?T1_editor_id . FILTER(?T1_editor_id not in (?T22_editor_id)) .       {SELECT ?T22_editor_id WHERE { ?T22 a :journal_committee . ?T22 :journal_committee\#editor_id ?T22_editor_id .        }    } }
journal_committee,"List the date, theme and sales of the journal which did not have any of the listed editors serving on committee.",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_date as ?col1) (?T1_theme as ?col2) (?T1_sales as ?col3) WHERE { ?T1 a :journal . ?T1 :journal\#date ?T1_date . ?T1 :journal\#theme ?T1_theme . ?T1 :journal\#sales ?T1_sales .   }}  MINUS {SELECT (?T2_date as ?col1) (?T2_theme as ?col2) (?T2_sales as ?col3) WHERE { ?T2 a :journal . ?T2 :journal\#date ?T2_date . ?T2 :journal\#theme ?T2_theme . ?T2 :journal\#sales ?T2_sales .        }     } }
customers_card_transactions,How many accounts do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts .        }
customers_card_transactions,"Show ids, customer ids, names for all accounts.",SELECT ?T1_account_id ?T1_customer_id ?T1_account_name WHERE { ?T1 a :accounts . ?T1 :accounts\#account_id ?T1_account_id . ?T1 :accounts\#customer_id ?T1_customer_id . ?T1 :accounts\#account_name ?T1_account_name .        }
customers_card_transactions,Show other account details for account with name 338.,SELECT ?T1_other_account_details WHERE { ?T1 a :accounts . ?T1 :accounts\#other_account_details ?T1_other_account_details . ?T1 :accounts\#account_name ?T1_account_name . FILTER(?T1_account_name = '338') .        }
customers_card_transactions,What are the other account details for the account with the name 338?,SELECT ?T1_other_account_details WHERE { ?T1 a :accounts . ?T1 :accounts\#other_account_details ?T1_other_account_details . ?T1 :accounts\#account_name ?T1_account_name . FILTER(?T1_account_name = '338') .        }
customers_card_transactions,Give the full name and phone of the customer who has the account name 162.,SELECT ?T1_customer_first_name ?T1_customer_last_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T2 a :accounts . ?T2 :accounts\#ref-customer_id ?T1 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :accounts\#account_name ?T2_account_name . FILTER(?T2_account_name = '162') .        }
customers_card_transactions,Return the number of accounts that the customer with the first name Art and last name Turcotte has.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T2 a :customers . ?T1 :accounts\#ref-customer_id ?T2 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . FILTER(?T2_customer_first_name = 'Art' && ?T2_customer_last_name = 'Turcotte') .        }
customers_card_transactions,Show all customer ids and the number of accounts for each customer.,SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id
customers_card_transactions,How many accounts are there for each customer id?,SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id
customers_card_transactions,Show the customer id and number of accounts with most accounts.,SELECT ?T1_customer_id (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_card_transactions,"What is the customer first, last name and id with least number of accounts.",SELECT ?T1_customer_first_name (count( *) as ?aggregation_all) ?T1_customer_last_name ?T2_customer_id WHERE { ?T1 a :customers . ?T2 a :accounts . ?T2 :accounts\#ref-customer_id ?T1 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T2 :accounts\#customer_id ?T2_customer_id .        } GROUP BY ?T1_customer_first_name ?T1_customer_last_name ?T2_customer_id  ORDER BY ASC (?aggregation_all) LIMIT 1
customers_card_transactions,Show the number of all customers without an account.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :accounts . ?T22 :accounts\#customer_id ?T22_customer_id .        }    } }
customers_card_transactions,How many customers do not have an account?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) .       {SELECT ?T22_customer_id WHERE { ?T22 a :accounts . ?T22 :accounts\#customer_id ?T22_customer_id .        }    } }
customers_card_transactions,Show the first names and last names of customers without any account.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_customer_first_name as ?col1) (?T1_customer_last_name as ?col2) WHERE { ?T1 a :customers . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name .   }}  MINUS {SELECT (?T2_customer_first_name as ?col1) (?T2_customer_last_name as ?col2) WHERE { ?T2 a :customers . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        }     } }
customers_card_transactions,What are the full names of customers who do not have any accounts?,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_customer_first_name as ?col1) (?T1_customer_last_name as ?col2) WHERE { ?T1 a :customers . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name .   }}  MINUS {SELECT (?T2_customer_first_name as ?col1) (?T2_customer_last_name as ?col2) WHERE { ?T2 a :customers . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        }     } }
customers_card_transactions,Show distinct first and last names for all customers with an account.,SELECT DISTINCT ?T1_customer_first_name ?T1_customer_last_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name .        }
customers_card_transactions,What are the full names of customers who have accounts?,SELECT DISTINCT ?T1_customer_first_name ?T1_customer_last_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name .        }
customers_card_transactions,How many customers have an account?,SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_179 ) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        }
customers_card_transactions,Count the number of customers who hold an account.,SELECT DISTINCT (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_167 ) WHERE { ?T1 a :accounts . ?T1 :accounts\#customer_id ?T1_customer_id .        }
customers_card_transactions,How many customers do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers .        }
customers_card_transactions,"Show ids, first names, last names, and phones for all customers.",SELECT ?T1_customer_id ?T1_customer_first_name ?T1_customer_last_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T1 :customers\#customer_phone ?T1_customer_phone .        }
customers_card_transactions,Return the phone and email of the customer with the first name Aniyah and last name Feest.,SELECT ?T1_customer_phone ?T1_customer_email WHERE { ?T1 a :customers . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#customer_email ?T1_customer_email . ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . FILTER(?T1_customer_first_name = 'Aniyah' && ?T1_customer_last_name = 'Feest') .        }
customers_card_transactions,Show the number of customer cards.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards .        }
customers_card_transactions,How many customer cards are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards .        }
customers_card_transactions,"Show ids, customer ids, card type codes, card numbers for all cards.",SELECT ?T1_card_id ?T1_customer_id ?T1_card_type_code ?T1_card_number WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_id ?T1_card_id . ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T1 :customers_cards\#card_type_code ?T1_card_type_code . ?T1 :customers_cards\#card_number ?T1_card_number .        }
customers_card_transactions,Show the date valid from and the date valid to for the card with card number '4560596484842'.,SELECT ?T1_date_valid_from ?T1_date_valid_to WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#date_valid_from ?T1_date_valid_from . ?T1 :customers_cards\#date_valid_to ?T1_date_valid_to . ?T1 :customers_cards\#card_number ?T1_card_number . FILTER(?T1_card_number = '4560596484842') .        }
customers_card_transactions,"What is the first name, last name, and phone of the customer with card 4560596484842.",SELECT ?T1_customer_first_name ?T1_customer_last_name ?T1_customer_phone WHERE { ?T1 a :customers . ?T13 a :accounts . ?T13 :accounts\#ref-customer_id ?T1 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :customers_cards\#card_number ?T2_card_number . ?T14 a :financial_transactions . ?T14 :financial_transactions\#ref-account_id ?T13 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :customers_cards\#card_number ?T2_card_number . ?T2 a :customers_cards . ?T14 :financial_transactions\#ref-card_id ?T2 .  ?T1 :customers\#customer_first_name ?T1_customer_first_name . ?T1 :customers\#customer_last_name ?T1_customer_last_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T2 :customers_cards\#card_number ?T2_card_number . FILTER(?T2_card_number = '4560596484842') .        }
customers_card_transactions,How many cards does customer Art Turcotte have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T13 a :financial_transactions . ?T13 :financial_transactions\#ref-card_id ?T1 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T14 a :accounts . ?T13 :financial_transactions\#ref-account_id ?T14 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T2 a :customers . ?T14 :accounts\#ref-customer_id ?T2 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . FILTER(?T2_customer_first_name = 'Art' && ?T2_customer_last_name = 'Turcotte') .        }
customers_card_transactions,How many debit cards do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code . FILTER(?T1_card_type_code = 'Debit') .        }
customers_card_transactions,How many credit cards does customer Blanche Huels have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T13 a :financial_transactions . ?T13 :financial_transactions\#ref-card_id ?T1 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T1 :customers_cards\#card_type_code ?T1_card_type_code . ?T14 a :accounts . ?T13 :financial_transactions\#ref-account_id ?T14 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T1 :customers_cards\#card_type_code ?T1_card_type_code . ?T2 a :customers . ?T14 :accounts\#ref-customer_id ?T2 .  ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T1 :customers_cards\#card_type_code ?T1_card_type_code . FILTER(?T2_customer_first_name = 'Blanche' && ?T2_customer_last_name = 'Huels' && ?T1_card_type_code = 'Credit') .        }
customers_card_transactions,Show all customer ids and the number of cards owned by each customer.,SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id
customers_card_transactions,"Return the id of the customer who has the most cards, as well as the number of cards.",SELECT ?T1_customer_id (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_card_transactions,"Show id, first and last names for all customers with at least two cards.",SELECT ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name WHERE { ?T1 a :customers_cards . ?T13 a :financial_transactions . ?T13 :financial_transactions\#ref-card_id ?T1 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T14 a :accounts . ?T13 :financial_transactions\#ref-account_id ?T14 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T2 a :customers . ?T14 :accounts\#ref-customer_id ?T2 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        } GROUP BY ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name   HAVING(count( *)  >= 2)
customers_card_transactions,What are the ids and full names of customers who hold two or more cards?,SELECT ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name WHERE { ?T1 a :customers_cards . ?T13 a :financial_transactions . ?T13 :financial_transactions\#ref-card_id ?T1 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T14 a :accounts . ?T13 :financial_transactions\#ref-account_id ?T14 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T2 a :customers . ?T14 :accounts\#ref-customer_id ?T2 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        } GROUP BY ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name   HAVING(count( *)  >= 2)
customers_card_transactions,"What is the customer id, first and last name with least number of accounts.",SELECT ?T1_customer_id (count( *) as ?aggregation_all) ?T2_customer_first_name ?T2_customer_last_name WHERE { ?T1 a :customers_cards . ?T13 a :financial_transactions . ?T13 :financial_transactions\#ref-card_id ?T1 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T14 a :accounts . ?T13 :financial_transactions\#ref-account_id ?T14 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name . ?T2 a :customers . ?T14 :accounts\#ref-customer_id ?T2 .  ?T1 :customers_cards\#customer_id ?T1_customer_id . ?T2 :customers\#customer_first_name ?T2_customer_first_name . ?T2 :customers\#customer_last_name ?T2_customer_last_name .        } GROUP BY ?T1_customer_id ?T2_customer_first_name ?T2_customer_last_name  ORDER BY ASC (?aggregation_all) LIMIT 1
customers_card_transactions,Show all card type codes and the number of cards in each type.,SELECT ?T1_card_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        } GROUP BY ?T1_card_type_code
customers_card_transactions,What is the card type code with most number of cards?,SELECT ?T1_card_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        } GROUP BY ?T1_card_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
customers_card_transactions,Show card type codes with at least 5 cards.,SELECT ?T1_card_type_code WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        } GROUP BY ?T1_card_type_code   HAVING(count( *)  >= 5)
customers_card_transactions,What are the codes of card types that have 5 or more cards?,SELECT ?T1_card_type_code WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        } GROUP BY ?T1_card_type_code   HAVING(count( *)  >= 5)
customers_card_transactions,Show all card type codes and the number of customers holding cards in each type.,SELECT DISTINCT ?T1_card_type_code (count(DISTINCT ?T1_customer_id) as ?aggregation_T1_customer_id_200 ) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code . ?T1 :customers_cards\#customer_id ?T1_customer_id .        } GROUP BY ?T1_card_type_code
customers_card_transactions,Show the customer ids and firstname without a credit card.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_customer_id as ?col1) (?T1_customer_first_name as ?col2) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_first_name ?T1_customer_first_name .   }}  MINUS {SELECT (?T2_customer_id as ?col1) (?T3_customer_first_name as ?col2) WHERE { ?T2 a :customers_cards . ?T14 a :financial_transactions . ?T14 :financial_transactions\#ref-card_id ?T2 .  ?T2 :customers_cards\#customer_id ?T2_customer_id . ?T3 :customers\#customer_first_name ?T3_customer_first_name . ?T2 :customers_cards\#card_type_code ?T2_card_type_code . ?T15 a :accounts . ?T14 :financial_transactions\#ref-account_id ?T15 .  ?T2 :customers_cards\#customer_id ?T2_customer_id . ?T3 :customers\#customer_first_name ?T3_customer_first_name . ?T2 :customers_cards\#card_type_code ?T2_card_type_code . ?T3 a :customers . ?T15 :accounts\#ref-customer_id ?T3 .  ?T2 :customers_cards\#customer_id ?T2_customer_id . ?T3 :customers\#customer_first_name ?T3_customer_first_name . ?T2 :customers_cards\#card_type_code ?T2_card_type_code . FILTER(?T2_card_type_code = 'Credit') .        }     } }
customers_card_transactions,What are the ids and first names of customers who do not hold a credit card?,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_customer_id as ?col1) (?T1_customer_first_name as ?col2) WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_first_name ?T1_customer_first_name .   }}  MINUS {SELECT (?T2_customer_id as ?col1) (?T3_customer_first_name as ?col2) WHERE { ?T2 a :customers_cards . ?T14 a :financial_transactions . ?T14 :financial_transactions\#ref-card_id ?T2 .  ?T2 :customers_cards\#customer_id ?T2_customer_id . ?T3 :customers\#customer_first_name ?T3_customer_first_name . ?T2 :customers_cards\#card_type_code ?T2_card_type_code . ?T15 a :accounts . ?T14 :financial_transactions\#ref-account_id ?T15 .  ?T2 :customers_cards\#customer_id ?T2_customer_id . ?T3 :customers\#customer_first_name ?T3_customer_first_name . ?T2 :customers_cards\#card_type_code ?T2_card_type_code . ?T3 a :customers . ?T15 :accounts\#ref-customer_id ?T3 .  ?T2 :customers_cards\#customer_id ?T2_customer_id . ?T3 :customers\#customer_first_name ?T3_customer_first_name . ?T2 :customers_cards\#card_type_code ?T2_card_type_code . FILTER(?T2_card_type_code = 'Credit') .        }     } }
customers_card_transactions,Show all card type codes.,SELECT DISTINCT ?T1_card_type_code WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        }
customers_card_transactions,What are the different card type codes?,SELECT DISTINCT ?T1_card_type_code WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        }
customers_card_transactions,Show the number of card types.,SELECT DISTINCT (count(DISTINCT ?T1_card_type_code) as ?aggregation_T1_card_type_code_157 ) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        }
customers_card_transactions,How many different card types are there?,SELECT DISTINCT (count(DISTINCT ?T1_card_type_code) as ?aggregation_T1_card_type_code_16 ) WHERE { ?T1 a :customers_cards . ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        }
customers_card_transactions,Show all transaction types.,SELECT DISTINCT ?T1_transaction_type WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type .        }
customers_card_transactions,What are the different types of transactions?,SELECT DISTINCT ?T1_transaction_type WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type .        }
customers_card_transactions,Show the number of transaction types.,SELECT DISTINCT (count(DISTINCT ?T1_transaction_type) as ?aggregation_T1_transaction_type_85 ) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type .        }
customers_card_transactions,How many different types of transactions are there?,SELECT DISTINCT (count(DISTINCT ?T1_transaction_type) as ?aggregation_T1_transaction_type_120 ) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type .        }
customers_card_transactions,What is the average and total transaction amount?,SELECT (avg( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_163 ) (sum( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_106 ) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount .        }
customers_card_transactions,"Return the average transaction amount, as well as the total amount of all transactions.",SELECT (avg( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_40 ) (sum( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_27 ) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount .        }
customers_card_transactions,Show the card type codes and the number of transactions.,SELECT ?T1_card_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_cards . ?T2 a :financial_transactions . ?T2 :financial_transactions\#ref-card_id ?T1 .  ?T1 :customers_cards\#card_type_code ?T1_card_type_code .        } GROUP BY ?T1_card_type_code
customers_card_transactions,Show the transaction type and the number of transactions.,SELECT ?T1_transaction_type (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type .        } GROUP BY ?T1_transaction_type
customers_card_transactions,What is the transaction type that has processed the greatest total amount in transactions?,SELECT ?T1_transaction_type WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#transaction_type ?T1_transaction_type . ?T1 :financial_transactions\#transaction_amount ?T1_transaction_amount .        } GROUP BY ?T1_transaction_type  ORDER BY DESC ((sum( ?T1_transaction_amount) as ?aggregation_T1_transaction_amount_36 )) LIMIT 1
customers_card_transactions,Show the account id and the number of transactions for each account,SELECT ?T1_account_id (count( *) as ?aggregation_all) WHERE { ?T1 a :financial_transactions . ?T1 :financial_transactions\#account_id ?T1_account_id .        } GROUP BY ?T1_account_id
race_track,How many tracks do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :track .        }
race_track,Show the name and location for all tracks.,SELECT ?T1_name ?T1_location WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#location ?T1_location .        }
race_track,What are the names and locations of all tracks?,SELECT ?T1_name ?T1_location WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#location ?T1_location .        }
race_track,"Show names and seatings, ordered by seating for all tracks opened after 2000.",SELECT ?T1_name ?T1_seating WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#seating ?T1_seating . ?T1 :track\#seating ?T1_seating . ?T1 :track\#year_opened ?T1_year_opened . FILTER(?T1_year_opened > 2000) .        }  ORDER BY ASC (?T1_seating)
race_track,"Return the name, location, and seating of the track that was opened in the most recent year.",SELECT ?T1_name ?T1_location ?T1_seating WHERE { ?T1 a :track . ?T1 :track\#name ?T1_name . ?T1 :track\#location ?T1_location . ?T1 :track\#seating ?T1_seating . ?T1 :track\#year_opened ?T1_year_opened .        }   ORDER BY DESC (?T1_year_opened) LIMIT 1
