kg_name,question,query
driving_school,"List lesson id of all lessons taught by staff with first name as Janessa, last name as Sawayn and nickname containing letter 's'.","SELECT ?T1_lesson_id WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\#ref-staff_id ?T2 .  ?T1 :lessons\#lesson_id ?T1_lesson_id . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . ?T2 :staff\#nickname ?T2_nickname . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn' && contains (?T2_nickname, 's')) .        }"
driving_school,How many lessons taught by staff whose first name has letter 'a' in it?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\#ref-staff_id ?T2 .  ?T2 :staff\#first_name ?T2_first_name . FILTER(contains (?T2_first_name, 'a')) .        }"
driving_school,How long is the total lesson time taught by staff with first name as Janessa and last name as Sawayn?,SELECT (sum( ?T1_lesson_time) as ?aggregation_T1_lesson_time_114 ) WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\#ref-staff_id ?T2 .  ?T1 :lessons\#lesson_time ?T1_lesson_time . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }
driving_school,What is the total time for all lessons taught by Janessa Sawayn?,SELECT (sum( ?T1_lesson_time) as ?aggregation_T1_lesson_time_124 ) WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\#ref-staff_id ?T2 .  ?T1 :lessons\#lesson_time ?T1_lesson_time . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }
driving_school,What is the average price for a lesson taught by Janessa Sawayn?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_114 ) WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\#ref-staff_id ?T2 .  ?T1 :lessons\#price ?T1_price . ?T2 :staff\#first_name ?T2_first_name . ?T2 :staff\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }
driving_school,How many lesson does customer with first name Ray took?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lessons . ?T2 a :customers . ?T1 :lessons\#ref-customer_id ?T2 .  ?T2 :customers\#first_name ?T2_first_name . FILTER(?T2_first_name = 'Ray') .        }
driving_school,How many lessons did the customer with the first name Ray take?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lessons . ?T2 a :customers . ?T1 :lessons\#ref-customer_id ?T2 .  ?T2 :customers\#first_name ?T2_first_name . FILTER(?T2_first_name = 'Ray') .        }
driving_school,Which last names are both used by customers and by staff?,SELECT DISTINCT ?T1_last_name WHERE { ?T1 a :customers . ?T1 :customers\#last_name ?T1_last_name . FILTER (?T1_last_name in (?T2_last_name)) .   ?T2 a :staff . ?T2 :staff\#last_name ?T2_last_name .              }
driving_school,What are the last names that are used by customers and staff?,SELECT DISTINCT ?T1_last_name WHERE { ?T1 a :customers . ?T1 :customers\#last_name ?T1_last_name . FILTER (?T1_last_name in (?T2_last_name)) .   ?T2 a :staff . ?T2 :staff\#last_name ?T2_last_name .              }
driving_school,What is the first name of the staff who did not give any lesson?,SELECT distinct?col1 WHERE { { SELECT (?T1_first_name as ?col1) WHERE { ?T1 a :staff . ?T1 :staff\#first_name ?T1_first_name .   }}  MINUS {SELECT (?T2_first_name as ?col1) WHERE { ?T2 a :staff . ?T2 :staff\#first_name ?T2_first_name .        }     } }
driving_school,What is the first name of all employees who do not give any lessons?,SELECT distinct?col1 WHERE { { SELECT (?T1_first_name as ?col1) WHERE { ?T1 a :staff . ?T1 :staff\#first_name ?T1_first_name .   }}  MINUS {SELECT (?T2_first_name as ?col1) WHERE { ?T2 a :staff . ?T2 :staff\#first_name ?T2_first_name .        }     } }
activity_1,How many faculty do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty .        }
activity_1,What is the total number of faculty members?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty .        }
activity_1,What ranks do we have for faculty?,SELECT DISTINCT ?T1_rank WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank .        }
activity_1,Show all the distinct buildings that have faculty rooms.,SELECT DISTINCT ?T1_building WHERE { ?T1 a :faculty . ?T1 :faculty\#building ?T1_building .        }
activity_1,What buildings have faculty offices?,SELECT DISTINCT ?T1_building WHERE { ?T1 a :faculty . ?T1 :faculty\#building ?T1_building .        }
activity_1,"Show the rank, first name, and last name for all the faculty.",SELECT ?T1_rank ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname .        }
activity_1,"Show the first name, last name, and phone number for all female faculty members.",SELECT ?T1_fname ?T1_lname ?T1_phone WHERE { ?T1 a :faculty . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#phone ?T1_phone . ?T1 :faculty\#sex ?T1_sex . FILTER(?T1_sex = 'F') .        }
activity_1,Show ids for all the male faculty.,SELECT ?T1_facid WHERE { ?T1 a :faculty . ?T1 :faculty\#facid ?T1_facid . ?T1 :faculty\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
activity_1,What are the faculty ids of all the male faculty members?,SELECT ?T1_facid WHERE { ?T1 a :faculty . ?T1 :faculty\#facid ?T1_facid . ?T1 :faculty\#sex ?T1_sex . FILTER(?T1_sex = 'M') .        }
activity_1,How many female Professors do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#sex ?T1_sex . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_sex = 'F' && ?T1_rank = 'Professor') .        }
activity_1,"Show the phone, room, and building for the faculty named Jerry Prince.",SELECT ?T1_phone ?T1_room ?T1_building WHERE { ?T1 a :faculty . ?T1 :faculty\#phone ?T1_phone . ?T1 :faculty\#room ?T1_room . ?T1 :faculty\#building ?T1_building . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . FILTER(?T1_fname = 'Jerry' && ?T1_lname = 'Prince') .        }
activity_1,How many Professors are in building NEB?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank . ?T1 :faculty\#building ?T1_building . FILTER(?T1_rank = 'Professor' && ?T1_building = 'NEB') .        }
activity_1,Show the first name and last name for all the instructors.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Instructor') .        }
activity_1,What are the first name and last name of all the instructors?,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Instructor') .        }
activity_1,Show all the buildings along with the number of faculty members the buildings have.,SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#building ?T1_building .        } GROUP BY ?T1_building
activity_1,Which building has most faculty members?,SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#building ?T1_building .        } GROUP BY ?T1_building  ORDER BY DESC (?aggregation_all) LIMIT 1
activity_1,Show all the buildings that have at least 10 professors.,SELECT ?T1_building WHERE { ?T1 a :faculty . ?T1 :faculty\#building ?T1_building . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Professor') .        } GROUP BY ?T1_building   HAVING(count( *)  >= 10)
activity_1,In which buildings are there at least ten professors?,SELECT ?T1_building WHERE { ?T1 a :faculty . ?T1 :faculty\#building ?T1_building . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Professor') .        } GROUP BY ?T1_building   HAVING(count( *)  >= 10)
activity_1,"For each faculty rank, show the number of faculty members who have it.",SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank .        } GROUP BY ?T1_rank
activity_1,How many faculty members do we have for each faculty rank?,SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank .        } GROUP BY ?T1_rank
activity_1,Show all the ranks and the number of male and female faculty for each rank.,SELECT ?T1_rank ?T1_sex (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank . ?T1 :faculty\#sex ?T1_sex .        } GROUP BY ?T1_sex
activity_1,How many faculty members do we have for each rank and gender?,SELECT ?T1_rank ?T1_sex (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank . ?T1 :faculty\#sex ?T1_sex .        } GROUP BY ?T1_sex
activity_1,Which rank has the smallest number of faculty members?,SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#rank ?T1_rank .        } GROUP BY ?T1_rank  ORDER BY ASC (?aggregation_all) LIMIT 1
activity_1,Show the number of male and female assistant professors.,SELECT ?T1_sex (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#sex ?T1_sex . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'AsstProf') .        } GROUP BY ?T1_sex
activity_1,How many male and female assistant professors do we have?,SELECT ?T1_sex (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\#sex ?T1_sex . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'AsstProf') .        } GROUP BY ?T1_sex
activity_1,What are the first name and last name of Linda Smith's advisor?,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T14 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T15 a :participates_in . ?T15 :participates_in\#ref-actid ?T14 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . ?T2 a :student . ?T15 :participates_in\#ref-stuid ?T2 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T2 :student\#fname ?T2_fname . ?T2 :student\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }
activity_1,Show the ids of students whose advisors are professors.,SELECT ?T1_stuid WHERE { ?T1 a :student . ?T13 a :participates_in . ?T13 :participates_in\#ref-stuid ?T1 .  ?T1 :student\#stuid ?T1_stuid . ?T2 :faculty\#rank ?T2_rank . ?T14 a :activity . ?T13 :participates_in\#ref-actid ?T14 .  ?T1 :student\#stuid ?T1_stuid . ?T2 :faculty\#rank ?T2_rank . ?T15 a :faculty_participates_in . ?T15 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :student\#stuid ?T1_stuid . ?T2 :faculty\#rank ?T2_rank . ?T2 a :faculty . ?T15 :faculty_participates_in\#ref-facid ?T2 .  ?T1 :student\#stuid ?T1_stuid . ?T2 :faculty\#rank ?T2_rank . FILTER(?T2_rank = 'Professor') .        }
activity_1,Show first name and last name for all the students advised by Michael Goodrich.,SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T13 a :participates_in . ?T13 :participates_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . ?T14 a :activity . ?T13 :participates_in\#ref-actid ?T14 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . ?T15 a :faculty_participates_in . ?T15 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . ?T2 a :faculty . ?T15 :faculty_participates_in\#ref-facid ?T2 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname . ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . FILTER(?T2_fname = 'Michael' && ?T2_lname = 'Goodrich') .        }
activity_1,"Show the faculty id of each faculty member, along with the number of students he or she advises.",SELECT ?T1_facid (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#facid ?T1_facid . ?T14 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :faculty\#facid ?T1_facid . ?T15 a :participates_in . ?T15 :participates_in\#ref-actid ?T14 .  ?T1 :faculty\#facid ?T1_facid .        } GROUP BY ?T1_facid
activity_1,What are the faculty id and the number of students each faculty has?,SELECT ?T1_facid (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#facid ?T1_facid . ?T14 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :faculty\#facid ?T1_facid . ?T15 a :participates_in . ?T15 :participates_in\#ref-actid ?T14 .  ?T1 :faculty\#facid ?T1_facid .        } GROUP BY ?T1_facid
activity_1,Show all the faculty ranks and the number of students advised by each rank.,SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#rank ?T1_rank . ?T14 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :faculty\#rank ?T1_rank . ?T15 a :participates_in . ?T15 :participates_in\#ref-actid ?T14 .  ?T1 :faculty\#rank ?T1_rank .        } GROUP BY ?T1_rank
activity_1,What are the first and last name of the faculty who has the most students?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T14 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T15 a :participates_in . ?T15 :participates_in\#ref-actid ?T14 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
activity_1,Show the ids for all the faculty members who have at least 2 students.,SELECT ?T1_facid WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#facid ?T1_facid . ?T14 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T14 .  ?T1 :faculty\#facid ?T1_facid . ?T15 a :participates_in . ?T15 :participates_in\#ref-actid ?T14 .  ?T1 :faculty\#facid ?T1_facid .        } GROUP BY ?T1_facid   HAVING(count( *)  >= 2)
activity_1,Show ids for the faculty members who don't advise any student.,SELECT distinct?col1 WHERE { { SELECT (?T1_facid as ?col1) WHERE { ?T1 a :faculty . ?T1 :faculty\#facid ?T1_facid .   }}  MINUS {SELECT (?T2_advisor as ?col1) WHERE { ?T2 a :student . ?T2 :student\#advisor ?T2_advisor .        }     } }
activity_1,What activities do we have?,SELECT ?T1_activity_name WHERE { ?T1 a :activity . ?T1 :activity\#activity_name ?T1_activity_name .        }
activity_1,How many activities do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :activity .        }
activity_1,How many faculty members participate in an activity?,SELECT DISTINCT (count(DISTINCT ?T1_facid) as ?aggregation_T1_facid_10 ) WHERE { ?T1 a :faculty_participates_in . ?T1 :faculty_participates_in\#facid ?T1_facid .        }
activity_1,Give me the number of faculty members who participate in an activity,SELECT DISTINCT (count(DISTINCT ?T1_facid) as ?aggregation_T1_facid_97 ) WHERE { ?T1 a :faculty_participates_in . ?T1 :faculty_participates_in\#facid ?T1_facid .        }
activity_1,Show the ids of the faculty who don't participate in any activity.,SELECT distinct?col1 WHERE { { SELECT (?T1_facid as ?col1) WHERE { ?T1 a :faculty . ?T1 :faculty\#facid ?T1_facid .   }}  MINUS {SELECT (?T2_facid as ?col1) WHERE { ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\#facid ?T2_facid .        }     } }
activity_1,Show the ids of all the faculty members who participate in an activity and advise a student.,SELECT DISTINCT ?T1_facid WHERE { ?T1 a :faculty_participates_in . ?T1 :faculty_participates_in\#facid ?T1_facid . FILTER (?T1_facid in (?T2_advisor)) .   ?T2 a :student . ?T2 :student\#advisor ?T2_advisor .              }
activity_1,How many activities does Mark Giuliano participate in?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty_participates_in . ?T2 a :faculty . ?T1 :faculty_participates_in\#ref-facid ?T2 .  ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') .        }
activity_1,Show the names of all the activities Mark Giuliano participates in.,SELECT ?T1_activity_name WHERE { ?T1 a :activity . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-actid ?T1 .  ?T1 :activity\#activity_name ?T1_activity_name . ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . ?T2 a :faculty . ?T13 :faculty_participates_in\#ref-facid ?T2 .  ?T1 :activity\#activity_name ?T1_activity_name . ?T2 :faculty\#fname ?T2_fname . ?T2 :faculty\#lname ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') .        }
activity_1,"Show the first and last name of all the faculty members who participated in some activity, together with the number of activities they participated in.",SELECT ?T1_fname ?T1_lname (count( *) as ?aggregation_all) ?T1_facid WHERE { ?T1 a :faculty . ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#facid ?T1_facid .        } GROUP BY ?T1_fname ?T1_lname ?T1_facid
activity_1,Show all the activity names and the number of faculty involved in each activity.,SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\#ref-actid ?T1 .  ?T1 :activity\#activity_name ?T1_activity_name .        } GROUP BY ?T1_activity_name
activity_1,What is the first and last name of the faculty participating in the most activities?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :faculty_participates_in . ?T2 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#fname ?T1_fname . ?T1 :faculty\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
activity_1,Show the ids of the students who don't participate in any activity.,SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :student\#stuid ?T1_stuid .   }}  MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :participates_in . ?T2 :participates_in\#stuid ?T2_stuid .        }     } }
activity_1,Show the ids for all the students who participate in an activity and are under 20.,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :participates_in . ?T1 :participates_in\#stuid ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) .   ?T2 a :student . ?T2 :student\#stuid ?T2_stuid . ?T2 :student\#age ?T2_age .  FILTER(?T2_age < 20) .             }
activity_1,What is the first and last name of the student participating in the most activities?,SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :participates_in . ?T2 :participates_in\#ref-stuid ?T1 .  ?T1 :student\#fname ?T1_fname . ?T1 :student\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1
activity_1,What is the name of the activity with the most students?,SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . ?T2 a :participates_in . ?T2 :participates_in\#ref-actid ?T1 .  ?T1 :activity\#activity_name ?T1_activity_name .        } GROUP BY ?T1_activity_name  ORDER BY DESC (?aggregation_all) LIMIT 1
activity_1,Find the first names of the faculty members who are playing Canoeing or Kayaking.,SELECT DISTINCT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :activity\#activity_name ?T2_activity_name . ?T2 :activity\#activity_name ?T2_activity_name . ?T2 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T2 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :activity\#activity_name ?T2_activity_name . ?T2 :activity\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing' || ?T2_activity_name = 'Kayaking') .        }
activity_1,Find the first names of professors who are not playing Canoeing or Kayaking.,SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a :faculty . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Professor') .   }}  MINUS {SELECT DISTINCT (?T2_lname as ?col1) WHERE { ?T2 a :faculty . ?T14 a :faculty_participates_in . ?T14 :faculty_participates_in\#ref-facid ?T2 .  ?T2 :faculty\#lname ?T2_lname . ?T3 :activity\#activity_name ?T3_activity_name . ?T3 :activity\#activity_name ?T3_activity_name . ?T3 a :activity . ?T14 :faculty_participates_in\#ref-actid ?T3 .  ?T2 :faculty\#lname ?T2_lname . ?T3 :activity\#activity_name ?T3_activity_name . ?T3 :activity\#activity_name ?T3_activity_name . FILTER(?T3_activity_name = 'Canoeing' || ?T3_activity_name = 'Kayaking') .        }     } }
activity_1,What are the first names of the professors who do not play Canoeing or Kayaking as activities?,SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a :faculty . ?T1 :faculty\#lname ?T1_lname . ?T1 :faculty\#rank ?T1_rank . FILTER(?T1_rank = 'Professor') .   }}  MINUS {SELECT DISTINCT (?T2_lname as ?col1) WHERE { ?T2 a :faculty . ?T14 a :faculty_participates_in . ?T14 :faculty_participates_in\#ref-facid ?T2 .  ?T2 :faculty\#lname ?T2_lname . ?T3 :activity\#activity_name ?T3_activity_name . ?T3 :activity\#activity_name ?T3_activity_name . ?T3 a :activity . ?T14 :faculty_participates_in\#ref-actid ?T3 .  ?T2 :faculty\#lname ?T2_lname . ?T3 :activity\#activity_name ?T3_activity_name . ?T3 :activity\#activity_name ?T3_activity_name . FILTER(?T3_activity_name = 'Canoeing' || ?T3_activity_name = 'Kayaking') .        }     } }
activity_1,Find the first names of the faculty members who participate in Canoeing and Kayaking.,SELECT DISTINCT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :activity\#activity_name ?T2_activity_name . ?T2 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T2 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :activity\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_lname in (?T3_lname)) .   ?T3 a :faculty . ?T15 a :faculty_participates_in . ?T15 :faculty_participates_in\#ref-facid ?T3 .  ?T3 :faculty\#lname ?T3_lname . ?T4 :activity\#activity_name ?T4_activity_name . ?T4 a :activity . ?T15 :faculty_participates_in\#ref-actid ?T4 .  ?T3 :faculty\#lname ?T3_lname . ?T4 :activity\#activity_name ?T4_activity_name .  FILTER(?T4_activity_name = 'Kayaking') .             }
activity_1,What are the first names of the faculty members playing both Canoeing and Kayaking?,SELECT DISTINCT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\#ref-facid ?T1 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :activity\#activity_name ?T2_activity_name . ?T2 a :activity . ?T13 :faculty_participates_in\#ref-actid ?T2 .  ?T1 :faculty\#lname ?T1_lname . ?T2 :activity\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_lname in (?T3_lname)) .   ?T3 a :faculty . ?T15 a :faculty_participates_in . ?T15 :faculty_participates_in\#ref-facid ?T3 .  ?T3 :faculty\#lname ?T3_lname . ?T4 :activity\#activity_name ?T4_activity_name . ?T4 a :activity . ?T15 :faculty_participates_in\#ref-actid ?T4 .  ?T3 :faculty\#lname ?T3_lname . ?T4 :activity\#activity_name ?T4_activity_name .  FILTER(?T4_activity_name = 'Kayaking') .             }
activity_1,Find the ids of the students who participate in Canoeing and Kayaking.,SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :participates_in . ?T2 a :activity . ?T1 :participates_in\#ref-actid ?T2 .  ?T1 :participates_in\#stuid ?T1_stuid . ?T2 :activity\#activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_stuid in (?T3_stuid)) .   ?T3 a :participates_in . ?T4 a :activity . ?T3 :participates_in\#ref-actid ?T4 .  ?T3 :participates_in\#stuid ?T3_stuid . ?T4 :activity\#activity_name ?T4_activity_name .  FILTER(?T4_activity_name = 'Kayaking') .             }
flight_4,Find the name of the airport in the city of Goroka.,SELECT ?T1_name WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#city ?T1_city . FILTER(?T1_city = 'Goroka') .        }
flight_4,What are the names of the airports in the city of Goroka?,SELECT ?T1_name WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#city ?T1_city . FILTER(?T1_city = 'Goroka') .        }
flight_4,"Find the name, city, country, and altitude (or elevation) of the airports in the city of New York.",SELECT ?T1_name ?T1_city ?T1_country ?T1_elevation WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . ?T1 :airports\#elevation ?T1_elevation . ?T1 :airports\#city ?T1_city . FILTER(?T1_city = 'New York') .        }
flight_4,How many airlines are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines .        }
flight_4,What is the total number of airlines?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines .        }
flight_4,How many airlines does Russia has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country . FILTER(?T1_country = 'Russia') .        }
flight_4,What is the number of airlines based in Russia?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country . FILTER(?T1_country = 'Russia') .        }
flight_4,What is the maximum elevation of all airports in the country of Iceland?,SELECT (max( ?T1_elevation) as ?aggregation_T1_elevation_179 ) WHERE { ?T1 a :airports . ?T1 :airports\#elevation ?T1_elevation . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'Iceland') .        }
flight_4,What is the highest elevation of an airport in the country of Iceland?,SELECT (max( ?T1_elevation) as ?aggregation_T1_elevation_182 ) WHERE { ?T1 a :airports . ?T1 :airports\#elevation ?T1_elevation . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'Iceland') .        }
flight_4,Find the name of the airports located in Cuba or Argentina.,SELECT ?T1_name WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#country ?T1_country . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'Cuba' || ?T1_country = 'Argentina') .        }
flight_4,What are the names of all airports in Cuba or Argentina?,SELECT ?T1_name WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#country ?T1_country . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'Cuba' || ?T1_country = 'Argentina') .        }
flight_4,Find the country of the airlines whose name starts with 'Orbit'.,"SELECT ?T1_country WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country . ?T1 :airlines\#name ?T1_name . FILTER(contains (?T1_name, 'Orbit')) .        }"
flight_4,What are the countries of all airlines whose names start with Orbit?,"SELECT ?T1_country WHERE { ?T1 a :airlines . ?T1 :airlines\#country ?T1_country . ?T1 :airlines\#name ?T1_name . FILTER(contains (?T1_name, 'Orbit')) .        }"
flight_4,Find the name of airports whose altitude is between -50 and 50.,SELECT ?T1_name WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#elevation ?T1_elevation . FILTER(?T1_elevation >= -50 && ?T1_elevation <= 50) .        }
flight_4,What are the names of all airports whose elevation is between -50 and 50?,SELECT ?T1_name WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#elevation ?T1_elevation . FILTER(?T1_elevation >= -50 && ?T1_elevation <= 50) .        }
flight_4,Which country is the airport that has the highest altitude located in?,SELECT ?T1_country WHERE { ?T1 a :airports . ?T1 :airports\#country ?T1_country . ?T1 :airports\#elevation ?T1_elevation .        }   ORDER BY DESC (?T1_elevation) LIMIT 1
flight_4,What is the country of the airport with the highest elevation?,SELECT ?T1_country WHERE { ?T1 a :airports . ?T1 :airports\#country ?T1_country . ?T1 :airports\#elevation ?T1_elevation .        }   ORDER BY DESC (?T1_elevation) LIMIT 1
flight_4,Find the number of airports whose name contain the word 'International'.,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . FILTER(contains (?T1_name, 'International')) .        }"
flight_4,How many airports' names have the word Interanation in them?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . FILTER(contains (?T1_name, 'International')) .        }"
flight_4,In how many cities are there airports in the country of Greenland?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_186 ) WHERE { ?T1 a :airports . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . FILTER(?T1_country = 'Greenland') .        }
flight_4,Find the number of routes operated by American Airlines.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :routes . ?T2 a :airlines . ?T1 :routes\#ref-alid ?T2 .  ?T2 :airlines\#name ?T2_name . FILTER(?T2_name = 'American Airlines') .        }
flight_4,How many routes does American Airlines operate?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :routes . ?T2 a :airlines . ?T1 :routes\#ref-alid ?T2 .  ?T2 :airlines\#name ?T2_name . FILTER(?T2_name = 'American Airlines') .        }
flight_4,Find the number of routes whose destination airports are in Canada.,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :airports\#ref-routes_id ?T1 . FILTER(?T2_country = 'Canada') .        }
flight_4,How many routes end in a Canadian airport?,SELECT (count( *) as ?aggregation_all) WHERE { ?T2 :airports\#ref-routes_id ?T1 . FILTER(?T2_country = 'Canada') .        }
flight_4,"Find the name, city, and country of the airport that has the lowest altitude.",SELECT ?T1_name ?T1_city ?T1_country WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . ?T1 :airports\#elevation ?T1_elevation .        }   ORDER BY ASC (?T1_elevation) LIMIT 1
flight_4,"Find the name, city, and country of the airport that has the highest latitude.",SELECT ?T1_name ?T1_city ?T1_country WHERE { ?T1 a :airports . ?T1 :airports\#name ?T1_name . ?T1 :airports\#city ?T1_city . ?T1 :airports\#country ?T1_country . ?T1 :airports\#elevation ?T1_elevation .        }   ORDER BY DESC (?T1_elevation) LIMIT 1
flight_4,Find the name and city of the airport which is the destination of the most number of routes.,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_city ?T2_dst_apid WHERE { ?T1 :airports\#ref-routes_id ?T2 .        } GROUP BY ?T1_name ?T1_city ?T2_dst_apid  ORDER BY DESC (?aggregation_all) LIMIT 1
flight_4,What is the name and city of the airport that the most routes end at?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_city ?T2_dst_apid WHERE { ?T1 :airports\#ref-routes_id ?T2 .        } GROUP BY ?T1_name ?T1_city ?T2_dst_apid  ORDER BY DESC (?aggregation_all) LIMIT 1
