kg_name,question,query
movie_1,What are the titles of all movies that have not been rated?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#mid ?T1_mid . FILTER(?T1_mid not in (?T22_mid)) .       {SELECT ?T22_mid WHERE { ?T22 a :rating . ?T22 :rating\#mid ?T22_mid .        }    } }
movie_1,Find the names of all reviewers who have ratings with a NULL value for the date.,SELECT DISTINCT ?t1_name WHERE{?t1 a :reviewer . ?t1 :reviewer\#ratingdate ?t1_ratingdate . ?t1 :reviewer\#ref-ratingdate_id ?t2_ratingdate_id . FILTER(?t1_rating_date = 0)}
movie_1,What is the average rating stars and title for the oldest movie?,SELECT (avg( ?T1_stars) as ?aggregation_T1_stars_82 ) ?T2_title WHERE { ?T1 a :rating . ?T2 a :movie . ?T1 :rating\#ref-mid ?T2 .  ?T1 :rating\#stars ?T1_stars . ?T2 :movie\#title ?T2_title . ?T2 :movie\#year ?T2_year . FILTER(?T2_year = (?aggregation_T23_year_58)) .       {SELECT (min( ?T23_year) as ?aggregation_T23_year_58 ) WHERE { ?T23 a :movie . ?T23 :movie\#year ?T23_year .        }    } } GROUP BY ?T2_title
movie_1,What is the name of the most recent movie?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#year ?T1_year . FILTER(?T1_year = (?aggregation_T22_year_2)) .       {SELECT (max( ?T22_year) as ?aggregation_T22_year_2 ) WHERE { ?T22 a :movie . ?T22 :movie\#year ?T22_year .        }    } }
movie_1,What is the title of the newest movie?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#year ?T1_year . FILTER(?T1_year = (?aggregation_T22_year_6)) .       {SELECT (max( ?T22_year) as ?aggregation_T22_year_6 ) WHERE { ?T22 a :movie . ?T22 :movie\#year ?T22_year .        }    } }
movie_1,What is the maximum stars and year for the most recent movie?,SELECT (max( ?T1_stars) as ?aggregation_T1_stars_69 ) ?T2_year WHERE { ?T1 a :rating . ?T2 a :movie . ?T1 :rating\#ref-mid ?T2 .  ?T1 :rating\#stars ?T1_stars . ?T2 :movie\#year ?T2_year . ?T2 :movie\#year ?T2_year . FILTER(?T2_year = (?aggregation_T23_year_149)) .       {SELECT (max( ?T23_year) as ?aggregation_T23_year_149 ) WHERE { ?T23 a :movie . ?T23 :movie\#year ?T23_year .        }    } } GROUP BY ?T2_year
movie_1,"Return reviewer name, movie title, stars, and ratingDate. And sort the data first by reviewer name, then by movie title, and lastly by number of stars.",SELECT ?T1_name ?T2_title ?T3_stars ?T3_ratingdate WHERE { ?T1 a :reviewer . ?T3 a :rating . ?T3 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name . ?T2 :movie\#title ?T2_title . ?T3 :rating\#stars ?T3_stars . ?T3 :rating\#ratingdate ?T3_ratingdate . ?T1 :reviewer\#name ?T1_name . ?T2 a :movie . ?T3 :rating\#ref-mid ?T2 .  ?T1 :reviewer\#name ?T1_name . ?T2 :movie\#title ?T2_title . ?T3 :rating\#stars ?T3_stars . ?T3 :rating\#ratingdate ?T3_ratingdate . ?T1 :reviewer\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
movie_1,Find the names of all reviewers who have contributed three or more ratings.,SELECT ?T1_name WHERE { ?T1 a :reviewer . ?T2 a :rating . ?T2 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 3)
movie_1,What are the names of all reviewers that have rated 3 or more movies?,SELECT ?T1_name WHERE { ?T1 a :reviewer . ?T2 a :rating . ?T2 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  >= 3)
movie_1,Find the names of all reviewers who rated Gone with the Wind.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :reviewer . ?T13 a :rating . ?T13 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name . ?T2 :movie\#title ?T2_title . ?T2 a :movie . ?T13 :rating\#ref-mid ?T2 .  ?T1 :reviewer\#name ?T1_name . ?T2 :movie\#title ?T2_title . FILTER(?T2_title = 'Gone with the Wind') .        }
movie_1,Find the names of all directors whose movies are rated by Sarah Martinez.,SELECT DISTINCT ?T1_director WHERE { ?T1 a :movie . ?T13 a :rating . ?T13 :rating\#ref-mid ?T1 .  ?T1 :movie\#director ?T1_director . ?T2 :reviewer\#name ?T2_name . ?T2 a :reviewer . ?T13 :rating\#ref-rid ?T2 .  ?T1 :movie\#director ?T1_director . ?T2 :reviewer\#name ?T2_name . FILTER(?T2_name = 'Sarah Martinez') .        }
movie_1,"For any rating where the name of reviewer is the same as the director of the movie, return the reviewer name, movie title, and number of stars.","SELECT DISTINCT ?T1_name ?T2_title ?T3_stars WHERE { ?T1 a :reviewer . ?T3 a :rating . ?T3 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name . ?T2 :movie\#title ?T2_title . ?T3 :rating\#stars ?T3_stars . ?T2 :movie\#director ?T2_director . ?T2 a :movie . ?T3 :rating\#ref-mid ?T2 .  ?T1 :reviewer\#name ?T1_name . ?T2 :movie\#title ?T2_title . ?T3 :rating\#stars ?T3_stars . ?T2 :movie\#director ?T2_director . FILTER(?T2_director = '[0, 21, False]') .        }"
movie_1,Return all reviewer names and movie names together in a single list.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :reviewer . ?T1 :reviewer\#name ?T1_name .   }} UNION {SELECT (?T1_title as ?col1) WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title .        }      } }
movie_1,What are the names of all the reviewers and movie names?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :reviewer . ?T1 :reviewer\#name ?T1_name .   }} UNION {SELECT (?T1_title as ?col1) WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title .        }      } }
movie_1,Find the titles of all movies not reviewed by Chris Jackson.,SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_title as ?col1) WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title .   }}  MINUS {SELECT (?T2_title as ?col1) WHERE { ?T2 a :movie . ?T14 a :rating . ?T14 :rating\#ref-mid ?T2 .  ?T2 :movie\#title ?T2_title . ?T3 :reviewer\#name ?T3_name . ?T3 a :reviewer . ?T14 :rating\#ref-rid ?T3 .  ?T2 :movie\#title ?T2_title . ?T3 :reviewer\#name ?T3_name . FILTER(?T3_name = 'Chris Jackson') .        }     } }
movie_1,"For all directors who directed more than one movie, return the titles of all movies directed by them, along with the director name. Sort by director name, then movie title.","SELECT ?T1_title ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#director ?T1_director . ?T1 :movie\#director ?T1_director . ?T1 :movie\#title ?T1_title . FILTER(?T1_title != '[0, 2, False]') .        }  ORDER BY ASC (?T1_director)"
movie_1,"For directors who had more than one movie, return the titles and produced years of all movies directed by them.","SELECT ?T1_title ?T1_year WHERE { ?T1 a :movie . ?T1 :movie\#title ?T1_title . ?T1 :movie\#year ?T1_year . ?T1 :movie\#title ?T1_title . FILTER(?T1_title != '[0, 2, False]') .        }"
movie_1,What are the names of the directors who made exactly one movie?,SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director .        } GROUP BY ?T1_director   HAVING(count( *)  = 1)
movie_1,What are the names of all directors who made one movie?,SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :movie\#director ?T1_director .        } GROUP BY ?T1_director   HAVING(count( *)  = 1)
movie_1,How many movie reviews does each director get?,SELECT (count( *) as ?aggregation_all) ?T2_director WHERE { ?T1 a :rating . ?T2 a :movie . ?T1 :rating\#ref-mid ?T2 .  ?T2 :movie\#director ?T2_director .        } GROUP BY ?T2_director
movie_1,Find the movies with the highest average rating. Return the movie titles and average rating.,SELECT ?T1_title (avg( ?T2_stars) as ?aggregation_T2_stars_171 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title  ORDER BY DESC ((avg( ?T2_stars) as ?aggregation_T2_stars_93 )) LIMIT 1
movie_1,What are the movie titles with the highest average rating and what are those ratings?,SELECT ?T1_title (avg( ?T2_stars) as ?aggregation_T2_stars_84 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title  ORDER BY DESC ((avg( ?T2_stars) as ?aggregation_T2_stars_187 )) LIMIT 1
movie_1,What are the movie titles and average rating of the movies with the lowest average rating?,SELECT ?T1_title (avg( ?T2_stars) as ?aggregation_T2_stars_120 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title  ORDER BY ASC ((avg( ?T2_stars) as ?aggregation_T2_stars_173 )) LIMIT 1
movie_1,What are the titles and average ratings for all movies that have the lowest average rating?,SELECT ?T1_title (avg( ?T2_stars) as ?aggregation_T2_stars_111 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title  ORDER BY ASC ((avg( ?T2_stars) as ?aggregation_T2_stars_183 )) LIMIT 1
movie_1,"For each director, return the director's name together with the title of the movie they directed that received the highest rating among all of their movies, and the value of that rating. Ignore movies whose director is NULL.",SELECT ?T1_title ?T2_stars ?T1_director (max( ?T2_stars) as ?aggregation_T2_stars_63 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T1 :movie\#director ?T1_director . ?T2 :rating\#stars ?T2_stars . ?T1 :movie\#director ?T1_director . FILTER(?T1_director != 'null') .        } GROUP BY ?T1_title ?T2_stars ?T1_director
movie_1,"For each director, what are the titles and ratings for all the movies they reviewed?",SELECT ?T1_title ?T2_stars ?T1_director (max( ?T2_stars) as ?aggregation_T2_stars_41 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T1 :movie\#director ?T1_director . ?T2 :rating\#stars ?T2_stars . ?T1 :movie\#director ?T1_director . FILTER(?T1_director != 'null') .        } GROUP BY ?T1_title ?T2_stars ?T1_director
movie_1,Find the title and star rating of the movie that got the least rating star for each reviewer.,SELECT ?T1_title ?T2_rid ?T2_stars (min( ?T2_stars) as ?aggregation_T2_stars_8 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#rid ?T2_rid . ?T2 :rating\#stars ?T2_stars . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title ?T2_rid ?T2_stars
movie_1,"For each reviewer id, what is the title and rating for the movie with the smallest rating?",SELECT ?T1_title ?T2_rid ?T2_stars (min( ?T2_stars) as ?aggregation_T2_stars_31 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#rid ?T2_rid . ?T2 :rating\#stars ?T2_stars . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title ?T2_rid ?T2_stars
movie_1,Find the title and score of the movie with the lowest rating among all movies directed by each director.,SELECT ?T1_title ?T2_stars ?T1_director (min( ?T2_stars) as ?aggregation_T2_stars_14 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T1 :movie\#director ?T1_director . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title ?T2_stars ?T1_director
movie_1,"For each director, what is the title and score of their most poorly rated movie?",SELECT ?T1_title ?T2_stars ?T1_director (min( ?T2_stars) as ?aggregation_T2_stars_51 ) WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . ?T1 :movie\#director ?T1_director . ?T2 :rating\#stars ?T2_stars .        } GROUP BY ?T1_title ?T2_stars ?T1_director
movie_1,What is the name of the movie that is rated by most of times?,SELECT ?T1_title (count( *) as ?aggregation_all) ?T2_mid WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#mid ?T2_mid .        } GROUP BY ?T1_title ?T2_mid  ORDER BY DESC (?aggregation_all) LIMIT 1
movie_1,What is the name of the movie that has been reviewed the most?,SELECT ?T1_title (count( *) as ?aggregation_all) ?T2_mid WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#mid ?T2_mid .        } GROUP BY ?T1_title ?T2_mid  ORDER BY DESC (?aggregation_all) LIMIT 1
movie_1,What are the titles of all movies that have rating star is between 3 and 5?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars >= 3 && ?T2_stars <= 5) .        }
movie_1,What are the titles of all movies that have between 3 and 5 stars?,SELECT ?T1_title WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars >= 3 && ?T2_stars <= 5) .        }
movie_1,Find the names of reviewers who had given higher than 3 star ratings.,SELECT ?T1_name WHERE { ?T1 a :reviewer . ?T2 a :rating . ?T2 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars > 3) .        }
movie_1,Find the average rating star for each movie that are not reviewed by Brittany Harris.,SELECT ?T1_mid (avg( ?T1_stars) as ?aggregation_T1_stars_179 ) WHERE { ?T1 a :rating . ?T1 :rating\#mid ?T1_mid . ?T1 :rating\#stars ?T1_stars . ?T1 :rating\#mid ?T1_mid . FILTER(?T1_mid not in (?T23_name)) .       {SELECT ?T22_mid WHERE { ?T22 a :rating . ?T23 a :reviewer . ?T22 :rating\#ref-rid ?T23 .  ?T22 :rating\#mid ?T22_mid . ?T23 :reviewer\#name ?T23_name . FILTER(?T23_name = 'Brittany Harris') .        }    } } GROUP BY ?T1_mid
movie_1,What are the ids of the movies that are not reviewed by Brittany Harris.,SELECT distinct?col1 WHERE { { SELECT (?T1_mid as ?col1) WHERE { ?T1 a :rating . ?T1 :rating\#mid ?T1_mid .   }}  MINUS {SELECT (?T2_mid as ?col1) WHERE { ?T2 a :rating . ?T3 a :reviewer . ?T2 :rating\#ref-rid ?T3 .  ?T2 :rating\#mid ?T2_mid . ?T3 :reviewer\#name ?T3_name . FILTER(?T3_name = 'Brittany Harris') .        }     } }
movie_1,Find the average rating star for each movie that received at least 2 ratings.,SELECT ?T1_mid (avg( ?T1_stars) as ?aggregation_T1_stars_183 ) WHERE { ?T1 a :rating . ?T1 :rating\#mid ?T1_mid . ?T1 :rating\#stars ?T1_stars .        } GROUP BY ?T1_mid   HAVING(count( *)  >= 2)
movie_1,find the ids of reviewers who did not give 4 star.,SELECT distinct?col1 WHERE { { SELECT (?T1_rid as ?col1) WHERE { ?T1 a :rating . ?T1 :rating\#rid ?T1_rid .   }}  MINUS {SELECT (?T2_rid as ?col1) WHERE { ?T2 a :rating . ?T2 :rating\#rid ?T2_rid . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars = 4) .        }     } }
movie_1,What are the ids of all reviewers who did not give 4 stars?,SELECT distinct?col1 WHERE { { SELECT (?T1_rid as ?col1) WHERE { ?T1 a :rating . ?T1 :rating\#rid ?T1_rid .   }}  MINUS {SELECT (?T2_rid as ?col1) WHERE { ?T2 a :rating . ?T2 :rating\#rid ?T2_rid . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars = 4) .        }     } }
movie_1,Find the ids of reviewers who didn't only give 4 star.,SELECT ?T1_rid WHERE { ?T1 a :rating . ?T1 :rating\#rid ?T1_rid . ?T1 :rating\#stars ?T1_stars . FILTER(?T1_stars != 4) .        }
movie_1,What are the ids of all reviewers who have not given 4 stars at least once?,SELECT ?T1_rid WHERE { ?T1 a :rating . ?T1 :rating\#rid ?T1_rid . ?T1 :rating\#stars ?T1_stars . FILTER(?T1_stars != 4) .        }
movie_1,What are the names of reviewers who had rated 3 star and 4 star?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :reviewer . ?T2 a :rating . ?T2 :rating\#ref-rid ?T1 .  ?T1 :reviewer\#name ?T1_name . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars = 3) . FILTER (?T1_name in (?T3_name)) .   ?T3 a :reviewer . ?T4 a :rating . ?T4 :rating\#ref-rid ?T3 .  ?T3 :reviewer\#name ?T3_name . ?T4 :rating\#stars ?T4_stars .  FILTER(?T4_stars = 4) .             }
movie_1,What are the names of movies that get 3 star and 4 star?,SELECT DISTINCT ?T1_title WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars = 3) . FILTER (?T1_title in (?T3_title)) .   ?T3 a :movie . ?T4 a :rating . ?T4 :rating\#ref-mid ?T3 .  ?T3 :movie\#title ?T3_title . ?T4 :rating\#stars ?T4_stars .  FILTER(?T4_stars = 4) .             }
movie_1,What are the names of all movies that received 3 or 4 stars?,SELECT DISTINCT ?T1_title WHERE { ?T1 a :movie . ?T2 a :rating . ?T2 :rating\#ref-mid ?T1 .  ?T1 :movie\#title ?T1_title . ?T2 :rating\#stars ?T2_stars . FILTER(?T2_stars = 3) . FILTER (?T1_title in (?T3_title)) .   ?T3 a :movie . ?T4 a :rating . ?T4 :rating\#ref-mid ?T3 .  ?T3 :movie\#title ?T3_title . ?T4 :rating\#stars ?T4_stars .  FILTER(?T4_stars = 4) .             }
county_public_safety,How many counties are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety .        }
county_public_safety,List the names of counties in descending order of population.,SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#name ?T1_name . ?T1 :county_public_safety\#population ?T1_population .        }  ORDER BY DESC (?T1_population)
county_public_safety,List the distinct police forces of counties whose location is not on east side.,SELECT DISTINCT ?T1_police_force WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#police_force ?T1_police_force . ?T1 :county_public_safety\#location ?T1_location . FILTER(?T1_location != 'East') .        }
county_public_safety,What are the minimum and maximum crime rate of counties?,SELECT (min( ?T1_crime_rate) as ?aggregation_T1_crime_rate_37 ) (max( ?T1_crime_rate) as ?aggregation_T1_crime_rate_141 ) WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#crime_rate ?T1_crime_rate . ?T1 :county_public_safety\#crime_rate ?T1_crime_rate .        }
county_public_safety,Return the minimum and maximum crime rates across all counties.,SELECT (min( ?T1_crime_rate) as ?aggregation_T1_crime_rate_147 ) (max( ?T1_crime_rate) as ?aggregation_T1_crime_rate_11 ) WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#crime_rate ?T1_crime_rate . ?T1 :county_public_safety\#crime_rate ?T1_crime_rate .        }
county_public_safety,Show the crime rates of counties in ascending order of number of police officers.,SELECT ?T1_crime_rate WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#crime_rate ?T1_crime_rate . ?T1 :county_public_safety\#police_officers ?T1_police_officers .        }  ORDER BY ASC (?T1_police_officers)
county_public_safety,What are the names of cities in ascending alphabetical order?,SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :city\#name ?T1_name . ?T1 :city\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
county_public_safety,Return the hispanic percentage for cities in which the black percentage is greater than 10.,SELECT ?T1_hispanic WHERE { ?T1 a :city . ?T1 :city\#hispanic ?T1_hispanic . ?T1 :city\#black ?T1_black . FILTER(?T1_black > 10) .        }
county_public_safety,List the name of the county with the largest population.,SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#name ?T1_name . ?T1 :county_public_safety\#population ?T1_population .        }   ORDER BY DESC (?T1_population) LIMIT 1
county_public_safety,What is the name of the county with the greatest population?,SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#name ?T1_name . ?T1 :county_public_safety\#population ?T1_population .        }   ORDER BY DESC (?T1_population) LIMIT 1
county_public_safety,List the names of the city with the top 5 white percentages.,SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :city\#name ?T1_name . ?T1 :city\#white ?T1_white .        }   ORDER BY DESC (?T1_white) LIMIT 1
county_public_safety,Show names of cities and names of counties they are in.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :city . ?T2 a :county_public_safety . ?T1 :city\#ref-county_id ?T2 .  ?T1 :city\#name ?T1_name . ?T2 :county_public_safety\#name ?T2_name .        }
county_public_safety,Show white percentages of cities and the crime rates of counties they are in.,SELECT ?T1_white ?T2_crime_rate WHERE { ?T1 a :city . ?T2 a :county_public_safety . ?T1 :city\#ref-county_id ?T2 .  ?T1 :city\#white ?T1_white . ?T2 :county_public_safety\#crime_rate ?T2_crime_rate .        }
county_public_safety,Show the name of cities in the county that has the largest number of police officers.,SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :city\#name ?T1_name . ?T1 :city\#county_id ?T1_county_id . FILTER(?T1_county_id = (?T22_police_officers)) .       {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_public_safety\#county_id ?T22_county_id . ?T22 :county_public_safety\#police_officers ?T22_police_officers .        }   ORDER BY DESC (?T22_police_officers) LIMIT 1 } }
county_public_safety,Show the number of cities in counties that have a population more than 20000.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T1 :city\#county_id ?T1_county_id . FILTER(?T1_county_id in (?T22_population)) .       {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_public_safety\#county_id ?T22_county_id . ?T22 :county_public_safety\#population ?T22_population . FILTER(?T22_population > 20000) .        }    } }
county_public_safety,How many cities are in counties that have populations of over 20000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T1 :city\#county_id ?T1_county_id . FILTER(?T1_county_id in (?T22_population)) .       {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_public_safety\#county_id ?T22_county_id . ?T22 :county_public_safety\#population ?T22_population . FILTER(?T22_population > 20000) .        }    } }
county_public_safety,Show the crime rate of counties with a city having white percentage more than 90.,SELECT ?T1_crime_rate WHERE { ?T1 a :county_public_safety . ?T2 a :city . ?T2 :city\#ref-county_id ?T1 .  ?T1 :county_public_safety\#crime_rate ?T1_crime_rate . ?T2 :city\#white ?T2_white . FILTER(?T2_white > 90) .        }
county_public_safety,Please show the police forces and the number of counties with each police force.,SELECT ?T1_police_force (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#police_force ?T1_police_force .        } GROUP BY ?T1_police_force
county_public_safety,How many counties correspond to each police force?,SELECT ?T1_police_force (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#police_force ?T1_police_force .        } GROUP BY ?T1_police_force
county_public_safety,What is the location shared by most counties?,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#location ?T1_location .        } GROUP BY ?T1_location  ORDER BY DESC (?aggregation_all) LIMIT 1
county_public_safety,Which location has the most corresponding counties?,SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#location ?T1_location .        } GROUP BY ?T1_location  ORDER BY DESC (?aggregation_all) LIMIT 1
county_public_safety,List the names of counties that do not have any cities.,SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#name ?T1_name . ?T1 :county_public_safety\#county_id ?T1_county_id . FILTER(?T1_county_id not in (?T22_county_id)) .       {SELECT ?T22_county_id WHERE { ?T22 a :city . ?T22 :city\#county_id ?T22_county_id .        }    } }
county_public_safety,What are the names of counties that do not contain any cities?,SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#name ?T1_name . ?T1 :county_public_safety\#county_id ?T1_county_id . FILTER(?T1_county_id not in (?T22_county_id)) .       {SELECT ?T22_county_id WHERE { ?T22 a :city . ?T22 :city\#county_id ?T22_county_id .        }    } }
county_public_safety,Show the police force shared by counties with location on the east and west.,SELECT DISTINCT ?T1_police_force WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#police_force ?T1_police_force . ?T1 :county_public_safety\#location ?T1_location . FILTER(?T1_location = 'East') . FILTER (?T1_police_force in (?T2_police_force)) .   ?T2 a :county_public_safety . ?T2 :county_public_safety\#police_force ?T2_police_force . ?T2 :county_public_safety\#location ?T2_location .  FILTER(?T2_location = 'West') .             }
county_public_safety,Show the names of cities in counties that have a crime rate less than 100.,SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :city\#name ?T1_name . ?T1 :city\#county_id ?T1_county_id . FILTER(?T1_county_id in (?T22_crime_rate)) .       {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_public_safety\#county_id ?T22_county_id . ?T22 :county_public_safety\#crime_rate ?T22_crime_rate . FILTER(?T22_crime_rate < 100) .        }    } }
county_public_safety,Show the case burden of counties in descending order of population.,SELECT ?T1_case_burden WHERE { ?T1 a :county_public_safety . ?T1 :county_public_safety\#case_burden ?T1_case_burden . ?T1 :county_public_safety\#population ?T1_population .        }  ORDER BY DESC (?T1_population)
inn_1,Find the names of all modern rooms with a base price below $160 and two beds.,SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice . ?T1 :rooms\#beds ?T1_beds . ?T1 :rooms\#decor ?T1_decor . FILTER(?T1_baseprice < 160 && ?T1_beds = 2 && ?T1_decor = 'modern') .        }
inn_1,Find all the rooms that have a price higher than 160 and can accommodate more than 2 people. Report room names and ids.,SELECT ?T1_roomname ?T1_roomid WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#roomid ?T1_roomid . ?T1 :rooms\#baseprice ?T1_baseprice . ?T1 :rooms\#maxoccupancy ?T1_maxoccupancy . FILTER(?T1_baseprice > 160 && ?T1_maxoccupancy > 2) .        }
inn_1,Find the most popular room in the hotel. The most popular room is the room that had seen the largest number of reservations.,SELECT ?T1_roomname (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname .        } GROUP BY ?T1_roomname  ORDER BY DESC (?aggregation_all) LIMIT 1
inn_1,Which room has the largest number of reservations?,SELECT ?T1_roomname (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname .        } GROUP BY ?T1_roomname  ORDER BY DESC (?aggregation_all) LIMIT 1
inn_1,How many kids stay in the rooms reserved by ROY SWEAZY?,SELECT ?T1_kids WHERE { ?T1 a :reservations . ?T1 :reservations\#kids ?T1_kids . ?T1 :reservations\#firstname ?T1_firstname . ?T1 :reservations\#lastname ?T1_lastname . FILTER(?T1_firstname = 'ROY' && ?T1_lastname = 'SWEAZY') .        }
inn_1,How many times does ROY SWEAZY has reserved a room.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reservations . ?T1 :reservations\#firstname ?T1_firstname . ?T1 :reservations\#lastname ?T1_lastname . FILTER(?T1_firstname = 'ROY' && ?T1_lastname = 'SWEAZY') .        }
inn_1,"Which room has the highest rate? List the room's full name, rate, check in and check out date.",SELECT ?T1_roomname ?T2_rate ?T2_checkin ?T2_checkout WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :reservations\#ref-room ?T1 .  ?T1 :rooms\#roomname ?T1_roomname . ?T2 :reservations\#rate ?T2_rate . ?T2 :reservations\#checkin ?T2_checkin . ?T2 :reservations\#checkout ?T2_checkout . ?T2 :reservations\#rate ?T2_rate .        }   ORDER BY DESC (?T2_rate) LIMIT 1
inn_1,"Find the number of adults for the room reserved and checked in by CONRAD SELBIG on Oct 23, 2010.",SELECT ?T1_adults WHERE { ?T1 a :reservations . ?T1 :reservations\#adults ?T1_adults . ?T1 :reservations\#checkin ?T1_checkin . ?T1 :reservations\#firstname ?T1_firstname . ?T1 :reservations\#lastname ?T1_lastname . FILTER(?T1_checkin = '2010-10-23' && ?T1_firstname = 'CONRAD' && ?T1_lastname = 'SELBIG') .        }
inn_1,"Return the number of kids for the room reserved and checked in by DAMIEN TRACHSEL on  Sep 21, 2010.",SELECT ?T1_kids WHERE { ?T1 a :reservations . ?T1 :reservations\#kids ?T1_kids . ?T1 :reservations\#checkin ?T1_checkin . ?T1 :reservations\#firstname ?T1_firstname . ?T1 :reservations\#lastname ?T1_lastname . FILTER(?T1_checkin = '2010-09-21' && ?T1_firstname = 'DAMIEN' && ?T1_lastname = 'TRACHSEL') .        }
inn_1,How many king beds are there?,SELECT (sum( ?T1_beds) as ?aggregation_T1_beds_64 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#beds ?T1_beds . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') .        }
inn_1,Find the total number of king beds available.,SELECT (sum( ?T1_beds) as ?aggregation_T1_beds_35 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#beds ?T1_beds . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') .        }
inn_1,List the names and decor of rooms that have a king bed. Sort the list by their price.,SELECT ?T1_roomname ?T1_decor WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#baseprice ?T1_baseprice . ?T1 :rooms\#bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') .        }  ORDER BY ASC (?T1_baseprice)
inn_1,Which room has cheapest base price? List the room's name and the base price.,SELECT ?T1_roomname ?T1_baseprice WHERE { ?T1 a :rooms . ?T1 :rooms\#roomname ?T1_roomname . ?T1 :rooms\#baseprice ?T1_baseprice . ?T1 :rooms\#baseprice ?T1_baseprice .        }   ORDER BY ASC (?T1_baseprice) LIMIT 1
inn_1,What is the decor of room Recluse and defiance?,SELECT ?T1_decor WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#roomname ?T1_roomname . FILTER(?T1_roomname = 'Recluse && defiance') .        }
inn_1,What is the average base price of different bed type? List bed type and average base price.,SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_184 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#baseprice ?T1_baseprice .        } GROUP BY ?T1_bedtype
inn_1,"For each bed type, find the average base price of different bed type.",SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_96 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#bedtype ?T1_bedtype . ?T1 :rooms\#baseprice ?T1_baseprice .        } GROUP BY ?T1_bedtype
inn_1,How many people in total can stay in the modern rooms of this inn?,SELECT (sum( ?T1_maxoccupancy) as ?aggregation_T1_maxoccupancy_1 ) WHERE { ?T1 a :rooms . ?T1 :rooms\#maxoccupancy ?T1_maxoccupancy . ?T1 :rooms\#decor ?T1_decor . FILTER(?T1_decor = 'modern') .        }
inn_1,What kind of decor has the least number of reservations?,SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#decor ?T1_decor .        } GROUP BY ?T1_decor  ORDER BY ASC ((count( ?T1_decor) as ?aggregation_T1_decor_76 )) LIMIT 1
inn_1,What is the least popular kind of decor?,SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :rooms\#decor ?T1_decor . ?T1 :rooms\#decor ?T1_decor .        } GROUP BY ?T1_decor  ORDER BY ASC ((count( ?T1_decor) as ?aggregation_T1_decor_0 )) LIMIT 1
inn_1,List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reservations . ?T2 a :rooms . ?T1 :reservations\#ref-room ?T2 .  ?T2 :rooms\#maxoccupancy ?T2_maxoccupancy . FILTER(?T2_maxoccupancy = [0, 8, False]) .        }"
