kg_name,question,query
department_management,How many heads of the departments are older than 56 ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :head . ?T1 :head\#age ?T1_age . FILTER(?T1_age > 56) .        }
department_management,"List the name, born state and age of the heads of departments ordered by age.",SELECT ?T1_name ?T1_born_state ?T1_age WHERE { ?T1 a :head . ?T1 :head\#name ?T1_name . ?T1 :head\#born_state ?T1_born_state . ?T1 :head\#age ?T1_age . ?T1 :head\#age ?T1_age .        }  ORDER BY ASC (?T1_age)
department_management,"List the creation year, name and budget of each department.",SELECT ?T1_creation ?T1_name ?T1_budget_in_billions WHERE { ?T1 a :department . ?T1 :department\#creation ?T1_creation . ?T1 :department\#name ?T1_name . ?T1 :department\#budget_in_billions ?T1_budget_in_billions .        }
department_management,What are the maximum and minimum budget of the departments?,SELECT (max( ?T1_budget_in_billions) as ?aggregation_T1_budget_in_billions_186 ) (min( ?T1_budget_in_billions) as ?aggregation_T1_budget_in_billions_121 ) WHERE { ?T1 a :department . ?T1 :department\#budget_in_billions ?T1_budget_in_billions . ?T1 :department\#budget_in_billions ?T1_budget_in_billions .        }
department_management,What are the names of the states where at least 3 heads were born?,SELECT ?T1_born_state WHERE { ?T1 a :head . ?T1 :head\#born_state ?T1_born_state .        } GROUP BY ?T1_born_state   HAVING(count( *)  >= 3)
department_management,In which year were most departments established?,SELECT ?T1_creation (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\#creation ?T1_creation .        } GROUP BY ?T1_creation  ORDER BY DESC (?aggregation_all) LIMIT 1
department_management,How many acting statuses are there?,SELECT DISTINCT (count(DISTINCT ?T1_temporary_acting) as ?aggregation_T1_temporary_acting_78 ) WHERE { ?T1 a :management . ?T1 :management\#temporary_acting ?T1_temporary_acting .        }
department_management,How many departments are led by heads who are not mentioned?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\#department_id ?T1_department_id . FILTER(?T1_department_id not in (?T22_department_id)) .       {SELECT ?T22_department_id WHERE { ?T22 a :management . ?T22 :management\#department_id ?T22_department_id .        }    } }
department_management,What are the distinct ages of the heads who are acting?,SELECT DISTINCT ?T1_age WHERE { ?T1 a :head . ?T2 a :management . ?T2 :management\#ref-head_id ?T1 .  ?T1 :head\#age ?T1_age . ?T2 :management\#temporary_acting ?T2_temporary_acting . FILTER(?T2_temporary_acting = 'Yes') .        }
department_management,List the states where both the secretary of 'Treasury' department and the secretary of 'Homeland Security' were born.,SELECT DISTINCT ?T1_born_state WHERE { ?T1 a :head . ?T13 a :management . ?T13 :management\#ref-head_id ?T1 .  ?T1 :head\#born_state ?T1_born_state . ?T2 :department\#name ?T2_name . ?T2 a :department . ?T13 :management\#ref-department_id ?T2 .  ?T1 :head\#born_state ?T1_born_state . ?T2 :department\#name ?T2_name . FILTER(?T2_name = 'Treasury') . FILTER (?T1_born_state in (?T3_born_state)) .   ?T3 a :head . ?T15 a :management . ?T15 :management\#ref-head_id ?T3 .  ?T3 :head\#born_state ?T3_born_state . ?T4 :department\#name ?T4_name . ?T4 a :department . ?T15 :management\#ref-department_id ?T4 .  ?T3 :head\#born_state ?T3_born_state . ?T4 :department\#name ?T4_name .  FILTER(?T4_name = 'Homeland Security') .             }
department_management,"Which department has more than 1 head at a time? List the id, name and the number of heads.",SELECT ?T1_department_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :management . ?T2 :management\#ref-department_id ?T1 .  ?T1 :department\#department_id ?T1_department_id . ?T1 :department\#name ?T1_name .        } GROUP BY ?T1_department_id ?T1_name   HAVING(count( *)  > 1)
department_management,Which head's name has the substring 'Ha'? List the id and name.,"SELECT ?T1_head_id ?T1_name WHERE { ?T1 a :head . ?T1 :head\#head_id ?T1_head_id . ?T1 :head\#name ?T1_name . ?T1 :head\#name ?T1_name . FILTER(contains (?T1_name, 'Ha')) .        }"
farm,How many farms are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :farm .        }
farm,List the total number of horses on farms in ascending order.,SELECT ?T1_total_horses WHERE { ?T1 a :farm . ?T1 :farm\#total_horses ?T1_total_horses . ?T1 :farm\#total_horses ?T1_total_horses .        }  ORDER BY ASC (?T1_total_horses)
farm,What are the hosts of competitions whose theme is not 'Aliens'?,SELECT ?T1_hosts WHERE { ?T1 a :farm_competition . ?T1 :farm_competition\#hosts ?T1_hosts . ?T1 :farm_competition\#theme ?T1_theme . FILTER(?T1_theme != 'Aliens') .        }
farm,Return the hosts of competitions for which the theme is not Aliens?,SELECT ?T1_hosts WHERE { ?T1 a :farm_competition . ?T1 :farm_competition\#hosts ?T1_hosts . ?T1 :farm_competition\#theme ?T1_theme . FILTER(?T1_theme != 'Aliens') .        }
farm,"Return the themes of farm competitions, sorted by year ascending.",SELECT ?T1_theme WHERE { ?T1 a :farm_competition . ?T1 :farm_competition\#theme ?T1_theme . ?T1 :farm_competition\#year ?T1_year .        }  ORDER BY ASC (?T1_year)
farm,Give the average number of working horses on farms with more than 5000 total horses.,SELECT (avg( ?T1_working_horses) as ?aggregation_T1_working_horses_45 ) WHERE { ?T1 a :farm . ?T1 :farm\#working_horses ?T1_working_horses . ?T1 :farm\#total_horses ?T1_total_horses . FILTER(?T1_total_horses > 5000) .        }
farm,What are the maximum and minimum number of cows across all farms.,SELECT (max( ?T1_cows) as ?aggregation_T1_cows_56 ) (min( ?T1_cows) as ?aggregation_T1_cows_140 ) WHERE { ?T1 a :farm . ?T1 :farm\#cows ?T1_cows . ?T1 :farm\#cows ?T1_cows .        }
farm,Return the maximum and minimum number of cows across all farms.,SELECT (max( ?T1_cows) as ?aggregation_T1_cows_1 ) (min( ?T1_cows) as ?aggregation_T1_cows_143 ) WHERE { ?T1 a :farm . ?T1 :farm\#cows ?T1_cows . ?T1 :farm\#cows ?T1_cows .        }
farm,How many different statuses do cities have?,SELECT DISTINCT (count(DISTINCT ?T1_status) as ?aggregation_T1_status_91 ) WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status .        }
farm,Count the number of different statuses.,SELECT DISTINCT (count(DISTINCT ?T1_status) as ?aggregation_T1_status_122 ) WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status .        }
farm,List official names of cities in descending order of population.,SELECT ?T1_official_name WHERE { ?T1 a :city . ?T1 :city\#official_name ?T1_official_name . ?T1 :city\#population ?T1_population .        }  ORDER BY DESC (?T1_population)
farm,List the official name and status of the city with the largest population.,SELECT ?T1_official_name ?T1_status WHERE { ?T1 a :city . ?T1 :city\#official_name ?T1_official_name . ?T1 :city\#status ?T1_status . ?T1 :city\#population ?T1_population .        }   ORDER BY DESC (?T1_population) LIMIT 1
farm,What is the official name and status of the city with the most residents?,SELECT ?T1_official_name ?T1_status WHERE { ?T1 a :city . ?T1 :city\#official_name ?T1_official_name . ?T1 :city\#status ?T1_status . ?T1 :city\#population ?T1_population .        }   ORDER BY DESC (?T1_population) LIMIT 1
farm,Show the years and the official names of the host cities of competitions.,SELECT ?T1_year ?T2_official_name WHERE { ?T1 a :farm_competition . ?T2 a :city . ?T1 :farm_competition\#ref-host_city_id ?T2 .  ?T1 :farm_competition\#year ?T1_year . ?T2 :city\#official_name ?T2_official_name .        }
farm,Show the official names of the cities that have hosted more than one competition.,SELECT ?T1_official_name WHERE { ?T1 a :city . ?T2 a :farm_competition . ?T2 :farm_competition\#ref-host_city_id ?T1 .  ?T1 :city\#official_name ?T1_official_name .        } GROUP BY ?T1_official_name   HAVING(count( *)  > 1)
farm,Show the status of the city that has hosted the greatest number of competitions.,SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :farm_competition . ?T2 :farm_competition\#ref-host_city_id ?T1 .  ?T1 :city\#status ?T1_status .        } GROUP BY ?T1_status  ORDER BY DESC (?aggregation_all) LIMIT 1
farm,What is the status of the city that has hosted the most competitions?,SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :farm_competition . ?T2 :farm_competition\#ref-host_city_id ?T1 .  ?T1 :city\#status ?T1_status .        } GROUP BY ?T1_status  ORDER BY DESC (?aggregation_all) LIMIT 1
farm,Please show the themes of competitions with host cities having populations larger than 1000.,SELECT ?T1_theme WHERE { ?T1 a :farm_competition . ?T2 a :city . ?T1 :farm_competition\#ref-host_city_id ?T2 .  ?T1 :farm_competition\#theme ?T1_theme . ?T2 :city\#population ?T2_population . FILTER(?T2_population > 1000) .        }
farm,Please show the different statuses of cities and the average population of cities with each status.,SELECT ?T1_status (avg( ?T1_population) as ?aggregation_T1_population_101 ) WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status . ?T1 :city\#population ?T1_population .        } GROUP BY ?T1_status
farm,What are the statuses and average populations of each city?,SELECT ?T1_status (avg( ?T1_population) as ?aggregation_T1_population_158 ) WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status . ?T1 :city\#population ?T1_population .        } GROUP BY ?T1_status
farm,"Please show the different statuses, ordered by the number of cities that have each.",SELECT ?T1_status WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status .        } GROUP BY ?T1_status ORDER BY ASC ((count( *) as ?aggregation_all))
farm,List the most common type of Status across cities.,SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status .        } GROUP BY ?T1_status  ORDER BY DESC (?aggregation_all) LIMIT 1
farm,What is the most common status across all cities?,SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status .        } GROUP BY ?T1_status  ORDER BY DESC (?aggregation_all) LIMIT 1
farm,List the official names of cities that have not held any competition.,SELECT ?T1_official_name WHERE { ?T1 a :city . ?T1 :city\#official_name ?T1_official_name . ?T1 :city\#city_id ?T1_city_id . FILTER(?T1_city_id not in (?T22_host_city_id)) .       {SELECT ?T22_host_city_id WHERE { ?T22 a :farm_competition . ?T22 :farm_competition\#host_city_id ?T22_host_city_id .        }    } }
farm,Show the status shared by cities with population bigger than 1500 and smaller than 500.,SELECT DISTINCT ?T1_status WHERE { ?T1 a :city . ?T1 :city\#status ?T1_status . ?T1 :city\#population ?T1_population . FILTER(?T1_population > 1500) . FILTER (?T1_status in (?T2_status)) .   ?T2 a :city . ?T2 :city\#status ?T2_status . ?T2 :city\#population ?T2_population .  FILTER(?T2_population < 500) .             }
farm,Find the official names of cities with population bigger than 1500 or smaller than 500.,SELECT ?T1_official_name WHERE { ?T1 a :city . ?T1 :city\#official_name ?T1_official_name . ?T1 :city\#population ?T1_population . ?T1 :city\#population ?T1_population . FILTER(?T1_population > 1500 || ?T1_population < 500) .        }
farm,Show the census ranking of cities whose status are not 'Village'.,SELECT ?T1_census_ranking WHERE { ?T1 a :city . ?T1 :city\#census_ranking ?T1_census_ranking . ?T1 :city\#status ?T1_status . FILTER(?T1_status != 'Village') .        }
farm,What are the census rankings of cities that do not have the status 'Village'?,SELECT ?T1_census_ranking WHERE { ?T1 a :city . ?T1 :city\#census_ranking ?T1_census_ranking . ?T1 :city\#status ?T1_status . FILTER(?T1_status != 'Village') .        }
student_assessment,which course has most number of registered students?,SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\#ref-course_id ?T1 .  ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1
student_assessment,What is the name of the course with the most registered students?,SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\#ref-course_id ?T1 .  ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1
student_assessment,what is id of students who registered some courses but the least number of courses in these students?,SELECT ?T1_student_id (count( *) as ?aggregation_all) WHERE { ?T1 a :student_course_registrations . ?T1 :student_course_registrations\#student_id ?T1_student_id .        } GROUP BY ?T1_student_id  ORDER BY ASC (?aggregation_all) LIMIT 1
student_assessment,What are the ids of the students who registered for some courses but had the least number of courses for all students?,SELECT ?T1_student_id (count( *) as ?aggregation_all) WHERE { ?T1 a :student_course_registrations . ?T1 :student_course_registrations\#student_id ?T1_student_id .        } GROUP BY ?T1_student_id  ORDER BY ASC (?aggregation_all) LIMIT 1
student_assessment,what are the first name and last name of all candidates?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :people . ?T1 :people\#first_name ?T1_first_name . ?T1 :people\#last_name ?T1_last_name .        }
student_assessment,What are the first and last names of all the candidates?,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :people . ?T1 :people\#first_name ?T1_first_name . ?T1 :people\#last_name ?T1_last_name .        }
student_assessment,List the id of students who never attends courses?,SELECT ?T1_student_id WHERE { ?T1 a :students . ?T1 :students\#student_id ?T1_student_id . ?T1 :students\#student_id ?T1_student_id . FILTER(?T1_student_id not in (?T22_student_id)) .       {SELECT ?T22_student_id WHERE { ?T22 a :student_course_attendance . ?T22 :student_course_attendance\#student_id ?T22_student_id .        }    } }
student_assessment,What are the  ids of every student who has never attended a course?,SELECT ?T1_student_id WHERE { ?T1 a :students . ?T1 :students\#student_id ?T1_student_id . ?T1 :students\#student_id ?T1_student_id . FILTER(?T1_student_id not in (?T22_student_id)) .       {SELECT ?T22_student_id WHERE { ?T22 a :student_course_attendance . ?T22 :student_course_attendance\#student_id ?T22_student_id .        }    } }
student_assessment,List the id of students who attended some courses?,SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T1 :student_course_attendance\#student_id ?T1_student_id .        }
student_assessment,What are the ids of all students who have attended at least one course?,SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T1 :student_course_attendance\#student_id ?T1_student_id .        }
student_assessment,What is detail of the student who most recently registered course?,SELECT ?T1_student_details WHERE { ?T1 a :students . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\#ref-student_id ?T1 .  ?T1 :students\#student_details ?T1_student_details . ?T2 :student_course_registrations\#registration_date ?T2_registration_date .        }   ORDER BY DESC (?T2_registration_date) LIMIT 1
student_assessment,How many students attend course English?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student_course_attendance . ?T13 a :student_course_registrations . ?T1 :student_course_attendance\#ref-student_id ?T13 .  ?T2 :courses\#course_name ?T2_course_name . ?T2 a :courses . ?T13 :student_course_registrations\#ref-course_id ?T2 .  ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'English') .        }
student_assessment,How many students are attending English courses?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student_course_attendance . ?T13 a :student_course_registrations . ?T1 :student_course_attendance\#ref-student_id ?T13 .  ?T2 :courses\#course_name ?T2_course_name . ?T2 a :courses . ?T13 :student_course_registrations\#ref-course_id ?T2 .  ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'English') .        }
student_assessment,How many courses do the student whose id is 171 attend?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :student_course_registrations . ?T2 a :student_course_attendance . ?T2 :student_course_attendance\#ref-student_id ?T13 .  ?T2 :student_course_attendance\#student_id ?T2_student_id . FILTER(?T2_student_id = 171) .        }
student_assessment,How many courses does the student with id 171 actually attend?,SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :student_course_registrations . ?T2 a :student_course_attendance . ?T2 :student_course_attendance\#ref-student_id ?T13 .  ?T2 :student_course_attendance\#student_id ?T2_student_id . FILTER(?T2_student_id = 171) .        }
student_assessment,Find id of the candidate whose email is stanley.monahan@example.org?,SELECT ?T1_candidate_id WHERE { ?T1 a :candidates . ?T2 a :people . ?T1 :candidates\#ref-candidate_id ?T2 .  ?T1 :candidates\#candidate_id ?T1_candidate_id . ?T2 :people\#email_address ?T2_email_address . FILTER(?T2_email_address = 'stanley.monahan@example.org') .        }
student_assessment,Find id of the candidate who most recently accessed the course?,SELECT ?T1_candidate_id WHERE { ?T1 a :candidate_assessments . ?T1 :candidate_assessments\#candidate_id ?T1_candidate_id . ?T1 :candidate_assessments\#assessment_date ?T1_assessment_date .        }   ORDER BY DESC (?T1_assessment_date) LIMIT 1
student_assessment,What is the id of the candidate who most recently accessed the course?,SELECT ?T1_candidate_id WHERE { ?T1 a :candidate_assessments . ?T1 :candidate_assessments\#candidate_id ?T1_candidate_id . ?T1 :candidate_assessments\#assessment_date ?T1_assessment_date .        }   ORDER BY DESC (?T1_assessment_date) LIMIT 1
student_assessment,What is detail of the student who registered the most number of courses?,SELECT ?T1_student_details (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\#ref-student_id ?T1 .  ?T1 :students\#student_details ?T1_student_details .        } GROUP BY ?T1_student_details  ORDER BY DESC (?aggregation_all) LIMIT 1
student_assessment,What are the details of the student who registered for the most number of courses?,SELECT ?T1_student_details (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T2 a :student_course_registrations . ?T2 :student_course_registrations\#ref-student_id ?T1 .  ?T1 :students\#student_details ?T1_student_details .        } GROUP BY ?T1_student_details  ORDER BY DESC (?aggregation_all) LIMIT 1
student_assessment,How many registed students do each course have? List course name and the number of their registered students?,SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T13 a :student_course_registrations . ?T13 :student_course_registrations\#ref-course_id ?T1 .  ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name
student_assessment,"For each course id, how many students are registered and what are the course names?",SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T13 a :student_course_registrations . ?T13 :student_course_registrations\#ref-course_id ?T1 .  ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name
student_assessment,Find id of candidates whose assessment code is 'Pass'?,SELECT ?T1_candidate_id WHERE { ?T1 a :candidate_assessments . ?T1 :candidate_assessments\#candidate_id ?T1_candidate_id . ?T1 :candidate_assessments\#asessment_outcome_code ?T1_asessment_outcome_code . FILTER(?T1_asessment_outcome_code = 'Pass') .        }
student_assessment,What are the ids of the candidates that have an outcome code of Pass?,SELECT ?T1_candidate_id WHERE { ?T1 a :candidate_assessments . ?T1 :candidate_assessments\#candidate_id ?T1_candidate_id . ?T1 :candidate_assessments\#asessment_outcome_code ?T1_asessment_outcome_code . FILTER(?T1_asessment_outcome_code = 'Pass') .        }
student_assessment,Find the cell mobile number of the candidates whose assessment code is 'Fail'?,SELECT ?T1_cell_mobile_number WHERE { ?T1 a :people . ?T13 a :candidates . ?T13 :candidates\#ref-candidate_id ?T1 .  ?T1 :people\#cell_mobile_number ?T1_cell_mobile_number . ?T2 :candidate_assessments\#asessment_outcome_code ?T2_asessment_outcome_code . ?T2 a :candidate_assessments . ?T2 :candidate_assessments\#ref-candidate_id ?T13 .  ?T1 :people\#cell_mobile_number ?T1_cell_mobile_number . ?T2 :candidate_assessments\#asessment_outcome_code ?T2_asessment_outcome_code . FILTER(?T2_asessment_outcome_code = 'Fail') .        }
student_assessment,What are the cell phone numbers of the candidates that received an assessment code of 'Fail'?,SELECT ?T1_cell_mobile_number WHERE { ?T1 a :people . ?T13 a :candidates . ?T13 :candidates\#ref-candidate_id ?T1 .  ?T1 :people\#cell_mobile_number ?T1_cell_mobile_number . ?T2 :candidate_assessments\#asessment_outcome_code ?T2_asessment_outcome_code . ?T2 a :candidate_assessments . ?T2 :candidate_assessments\#ref-candidate_id ?T13 .  ?T1 :people\#cell_mobile_number ?T1_cell_mobile_number . ?T2 :candidate_assessments\#asessment_outcome_code ?T2_asessment_outcome_code . FILTER(?T2_asessment_outcome_code = 'Fail') .        }
student_assessment,What are the id of students who registered course 301?,SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T1 :student_course_attendance\#student_id ?T1_student_id . ?T1 :student_course_attendance\#course_id ?T1_course_id . FILTER(?T1_course_id = 301) .        }
student_assessment,What are the ids of the students who registered for course 301?,SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T1 :student_course_attendance\#student_id ?T1_student_id . ?T1 :student_course_attendance\#course_id ?T1_course_id . FILTER(?T1_course_id = 301) .        }
student_assessment,What is the id of the student who most recently registered course 301?,SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T1 :student_course_attendance\#student_id ?T1_student_id . ?T1 :student_course_attendance\#date_of_attendance ?T1_date_of_attendance . ?T1 :student_course_attendance\#course_id ?T1_course_id . FILTER(?T1_course_id = 301) .        }   ORDER BY DESC (?T1_date_of_attendance) LIMIT 1
student_assessment,Find distinct cities of addresses of people?,SELECT DISTINCT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city .        }
student_assessment,What are the different cities where people live?,SELECT DISTINCT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city .        }
student_assessment,Find distinct cities of address of students?,SELECT DISTINCT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city .        }
student_assessment,What are the different cities where students live?,SELECT DISTINCT ?T1_city WHERE { ?T1 a :addresses . ?T1 :addresses\#city ?T1_city .        }
student_assessment,List the names of courses in alphabetical order?,SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T1 :courses\#course_name ?T1_course_name . ?T1 :courses\#course_name ?T1_course_name .        }  ORDER BY ASC (?T1_course_name)
student_assessment,What are the names of the courses in alphabetical order?,SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T1 :courses\#course_name ?T1_course_name . ?T1 :courses\#course_name ?T1_course_name .        }  ORDER BY ASC (?T1_course_name)
student_assessment,List the first names of people in alphabetical order?,SELECT ?T1_first_name WHERE { ?T1 a :people . ?T1 :people\#first_name ?T1_first_name . ?T1 :people\#first_name ?T1_first_name .        }  ORDER BY ASC (?T1_first_name)
student_assessment,What are the first names of the people in alphabetical order?,SELECT ?T1_first_name WHERE { ?T1 a :people . ?T1 :people\#first_name ?T1_first_name . ?T1 :people\#first_name ?T1_first_name .        }  ORDER BY ASC (?T1_first_name)
student_assessment,What are the id of students who registered courses or attended courses?,SELECT distinct?col1 WHERE { { SELECT (?T1_student_id as ?col1) WHERE { ?T1 a :student_course_registrations . ?T1 :student_course_registrations\#student_id ?T1_student_id .   }} UNION {SELECT (?T1_student_id as ?col1) WHERE { ?T1 a :student_course_attendance . ?T1 :student_course_attendance\#student_id ?T1_student_id .        }      } }
student_assessment,List the id of students who registered course statistics in the order of registration date.,SELECT ?T1_student_id WHERE { ?T1 a :student_course_registrations . ?T2 a :courses . ?T1 :student_course_registrations\#ref-course_id ?T2 .  ?T1 :student_course_registrations\#student_id ?T1_student_id . ?T1 :student_course_registrations\#registration_date ?T1_registration_date . ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'statistics') .        }  ORDER BY ASC (?T1_registration_date)
student_assessment,List the id of students who attended  statistics courses in the order of attendance date.,SELECT ?T1_student_id WHERE { ?T1 a :student_course_attendance . ?T13 a :student_course_registrations . ?T1 :student_course_attendance\#ref-student_id ?T13 .  ?T1 :student_course_attendance\#student_id ?T1_student_id . ?T1 :student_course_attendance\#date_of_attendance ?T1_date_of_attendance . ?T2 :courses\#course_name ?T2_course_name . ?T2 a :courses . ?T13 :student_course_registrations\#ref-course_id ?T2 .  ?T1 :student_course_attendance\#student_id ?T1_student_id . ?T1 :student_course_attendance\#date_of_attendance ?T1_date_of_attendance . ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'statistics') .        }  ORDER BY ASC (?T1_date_of_attendance)
bike_1,Give me the dates when the max temperature was higher than 85.,SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . FILTER(?T1_max_temperature_f > 85) .        }
bike_1,What are the dates with a maximum temperature higher than 85?,SELECT ?T1_date WHERE { ?T1 a :weather . ?T1 :weather\#date ?T1_date . ?T1 :weather\#max_temperature_f ?T1_max_temperature_f . FILTER(?T1_max_temperature_f > 85) .        }
bike_1,What are the names of stations that have latitude lower than 37.5?,SELECT ?T1_name WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#lat ?T1_lat . FILTER(?T1_lat < 37.5) .        }
bike_1,What are the names of all stations with a latitude smaller than 37.5?,SELECT ?T1_name WHERE { ?T1 a :station . ?T1 :station\#name ?T1_name . ?T1 :station\#lat ?T1_lat . FILTER(?T1_lat < 37.5) .        }
bike_1,"For each city, return the highest latitude among its stations.",SELECT ?T1_city (max( ?T1_lat) as ?aggregation_T1_lat_58 ) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city . ?T1 :station\#lat ?T1_lat .        } GROUP BY ?T1_city
bike_1,"For each city, what is the highest latitude for its stations?",SELECT ?T1_city (max( ?T1_lat) as ?aggregation_T1_lat_191 ) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city . ?T1 :station\#lat ?T1_lat .        } GROUP BY ?T1_city
bike_1,Give me the start station and end station for the trips with the three oldest id.,SELECT ?T1_start_station_name ?T1_end_station_name WHERE { ?T1 a :trip . ?T1 :trip\#start_station_name ?T1_start_station_name . ?T1 :trip\#end_station_name ?T1_end_station_name . ?T1 :trip\#id ?T1_id .        }   ORDER BY ASC (?T1_id) LIMIT 1
bike_1,What is the station station and end station for the trips with the three smallest ids?,SELECT ?T1_start_station_name ?T1_end_station_name WHERE { ?T1 a :trip . ?T1 :trip\#start_station_name ?T1_start_station_name . ?T1 :trip\#end_station_name ?T1_end_station_name . ?T1 :trip\#id ?T1_id .        }   ORDER BY ASC (?T1_id) LIMIT 1
bike_1,What is the average latitude and longitude of stations located in San Jose city?,SELECT (avg( ?T1_lat) as ?aggregation_T1_lat_75 ) (avg( ?T1_long) as ?aggregation_T1_long_100 ) WHERE { ?T1 a :station . ?T1 :station\#lat ?T1_lat . ?T1 :station\#long ?T1_long . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'San Jose') .        }
bike_1,What is the average latitude and longitude in San Jose?,SELECT (avg( ?T1_lat) as ?aggregation_T1_lat_10 ) (avg( ?T1_long) as ?aggregation_T1_long_163 ) WHERE { ?T1 a :station . ?T1 :station\#lat ?T1_lat . ?T1 :station\#long ?T1_long . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'San Jose') .        }
bike_1,What is the id of the trip that has the shortest duration?,SELECT ?T1_id WHERE { ?T1 a :trip . ?T1 :trip\#id ?T1_id . ?T1 :trip\#duration ?T1_duration .        }   ORDER BY ASC (?T1_duration) LIMIT 1
bike_1,What is the id of the shortest trip?,SELECT ?T1_id WHERE { ?T1 a :trip . ?T1 :trip\#id ?T1_id . ?T1 :trip\#duration ?T1_duration .        }   ORDER BY ASC (?T1_duration) LIMIT 1
bike_1,What is the total and maximum duration of trips with bike id 636?,SELECT (sum( ?T1_duration) as ?aggregation_T1_duration_74 ) (max( ?T1_duration) as ?aggregation_T1_duration_0 ) WHERE { ?T1 a :trip . ?T1 :trip\#duration ?T1_duration . ?T1 :trip\#duration ?T1_duration . ?T1 :trip\#bike_id ?T1_bike_id . FILTER(?T1_bike_id = 636) .        }
bike_1,What is the total and maximum duration for all trips with the bike id 636?,SELECT (sum( ?T1_duration) as ?aggregation_T1_duration_140 ) (max( ?T1_duration) as ?aggregation_T1_duration_51 ) WHERE { ?T1 a :trip . ?T1 :trip\#duration ?T1_duration . ?T1 :trip\#duration ?T1_duration . ?T1 :trip\#bike_id ?T1_bike_id . FILTER(?T1_bike_id = 636) .        }
bike_1,"For each zip code, return the average mean temperature of August there.","SELECT ?T1_zip_code (avg( ?T1_mean_temperature_f) as ?aggregation_T1_mean_temperature_f_127 ) WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_temperature_f ?T1_mean_temperature_f . ?T1 :weather\#date ?T1_date . FILTER(contains (?T1_date, '8/')) .        } GROUP BY ?T1_zip_code"
bike_1,"For each zip code, what is the average mean temperature for all dates that start with '8'?","SELECT ?T1_zip_code (avg( ?T1_mean_temperature_f) as ?aggregation_T1_mean_temperature_f_69 ) WHERE { ?T1 a :weather . ?T1 :weather\#zip_code ?T1_zip_code . ?T1 :weather\#mean_temperature_f ?T1_mean_temperature_f . ?T1 :weather\#date ?T1_date . FILTER(contains (?T1_date, '8/')) .        } GROUP BY ?T1_zip_code"
bike_1,"From the trip record, find the number of unique bikes.",SELECT DISTINCT (count(DISTINCT ?T1_bike_id) as ?aggregation_T1_bike_id_124 ) WHERE { ?T1 a :trip . ?T1 :trip\#bike_id ?T1_bike_id .        }
bike_1,How many different bike ids are there?,SELECT DISTINCT (count(DISTINCT ?T1_bike_id) as ?aggregation_T1_bike_id_11 ) WHERE { ?T1 a :trip . ?T1 :trip\#bike_id ?T1_bike_id .        }
bike_1,What is the number of distinct cities the stations are located at?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_21 ) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city .        }
bike_1,How many different cities have these stations?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_188 ) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city .        }
bike_1,How many stations does Mountain View city has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'Mountain View') .        }
bike_1,How many stations are in Mountain View?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :station . ?T1 :station\#city ?T1_city . FILTER(?T1_city = 'Mountain View') .        }
