kg_name,question,query
department_store,Return the staff ids and genders for any staff with the title Department Manager.,SELECT ?T1_staff_id ?T1_staff_gender WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\#ref-staff_id ?T1 .  ?T1 :staff\#staff_id ?T1_staff_id . ?T1 :staff\#staff_gender ?T1_staff_gender . ?T2 :staff_department_assignments\#job_title_code ?T2_job_title_code . FILTER(?T2_job_title_code = 'Department Manager') .        }
department_store,"For each payment method, return how many customers use it.",SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code
department_store,How many customers use each payment method?,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customers\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code
department_store,What is the id of the product that was ordered the most often?,SELECT ?T1_product_id (count( *) as ?aggregation_all) WHERE { ?T1 a :order_items . ?T1 :order_items\#product_id ?T1_product_id .        } GROUP BY ?T1_product_id  ORDER BY DESC (?aggregation_all) LIMIT 1
department_store,"Return the name, phone number and email address for the customer with the most orders.",SELECT ?T1_customer_name (count( *) as ?aggregation_all) ?T1_customer_phone ?T1_customer_email WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_phone ?T1_customer_phone . ?T1 :customers\#customer_email ?T1_customer_email .        } GROUP BY ?T1_customer_name ?T1_customer_phone ?T1_customer_email  ORDER BY DESC (?aggregation_all) LIMIT 1
department_store,What is the average price for each type of product?,SELECT ?T1_product_type_code (avg( ?T1_product_price) as ?aggregation_T1_product_price_20 ) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_type_code
department_store,Return the average price for each product type.,SELECT ?T1_product_type_code (avg( ?T1_product_price) as ?aggregation_T1_product_price_172 ) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_type_code
department_store,How many department stores does the store chain South have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department_stores . ?T2 a :department_store_chain . ?T1 :department_stores\#ref-dept_store_chain_id ?T2 .  ?T2 :department_store_chain\#dept_store_chain_name ?T2_dept_store_chain_name . FILTER(?T2_dept_store_chain_name = 'South') .        }
department_store,What is the name and job title of the staff who was assigned the latest?,SELECT ?T1_staff_name ?T2_job_title_code WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\#ref-staff_id ?T1 .  ?T1 :staff\#staff_name ?T1_staff_name . ?T2 :staff_department_assignments\#job_title_code ?T2_job_title_code . ?T2 :staff_department_assignments\#date_assigned_to ?T2_date_assigned_to .        }   ORDER BY DESC (?T2_date_assigned_to) LIMIT 1
department_store,"Give me the product type, name and price for all the products supplied by supplier id 3.",SELECT ?T1_product_type_code ?T1_product_name ?T1_product_price WHERE { ?T1 a :products . ?T2 a :product_suppliers . ?T2 :product_suppliers\#ref-product_id ?T1 .  ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price . ?T2 :product_suppliers\#supplier_id ?T2_supplier_id . FILTER(?T2_supplier_id = 3) .        }
department_store,"Return the distinct name of customers whose order status is Pending, in the order of customer id.",SELECT DISTINCT ?T1_customer_name ?T2_customer_id WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :customer_orders\#customer_id ?T2_customer_id . ?T2 :customer_orders\#customer_id ?T2_customer_id . ?T2 :customer_orders\#order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'Pending') .        }  ORDER BY ASC (?T2_customer_id)
department_store,Find the name and address of the customers who have both New and Pending orders.,SELECT DISTINCT ?T1_customer_name ?T1_customer_address WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_address ?T1_customer_address . ?T2 :customer_orders\#order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'New') . FILTER (?T1_customer_name in (?T3_customer_name)) . FILTER (?T1_customer_address in (?T3_customer_address)) .   ?T3 a :customers . ?T4 a :customer_orders . ?T4 :customer_orders\#ref-customer_id ?T3 .  ?T3 :customers\#customer_name ?T3_customer_name . ?T3 :customers\#customer_address ?T3_customer_address . ?T4 :customer_orders\#order_status_code ?T4_order_status_code .  FILTER(?T4_order_status_code = 'Pending') .             }
department_store,Return ids of all the products that are supplied by supplier id 2 and are more expensive than the average price of all products.,SELECT ?T1_product_id WHERE { ?T1 a :product_suppliers . ?T2 a :products . ?T1 :product_suppliers\#ref-product_id ?T2 .  ?T1 :product_suppliers\#product_id ?T1_product_id . ?T1 :product_suppliers\#supplier_id ?T1_supplier_id . ?T2 :products\#product_price ?T2_product_price . FILTER(?T1_supplier_id = 2 && ?T2_product_price > (?aggregation_T23_product_price_182)) .       {SELECT (avg( ?T23_product_price) as ?aggregation_T23_product_price_182 ) WHERE { ?T23 a :products . ?T23 :products\#product_price ?T23_product_price .        }    } }
department_store,Return the ids of the two department store chains with the most department stores.,SELECT ?T1_dept_store_chain_id (count( *) as ?aggregation_all) WHERE { ?T1 a :department_stores . ?T1 :department_stores\#dept_store_chain_id ?T1_dept_store_chain_id .        } GROUP BY ?T1_dept_store_chain_id  ORDER BY DESC (?aggregation_all) LIMIT 1
department_store,What is the id of the department with the least number of staff?,SELECT ?T1_department_id (count( *) as ?aggregation_all) WHERE { ?T1 a :staff_department_assignments . ?T1 :staff_department_assignments\#department_id ?T1_department_id .        } GROUP BY ?T1_department_id  ORDER BY ASC (?aggregation_all) LIMIT 1
department_store,"For each product type, return the maximum and minimum price.",SELECT ?T1_product_type_code (max( ?T1_product_price) as ?aggregation_T1_product_price_30 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_84 ) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_type_code
department_store,What are the maximum and minimum product prices for each product type?,SELECT ?T1_product_type_code (max( ?T1_product_price) as ?aggregation_T1_product_price_19 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_136 ) WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price .        } GROUP BY ?T1_product_type_code
department_store,Find the product type whose average price is higher than the average price of all products.,SELECT ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_price ?T1_product_price .       {SELECT (avg( ?T22_product_price) as ?aggregation_T22_product_price_145 ) WHERE { ?T22 a :products . ?T22 :products\#product_price ?T22_product_price .        }    } } GROUP BY ?T1_product_type_code   HAVING(avg( ?T1_product_price)  > (?aggregation_T22_product_price_145))
department_store,Find the id and name of the staff who has been assigned for the shortest period.,SELECT ?T1_staff_id ?T1_staff_name WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\#ref-staff_id ?T1 .  ?T1 :staff\#staff_id ?T1_staff_id . ?T1 :staff\#staff_name ?T1_staff_name . ?T2 :staff_department_assignments\#date_assigned_to ?T2_date_assigned_to . ?T2 :staff_department_assignments\#date_assigned_from ?T2_date_assigned_from .        }   ORDER BY ASC (?T2_date_assigned_to - ?T2_date_assigned_from) LIMIT 1
department_store,Return the names and ids of all products whose price is between 600 and 700.,SELECT ?T1_product_name ?T1_product_id WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_id ?T1_product_id . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price >= 600 && ?T1_product_price <= 700) .        }
department_store,What are the names and ids of products costing between 600 and 700?,SELECT ?T1_product_name ?T1_product_id WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_id ?T1_product_id . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price >= 600 && ?T1_product_price <= 700) .        }
department_store,Find the ids of all distinct customers who made order after some orders that were Cancelled.,SELECT DISTINCT ?T1_customer_id WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\#customer_id ?T1_customer_id . ?T1 :customer_orders\#order_date ?T1_order_date . FILTER(?T1_order_date > (?T22_order_status_code)) .       {SELECT (min( ?T22_order_date) as ?aggregation_T22_order_date_37 ) WHERE { ?T22 a :customer_orders . ?T22 :customer_orders\#order_date ?T22_order_date . ?T22 :customer_orders\#order_status_code ?T22_order_status_code . FILTER(?T22_order_status_code = 'Cancelled') .        }    } }
department_store,Return the id of the staff whose Staff Department Assignment was earlier than that of any Clerical Staff.,SELECT ?T1_staff_id WHERE { ?T1 a :staff_department_assignments . ?T1 :staff_department_assignments\#staff_id ?T1_staff_id . ?T1 :staff_department_assignments\#date_assigned_to ?T1_date_assigned_to . FILTER(?T1_date_assigned_to < (?T22_job_title_code)) .       {SELECT (max( ?T22_date_assigned_to) as ?aggregation_T22_date_assigned_to_5 ) WHERE { ?T22 a :staff_department_assignments . ?T22 :staff_department_assignments\#date_assigned_to ?T22_date_assigned_to . ?T22 :staff_department_assignments\#job_title_code ?T22_job_title_code . FILTER(?T22_job_title_code = 'Clerical Staff') .        }    } }
department_store,What are the names and ids of customers whose address contains TN?,"SELECT ?T1_customer_name ?T1_customer_id WHERE { ?T1 a :customers . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_address ?T1_customer_address . FILTER(contains (?T1_customer_address, 'TN')) .        }"
department_store,Return the name and gender of the staff who was assigned in 2016.,"SELECT ?t1_staff_name ?t1_staff_gender WHERE {?t1 a :staff . ?t2 a :staff_department_assignments . ?t1 :staff\#ref-staff_id ?t2 . ?t2 :staff_department_assignments\#date_assigned_from ?t2_date_assigned_from . FILTER(contains(xsd:string(?t2_date_assigned_from),'2016'))}"
department_store,What are the names and genders of staff who were assigned in 2016?,"SELECT ?t1_staff_name ?t1_staff_gender WHERE {?t1 a :staff . ?t2 a :staff_department_assignments . ?t1 :staff\#ref-staff_id ?t2 . ?t2 :staff_department_assignments\#date_assigned_from ?t2_date_assigned_from . FILTER(contains(xsd:string(?t2_date_assigned_from),'2016'))}"
department_store,List the name of staff who has been assigned multiple jobs.,SELECT ?T1_staff_name WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\#ref-staff_id ?T1 .  ?T1 :staff\#staff_name ?T1_staff_name .        } GROUP BY ?T1_staff_name   HAVING(count( *)  > 1)
department_store,What are the names of staff who have been assigned multiple jobs?,SELECT ?T1_staff_name WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\#ref-staff_id ?T1 .  ?T1 :staff\#staff_name ?T1_staff_name .        } GROUP BY ?T1_staff_name   HAVING(count( *)  > 1)
department_store,List the name and phone number of all suppliers in the alphabetical order of their addresses.,SELECT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a :suppliers . ?T13 a :supplier_addresses . ?T13 :supplier_addresses\#ref-supplier_id ?T1 .  ?T1 :suppliers\#supplier_name ?T1_supplier_name . ?T1 :suppliers\#supplier_phone ?T1_supplier_phone . ?T2 :addresses\#address_details ?T2_address_details . ?T2 a :addresses . ?T13 :supplier_addresses\#ref-address_id ?T2 .  ?T1 :suppliers\#supplier_name ?T1_supplier_name . ?T1 :suppliers\#supplier_phone ?T1_supplier_phone . ?T2 :addresses\#address_details ?T2_address_details .        }  ORDER BY ASC (?T2_address_details)
department_store,What are the phone numbers of all customers and suppliers.,SELECT distinct?col1 WHERE { { SELECT (?T1_customer_phone as ?col1) WHERE { ?T1 a :customers . ?T1 :customers\#customer_phone ?T1_customer_phone .   }} UNION {SELECT (?T1_supplier_phone as ?col1) WHERE { ?T1 a :suppliers . ?T1 :suppliers\#supplier_phone ?T1_supplier_phone .        }      } }
department_store,Return the ids of all products that were ordered more than three times or supplied more than 80000.,SELECT distinct?col1 WHERE { { SELECT (?T1_product_id as ?col1) WHERE { ?T1 a :order_items . ?T1 :order_items\#product_id ?T1_product_id .   }} UNION {SELECT (?T1_product_id as ?col1) WHERE { ?T1 a :product_suppliers . ?T1 :product_suppliers\#product_id ?T1_product_id . ?T1 :product_suppliers\#total_amount_purchased ?T1_total_amount_purchased .        } GROUP BY ?T1_product_id   HAVING(sum( ?T1_total_amount_purch  > 80000)  } } GROUP BY ?T1_product_id   HAVING(count( *)  > 3)
department_store,What are the ids of all products that were either ordered more than 3 times or have a cumulative amount purchased of above 80000?,SELECT distinct?col1 WHERE { { SELECT (?T1_product_id as ?col1) WHERE { ?T1 a :order_items . ?T1 :order_items\#product_id ?T1_product_id .   }} UNION {SELECT (?T1_product_id as ?col1) WHERE { ?T1 a :product_suppliers . ?T1 :product_suppliers\#product_id ?T1_product_id . ?T1 :product_suppliers\#total_amount_purchased ?T1_total_amount_purchased .        } GROUP BY ?T1_product_id   HAVING(sum( ?T1_total_amount_purch  > 80000)  } } GROUP BY ?T1_product_id   HAVING(count( *)  > 3)
department_store,Give the ids and names of products with price lower than 600 or higher than 900.,SELECT ?T1_product_id ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_id ?T1_product_id . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price . FILTER(?T1_product_price < 600 || ?T1_product_price > 900) .        }
department_store,Find the id of suppliers whose average amount purchased for each product is above 50000 or below 30000.,SELECT ?T1_supplier_id WHERE { ?T1 a :product_suppliers . ?T1 :product_suppliers\#supplier_id ?T1_supplier_id . ?T1 :product_suppliers\#total_amount_purchased ?T1_total_amount_purchased . ?T1 :product_suppliers\#total_amount_purchased ?T1_total_amount_purchased .        } GROUP BY ?T1_supplier_id   HAVING(avg( ?T1_total_amount_purch  > 50000 (avg( ?T1_total_amount_purch  < 30000)
department_store,What are the average amount purchased and value purchased for the supplier who supplies the most products.,SELECT (avg( ?T1_total_amount_purchased) as ?aggregation_T1_total_amount_purchased_49 ) (avg( ?T1_total_value_purchased) as ?aggregation_T1_total_value_purchased_169 ) WHERE { ?T1 a :product_suppliers . ?T1 :product_suppliers\#total_amount_purchased ?T1_total_amount_purchased . ?T1 :product_suppliers\#total_value_purchased ?T1_total_value_purchased . ?T1 :product_suppliers\#supplier_id ?T1_supplier_id . FILTER(?T1_supplier_id = (?T22_supplier_id)) .       {SELECT ?T22_supplier_id (count( *) as ?aggregation_all) WHERE { ?T22 a :product_suppliers . ?T22 :product_suppliers\#supplier_id ?T22_supplier_id .        } GROUP BY ?T22_supplier_id  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
department_store,What is the largest and smallest customer codes?,SELECT (max( ?T1_customer_code) as ?aggregation_T1_customer_code_62 ) (min( ?T1_customer_code) as ?aggregation_T1_customer_code_190 ) WHERE { ?T1 a :customers . ?T1 :customers\#customer_code ?T1_customer_code . ?T1 :customers\#customer_code ?T1_customer_code .        }
department_store,Return the maximum and minimum customer codes.,SELECT (max( ?T1_customer_code) as ?aggregation_T1_customer_code_116 ) (min( ?T1_customer_code) as ?aggregation_T1_customer_code_14 ) WHERE { ?T1 a :customers . ?T1 :customers\#customer_code ?T1_customer_code . ?T1 :customers\#customer_code ?T1_customer_code .        }
department_store,List the names of all the distinct customers who bought a keyboard.,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T14 a :order_items . ?T14 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T14 :order_items\#ref-product_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'keyboard') .        }
department_store,What are the distinct names of customers who have purchased a keyboard?,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T14 a :order_items . ?T14 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T14 :order_items\#ref-product_id ?T2 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'keyboard') .        }
department_store,List the names and phone numbers of all the distinct suppliers who supply red jeans.,SELECT DISTINCT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a :suppliers . ?T13 a :product_suppliers . ?T13 :product_suppliers\#ref-supplier_id ?T1 .  ?T1 :suppliers\#supplier_name ?T1_supplier_name . ?T1 :suppliers\#supplier_phone ?T1_supplier_phone . ?T2 :products\#product_name ?T2_product_name . ?T2 a :products . ?T13 :product_suppliers\#ref-product_id ?T2 .  ?T1 :suppliers\#supplier_name ?T1_supplier_name . ?T1 :suppliers\#supplier_phone ?T1_supplier_phone . ?T2 :products\#product_name ?T2_product_name . FILTER(?T2_product_name = 'red jeans') .        }
department_store,"Give the maximum and minimum product prices for each product type, grouped and ordered by product type.",SELECT (max( ?T1_product_price) as ?aggregation_T1_product_price_122 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_177 ) ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_type_code ?T1_product_type_code . ?T1 :products\#product_type_code ?T1_product_type_code .        } GROUP BY ?T1_product_type_code ORDER BY ASC (?T1_product_type_code)
department_store,"List the order id, customer id for orders in Cancelled status, ordered by their order dates.",SELECT ?T1_order_id ?T1_customer_id WHERE { ?T1 a :customer_orders . ?T1 :customer_orders\#order_id ?T1_order_id . ?T1 :customer_orders\#customer_id ?T1_customer_id . ?T1 :customer_orders\#order_date ?T1_order_date . ?T1 :customer_orders\#order_status_code ?T1_order_status_code . FILTER(?T1_order_status_code = 'Cancelled') .        }  ORDER BY ASC (?T1_order_date)
department_store,Find the names of products that were bought by at least two distinct customers.,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T13 a :order_items . ?T13 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :customer_orders\#customer_id ?T2_customer_id . ?T2 a :customer_orders . ?T13 :order_items\#ref-order_id ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :customer_orders\#customer_id ?T2_customer_id .        } GROUP BY ?T1_product_name   HAVING(count( ?T2_customer_id) as ?aggregation_T2_customer_id_8 ) >= 2)
department_store,What are the distinct names of products purchased by at least two different customers?,SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T13 a :order_items . ?T13 :order_items\#ref-product_id ?T1 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :customer_orders\#customer_id ?T2_customer_id . ?T2 a :customer_orders . ?T13 :order_items\#ref-order_id ?T2 .  ?T1 :products\#product_name ?T1_product_name . ?T2 :customer_orders\#customer_id ?T2_customer_id .        } GROUP BY ?T1_product_name   HAVING(count( ?T2_customer_id) as ?aggregation_T2_customer_id_182 ) >= 2)
department_store,Find the names of customers who have bought by at least three distinct products.,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#product_id ?T2_product_id . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#product_id ?T2_product_id .        } GROUP BY ?T1_customer_name   HAVING(count( ?T2_product_id) as ?aggregation_T2_product_id_120 ) >= 3)
department_store,What are the distinct names of customers who have purchased at least three different products?,SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :customer_orders\#ref-customer_id ?T1 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#product_id ?T2_product_id . ?T2 a :order_items . ?T2 :order_items\#ref-order_id ?T13 .  ?T1 :customers\#customer_name ?T1_customer_name . ?T2 :order_items\#product_id ?T2_product_id .        } GROUP BY ?T1_customer_name   HAVING(count( ?T2_product_id) as ?aggregation_T2_product_id_107 ) >= 3)
department_store,Find the name and gender of the staff who has been assigned the job of Sales Person but never Clerical Staff.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_staff_name as ?col1) (?T1_staff_gender as ?col2) WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :staff_department_assignments\#ref-staff_id ?T1 .  ?T1 :staff\#staff_name ?T1_staff_name . ?T1 :staff\#staff_gender ?T1_staff_gender . ?T2 :staff_department_assignments\#job_title_code ?T2_job_title_code . FILTER(?T2_job_title_code = 'Sales Person') .   }}  MINUS {SELECT (?T3_staff_name as ?col1) (?T3_staff_gender as ?col2) WHERE { ?T3 a :staff . ?T4 a :staff_department_assignments . ?T4 :staff_department_assignments\#ref-staff_id ?T3 .  ?T3 :staff\#staff_name ?T3_staff_name . ?T3 :staff\#staff_gender ?T3_staff_gender . ?T4 :staff_department_assignments\#job_title_code ?T4_job_title_code . FILTER(?T4_job_title_code = 'Clerical Staff') .        }     } }
department_store,Find the id and name of customers whose address contains WY state and do not use credit card for payment.,"SELECT ?T1_customer_id ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customers\#customer_id ?T1_customer_id . ?T1 :customers\#customer_name ?T1_customer_name . ?T1 :customers\#customer_address ?T1_customer_address . ?T1 :customers\#payment_method_code ?T1_payment_method_code . FILTER(contains (?T1_customer_address, 'WY') && ?T1_payment_method_code != 'Credit Card') .        }"
department_store,Find the average price of all product clothes.,SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_129 ) WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_type_code ?T1_product_type_code . FILTER(?T1_product_type_code = 'Clothes') .        }
department_store,What is the average price of clothes?,SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_28 ) WHERE { ?T1 a :products . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_type_code ?T1_product_type_code . FILTER(?T1_product_type_code = 'Clothes') .        }
department_store,Find the name of the most expensive hardware product.,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_type_code ?T1_product_type_code . FILTER(?T1_product_type_code = 'Hardware') .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
department_store,What is the name of the hardware product with the greatest price?,SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :products\#product_name ?T1_product_name . ?T1 :products\#product_price ?T1_product_price . ?T1 :products\#product_type_code ?T1_product_type_code . FILTER(?T1_product_type_code = 'Hardware') .        }   ORDER BY DESC (?T1_product_price) LIMIT 1
aircraft,How many aircrafts are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft .        }
aircraft,What is the number of aircraft?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft .        }
aircraft,List the description of all aircrafts.,SELECT ?T1_description WHERE { ?T1 a :aircraft . ?T1 :aircraft\#description ?T1_description .        }
aircraft,What are the descriptions for the aircrafts?,SELECT ?T1_description WHERE { ?T1 a :aircraft . ?T1 :aircraft\#description ?T1_description .        }
aircraft,What is the average number of international passengers for an airport?,SELECT (avg( ?T1_international_passengers) as ?aggregation_T1_international_passengers_139 ) WHERE { ?T1 a :airport . ?T1 :airport\#international_passengers ?T1_international_passengers .        }
aircraft,What are the number of international and domestic passengers of the airport named London 'Heathrow'?,SELECT ?T1_international_passengers ?T1_domestic_passengers WHERE { ?T1 a :airport . ?T1 :airport\#international_passengers ?T1_international_passengers . ?T1 :airport\#domestic_passengers ?T1_domestic_passengers . ?T1 :airport\#airport_name ?T1_airport_name . FILTER(?T1_airport_name = 'London Heathrow') .        }
aircraft,What are the total number of Domestic Passengers of airports that contain the word 'London'.,"SELECT (sum( ?T1_domestic_passengers) as ?aggregation_T1_domestic_passengers_69 ) WHERE { ?T1 a :airport . ?T1 :airport\#domestic_passengers ?T1_domestic_passengers . ?T1 :airport\#airport_name ?T1_airport_name . FILTER(contains (?T1_airport_name, 'London')) .        }"
aircraft,What are the maximum and minimum number of transit passengers of all aiports.,SELECT (max( ?T1_transit_passengers) as ?aggregation_T1_transit_passengers_113 ) (min( ?T1_transit_passengers) as ?aggregation_T1_transit_passengers_11 ) WHERE { ?T1 a :airport . ?T1 :airport\#transit_passengers ?T1_transit_passengers . ?T1 :airport\#transit_passengers ?T1_transit_passengers .        }
aircraft,What are the name of pilots aged 25 or older?,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . FILTER(?T1_age >= 25) .        }
aircraft,what is the name of every pilot who is at least 25 years old?,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . FILTER(?T1_age >= 25) .        }
aircraft,List all pilot names in ascending alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
aircraft,What are the names of the pilots in alphabetical order?,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
aircraft,List names of all pilot aged 30 or younger in descending alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#name ?T1_name . ?T1 :pilot\#age ?T1_age . FILTER(?T1_age <= 30) .        }  ORDER BY DESC (?T1_name)
aircraft,Please show the names of aircrafts associated with airport with name 'London Gatwick'.,SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\#ref-aircraft_id ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft . ?T2 :airport\#airport_name ?T2_airport_name . ?T2 a :airport . ?T13 :airport_aircraft\#ref-airport_id ?T2 .  ?T1 :aircraft\#aircraft ?T1_aircraft . ?T2 :airport\#airport_name ?T2_airport_name . FILTER(?T2_airport_name = 'London Gatwick') .        }
aircraft,Please show the names and descriptions of aircrafts associated with airports that have a total number of passengers bigger than 10000000.,SELECT ?T1_aircraft ?T1_description WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\#ref-aircraft_id ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft . ?T1 :aircraft\#description ?T1_description . ?T2 :airport\#total_passengers ?T2_total_passengers . ?T2 a :airport . ?T13 :airport_aircraft\#ref-airport_id ?T2 .  ?T1 :aircraft\#aircraft ?T1_aircraft . ?T1 :aircraft\#description ?T1_description . ?T2 :airport\#total_passengers ?T2_total_passengers . FILTER(?T2_total_passengers > 10000000) .        }
aircraft,What is the average total number of passengers of airports that are associated with aircraft 'Robinson R-22'?,SELECT (avg( ?T1_total_passengers) as ?aggregation_T1_total_passengers_171 ) WHERE { ?T1 a :airport . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\#ref-airport_id ?T1 .  ?T1 :airport\#total_passengers ?T1_total_passengers . ?T2 :aircraft\#aircraft ?T2_aircraft . ?T2 a :aircraft . ?T13 :airport_aircraft\#ref-aircraft_id ?T2 .  ?T1 :airport\#total_passengers ?T1_total_passengers . ?T2 :aircraft\#aircraft ?T2_aircraft . FILTER(?T2_aircraft = 'Robinson R-22') .        }
aircraft,What is the average total number of passengers for all airports that the aircraft 'Robinson R-22' visits?,SELECT (avg( ?T1_total_passengers) as ?aggregation_T1_total_passengers_33 ) WHERE { ?T1 a :airport . ?T13 a :airport_aircraft . ?T13 :airport_aircraft\#ref-airport_id ?T1 .  ?T1 :airport\#total_passengers ?T1_total_passengers . ?T2 :aircraft\#aircraft ?T2_aircraft . ?T2 a :aircraft . ?T13 :airport_aircraft\#ref-aircraft_id ?T2 .  ?T1 :airport\#total_passengers ?T1_total_passengers . ?T2 :aircraft\#aircraft ?T2_aircraft . FILTER(?T2_aircraft = 'Robinson R-22') .        }
aircraft,Please list the location and the winning aircraft name.,SELECT ?T1_location ?T2_aircraft WHERE { ?T1 a :match . ?T2 a :aircraft . ?T1 :match\#ref-winning_aircraft ?T2 .  ?T1 :match\#location ?T1_location . ?T2 :aircraft\#aircraft ?T2_aircraft .        }
aircraft,What is the location and name of the winning aircraft?,SELECT ?T1_location ?T2_aircraft WHERE { ?T1 a :match . ?T2 a :aircraft . ?T1 :match\#ref-winning_aircraft ?T2 .  ?T1 :match\#location ?T1_location . ?T2 :aircraft\#aircraft ?T2_aircraft .        }
aircraft,List the name of the aircraft that has been named winning aircraft the most number of times.,SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft  ORDER BY DESC (?aggregation_all) LIMIT 1
