kg_name,question,query
restaurants,how many italian restaurants are in the yolo county ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#county ?T2_county . ?T1 :restaurant\#food_type ?T1_food_type . FILTER(?T2_county = 'yolo county' && ?T1_food_type = 'italian') .        }
restaurants,where can i eat french food in mountain view ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#food_type ?T2_food_type . FILTER(?T1_city_name = 'mountain view' && ?T2_food_type = 'french') .        }
restaurants,how many denny are there in the bay area ?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :restaurant . ?T2 a :geographic . ?T1 :restaurant\#ref-city_name ?T2 .  ?T2 :geographic\#region ?T2_region . ?T1 :restaurant\#name ?T1_name . FILTER(?T2_region = 'bay area' && ?T1_name = 'denny') .        }
restaurants,give me a good restaurant in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'alameda' && ?T2_rating > 2.5) .        }
restaurants,what are some good restaurants in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'alameda' && ?T2_rating > 2.5) .        }
restaurants,what is a good restaurant in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'alameda' && ?T2_rating > 2.5) .        }
restaurants,give me some good restaurants in alameda ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'alameda' && ?T2_rating > 2.5) .        }
restaurants,where is a good restaurant on buchanan in san francisco for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where are some good arabics on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good arabic restaurant on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,what are some good places for arabic on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good arabic on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good place on buchanan in san francisco for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good place on buchanan in san francisco for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where can i eat arabic food on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some good places on buchanan in san francisco for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a arabic restaurant on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good restaurant on buchanan in san francisco for arabic food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some good places for arabic on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where can i eat some good arabic food on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where is a good arabic on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where are some good places for arabic on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me a good arabic restaurant on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,give me some good arabics on buchanan in san francisco ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T1_city_name = 'san francisco' && ?T1_street_name = 'buchanan' && ?T2_food_type = 'arabic' && ?T2_rating > 2.5) .        }
restaurants,where can i eat french food in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'french') .        }
restaurants,give me some restaurants on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd') .        }
restaurants,give me a restaurant on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd') .        }
restaurants,where can we find a restaurant on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd') .        }
restaurants,where can we find some restaurants on bethel island rd in bethel island ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T1 :location\#city_name ?T1_city_name . ?T1 :location\#street_name ?T1_street_name . FILTER(?T1_city_name = 'bethel island' && ?T1_street_name = 'bethel island rd') .        }
restaurants,where is the best restaurant in the bay area for american food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_69 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,where is the best restaurant in bay area for american food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_166 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,what is the best restaurant in bay area for american food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_41 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,what is the best american restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_18 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,where is the best american restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_38 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,what is the best american in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_107 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,give me the best restaurant in the bay area for american food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_114 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,give me the best restaurant in bay area for american food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_184 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,what is the best restaurant in the bay area for american food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_24 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,where is the best american in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_21 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,give me the best american in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_146 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,give me the best american restaurant in the bay area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'bay area' && ?T2_food_type = 'american' && ?T2_rating = (?T24_food_type)) .       {SELECT (max( ?T24_rating) as ?aggregation_T24_rating_75 ) WHERE { ?T24 a :restaurant . ?T25 a :geographic . ?T24 :restaurant\#ref-city_name ?T25 .  ?T24 :restaurant\#rating ?T24_rating . ?T25 :geographic\#region ?T25_region . ?T24 :restaurant\#food_type ?T24_food_type . FILTER(?T25_region = 'bay area' && ?T24_food_type = 'american') .        }    } }
restaurants,give me a good french restaurant in the yosemite and mono lake area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'yosemite && mono lake area' && ?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
restaurants,where is a good place in the yosemite and mono lake area for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'yosemite && mono lake area' && ?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
restaurants,give me a good place in the yosemite and mono lake area for french food ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'yosemite && mono lake area' && ?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
restaurants,where is a good french restaurant in the yosemite and mono lake area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'yosemite && mono lake area' && ?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
restaurants,where can i eat some good french food in the yosemite and mono lake area ?,SELECT ?T1_house_number ?T2_name WHERE { ?T1 a :location . ?T2 a :restaurant . ?T1 :location\#ref-restaurant_id ?T2 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . ?T3 a :geographic . ?T2 :restaurant\#ref-city_name ?T3 .  ?T1 :location\#house_number ?T1_house_number . ?T2 :restaurant\#name ?T2_name . ?T3 :geographic\#region ?T3_region . ?T2 :restaurant\#food_type ?T2_food_type . ?T2 :restaurant\#rating ?T2_rating . FILTER(?T3_region = 'yosemite && mono lake area' && ?T2_food_type = 'french' && ?T2_rating > 2.5) .        }
