[
    {
        "kg_name": "cre_docs_and_epenses",
        "question": "What is the project detail for the project with document 'King Book'?",
        "query": "SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :documents . ?T2 :documents\\#ref-project_id ?T1 .  ?T1 :projects\\#project_details ?T1_project_details . ?T2 :documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'King Book') .        }"
    },
    {
        "kg_name": "wine_1",
        "question": "What are the countries for appelations with at most 3 wines?",
        "query": "SELECT ?T1_county WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\\#ref-appelation ?T1 .  ?T1 :appellations\\#county ?T1_county .        } GROUP BY ?T1_county   HAVING(count( *)  <= 3)"
    },
    {
        "kg_name": "wine_1",
        "question": "Which 3 wineries produce the most wines made from white grapes?",
        "query": "SELECT ?T1_winery (count( *) as ?aggregation_all) WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\\#ref-grape ?T2 .  ?T1 :wine\\#winery ?T1_winery . ?T2 :grapes\\#color ?T2_color . FILTER(?T2_color = 'White') .        } GROUP BY ?T1_winery  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "wine_1",
        "question": "What is the county that produces the most wines scoring higher than 90?",
        "query": "SELECT ?T1_county (count( *) as ?aggregation_all) WHERE { ?T1 a :appellations . ?T2 a :wine . ?T2 :wine\\#ref-appelation ?T1 .  ?T1 :appellations\\#county ?T1_county . ?T2 :wine\\#score ?T2_score . FILTER(?T2_score > 90) .        } GROUP BY ?T1_county  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "driving_school",
        "question": "What is the total time for all lessons taught by Janessa Sawayn?",
        "query": "SELECT (sum( ?T1_lesson_time) as ?aggregation_T1_lesson_time_124 ) WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :lessons\\#ref-staff_id ?T2 .  ?T1 :lessons\\#lesson_time ?T1_lesson_time . ?T2 :staff\\#first_name ?T2_first_name . ?T2 :staff\\#last_name ?T2_last_name . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn') .        }"
    },
    {
        "kg_name": "activity_1",
        "question": "Which building has most faculty members?",
        "query": "SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :faculty\\#building ?T1_building .        } GROUP BY ?T1_building  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "activity_1",
        "question": "What are the first and last name of the faculty who has the most students?",
        "query": "SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :faculty_participates_in\\#ref-facid ?T1 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T14 a :activity . ?T13 :faculty_participates_in\\#ref-actid ?T14 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname . ?T15 a :participates_in . ?T15 :participates_in\\#ref-actid ?T14 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "flight_4",
        "question": "What is the name and city of the airport that the most routes end at?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_city ?T2_dst_apid WHERE { ?T1 :airports\\#ref-routes_id ?T2 .        } GROUP BY ?T1_name ?T1_city ?T2_dst_apid  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "flight_4",
        "question": "What is the name and city of the airport from most of the routes start?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_city ?T2_src_apid WHERE { ?T1 :airports\\#ref-routes_id ?T2 .        } GROUP BY ?T1_name ?T1_city ?T2_src_apid  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "flight_4",
        "question": "Which countries has the most number of airlines?",
        "query": "SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "flight_4",
        "question": "What is the name of the country with the most number of home airlines?",
        "query": "SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\\#country ?T1_country .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "flight_4",
        "question": "What are the countries with the most airlines whose active status is Y?",
        "query": "SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T1 :airlines\\#country ?T1_country . ?T1 :airlines\\#active ?T1_active . FILTER(?T1_active = 'Y') .        } GROUP BY ?T1_country  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "flight_4",
        "question": "How many cities are there that have more than 3 airports?",
        "query": "SELECT (count(*) as ?agg) WHERE {SELECT ?t1_city WHERE {?t1 a :airports .             ?t1 :airports\\#city ?t1_city . }    GROUP BY ?t1_city     Having(?agg  >  3) }"
    },
    {
        "kg_name": "flight_4",
        "question": "What is the count of cities with more than 3 airports?",
        "query": "SELECT (count(*) as ?agg) WHERE {SELECT ?t1_city WHERE {?t1 a :airports .             ?t1 :airports\\#city ?t1_city . }    GROUP BY ?t1_city     Having(?agg  >  3) }"
    },
    {
        "kg_name": "flight_4",
        "question": "How many routes go from the United States to Canada?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :routes . ?T1 :routes\\#dst_apid ?T1_dst_apid . ?T1 :routes\\#src_apid ?T1_src_apid . FILTER(?T1_dst_apid in (?T22_country) && ?T1_src_apid in (?T22_country)) .       {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\\#apid ?T22_apid . ?T22 :airports\\#country ?T22_country . FILTER(?T22_country = 'Canada') .        }    } {SELECT ?T22_apid WHERE { ?T22 a :airports . ?T22 :airports\\#apid ?T22_apid . ?T22 :airports\\#country ?T22_country . FILTER(?T22_country = 'United States') .        }    } }"
    },
    {
        "kg_name": "flight_4",
        "question": "What is the name of the airline with the most routes?",
        "query": "SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :airlines . ?T2 a :routes . ?T2 :routes\\#ref-alid ?T1 .  ?T1 :airlines\\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "tracking_orders",
        "question": "What is the name of the customer who has the most orders?",
        "query": "SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "tracking_orders",
        "question": "What is the customer id of the customer who has the most orders?",
        "query": "SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "tracking_orders",
        "question": "What are the dates of the orders made by the customer named 'Jeramie'?",
        "query": "SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :customers . ?T1 :orders\\#ref-customer_id ?T2 .  ?T1 :orders\\#date_order_placed ?T1_date_order_placed . ?T2 :customers\\#customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') .        }"
    },
    {
        "kg_name": "tracking_orders",
        "question": "What is the id of the order which has the most items?",
        "query": "SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :orders . ?T2 a :order_items . ?T2 :order_items\\#ref-order_id ?T1 .  ?T1 :orders\\#order_id ?T1_order_id .        } GROUP BY ?T1_order_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "tracking_orders",
        "question": "What is the name of the customer who has the largest number of orders?",
        "query": "SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :orders\\#ref-customer_id ?T1 .  ?T1 :customers\\#customer_name ?T1_customer_name .        } GROUP BY ?T1_customer_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "architecture",
        "question": "What are the ids and names of the architects who built at least 3 bridges ?",
        "query": "SELECT ?T1_id ?T1_name WHERE { ?T1 a :architect . ?T2 a :bridge . ?T2 :bridge\\#ref-architect_id ?T1 .  ?T1 :architect\\#id ?T1_id . ?T1 :architect\\#name ?T1_name .        } GROUP BY ?T1_id ?T1_name   HAVING(count( *)  >= 3)"
    },
    {
        "kg_name": "culture_company",
        "question": "Which publishers did not publish a book in 1989?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_publisher as ?col1) WHERE { ?T1 a :book_club . ?T1 :book_club\\#publisher ?T1_publisher .   }}  MINUS {SELECT (?T2_publisher as ?col1) WHERE { ?T2 a :book_club . ?T2 :book_club\\#publisher ?T2_publisher . ?T2 :book_club\\#year ?T2_year . FILTER(?T2_year = 1989) .        }     } }"
    },
    {
        "kg_name": "geo",
        "question": "what mountains are in alaska",
        "query": "SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\\#mountain_name ?T1_mountain_name . ?T1 :mountain\\#state_name ?T1_state_name . FILTER(?T1_state_name = 'alaska') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "How many papers run experiments on ImageNet ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_56 ) WHERE { ?T2 :dataset\\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
    },
    {
        "kg_name": "scholar",
        "question": "How many papers used ImageNet dataset ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_70 ) WHERE { ?T2 :dataset\\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
    },
    {
        "kg_name": "scholar",
        "question": "How many papers written on ImageNet ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_25 ) WHERE { ?T2 :dataset\\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
    },
    {
        "kg_name": "scholar",
        "question": "how many papers use ImageNet ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_154 ) WHERE { ?T2 :dataset\\#ref-paper_id ?T1 . FILTER(contains (?T2_datasetname, 'ImageNet')) .        }"
    },
    {
        "kg_name": "scholar",
        "question": "what was the first deep learning paper ?",
        "query": "SELECT DISTINCT ?T1_datasetid ?T2_year WHERE { ?T2 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\\#ref-paperid ?T2 .  ?T1 :dataset\\#datasetid ?T1_datasetid . ?T2 :paper\\#year ?T2_year . ?T2 :paper\\#year ?T2_year . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :dataset\\#datasetid ?T1_datasetid . ?T2 :paper\\#year ?T2_year . ?T2 :paper\\#year ?T2_year . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T2_year)"
    },
    {
        "kg_name": "scholar",
        "question": "what year was the first deep learning paper published ?",
        "query": "SELECT DISTINCT ?T1_datasetid ?T2_year WHERE { ?T2 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\\#ref-paperid ?T2 .  ?T1 :dataset\\#datasetid ?T1_datasetid . ?T2 :paper\\#year ?T2_year . ?T2 :paper\\#year ?T2_year . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :dataset\\#datasetid ?T1_datasetid . ?T2 :paper\\#year ?T2_year . ?T2 :paper\\#year ?T2_year . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'deep learning') .        }  ORDER BY ASC (?T2_year)"
    },
    {
        "kg_name": "scholar",
        "question": "what datasets do papers at ACL use most ?",
        "query": "SELECT DISTINCT ?T1_datasetid WHERE { ?T1 :dataset\\#ref-venue_id ?T2 . FILTER(?T2_venuename = 'ACL') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "How many citations does Dan Makumbi 's Genetic Identity paper have ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_5 ) WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\\#ref-citedpaperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T15 a :writes . ?T15 :writes\\#ref-paperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T2 a :author . ?T15 :writes\\#ref-aid ?T2 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T16 a :paperkeyphrase . ?T16 :paperkeyphrase\\#ref-paperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T16 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . FILTER(?T2_authorname = 'Dan Makumbi' && ?T3_keyphrasename = 'Genetic Identity') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "How many papers related to deep learning cited the dataset ImageNet ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_176 ) WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\\#ref-paperid ?T1 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T14 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . FILTER(?T2_datasetname = 'ImageNet' && ?T3_keyphrasename = 'deep learning') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "What paper did Michael Armstrong write in the 90s ?",
        "query": "SELECT DISTINCT ?T1_year ?T2_paperid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\\#ref-paperid ?T1 .  ?T1 :paper\\#year ?T1_year . ?T2 :writes\\#paperid ?T2_paperid . ?T3 :author\\#authorname ?T3_authorname . ?T1 :paper\\#year ?T1_year . ?T1 :paper\\#year ?T1_year . ?T3 a :author . ?T2 :writes\\#ref-aid ?T3 .  ?T1 :paper\\#year ?T1_year . ?T2 :writes\\#paperid ?T2_paperid . ?T3 :author\\#authorname ?T3_authorname . ?T1 :paper\\#year ?T1_year . ?T1 :paper\\#year ?T1_year . FILTER(contains (?T3_authorname, 'Michael Armstrong') && ?T1_year >= 1990 && ?T1_year <= 1999) .        }"
    },
    {
        "kg_name": "scholar",
        "question": "which papers used WebKB ?",
        "query": "SELECT DISTINCT ?T1_paperid WHERE { ?T2 :dataset\\#ref-paper_id ?T1 . FILTER(?T2_datasetname = 'WebKB') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "how is the most cited author in CVPR ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_101 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\\#ref-citedpaperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :venue\\#venuename ?T3_venuename . ?T2 a :writes . ?T2 :writes\\#ref-paperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :venue\\#venuename ?T3_venuename . ?T3 a :venue . ?T14 :paper\\#ref-venueid ?T3 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :venue\\#venuename ?T3_venuename . FILTER(?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_45 ))"
    },
    {
        "kg_name": "scholar",
        "question": "who is the most cited author at CVPR ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_54 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\\#ref-citedpaperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :venue\\#venuename ?T3_venuename . ?T2 a :writes . ?T2 :writes\\#ref-paperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :venue\\#venuename ?T3_venuename . ?T3 a :venue . ?T14 :paper\\#ref-venueid ?T3 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :venue\\#venuename ?T3_venuename . FILTER(?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_20 ))"
    },
    {
        "kg_name": "scholar",
        "question": "Who cites Daniel A Reed most ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_32 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\\#ref-citedpaperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :author\\#authorname ?T3_authorname . ?T2 a :writes . ?T2 :writes\\#ref-paperid ?T14 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :author\\#authorname ?T3_authorname . ?T3 a :author . ?T2 :writes\\#ref-aid ?T3 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :writes\\#authorid ?T2_authorid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :author\\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Daniel A Reed') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_33 ))"
    },
    {
        "kg_name": "scholar",
        "question": "Who writes a lot of papers in Machine Learning ?",
        "query": "SELECT DISTINCT ?T1_authorname (count(DISTINCT ?T2_paperid) as ?aggregation_T2_paperid_39 ) WHERE { ?T1 a :author . ?T2 a :writes . ?T2 :writes\\#ref-aid ?T1 .  ?T1 :author\\#authorname ?T1_authorname . ?T2 :writes\\#paperid ?T2_paperid . ?T2 :writes\\#paperid ?T2_paperid . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T14 a :paper . ?T2 :writes\\#ref-paperid ?T14 .  ?T1 :author\\#authorname ?T1_authorname . ?T2 :writes\\#paperid ?T2_paperid . ?T2 :writes\\#paperid ?T2_paperid . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\\#ref-paperid ?T14 .  ?T1 :author\\#authorname ?T1_authorname . ?T2 :writes\\#paperid ?T2_paperid . ?T2 :writes\\#paperid ?T2_paperid . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :author\\#authorname ?T1_authorname . ?T2 :writes\\#paperid ?T2_paperid . ?T2 :writes\\#paperid ?T2_paperid . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . FILTER(?T3_keyphrasename = 'Machine Learning') .        } GROUP BY ?T1_authorname ORDER BY DESC ((count( ?T2_paperid) as ?aggregation_T2_paperid_195 ))"
    },
    {
        "kg_name": "scholar",
        "question": "who else was on the paper with Ameet Soni and Ras Bodik ?",
        "query": "SELECT DISTINCT ?T1_authorid WHERE { ?T1 a :writes . ?T2 a :author . ?T1 :writes\\#ref-aid ?T2 .  ?T1 :writes\\#authorid ?T1_authorid . ?T2 :author\\#authorname ?T2_authorname . ?T2 :author\\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Ameet Soni' && ?T2_authorname = 'Ras Bodik') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "which ACL 2014 papers about Parsing used Jeopardy! Questions ?",
        "query": "SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\\#ref-paperid ?T1 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T1 :paper\\#year ?T1_year . ?T4 :venue\\#venuename ?T4_venuename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T1 :paper\\#year ?T1_year . ?T4 :venue\\#venuename ?T4_venuename . ?T4 a :venue . ?T1 :paper\\#ref-venueid ?T4 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T1 :paper\\#year ?T1_year . ?T4 :venue\\#venuename ?T4_venuename . FILTER(?T2_datasetname = 'Jeopardy! Questions' && ?T3_keyphrasename = 'Parsing' && ?T1_year = 2014 && ?T4_venuename = 'ACL') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "What are some papers dealing with Semantic Data in YAGO ?",
        "query": "SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paperkeyphrase . ?T3 a :keyphrase . ?T1 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :paperkeyphrase\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . FILTER(?T2_datasetname = 'YAGO' && ?T3_keyphrasename = 'Semantic Data') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "which papers in eccv 2014 use ImageNet ?",
        "query": "SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T3 a :venue . ?T1 :paper\\#ref-venueid ?T3 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T1 :paper\\#year ?T1_year . ?T3 :venue\\#venuename ?T3_venuename . FILTER(?T2_datasetname = 'ImageNet' && ?T1_year = 2014 && ?T3_venuename = 'eccv') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "top authors working on ImageNet ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_1 ) ?T2_paperid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\\#ref-paperid ?T1 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :writes\\#paperid ?T2_paperid . ?T1 :paper\\#paperid ?T1_paperid . ?T3 :dataset\\#datasetname ?T3_datasetname . FILTER(?T3_datasetname = 'ImageNet') .        } GROUP BY ?T2_paperid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_191 ))"
    },
    {
        "kg_name": "scholar",
        "question": "What was the topic of best paper in 2012 EMNLP-CoNLL ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_20 ) ?T2_keyphraseid ?T3_paperid WHERE { ?T1 a :cite . ?T3 a :paper . ?T1 :cite\\#ref-citedpaperid ?T3 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :paperkeyphrase\\#keyphraseid ?T2_keyphraseid . ?T3 :paper\\#paperid ?T3_paperid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :paper\\#year ?T3_year . ?T4 :venue\\#venuename ?T4_venuename . ?T2 a :paperkeyphrase . ?T2 :paperkeyphrase\\#ref-paperid ?T3 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :paperkeyphrase\\#keyphraseid ?T2_keyphraseid . ?T3 :paper\\#paperid ?T3_paperid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :paper\\#year ?T3_year . ?T4 :venue\\#venuename ?T4_venuename . ?T4 a :venue . ?T3 :paper\\#ref-venueid ?T4 .  ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T2 :paperkeyphrase\\#keyphraseid ?T2_keyphraseid . ?T3 :paper\\#paperid ?T3_paperid . ?T1 :cite\\#citingpaperid ?T1_citingpaperid . ?T3 :paper\\#year ?T3_year . ?T4 :venue\\#venuename ?T4_venuename . FILTER(?T3_year = 2012 && ?T4_venuename = 'EMNLP-CoNLL') .        } GROUP BY ?T2_keyphraseid ?T3_paperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_25 ))"
    },
    {
        "kg_name": "scholar",
        "question": "What is the name of Eric C. Kerrigan 's Liquid Automatica paper ?",
        "query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a :paper . ?T15 a :writes . ?T15 :writes\\#ref-paperid ?T1 .  ?T1 :paper\\#title ?T1_title . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T4 :venue\\#venuename ?T4_venuename . ?T2 a :author . ?T15 :writes\\#ref-aid ?T2 .  ?T1 :paper\\#title ?T1_title . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T4 :venue\\#venuename ?T4_venuename . ?T16 a :paperkeyphrase . ?T16 :paperkeyphrase\\#ref-paperid ?T1 .  ?T1 :paper\\#title ?T1_title . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T4 :venue\\#venuename ?T4_venuename . ?T3 a :keyphrase . ?T16 :paperkeyphrase\\#ref-keyphraseid ?T3 .  ?T1 :paper\\#title ?T1_title . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T4 :venue\\#venuename ?T4_venuename . ?T4 a :venue . ?T1 :paper\\#ref-venueid ?T4 .  ?T1 :paper\\#title ?T1_title . ?T2 :author\\#authorname ?T2_authorname . ?T3 :keyphrase\\#keyphrasename ?T3_keyphrasename . ?T4 :venue\\#venuename ?T4_venuename . FILTER(contains (?T2_authorname, 'Eric C. Kerrigan') && ?T3_keyphrasename = 'Liquid' && ?T4_venuename = 'Automatica') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "How many papers used ImageNet datasets in cvpr ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_20 ) WHERE { ?T1 a :paper . ?T3 a :venue . ?T1 :paper\\#ref-venueid ?T3 .  ?T1 :paper\\#paperid ?T1_paperid . ?T2 :dataset\\#datasetname ?T2_datasetname . ?T3 :venue\\#venuename ?T3_venuename . FILTER(?T2_datasetname = 'ImageNet' && ?T3_venuename = 'cvpr') .        }"
    },
    {
        "kg_name": "scholar",
        "question": "What is the year of publication of ' A Switching Architecture For ISDN ' ?",
        "query": "SELECT DISTINCT ?T1_title ?T1_year WHERE { ?T1 a :paper . ?T1 :paper\\#title ?T1_title . ?T1 :paper\\#year ?T1_year . ?T1 :paper\\#title ?T1_title . FILTER(?T1_title = 'A Switching Architecture For ISDN') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "What are all the breweries in ' Los Angeles ' ?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\\#ref-business_id ?T1 .  ?T1 :business\\#name ?T1_name . ?T1 :business\\#city ?T1_city . ?T2 :category\\#category_name ?T2_category_name . FILTER(?T1_city = 'Los Angeles' && ?T2_category_name = 'breweries') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "What neighbourhood is restaurant ' Flat Top Grill ' in ?",
        "query": "SELECT ?T1_neighbourhood_name WHERE { ?T1 a :neighbourhood . ?T2 a :business . ?T1 :neighbourhood\\#ref-business_id ?T2 .  ?T1 :neighbourhood\\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\\#name ?T2_name . ?T3 :category\\#category_name ?T3_category_name . ?T3 a :category . ?T3 :category\\#ref-business_id ?T2 .  ?T1 :neighbourhood\\#neighbourhood_name ?T1_neighbourhood_name . ?T2 :business\\#name ?T2_name . ?T3 :category\\#category_name ?T3_category_name . FILTER(?T2_name = 'Flat Top Grill' && ?T3_category_name = 'category_category_name0') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "What is the number of escape games in ' Madison ' ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_19 ) WHERE { ?T1 a :business . ?T2 a :category . ?T2 :category\\#ref-business_id ?T1 .  ?T1 :business\\#name ?T1_name . ?T1 :business\\#city ?T1_city . ?T2 :category\\#category_name ?T2_category_name . FILTER(?T1_city = 'Madison' && ?T2_category_name = 'escape games') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "How many people reviewed ' Bistro Di Napoli ' in 2015 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_155 ) WHERE { ?T2 a :business . ?T3 a :review . ?T3 :review\\#ref-business_id ?T2 .  ?T1 :users\\#name ?T1_name . ?T2 :business\\#name ?T2_name . ?T3 :review\\#year ?T3_year . FILTER(?T2_name = 'Bistro Di Napoli' && ?T3_year = 2015) .        }"
    },
    {
        "kg_name": "yelp",
        "question": "How many reviews does ' Acacia Cafe ' have ?",
        "query": "SELECT ?T1_review_count WHERE { ?T1 a :business . ?T1 :business\\#review_count ?T1_review_count . ?T1 :business\\#name ?T1_name . FILTER(?T1_name = 'Acacia Cafe') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "How many businesses in ' San Diego ' has Christine reviewed in 2010 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_101 ) WHERE { ?T1 a :business . ?T2 a :review . ?T2 :review\\#ref-business_id ?T1 .  ?T1 :business\\#name ?T1_name . ?T1 :business\\#city ?T1_city . ?T2 :review\\#year ?T2_year . ?T3 :users\\#name ?T3_name . FILTER(?T1_city = 'San Diego' && ?T2_year = 2010 && ?T3_name = 'Christine') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "How many Target are there in ' Los Angeles ' ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_business_id) as ?aggregation_T1_business_id_39 ) WHERE { ?T1 a :business . ?T1 :business\\#business_id ?T1_business_id . ?T1 :business\\#city ?T1_city . ?T1 :business\\#name ?T1_name . FILTER(?T1_city = 'Los Angeles' && ?T1_name = 'Target') .        }"
    },
    {
        "kg_name": "yelp",
        "question": "How many people reviewed restaurant ' Vintner Grill ' in 2010 ?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_52 ) WHERE { ?T2 a :business . ?T3 a :category . ?T3 :category\\#ref-business_id ?T2 .  ?T1 :users\\#name ?T1_name . ?T2 :business\\#name ?T2_name . ?T3 :category\\#category_name ?T3_category_name . ?T4 :review\\#year ?T4_year . ?T4 a :review . ?T4 :review\\#ref-business_id ?T2 .  ?T1 :users\\#name ?T1_name . ?T2 :business\\#name ?T2_name . ?T3 :category\\#category_name ?T3_category_name . ?T4 :review\\#year ?T4_year . FILTER(?T2_name = 'Vintner Grill' && ?T3_category_name = 'category_category_name0' && ?T4_year = 2010) .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What year is the movie ' The Imitation Game ' from ?",
        "query": "SELECT ?T1_release_year WHERE { ?T1 a :movie . ?T1 :movie\\#release_year ?T1_release_year . ?T1 :movie\\#title ?T1_title . FILTER(?T1_title = 'The Imitation Game') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What year was ' Benedict Cumberbatch ' born ?",
        "query": "SELECT ?T1_birth_year WHERE { ?T1 a :actor . ?T1 :actor\\#birth_year ?T1_birth_year . ?T1 :actor\\#name ?T1_name . FILTER(?T1_name = 'Benedict Cumberbatch') .        }"
    },
    {
        "kg_name": "imdb",
        "question": "What is the nationality of the actress ' Christoph Waltz ' ?",
        "query": "SELECT ?T1_nationality WHERE { ?T1 a :actor . ?T1 :actor\\#nationality ?T1_nationality . ?T1 :actor\\#name ?T1_name . FILTER(?T1_name = 'Christoph Waltz') .        }"
    }
]