[
    {
        "kg_name": "behavior_monitoring",
        "question": "What are the code and description of the least frequent detention type ?",
        "query": "SELECT ?T1_detention_type_code (count( *) as ?aggregation_all) ?T2_detention_type_description WHERE { ?T1 a :detention . ?T2 a :ref_detention_type . ?T1 :detention\\#ref-detention_type_code ?T2 .  ?T1 :detention\\#detention_type_code ?T1_detention_type_code . ?T2 :ref_detention_type\\#detention_type_description ?T2_detention_type_description .        } GROUP BY ?T1_detention_type_code ?T2_detention_type_description  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "behavior_monitoring",
        "question": "What are the email addresses of teachers whose address has zip code '918'?",
        "query": "SELECT ?T1_email_address WHERE { ?T1 a :teachers . ?T2 a :addresses . ?T1 :teachers\\#ref-address_id ?T2 .  ?T1 :teachers\\#email_address ?T1_email_address . ?T2 :addresses\\#zip_postcode ?T2_zip_postcode . FILTER(?T2_zip_postcode = '918') .        }"
    },
    {
        "kg_name": "college_1",
        "question": "Which school has the smallest amount of professors?",
        "query": "SELECT ?T1_school_code (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\\#ref-dept_code ?T1 .  ?T1 :department\\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_1",
        "question": "Which school has the fewest professors?",
        "query": "SELECT ?T1_school_code (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\\#ref-dept_code ?T1 .  ?T1 :department\\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_1",
        "question": "Which department offers the most credits all together?",
        "query": "SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :course\\#ref-dept_code ?T1 .  ?T1 :department\\#dept_name ?T1_dept_name . ?T2 :course\\#crs_credit ?T2_crs_credit .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((sum( ?T2_crs_credit) as ?aggregation_T2_crs_credit_32 )) LIMIT 1"
    },
    {
        "kg_name": "college_1",
        "question": "What is the name of the department with the most students enrolled?",
        "query": "SELECT ?T1_dept_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T13 a :employee . ?T1 :department\\#ref-emp_num ?T13 .  ?T1 :department\\#dept_name ?T1_dept_name .        } GROUP BY ?T1_dept_name  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_1",
        "question": "Which department has the most professors with a Ph.D.?",
        "query": "SELECT ?T1_dept_name (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\\#ref-dept_code ?T1 .  ?T1 :department\\#dept_name ?T1_dept_name . ?T2 :professor\\#dept_code ?T2_dept_code . ?T2 :professor\\#prof_high_degree ?T2_prof_high_degree . FILTER(?T2_prof_high_degree = 'Ph.D.') .        } GROUP BY ?T1_dept_name ?T2_dept_code  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_1",
        "question": "What are the first names of all history professors who do not teach?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T2 a :department . ?T2 :department\\#ref-emp_num ?T1 .  ?T1 :employee\\#emp_fname ?T1_emp_fname . ?T2 :department\\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'History') .   }}  MINUS {SELECT (?T3_emp_fname as ?col1) WHERE { ?T3 a :employee . ?T3 :employee\\#emp_fname ?T3_emp_fname .        }     } }"
    },
    {
        "kg_name": "sports_competition",
        "question": "What is the average number of points for players from the 'AIB' club?",
        "query": "SELECT (avg( ?T1_points) as ?aggregation_T1_points_150 ) WHERE { ?T1 a :player . ?T2 a :club . ?T1 :player\\#ref-club_id ?T2 .  ?T1 :player\\#points ?T1_points . ?T2 :club\\#name ?T2_name . FILTER(?T2_name = 'AIB') .        }"
    },
    {
        "kg_name": "hr_1",
        "question": "Find the ids of the employees who does not work in those departments where some employees works whose manager id within the range 100 and 200.",
        "query": "SELECT * WHERE { ?T1 a :employees . ?T1 :employees\\#department_id ?T1_department_id . FILTER NOT EXISTS { ?T22 a :departments . ?T22 :departments\\#department_id ?T1_department_id . ?T22 :departments\\#manager_id ?T22_manager_id . FILTER (?T22_manager_id >= 100 && ?T22_manager_id <= 200) . } }"
    },
    {
        "kg_name": "baseball_1",
        "question": "What are the three countries that the least players are from?",
        "query": "SELECT ?T1_birth_country (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\\#birth_country ?T1_birth_country .        } GROUP BY ?T1_birth_country  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "baseball_1",
        "question": "What are the name and id of the team offering the lowest average salary?",
        "query": "SELECT ?T1_name ?T1_team_id WHERE { ?T2 :salary\\#ref-team_id ?T1 .        } GROUP BY ?T1_name ?T1_team_id  ORDER BY ASC ((avg( ?T2_salary) as ?aggregation_T2_salary_104 )) LIMIT 1"
    },
    {
        "kg_name": "baseball_1",
        "question": "In which year did the least people enter hall of fame?",
        "query": "SELECT ?T1_yearid (count( *) as ?aggregation_all) WHERE { ?T1 a :hall_of_fame . ?T1 :hall_of_fame\\#yearid ?T1_yearid .        } GROUP BY ?T1_yearid  ORDER BY ASC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "baseball_1",
        "question": "How many games were played in park 'Columbia Park' in 1907?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :home_game . ?T2 a :park . ?T1 :home_game\\#ref-park_id ?T2 .  ?T1 :home_game\\#year ?T1_year . ?T2 :park\\#park_name ?T2_park_name . FILTER(?T1_year = 1907 && ?T2_park_name = 'Columbia Park') .        }"
    },
    {
        "kg_name": "baseball_1",
        "question": "List players' first name and last name who received salary from team Washington Nationals in both 2005 and 2007.",
        "query": "SELECT DISTINCT ?T2_name_first ?T2_name_last WHERE { ?T1 a :salary . ?T1 :salary\\#year ?T1_year .?T2 a :player . ?T1 :salary\\#player_id ?id . ?T2 :player\\#player_id ?id . ?T2 :player\\#name_first ?T2_name_first .?T2 :player\\#name_last ?T2_name_last . ?T3 a :team . ?T3 :team\\#team_id_br ?id_1 . ?T1 :salary\\#team_id ?id_1 . ?T3 :team\\#name ?T3_name FILTER(?T1_year = 2005 && ?T3_name = 'Washington Nationals') ?T4 a :salary . ?T4 :salary\\#year ?T4_year .?T5 a :player . ?T4 :salary\\#player_id ?id_2 . ?T5 :player\\#player_id ?id_2 . ?T5 :player\\#name_first ?T5_name_first .?T5 :player\\#name_last ?T2_name_last . ?T6 a :team . ?T6 :team\\#team_id_br ?id_3 . ?T4 :salary\\#team_id ?id_3 . ?T6 :team\\#name ?T6_name FILTER(?T4_year = 2007 && ?T6_name = 'Washington Nationals')  }"
    },
    {
        "kg_name": "program_share",
        "question": "How many distinct programs are broadcast at 'Night' time?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_program_id) as ?aggregation_T1_program_id_189 ) WHERE { ?T1 a :broadcast . ?T1 :broadcast\\#program_id ?T1_program_id . ?T1 :broadcast\\#time_of_day ?T1_time_of_day . FILTER(?T1_time_of_day = 'Night') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "What are the descriptions of the courses with name 'database'?",
        "query": "SELECT ?T1_course_description WHERE { ?T1 a :courses . ?T1 :courses\\#course_description ?T1_course_description . ?T1 :courses\\#course_name ?T1_course_name . FILTER(?T1_course_name = 'database') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "How many tests have result 'Fail'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student_tests_taken . ?T1 :student_tests_taken\\#test_result ?T1_test_result . FILTER(?T1_test_result = 'Fail') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "What are the login names of the students with family name 'Ward'?",
        "query": "SELECT ?T1_login_name WHERE { ?T1 a :students . ?T1 :students\\#login_name ?T1_login_name . ?T1 :students\\#family_name ?T1_family_name . FILTER(?T1_family_name = 'Ward') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "Find the latest logon date of the students whose family name is 'Jaskolski' or 'Langosh'.",
        "query": "SELECT ?T1_date_of_latest_logon WHERE { ?T1 a :students . ?T1 :students\\#date_of_latest_logon ?T1_date_of_latest_logon . ?T1 :students\\#family_name ?T1_family_name . ?T1 :students\\#family_name ?T1_family_name . FILTER(?T1_family_name = 'Jaskolski' || ?T1_family_name = 'Langosh') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "How many students have personal names that contain the word 'son'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T1 :students\\#personal_name ?T1_personal_name . FILTER(contains (?T1_personal_name, 'son')) .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "What is the date of enrollment of the course named 'Spanish'?",
        "query": "SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :courses . ?T1 :student_course_enrolment\\#ref-course_id ?T2 .  ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment . ?T2 :courses\\#course_name ?T2_course_name . FILTER(?T2_course_name = 'Spanish') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "What are the enrollment dates of all the tests that have result 'Pass'?",
        "query": "SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :student_tests_taken\\#ref-registration_id ?T1 .  ?T1 :student_course_enrolment\\#date_of_enrolment ?T1_date_of_enrolment . ?T2 :student_tests_taken\\#test_result ?T2_test_result . FILTER(?T2_test_result = 'Pass') .        }"
    },
    {
        "kg_name": "e_learning",
        "question": "What are the completion dates of all the tests that have result 'Fail'?",
        "query": "SELECT ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :student_tests_taken\\#ref-registration_id ?T1 .  ?T1 :student_course_enrolment\\#date_of_completion ?T1_date_of_completion . ?T2 :student_tests_taken\\#test_result ?T2_test_result . FILTER(?T2_test_result = 'Fail') .        }"
    },
    {
        "kg_name": "film_rank",
        "question": "What is the name of teh studio that created the most films?",
        "query": "SELECT ?T1_studio (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :film\\#studio ?T1_studio .        } GROUP BY ?T1_studio  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "cre_doc_tracking_db",
        "question": "What is the document type code for document type 'Paper'?",
        "query": "SELECT ?T1_document_type_code WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\\#document_type_code ?T1_document_type_code . ?T1 :ref_document_types\\#document_type_name ?T1_document_type_name . FILTER(?T1_document_type_name = 'Paper') .        }"
    },
    {
        "kg_name": "cre_doc_tracking_db",
        "question": "What is the date when the document 'Marry CV' was stored?",
        "query": "SELECT ?T1_date_stored WHERE { ?T1 a :all_documents . ?T1 :all_documents\\#date_stored ?T1_date_stored . ?T1 :all_documents\\#document_name ?T1_document_name . FILTER(?T1_document_name = 'Marry CV') .        }"
    },
    {
        "kg_name": "cre_doc_tracking_db",
        "question": "What is the location code for the country 'Canada'?",
        "query": "SELECT ?T1_location_code WHERE { ?T1 a :ref_locations . ?T1 :ref_locations\\#location_code ?T1_location_code . ?T1 :ref_locations\\#location_name ?T1_location_name . FILTER(?T1_location_name = 'Canada') .        }"
    },
    {
        "kg_name": "cre_doc_tracking_db",
        "question": "What are the name and description for role code 'MG'?",
        "query": "SELECT ?T1_role_name ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\\#role_name ?T1_role_name . ?T1 :roles\\#role_description ?T1_role_description . ?T1 :roles\\#role_code ?T1_role_code . FILTER(?T1_role_code = 'MG') .        }"
    },
    {
        "kg_name": "cre_doc_tracking_db",
        "question": "What is the description of the role named 'Proof Reader'?",
        "query": "SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T1 :roles\\#role_description ?T1_role_description . ?T1 :roles\\#role_name ?T1_role_name . FILTER(?T1_role_name = 'Proof Reader') .        }"
    },
    {
        "kg_name": "cre_doc_tracking_db",
        "question": "What is the location name of the document 'Robin CV'?",
        "query": "SELECT ?T1_location_name WHERE { ?T1 a :ref_locations . ?T13 a :document_locations . ?T13 :document_locations\\#ref-location_code ?T1 .  ?T1 :ref_locations\\#location_name ?T1_location_name . ?T2 :all_documents\\#document_name ?T2_document_name . ?T2 a :all_documents . ?T13 :document_locations\\#ref-document_id ?T2 .  ?T1 :ref_locations\\#location_name ?T1_location_name . ?T2 :all_documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'Robin CV') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many members does the club 'Tennis Club' has?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many people have membership in the club 'Pen and Paper Gaming'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many clubs does 'Linda Smith' belong to?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many clubs does 'Linda Smith' have membership for?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "For how many clubs is 'Tracy Kim' a member?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Tracy' && ?T2_lname = 'Kim') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "Which club has the most members majoring in '600'?",
        "query": "SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :member_of_club . ?T2 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T3 :student\\#major ?T3_major . ?T3 a :student . ?T2 :member_of_club\\#ref-stuid ?T3 .  ?T1 :club\\#clubname ?T1_clubname . ?T3 :student\\#major ?T3_major . FILTER(?T3_major = 600) .        } GROUP BY ?T1_clubname  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "club_1",
        "question": "What is the description of the club named 'Tennis Club'?",
        "query": "SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :club\\#clubdesc ?T1_clubdesc . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "What is the description of the club 'Pen and Paper Gaming'?",
        "query": "SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :club\\#clubdesc ?T1_clubdesc . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "What is the location of the club named 'Tennis Club'?",
        "query": "SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\\#clublocation ?T1_clublocation . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "Where us the club named 'Tennis Club' located?",
        "query": "SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\\#clublocation ?T1_clublocation . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "Where is the club 'Pen and Paper Gaming' located?",
        "query": "SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\\#clublocation ?T1_clublocation . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "Where is the club 'Hopkins Student Enterprises' located?",
        "query": "SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :club\\#clublocation ?T1_clublocation . ?T1 :club\\#clubname ?T1_clubname . FILTER(?T1_clubname = 'Hopkins Student Enterprises') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many clubs are located at 'HHH'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :club\\#clublocation ?T1_clublocation . FILTER(?T1_clublocation = 'HHH') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many different roles are there in the club 'Bootup Baltimore'?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_51 ) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\\#ref-clubid ?T2 .  ?T1 :member_of_club\\#position ?T1_position . ?T2 :club\\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many members of 'Bootup Baltimore' are older than 18?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\\#ref-clubid ?T2 .  ?T2 :club\\#clubname ?T2_clubname . ?T3 :student\\#age ?T3_age . ?T3 a :student . ?T1 :member_of_club\\#ref-stuid ?T3 .  ?T2 :club\\#clubname ?T2_clubname . ?T3 :student\\#age ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age > 18) .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many members of club 'Bootup Baltimore' are younger than 18?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :member_of_club\\#ref-clubid ?T2 .  ?T2 :club\\#clubname ?T2_clubname . ?T3 :student\\#age ?T3_age . ?T3 a :student . ?T1 :member_of_club\\#ref-stuid ?T3 .  ?T2 :club\\#clubname ?T2_clubname . ?T3 :student\\#age ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age < 18) .        }"
    },
    {
        "kg_name": "club_1",
        "question": "How many clubs does the student named 'Eric Tai' belong to?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_102 ) WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "What are the names of the clubs that have 'Davis Steven' as a member?",
        "query": "SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#fname ?T2_fname . ?T2 :student\\#lname ?T2_lname . FILTER(?T2_fname = 'Davis' && ?T2_lname = 'Steven') .        }"
    },
    {
        "kg_name": "club_1",
        "question": "Which clubs have one or more members whose advisor is '1121'?",
        "query": "SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-clubid ?T1 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#advisor ?T2_advisor . ?T2 a :student . ?T13 :member_of_club\\#ref-stuid ?T2 .  ?T1 :club\\#clubname ?T1_clubname . ?T2 :student\\#advisor ?T2_advisor . FILTER(?T2_advisor = 1121) .        }"
    },
    {
        "kg_name": "club_1",
        "question": "What is the average age of the members of the club 'Bootup Baltimore'?",
        "query": "SELECT (avg( ?T1_age) as ?aggregation_T1_age_18 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :member_of_club\\#ref-stuid ?T1 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . ?T2 a :club . ?T13 :member_of_club\\#ref-clubid ?T2 .  ?T1 :student\\#age ?T1_age . ?T2 :club\\#clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') .        }"
    },
    {
        "kg_name": "tracking_grants_for_research",
        "question": "What are the details and id of the project with the most outcomes?",
        "query": "SELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\\#ref-project_id ?T1 .  ?T1 :projects\\#project_details ?T1_project_details . ?T1 :projects\\#project_id ?T1_project_id .        } GROUP BY ?T1_project_details ?T1_project_id  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "tracking_grants_for_research",
        "question": "How many tasks does each project have? List the task count and the project detail.",
        "query": "SELECT (count( *) as ?aggregation_all) ?T2_project_details WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :tasks\\#ref-project_id ?T2 .  ?T2 :projects\\#project_details ?T2_project_details .        } GROUP BY ?T2_project_details"
    },
    {
        "kg_name": "network_2",
        "question": "What are the names of every person who has a friend over 40 and under 30?",
        "query": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\\#ref-friend ?T1 .  ?T1 :person\\#name ?T1_name . ?T2 :personfriend\\#friend ?T2_friend . FILTER(?T2_friend in (?T23_age)) . FILTER (?T1_name in (?T25_name)) .   ?T3 a :person . ?T4 a :personfriend . ?T4 :personfriend\\#ref-friend ?T3 .  ?T3 :person\\#name ?T3_name . ?T4 :personfriend\\#friend ?T4_friend .  FILTER(?T4_friend in (?T25_age)) .            { ?T23 a :person . ?T23 :person\\#name ?T23_name . ?T23 :person\\#age ?T23_age .  FILTER(?T23_age > 40) .       } }"
    },
    {
        "kg_name": "network_2",
        "question": "What are the names of all of Alice's friends of friends?",
        "query": "SELECT DISTINCT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\\#ref-friend ?T2 .  ?T1 :personfriend\\#name ?T1_name . ?T2 :person\\#name ?T2_name . ?T1 :personfriend\\#name ?T1_name . FILTER(?T2_name = 'Alice' && ?T1_name != 'Alice') .        }"
    },
    {
        "kg_name": "document_management",
        "question": "What is the type of the document named 'David CV'?",
        "query": "SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\\#document_type_code ?T1_document_type_code . ?T1 :documents\\#document_name ?T1_document_name . FILTER(?T1_document_name = 'David CV') .        }"
    },
    {
        "kg_name": "document_management",
        "question": "What are all the section titles of the document named 'David CV'?",
        "query": "SELECT ?T1_section_title WHERE { ?T1 a :document_sections . ?T2 a :documents . ?T1 :document_sections\\#ref-document_code ?T2 .  ?T1 :document_sections\\#section_title ?T1_section_title . ?T2 :documents\\#document_name ?T2_document_name . FILTER(?T2_document_name = 'David CV') .        }"
    },
    {
        "kg_name": "document_management",
        "question": "What are the names of documents that contain the substring 'CV'?",
        "query": "SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :documents\\#document_name ?T1_document_name . ?T1 :documents\\#document_name ?T1_document_name . FILTER(contains (?T1_document_name, 'CV')) .        }"
    },
    {
        "kg_name": "company_office",
        "question": "What are the names of companies whose headquarters are not 'USA'?",
        "query": "SELECT ?T1_name WHERE { ?T1 a :companies . ?T1 :companies\\#name ?T1_name . ?T1 :companies\\#headquarters ?T1_headquarters . FILTER(?T1_headquarters != 'USA') .        }"
    },
    {
        "kg_name": "college_3",
        "question": "What is the number of departments in Division 'AS'?",
        "query": "SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\\#division ?T1_division . FILTER(?T1_division = 'AS') .        }"
    },
    {
        "kg_name": "college_3",
        "question": "How many students have had at least one 'B' grade?",
        "query": "SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_129 ) WHERE { ?T1 a :enrolled_in . ?T1 :enrolled_in\\#stuid ?T1_stuid . ?T1 :enrolled_in\\#grade ?T1_grade . FILTER(?T1_grade = 'B') .        }"
    },
    {
        "kg_name": "college_3",
        "question": "What are the first names for students who have an 'a' in their first name?",
        "query": "SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T1 :student\\#fname ?T1_fname . ?T1 :student\\#fname ?T1_fname . FILTER(contains (?T1_fname, 'a')) .        }"
    },
    {
        "kg_name": "college_3",
        "question": "What is the name of the department with the most students minoring in it?",
        "query": "SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :minor_in . ?T2 :minor_in\\#ref-dno ?T1 .  ?T1 :department\\#dname ?T1_dname .        } GROUP BY ?T1_dname  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "college_3",
        "question": "What are the full names of the 3 instructors who teach the most courses?",
        "query": "SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :course\\#ref-instructor ?T1 .  ?T1 :faculty\\#fname ?T1_fname . ?T1 :faculty\\#lname ?T1_lname .        } GROUP BY ?T1_fname ?T1_lname  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "aircraft",
        "question": "What is the name of the aircraft that has won an award the most?",
        "query": "SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft  ORDER BY DESC (?aggregation_all) LIMIT 1"
    },
    {
        "kg_name": "aircraft",
        "question": "What are the names of all aircrafts that have won a match at least twice?",
        "query": "SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :match\\#ref-winning_aircraft ?T1 .  ?T1 :aircraft\\#aircraft ?T1_aircraft .        } GROUP BY ?T1_aircraft   HAVING(count( *)  >= 2)"
    },
    {
        "kg_name": "store_product",
        "question": "Which city is the headquarter of the store named 'Blackville' in?",
        "query": "SELECT ?T1_headquartered_city WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :store_district\\#ref-district_id ?T1 .  ?T1 :district\\#headquartered_city ?T1_headquartered_city . ?T2 :store\\#store_name ?T2_store_name . ?T2 a :store . ?T13 :store_district\\#ref-store_id ?T2 .  ?T1 :district\\#headquartered_city ?T1_headquartered_city . ?T2 :store\\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Blackville') .        }"
    },
    {
        "kg_name": "store_product",
        "question": "What products are available at store named 'Miramichi'?",
        "query": "SELECT ?T1_product WHERE { ?T1 a :product . ?T13 a :store_product . ?T13 :store_product\\#ref-product_id ?T1 .  ?T1 :product\\#product ?T1_product . ?T2 :store\\#store_name ?T2_store_name . ?T2 a :store . ?T13 :store_product\\#ref-store_id ?T2 .  ?T1 :product\\#product ?T1_product . ?T2 :store\\#store_name ?T2_store_name . FILTER(?T2_store_name = 'Miramichi') .        }"
    },
    {
        "kg_name": "store_product",
        "question": "What are all of the products whose name includes the substring 'Scanner'?",
        "query": "SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product\\#product ?T1_product . ?T1 :product\\#product ?T1_product . FILTER(contains (?T1_product, 'Scanner')) .        }"
    },
    {
        "kg_name": "cre_drama_workshop_groups",
        "question": "Which city is the address of the store named 'FJA Filming' located in?",
        "query": "SELECT ?T1_city_town WHERE { ?T1 a :addresses . ?T2 a :stores . ?T2 :stores\\#ref-address_id ?T1 .  ?T1 :addresses\\#city_town ?T1_city_town . ?T2 :stores\\#store_name ?T2_store_name . FILTER(?T2_store_name = 'FJA Filming') .        }"
    },
    {
        "kg_name": "cre_drama_workshop_groups",
        "question": "List the email addresses of the drama workshop groups located in Alaska state.",
        "query": "SELECT ?T1_store_email_address WHERE { ?T1 a :drama_workshop_groups . ?T2 a :addresses . ?T1 :drama_workshop_groups\\#ref-address_id ?T2 .  ?T1 :drama_workshop_groups\\#store_email_address ?T1_store_email_address . ?T2 :addresses\\#state_county ?T2_state_county . FILTER(?T2_state_county = 'Alaska') .        }"
    },
    {
        "kg_name": "cre_drama_workshop_groups",
        "question": "Which cities have at least one customer but no performer?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_city_town as ?col1) WHERE { ?T1 a :addresses . ?T1 :addresses\\#city_town ?T1_city_town .   }}  MINUS {SELECT (?T2_city_town as ?col1) WHERE { ?T2 a :addresses . ?T2 :addresses\\#city_town ?T2_city_town .        }     } }"
    },
    {
        "kg_name": "cre_drama_workshop_groups",
        "question": "What are the names of the clients who do not have any booking?",
        "query": "SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :clients . ?T1 :clients\\#customer_name ?T1_customer_name .   }}  MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :clients . ?T2 :clients\\#customer_name ?T2_customer_name .        }     } }"
    },
    {
        "kg_name": "music_2",
        "question": "What are the names of the songs by the artist whose last name is 'Heilo'?",
        "query": "SELECT ?T1_title WHERE { ?T1 a :songs . ?T13 a :performance . ?T13 :performance\\#ref-songid ?T1 .  ?T1 :songs\\#title ?T1_title . ?T2 :band\\#lastname ?T2_lastname . ?T2 a :band . ?T13 :performance\\#ref-bandmate ?T2 .  ?T1 :songs\\#title ?T1_title . ?T2 :band\\#lastname ?T2_lastname . FILTER(?T2_lastname = 'Heilo') .        }"
    }
]