kg_name,question,query
baseball_1,What is the average number of attendance at home games for each year?,SELECT ?T1_year (avg( ?T1_attendance) as ?aggregation_T1_attendance_79 ) WHERE { ?T1 a :home_game . ?T1 :home_game\#year ?T1_year . ?T1 :home_game\#attendance ?T1_attendance .        } GROUP BY ?T1_year
baseball_1,"For each year, return the year and the average number of attendance at home games.",SELECT ?T1_year (avg( ?T1_attendance) as ?aggregation_T1_attendance_187 ) WHERE { ?T1 a :home_game . ?T1 :home_game\#year ?T1_year . ?T1 :home_game\#attendance ?T1_attendance .        } GROUP BY ?T1_year
baseball_1,"In 2014, what are the id and rank of the team that has the largest average number of attendance?",SELECT ?T1_team_id ?T1_rank WHERE { ?T1 a :team . ?T2 a :home_game . ?T2 :home_game\#ref-team_id ?T1 .  ?T1 :team\#team_id ?T1_team_id . ?T1 :team\#rank ?T1_rank . ?T2 :home_game\#attendance ?T2_attendance . ?T2 :home_game\#year ?T2_year . FILTER(?T2_year = 2014) .        } GROUP BY ?T1_team_id ?T1_rank  ORDER BY DESC ((avg( ?T2_attendance) as ?aggregation_T2_attendance_30 )) LIMIT 1
baseball_1,"What are the manager's first name, last name and id who won the most manager award?",SELECT ?T1_name_first (count( *) as ?aggregation_all) ?T1_name_last ?T2_player_id WHERE { ?T2 :manager_award\#ref-player_id ?T1 .        } GROUP BY ?T1_name_first ?T1_name_last ?T2_player_id  ORDER BY DESC (?aggregation_all) LIMIT 1
baseball_1,How many parks are there in the state of NY?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :park . ?T1 :park\#state ?T1_state . FILTER(?T1_state = 'NY') .        }
baseball_1,Which 3 players won the most player awards? List their full name and id.,SELECT ?T1_name_first (count( *) as ?aggregation_all) ?T1_name_last ?T1_player_id WHERE { ?T1 a :player . ?T2 a :player_award . ?T2 :player_award\#ref-player_id ?T1 .  ?T1 :player\#name_first ?T1_name_first . ?T1 :player\#name_last ?T1_name_last . ?T1 :player\#player_id ?T1_player_id .        } GROUP BY ?T1_name_first ?T1_name_last ?T1_player_id  ORDER BY DESC (?aggregation_all) LIMIT 1
baseball_1,List three countries which are the origins of the least players.,SELECT ?T1_birth_country (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#birth_country ?T1_birth_country .        } GROUP BY ?T1_birth_country  ORDER BY ASC (?aggregation_all) LIMIT 1
baseball_1,What are the three countries that the least players are from?,SELECT ?T1_birth_country (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#birth_country ?T1_birth_country .        } GROUP BY ?T1_birth_country  ORDER BY ASC (?aggregation_all) LIMIT 1
baseball_1,Find all the players' first name and last name who have empty death record.,"SELECT ?t1_name_first ?t2_name_last WHERE {?t1 a :player . ?t1 :player\#death_year ?t1_death_year .
?t1 :player\#name_first ?t1_name_first . ?t1 :player\#name_last ?t1_n . FILTER (?t1_death_year = 0)}"
baseball_1,"How many players born in USA are right-handed batters? That is, have the batter value 'R'.",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :player\#birth_country ?T1_birth_country . ?T1 :player\#bats ?T1_bats . FILTER(?T1_birth_country = 'USA' && ?T1_bats = 'R') .        }
baseball_1,Find the average height of the players who belong to the college called 'Yale University'.,SELECT (avg( ?T1_height) as ?aggregation_T1_height_194 ) WHERE { ?T2 :college\#ref-player_id ?T1 . FILTER(?T2_name_full = 'Yale University') .        }
baseball_1,"What is the highest salary among each team? List the team name, id and maximum salary.",SELECT ?T1_name ?T1_team_id (max( ?T2_salary) as ?aggregation_T2_salary_153 ) WHERE { ?T2 :salary\#ref-team_id ?T1 .        } GROUP BY ?T1_name ?T1_team_id
baseball_1,"For each team, return the team name, id and the maximum salary among the team.",SELECT ?T1_name ?T1_team_id (max( ?T2_salary) as ?aggregation_T2_salary_77 ) WHERE { ?T2 :salary\#ref-team_id ?T1 .        } GROUP BY ?T1_name ?T1_team_id
baseball_1,What are the name and id of the team offering the lowest average salary?,SELECT ?T1_name ?T1_team_id WHERE { ?T2 :salary\#ref-team_id ?T1 .        } GROUP BY ?T1_name ?T1_team_id  ORDER BY ASC ((avg( ?T2_salary) as ?aggregation_T2_salary_104 )) LIMIT 1
baseball_1,Which team offers the lowest average salary? Give me the name and id of the team.,SELECT ?T1_name ?T1_team_id WHERE { ?T2 :salary\#ref-team_id ?T1 .        } GROUP BY ?T1_name ?T1_team_id  ORDER BY ASC ((avg( ?T2_salary) as ?aggregation_T2_salary_192 )) LIMIT 1
baseball_1,Find the players' first name and last name who won award both in 1960 and in 1961.,SELECT DISTINCT ?T1_name_first ?T1_name_last WHERE { ?T1 a :player . ?T2 a :player_award . ?T2 :player_award\#ref-player_id ?T1 .  ?T1 :player\#name_first ?T1_name_first . ?T1 :player\#name_last ?T1_name_last . ?T2 :player_award\#year ?T2_year . FILTER(?T2_year = 1960) . FILTER (?T1_name_first in (?T3_name_first)) . FILTER (?T1_name_last in (?T3_name_last)) .   ?T3 a :player . ?T4 a :player_award . ?T4 :player_award\#ref-player_id ?T3 .  ?T3 :player\#name_first ?T3_name_first . ?T3 :player\#name_last ?T3_name_last . ?T4 :player_award\#year ?T4_year .  FILTER(?T4_year = 1961) .             }
baseball_1,List players' first name and last name who have weight greater than 220 or height shorter than 75.,SELECT ?T1_name_first ?T1_name_last WHERE { ?T1 a :player . ?T1 :player\#name_first ?T1_name_first . ?T1 :player\#name_last ?T1_name_last . ?T1 :player\#weight ?T1_weight . ?T1 :player\#height ?T1_height . FILTER(?T1_weight > 220 || ?T1_height < 75) .        }
baseball_1,How many times did Boston Red Stockings lose in 2009 postseason?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :postseason\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings' && ?T1_year = 2009) .        }
baseball_1,What are the name and id of the team with the most victories in 2008 postseason?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T2_team_id_winner WHERE { ?T2 :postseason\#ref-team_id ?T1 . FILTER(?T2_year = 2008) .        } GROUP BY ?T1_name ?T2_team_id_winner  ORDER BY DESC (?aggregation_all) LIMIT 1
baseball_1,"For each year, return the year and the number of times the team Boston Red Stockings won in the postseasons.",SELECT (count( *) as ?aggregation_all) ?T1_year WHERE { ?T1 :postseason\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings') .        } GROUP BY ?T1_year
baseball_1,What is the total number of postseason games that team Boston Red Stockings participated in?,SELECT (COUNT(*) as ?agg) WHERE {{SELECT * WHERE{ ?t1 a :postseason . ?t2 a :team . ?t1 :postseason\#ref-team_id_winner ?t2 . ?t2 :team\#name ?t2_name . FILTER (?t2_name ='Boston Red Stockings' )}}UNION{{SELECT * WHERE {?t3 a :postseason . ?t4 a :team . ?t3 :team\#ref-team_id_loser ?t4 . ?t3 :team\#name ?t3_name . FILTER (?t3_name ='Boston Red Stockings') }}}}
baseball_1,How many times in total did the team Boston Red Stockings participate in postseason games?,SELECT (COUNT(*) as ?agg) WHERE {{SELECT * WHERE{ ?t1 a :postseason . ?t2 a :team . ?t1 :postseason\#ref-team_id_winner ?t2 . ?t2 :team\#name ?t2_name . FILTER (?t2_name ='Boston Red Stockings' )}}UNION{{SELECT * WHERE {?t3 a :postseason . ?t4 a :team . ?t3 :team\#ref-team_id_loser ?t4 . ?t3 :team\#name ?t3_name . FILTER (?t3_name ='Boston Red Stockings') }}}}
baseball_1,"How many games in 1885 postseason resulted in ties (that is, the value of 'ties' is '1')?",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :postseason . ?T1 :postseason\#year ?T1_year . ?T1 :postseason\#ties ?T1_ties . FILTER(?T1_year = 1885 && ?T1_ties = 1) .        }
baseball_1,What is the total salary paid by team Boston Red Stockings in 2010?,SELECT (sum( ?T1_salary) as ?aggregation_T1_salary_126 ) WHERE { ?T1 :salary\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings' && ?T1_year = 2010) .        }
baseball_1,What is the total salary expenses of team Boston Red Stockings in 2010?,SELECT (sum( ?T1_salary) as ?aggregation_T1_salary_197 ) WHERE { ?T1 :salary\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings' && ?T1_year = 2010) .        }
baseball_1,How many players were in the team Boston Red Stockings in 2000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :salary\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings' && ?T1_year = 2000) .        }
baseball_1,How many players did Boston Red Stockings have in 2000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 :salary\#ref-team_id ?T2 . FILTER(?T2_name = 'Boston Red Stockings' && ?T1_year = 2000) .        }
baseball_1,List the 3 highest salaries of the players in 2001?,SELECT ?T1_salary WHERE { ?T1 a :salary . ?T1 :salary\#salary ?T1_salary . ?T1 :salary\#salary ?T1_salary . ?T1 :salary\#year ?T1_year . FILTER(?T1_year = 2001) .        }   ORDER BY DESC (?T1_salary) LIMIT 1
baseball_1,How much salary did the top 3 well-paid players get in 2001?,SELECT ?T1_salary WHERE { ?T1 a :salary . ?T1 :salary\#salary ?T1_salary . ?T1 :salary\#salary ?T1_salary . ?T1 :salary\#year ?T1_year . FILTER(?T1_year = 2001) .        }   ORDER BY DESC (?T1_salary) LIMIT 1
baseball_1,What were all the salary values of players in 2010 and 2001?,SELECT distinct?col1 WHERE { { SELECT (?T1_salary as ?col1) WHERE { ?T1 a :salary . ?T1 :salary\#salary ?T1_salary . ?T1 :salary\#year ?T1_year . FILTER(?T1_year = 2010) .   }} UNION {SELECT (?T1_salary as ?col1) WHERE { ?T1 a :salary . ?T1 :salary\#salary ?T1_salary . ?T1 :salary\#year ?T1_year . FILTER(?T1_year = 2001) .        }      } }
baseball_1,In which year did the least people enter hall of fame?,SELECT ?T1_yearid (count( *) as ?aggregation_all) WHERE { ?T1 a :hall_of_fame . ?T1 :hall_of_fame\#yearid ?T1_yearid .        } GROUP BY ?T1_yearid  ORDER BY ASC (?aggregation_all) LIMIT 1
baseball_1,How many parks are there in Atlanta city?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :park . ?T1 :park\#city ?T1_city . FILTER(?T1_city = 'Atlanta') .        }
baseball_1,How many parks does Atlanta city have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :park . ?T1 :park\#city ?T1_city . FILTER(?T1_city = 'Atlanta') .        }
baseball_1,How many games were played in park 'Columbia Park' in 1907?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :home_game . ?T2 a :park . ?T1 :home_game\#ref-park_id ?T2 .  ?T1 :home_game\#year ?T1_year . ?T2 :park\#park_name ?T2_park_name . FILTER(?T1_year = 1907 && ?T2_park_name = 'Columbia Park') .        }
baseball_1,How many games were played in city Atlanta in 2000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :home_game . ?T2 a :park . ?T1 :home_game\#ref-park_id ?T2 .  ?T1 :home_game\#year ?T1_year . ?T2 :park\#city ?T2_city . FILTER(?T1_year = 2000 && ?T2_city = 'Atlanta') .        }
baseball_1,Compute the total salary that the player with first name Len and last name Barker received between 1985 to 1990.,SELECT (sum( ?T1_salary) as ?aggregation_T1_salary_151 ) WHERE { ?T1 :salary\#ref-player_id ?T2 . FILTER(?T2_name_first = 'Len' && ?T2_name_last = 'Barker' && ?T1_year >= 1985 && ?T1_year <= 1990) .        }
baseball_1,List players' first name and last name who received salary from team Washington Nationals in both 2005 and 2007.,SELECT DISTINCT ?T1_name_first ?T1_name_last WHERE { ?T1 a :player . ?T3 a :team . ?T1 :player\#ref-team ?T3 .  ?T1 :player\#name_first ?T1_name_first . ?T1 :player\#name_last ?T1_name_last . ?T2 :salary\#year ?T2_year . ?T3 :team\#name ?T3_name . FILTER(?T2_year = 2005 && ?T3_name = 'Washington Nationals') . FILTER (?T1_name_first in (?T4_name_first)) . FILTER (?T1_name_last in (?T4_name_last)) .   ?T4 a :player . ?T6 a :team . ?T4 :player\#ref-team ?T6 .  ?T4 :player\#name_first ?T4_name_first . ?T4 :player\#name_last ?T4_name_last . ?T5 :salary\#year ?T5_year . ?T6 :team\#name ?T6_name .  FILTER(?T5_year = 2007 && ?T6_name = 'Washington Nationals') .             }
baseball_1,What are the first name and last name of the players who were paid salary by team Washington Nationals in both 2005 and 2007?,SELECT DISTINCT ?T1_name_first ?T1_name_last WHERE { ?T1 a :player . ?T3 a :team . ?T1 :player\#ref-team ?T3 .  ?T1 :player\#name_first ?T1_name_first . ?T1 :player\#name_last ?T1_name_last . ?T2 :salary\#year ?T2_year . ?T3 :team\#name ?T3_name . FILTER(?T2_year = 2005 && ?T3_name = 'Washington Nationals') . FILTER (?T1_name_first in (?T4_name_first)) . FILTER (?T1_name_last in (?T4_name_last)) .   ?T4 a :player . ?T6 a :team . ?T4 :player\#ref-team ?T6 .  ?T4 :player\#name_first ?T4_name_first . ?T4 :player\#name_last ?T4_name_last . ?T5 :salary\#year ?T5_year . ?T6 :team\#name ?T6_name .  FILTER(?T5_year = 2007 && ?T6_name = 'Washington Nationals') .             }
baseball_1,Count the total number of games the team Boston Red Stockings attended from 1990 to 2000.,SELECT (sum( ?T1_games) as ?aggregation_T1_games_0 ) WHERE { ?T1 a :home_game . ?T2 a :team . ?T1 :home_game\#ref-team_id ?T2 .  ?T1 :home_game\#games ?T1_games . ?T2 :team\#name ?T2_name . ?T1 :home_game\#year ?T1_year . FILTER(?T2_name = 'Boston Red Stockings' && ?T1_year >= 1990 && ?T1_year <= 2000) .        }
baseball_1,Which team had the least number of attendances in home games in 1980?,SELECT ?T1_name WHERE { ?T1 a :team . ?T2 a :home_game . ?T2 :home_game\#ref-team_id ?T1 .  ?T1 :team\#name ?T1_name . ?T2 :home_game\#attendance ?T2_attendance . ?T2 :home_game\#year ?T2_year . FILTER(?T2_year = 1980) .        }   ORDER BY ASC (?T2_attendance) LIMIT 1
baseball_1,List the names of states that have more than 2 parks.,SELECT ?T1_state WHERE { ?T1 a :park . ?T1 :park\#state ?T1_state .        } GROUP BY ?T1_state   HAVING(count( *)  > 2)
baseball_1,Which states have more than 2 parks?,SELECT ?T1_state WHERE { ?T1 a :park . ?T1 :park\#state ?T1_state .        } GROUP BY ?T1_state   HAVING(count( *)  > 2)
baseball_1,Find the number of team franchises that are active (have 'Y' as 'active' information).,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :team_franchise . ?T1 :team_franchise\#active ?T1_active . FILTER(?T1_active = 'Y') .        }
baseball_1,Which cities have 2 to 4 parks?,SELECT ?T1_city WHERE { ?T1 a :park . ?T1 :park\#city ?T1_city .        } GROUP BY ?T1_city   HAVING(count( *)  >= 2 && count( *)  <= 4)
baseball_1,Which park had most attendances in 2008?,SELECT ?T1_park_name WHERE { ?T1 a :park . ?T2 a :home_game . ?T2 :home_game\#ref-park_id ?T1 .  ?T1 :park\#park_name ?T1_park_name . ?T2 :home_game\#attendance ?T2_attendance . ?T2 :home_game\#year ?T2_year . FILTER(?T2_year = 2008) .        }   ORDER BY DESC (?T2_attendance) LIMIT 1
baseball_1,Which park did the most people attend in 2008?,SELECT ?T1_park_name WHERE { ?T1 a :park . ?T2 a :home_game . ?T2 :home_game\#ref-park_id ?T1 .  ?T1 :park\#park_name ?T1_park_name . ?T2 :home_game\#attendance ?T2_attendance . ?T2 :home_game\#year ?T2_year . FILTER(?T2_year = 2008) .        }   ORDER BY DESC (?T2_attendance) LIMIT 1
mountain_photos,How many camera lenses have a focal length longer than 15 mm?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :camera_lens . ?T1 :camera_lens\#focal_length_mm ?T1_focal_length_mm . FILTER(?T1_focal_length_mm > 15) .        }
mountain_photos,"Find the brand and name for each camera lens, and sort in descending order of maximum aperture.",SELECT ?T1_brand ?T1_name WHERE { ?T1 a :camera_lens . ?T1 :camera_lens\#brand ?T1_brand . ?T1 :camera_lens\#name ?T1_name . ?T1 :camera_lens\#max_aperture ?T1_max_aperture .        }  ORDER BY DESC (?T1_max_aperture)
mountain_photos,"List the id, color scheme, and name for all the photos.",SELECT ?T1_id ?T1_color ?T1_name WHERE { ?T1 a :photos . ?T1 :photos\#id ?T1_id . ?T1 :photos\#color ?T1_color . ?T1 :photos\#name ?T1_name .        }
mountain_photos,What are the maximum and average height of the mountains?,SELECT (max( ?T1_height) as ?aggregation_T1_height_52 ) (avg( ?T1_height) as ?aggregation_T1_height_52 ) WHERE { ?T1 a :mountain . ?T1 :mountain\#height ?T1_height . ?T1 :mountain\#height ?T1_height .        }
mountain_photos,What are the average prominence of the mountains in country 'Morocco'?,SELECT (avg( ?T1_prominence) as ?aggregation_T1_prominence_114 ) WHERE { ?T1 a :mountain . ?T1 :mountain\#prominence ?T1_prominence . ?T1 :mountain\#country ?T1_country . FILTER(?T1_country = 'Morocco') .        }
mountain_photos,What are the id and name of the photos for mountains?,SELECT ?T1_id ?T1_name WHERE { ?T1 a :mountain . ?T1 :mountain\#id ?T1_id . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#height ?T1_height . FILTER(?T1_height > 4000) .        }
mountain_photos,What are the id and name of the mountains that have at least 2 photos?,SELECT ?T1_id ?T1_name WHERE { ?T1 a :mountain . ?T2 a :photos . ?T2 :photos\#ref-mountain_id ?T1 .  ?T1 :mountain\#id ?T1_id . ?T1 :mountain\#name ?T1_name .        } GROUP BY ?T1_id ?T1_name   HAVING(count( *)  >= 2)
mountain_photos,What are the names of photos taken with the lens brand 'Sigma' or 'Olympus'?,SELECT ?T1_name WHERE { ?T1 a :camera_lens . ?T1 :camera_lens\#name ?T1_name . ?T1 :camera_lens\#brand ?T1_brand . ?T1 :camera_lens\#brand ?T1_brand . FILTER(?T1_brand = 'Sigma' || ?T1_brand = 'Olympus') .        }
mountain_photos,How many different kinds of lens brands are there?,SELECT DISTINCT (count(DISTINCT ?T1_brand) as ?aggregation_T1_brand_165 ) WHERE { ?T1 a :camera_lens . ?T1 :camera_lens\#brand ?T1_brand .        }
mountain_photos,How many camera lenses are not used in taking any photos?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :camera_lens . ?T1 :camera_lens\#id ?T1_id . FILTER(?T1_id not in (?T22_camera_lens_id)) .       {SELECT ?T22_camera_lens_id WHERE { ?T22 a :photos . ?T22 :photos\#camera_lens_id ?T22_camera_lens_id .        }    } }
mountain_photos,List the brands of lenses that took both a picture of mountains with range 'Toubkal Atlas' and a picture of mountains with range 'Lasta Massif',SELECT DISTINCT ?T1_brand WHERE { ?T1 a :camera_lens . ?T13 a :photos . ?T13 :photos\#ref-camera_lens_id ?T1 .  ?T1 :camera_lens\#brand ?T1_brand . ?T2 :mountain\#range ?T2_range . ?T2 a :mountain . ?T13 :photos\#ref-mountain_id ?T2 .  ?T1 :camera_lens\#brand ?T1_brand . ?T2 :mountain\#range ?T2_range . FILTER(?T2_range = 'Toubkal Atlas') . FILTER (?T1_brand in (?T3_brand)) .   ?T3 a :camera_lens . ?T15 a :photos . ?T15 :photos\#ref-camera_lens_id ?T3 .  ?T3 :camera_lens\#brand ?T3_brand . ?T4 :mountain\#range ?T4_range . ?T4 a :mountain . ?T15 :photos\#ref-mountain_id ?T4 .  ?T3 :camera_lens\#brand ?T3_brand . ?T4 :mountain\#range ?T4_range .  FILTER(?T4_range = 'Lasta Massif') .             }
mountain_photos,Show the name and prominence of the mountains whose picture is not taken by a lens of brand 'Sigma'.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_prominence as ?col2) WHERE { ?T1 a :mountain . ?T1 :mountain\#name ?T1_name . ?T1 :mountain\#prominence ?T1_prominence .   }}  MINUS {SELECT (?T2_name as ?col1) (?T2_prominence as ?col2) WHERE { ?T2 a :mountain . ?T14 a :photos . ?T14 :photos\#ref-mountain_id ?T2 .  ?T2 :mountain\#name ?T2_name . ?T2 :mountain\#prominence ?T2_prominence . ?T3 :camera_lens\#brand ?T3_brand . ?T3 a :camera_lens . ?T14 :photos\#ref-camera_lens_id ?T3 .  ?T2 :mountain\#name ?T2_name . ?T2 :mountain\#prominence ?T2_prominence . ?T3 :camera_lens\#brand ?T3_brand . FILTER(?T3_brand = 'Sigma') .        }     } }
mountain_photos,List the camera lens names containing substring 'Digital'.,"SELECT ?T1_name WHERE { ?T1 a :camera_lens . ?T1 :camera_lens\#name ?T1_name . ?T1 :camera_lens\#name ?T1_name . FILTER(contains (?T1_name, 'Digital')) .        }"
mountain_photos,What is the name of each camera lens and the number of photos taken by it? Order the result by the count of photos.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :camera_lens . ?T2 a :photos . ?T2 :photos\#ref-camera_lens_id ?T1 .  ?T1 :camera_lens\#name ?T1_name .        } GROUP BY ?T1_name ORDER BY ASC ((count( *) as ?aggregation_all))
program_share,Find the names of channels that are not owned by CCTV.,SELECT ?T1_name WHERE { ?T1 a :channel . ?T1 :channel\#name ?T1_name . ?T1 :channel\#owner ?T1_owner . FILTER(?T1_owner != 'CCTV') .        }
program_share,List all channel names ordered by their rating in percent from big to small.,SELECT ?T1_name WHERE { ?T1 a :channel . ?T1 :channel\#name ?T1_name . ?T1 :channel\#rating_in_percent ?T1_rating_in_percent .        }  ORDER BY DESC (?T1_rating_in_percent)
program_share,What is the owner of the channel that has the highest rating ratio?,SELECT ?T1_owner WHERE { ?T1 a :channel . ?T1 :channel\#owner ?T1_owner . ?T1 :channel\#rating_in_percent ?T1_rating_in_percent .        }   ORDER BY DESC (?T1_rating_in_percent) LIMIT 1
program_share,how many programs are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :program .        }
program_share,"list all the names of programs, ordering by launch time.",SELECT ?T1_name WHERE { ?T1 a :program . ?T1 :program\#name ?T1_name . ?T1 :program\#launch ?T1_launch .        }  ORDER BY ASC (?T1_launch)
program_share,"List the name, origin and owner of each program.",SELECT ?T1_name ?T1_origin ?T1_owner WHERE { ?T1 a :program . ?T1 :program\#name ?T1_name . ?T1 :program\#origin ?T1_origin . ?T1 :program\#owner ?T1_owner .        }
program_share,find the name of the program that was launched most recently.,SELECT ?T1_name WHERE { ?T1 a :program . ?T1 :program\#name ?T1_name . ?T1 :program\#launch ?T1_launch .        }   ORDER BY DESC (?T1_launch) LIMIT 1
program_share,find the total percentage share of all channels owned by CCTV.,SELECT (sum( ?T1_share_in_percent) as ?aggregation_T1_share_in_percent_50 ) WHERE { ?T1 a :channel . ?T1 :channel\#share_in_percent ?T1_share_in_percent . ?T1 :channel\#owner ?T1_owner . FILTER(?T1_owner = 'CCTV') .        }
program_share,What is the total share (in percent) of all the channels owned by CCTV?,SELECT (sum( ?T1_share_in_percent) as ?aggregation_T1_share_in_percent_125 ) WHERE { ?T1 a :channel . ?T1 :channel\#share_in_percent ?T1_share_in_percent . ?T1 :channel\#owner ?T1_owner . FILTER(?T1_owner = 'CCTV') .        }
program_share,Find the names of the channels that are broadcast in the morning.,SELECT ?T1_name WHERE { ?T1 a :channel . ?T2 a :broadcast . ?T2 :broadcast\#ref-channel_id ?T1 .  ?T1 :channel\#name ?T1_name . ?T2 :broadcast\#time_of_day ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') .        }
program_share,Which channels broadcast both in the morning and at night? Give me the channel names.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :channel . ?T2 a :broadcast . ?T2 :broadcast\#ref-channel_id ?T1 .  ?T1 :channel\#name ?T1_name . ?T2 :broadcast\#time_of_day ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :channel . ?T4 a :broadcast . ?T4 :broadcast\#ref-channel_id ?T3 .  ?T3 :channel\#name ?T3_name . ?T4 :broadcast\#time_of_day ?T4_time_of_day .  FILTER(?T4_time_of_day = 'Night') .             }
program_share,how many programs are broadcast in each time section of the day?,SELECT (count( *) as ?aggregation_all) ?T1_time_of_day WHERE { ?T1 a :broadcast . ?T1 :broadcast\#time_of_day ?T1_time_of_day .        } GROUP BY ?T1_time_of_day
program_share,find the number of different programs that are broadcast during night time.,SELECT DISTINCT (count(DISTINCT ?T1_program_id) as ?aggregation_T1_program_id_129 ) WHERE { ?T1 a :broadcast . ?T1 :broadcast\#program_id ?T1_program_id . ?T1 :broadcast\#time_of_day ?T1_time_of_day . FILTER(?T1_time_of_day = 'Night') .        }
program_share,How many distinct programs are broadcast at 'Night' time?,SELECT DISTINCT (count(DISTINCT ?T1_program_id) as ?aggregation_T1_program_id_189 ) WHERE { ?T1 a :broadcast . ?T1 :broadcast\#program_id ?T1_program_id . ?T1 :broadcast\#time_of_day ?T1_time_of_day . FILTER(?T1_time_of_day = 'Night') .        }
program_share,Find the names of programs that are never broadcasted in the morning.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :program . ?T1 :program\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :program . ?T3 a :broadcast . ?T3 :broadcast\#ref-program_id ?T2 .  ?T2 :program\#name ?T2_name . ?T3 :broadcast\#time_of_day ?T3_time_of_day . FILTER(?T3_time_of_day = 'Morning') .        }     } }
program_share,find the program owners that have some programs in both morning and night time.,SELECT DISTINCT ?T1_owner WHERE { ?T1 a :program . ?T2 a :broadcast . ?T2 :broadcast\#ref-program_id ?T1 .  ?T1 :program\#owner ?T1_owner . ?T2 :broadcast\#time_of_day ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . FILTER (?T1_owner in (?T3_owner)) .   ?T3 a :program . ?T4 a :broadcast . ?T4 :broadcast\#ref-program_id ?T3 .  ?T3 :program\#owner ?T3_owner . ?T4 :broadcast\#time_of_day ?T4_time_of_day .  FILTER(?T4_time_of_day = 'Night') .             }
program_share,List all program origins in the alphabetical order.,SELECT ?T1_origin WHERE { ?T1 a :program . ?T1 :program\#origin ?T1_origin . ?T1 :program\#origin ?T1_origin .        }  ORDER BY ASC (?T1_origin)
program_share,What is the list of program origins ordered alphabetically?,SELECT ?T1_origin WHERE { ?T1 a :program . ?T1 :program\#origin ?T1_origin . ?T1 :program\#origin ?T1_origin .        }  ORDER BY ASC (?T1_origin)
program_share,what is the number of different channel owners?,SELECT DISTINCT (count(DISTINCT ?T1_owner) as ?aggregation_T1_owner_107 ) WHERE { ?T1 a :channel . ?T1 :channel\#owner ?T1_owner .        }
program_share,Count the number of distinct channel owners.,SELECT DISTINCT (count(DISTINCT ?T1_owner) as ?aggregation_T1_owner_6 ) WHERE { ?T1 a :channel . ?T1 :channel\#owner ?T1_owner .        }
program_share,find the names of programs whose origin is not in Beijing.,SELECT ?T1_name WHERE { ?T1 a :program . ?T1 :program\#name ?T1_name . ?T1 :program\#origin ?T1_origin . FILTER(?T1_origin != 'Beijing') .        }
program_share,What are the names of the channels owned by CCTV or HBS?,SELECT ?T1_name WHERE { ?T1 a :channel . ?T1 :channel\#name ?T1_name . ?T1 :channel\#owner ?T1_owner . ?T1 :channel\#owner ?T1_owner . FILTER(?T1_owner = 'CCTV' || ?T1_owner = 'HBS') .        }
program_share,Find the total rating ratio for each channel owner.,SELECT (sum( ?T1_rating_in_percent) as ?aggregation_T1_rating_in_percent_63 ) ?T1_owner WHERE { ?T1 a :channel . ?T1 :channel\#rating_in_percent ?T1_rating_in_percent . ?T1 :channel\#owner ?T1_owner .        } GROUP BY ?T1_owner
program_share,What is the total rating of channel for each channel owner?,SELECT (sum( ?T1_rating_in_percent) as ?aggregation_T1_rating_in_percent_31 ) ?T1_owner WHERE { ?T1 a :channel . ?T1 :channel\#rating_in_percent ?T1_rating_in_percent . ?T1 :channel\#owner ?T1_owner .        } GROUP BY ?T1_owner
program_share,Find the name of the program that is broadcast most frequently.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :program . ?T2 a :broadcast . ?T2 :broadcast\#ref-program_id ?T1 .  ?T1 :program\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_learning,How many courses are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :courses .        }
e_learning,What are the descriptions of the courses with name 'database'?,SELECT ?T1_course_description WHERE { ?T1 a :courses . ?T1 :courses\#course_description ?T1_course_description . ?T1 :courses\#course_name ?T1_course_name . FILTER(?T1_course_name = 'database') .        }
e_learning,What are the addresses of the course authors or tutors with personal name 'Cathrine',SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#address_line_1 ?T1_address_line_1 . ?T1 :course_authors_and_tutors\#personal_name ?T1_personal_name . FILTER(?T1_personal_name = 'Cathrine') .        }
e_learning,List the addresses of all the course authors or tutors.,SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#address_line_1 ?T1_address_line_1 .        }
e_learning,What is the address of each course author or tutor?,SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#address_line_1 ?T1_address_line_1 .        }
e_learning,List all the login names and family names of course author and tutors.,SELECT ?T1_login_name ?T1_family_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#login_name ?T1_login_name . ?T1 :course_authors_and_tutors\#family_name ?T1_family_name .        }
e_learning,What are the login names and family names of course author and tutors?,SELECT ?T1_login_name ?T1_family_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#login_name ?T1_login_name . ?T1 :course_authors_and_tutors\#family_name ?T1_family_name .        }
e_learning,List all the dates of enrollment and completion of students.,SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\#date_of_completion ?T1_date_of_completion .        }
e_learning,What are all the dates of enrollment and completion in record?,SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\#date_of_completion ?T1_date_of_completion .        }
e_learning,How many distinct students are enrolled in courses?,SELECT DISTINCT (count(DISTINCT ?T1_student_id) as ?aggregation_T1_student_id_105 ) WHERE { ?T1 a :student_course_enrolment . ?T1 :student_course_enrolment\#student_id ?T1_student_id .        }
e_learning,Find the number of distinct students enrolled in courses.,SELECT DISTINCT (count(DISTINCT ?T1_student_id) as ?aggregation_T1_student_id_187 ) WHERE { ?T1 a :student_course_enrolment . ?T1 :student_course_enrolment\#student_id ?T1_student_id .        }
e_learning,How many distinct courses are enrolled in by students?,SELECT (count( ?T1_course_id) as ?aggregation_T1_course_id_24 ) WHERE { ?T1 a :student_course_enrolment . ?T1 :student_course_enrolment\#course_id ?T1_course_id .        }
e_learning,Find the number of distinct courses that have enrolled students.,SELECT (count( ?T1_course_id) as ?aggregation_T1_course_id_28 ) WHERE { ?T1 a :student_course_enrolment . ?T1 :student_course_enrolment\#course_id ?T1_course_id .        }
e_learning,Find the dates of the tests taken with result 'Pass'.,SELECT ?T1_date_test_taken WHERE { ?T1 a :student_tests_taken . ?T1 :student_tests_taken\#date_test_taken ?T1_date_test_taken . ?T1 :student_tests_taken\#test_result ?T1_test_result . FILTER(?T1_test_result = 'Pass') .        }
e_learning,How many tests have result 'Fail'?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student_tests_taken . ?T1 :student_tests_taken\#test_result ?T1_test_result . FILTER(?T1_test_result = 'Fail') .        }
e_learning,What are the login names of the students with family name 'Ward'?,SELECT ?T1_login_name WHERE { ?T1 a :students . ?T1 :students\#login_name ?T1_login_name . ?T1 :students\#family_name ?T1_family_name . FILTER(?T1_family_name = 'Ward') .        }
e_learning,What are the dates of the latest logon of the students with family name 'Jaskolski' or 'Langosh'?,SELECT ?T1_date_of_latest_logon WHERE { ?T1 a :students . ?T1 :students\#date_of_latest_logon ?T1_date_of_latest_logon . ?T1 :students\#family_name ?T1_family_name . ?T1 :students\#family_name ?T1_family_name . FILTER(?T1_family_name = 'Jaskolski' || ?T1_family_name = 'Langosh') .        }
e_learning,How many students have personal names that contain the word 'son'?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T1 :students\#personal_name ?T1_personal_name . FILTER(contains (?T1_personal_name, 'son')) .        }"
