kg_name,question,query
cre_docs_and_epenses,Show the document name and the document date for all documents on project with details 'Graph Database project'.,SELECT ?T1_document_name ?T1_document_date WHERE { ?T1 a :documents . ?T2 a :projects . ?T1 :documents\#ref-project_id ?T2 .  ?T1 :documents\#document_name ?T1_document_name . ?T1 :documents\#document_date ?T1_document_date . ?T2 :projects\#project_details ?T2_project_details . FILTER(?T2_project_details = 'Graph Database project') .        }
cre_docs_and_epenses,Show project ids and the number of documents in each project.,SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#project_id ?T1_project_id .        } GROUP BY ?T1_project_id
cre_docs_and_epenses,How many documents correspond with each project id?,SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#project_id ?T1_project_id .        } GROUP BY ?T1_project_id
cre_docs_and_epenses,What is the id of the project with least number of documents?,SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#project_id ?T1_project_id .        } GROUP BY ?T1_project_id  ORDER BY ASC (?aggregation_all) LIMIT 1
cre_docs_and_epenses,Show the ids for projects with at least 2 documents.,SELECT ?T1_project_id WHERE { ?T1 a :documents . ?T1 :documents\#project_id ?T1_project_id .        } GROUP BY ?T1_project_id   HAVING(count( *)  >= 2)
cre_docs_and_epenses,List document type codes and the number of documents in each code.,SELECT ?T1_document_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code
cre_docs_and_epenses,How many documents are there of each type?,SELECT ?T1_document_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code
cre_docs_and_epenses,What is the document type code with most number of documents?,SELECT ?T1_document_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_docs_and_epenses,Show the document type code with fewer than 3 documents.,SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :documents\#document_type_code ?T1_document_type_code .        } GROUP BY ?T1_document_type_code   HAVING(count( *)  < 3)
cre_docs_and_epenses,Show the statement detail and the corresponding document name for the statement with detail 'Private Project'.,SELECT ?T1_statement_details ?T2_document_name WHERE { ?T1 a :statements . ?T2 a :documents . ?T1 :statements\#ref-statement_id ?T2 .  ?T1 :statements\#statement_details ?T1_statement_details . ?T2 :documents\#document_name ?T2_document_name . ?T1 :statements\#statement_details ?T1_statement_details . FILTER(?T1_statement_details = 'Private Project') .        }
cre_docs_and_epenses,"Show all document type codes, document type names, document type descriptions.",SELECT ?T1_document_type_code ?T1_document_type_name ?T1_document_type_description WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_code ?T1_document_type_code . ?T1 :ref_document_types\#document_type_name ?T1_document_type_name . ?T1 :ref_document_types\#document_type_description ?T1_document_type_description .        }
cre_docs_and_epenses,What is the document type description for document type named Film?,SELECT ?T1_document_type_description WHERE { ?T1 a :ref_document_types . ?T1 :ref_document_types\#document_type_description ?T1_document_type_description . ?T1 :ref_document_types\#document_type_name ?T1_document_type_name . FILTER(?T1_document_type_name = 'Film') .        }
cre_docs_and_epenses,"Return the type name, type description, and date of creation for each document.",SELECT ?T1_document_type_name ?T1_document_type_description ?T2_document_date WHERE { ?T1 a :ref_document_types . ?T2 a :documents . ?T2 :documents\#ref-document_type_code ?T1 .  ?T1 :ref_document_types\#document_type_name ?T1_document_type_name . ?T1 :ref_document_types\#document_type_description ?T1_document_type_description . ?T2 :documents\#document_date ?T2_document_date .        }
cre_docs_and_epenses,Show the number of projects.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :projects .        }
cre_docs_and_epenses,How many projects are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :projects .        }
cre_docs_and_epenses,List ids and details for all projects.,SELECT ?T1_project_id ?T1_project_details WHERE { ?T1 a :projects . ?T1 :projects\#project_id ?T1_project_id . ?T1 :projects\#project_details ?T1_project_details .        }
cre_docs_and_epenses,What are the ids and details for each project?,SELECT ?T1_project_id ?T1_project_details WHERE { ?T1 a :projects . ?T1 :projects\#project_id ?T1_project_id . ?T1 :projects\#project_details ?T1_project_details .        }
cre_docs_and_epenses,Return the ids and details corresponding to projects for which there are more than two documents.,SELECT ?T1_project_id ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :documents . ?T2 :documents\#ref-project_id ?T1 .  ?T1 :projects\#project_id ?T1_project_id . ?T1 :projects\#project_details ?T1_project_details .        } GROUP BY ?T1_project_id ?T1_project_details   HAVING(count( *)  > 2)
cre_docs_and_epenses,What is the project detail for the project with document 'King Book'?,SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :documents . ?T2 :documents\#ref-project_id ?T1 .  ?T1 :projects\#project_details ?T1_project_details . ?T2 :documents\#document_name ?T2_document_name . FILTER(?T2_document_name = 'King Book') .        }
cre_docs_and_epenses,How many budget types do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_budget_codes .        }
cre_docs_and_epenses,List all budget type codes and descriptions.,SELECT ?T1_budget_type_code ?T1_budget_type_description WHERE { ?T1 a :ref_budget_codes . ?T1 :ref_budget_codes\#budget_type_code ?T1_budget_type_code . ?T1 :ref_budget_codes\#budget_type_description ?T1_budget_type_description .        }
cre_docs_and_epenses,What are the type codes and descriptions of each budget type?,SELECT ?T1_budget_type_code ?T1_budget_type_description WHERE { ?T1 a :ref_budget_codes . ?T1 :ref_budget_codes\#budget_type_code ?T1_budget_type_code . ?T1 :ref_budget_codes\#budget_type_description ?T1_budget_type_description .        }
cre_docs_and_epenses,What is the description for the budget type with code ORG?,SELECT ?T1_budget_type_description WHERE { ?T1 a :ref_budget_codes . ?T1 :ref_budget_codes\#budget_type_description ?T1_budget_type_description . ?T1 :ref_budget_codes\#budget_type_code ?T1_budget_type_code . FILTER(?T1_budget_type_code = 'ORG') .        }
cre_docs_and_epenses,How many documents have expenses?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :documents_with_expenses .        }
cre_docs_and_epenses,What are the document ids for the budget type code 'SF'?,SELECT ?T1_document_id WHERE { ?T1 a :documents_with_expenses . ?T1 :documents_with_expenses\#document_id ?T1_document_id . ?T1 :documents_with_expenses\#budget_type_code ?T1_budget_type_code . FILTER(?T1_budget_type_code = 'SF') .        }
cre_docs_and_epenses,Show the budget type code and description and the corresponding document id.,SELECT ?T1_budget_type_code ?T1_budget_type_description ?T2_document_id WHERE { ?T1 a :ref_budget_codes . ?T2 a :documents_with_expenses . ?T2 :documents_with_expenses\#ref-budget_type_code ?T1 .  ?T1 :ref_budget_codes\#budget_type_code ?T1_budget_type_code . ?T1 :ref_budget_codes\#budget_type_description ?T1_budget_type_description . ?T2 :documents_with_expenses\#document_id ?T2_document_id .        }
cre_docs_and_epenses,Show ids for all documents with budget types described as 'Government'.,SELECT ?T1_document_id WHERE { ?T1 a :documents_with_expenses . ?T2 a :ref_budget_codes . ?T1 :documents_with_expenses\#ref-budget_type_code ?T2 .  ?T1 :documents_with_expenses\#document_id ?T1_document_id . ?T2 :ref_budget_codes\#budget_type_description ?T2_budget_type_description . FILTER(?T2_budget_type_description = 'Government') .        }
cre_docs_and_epenses,Show budget type codes and the number of documents in each budget type.,SELECT ?T1_budget_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :documents_with_expenses . ?T1 :documents_with_expenses\#budget_type_code ?T1_budget_type_code .        } GROUP BY ?T1_budget_type_code
cre_docs_and_epenses,What is the budget type code with most number of documents.,SELECT ?T1_budget_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :documents_with_expenses . ?T1 :documents_with_expenses\#budget_type_code ?T1_budget_type_code .        } GROUP BY ?T1_budget_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
cre_docs_and_epenses,What are the ids of documents which don't have expense budgets?,SELECT distinct?col1 WHERE { { SELECT (?T1_document_id as ?col1) WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id .   }}  MINUS {SELECT (?T2_document_id as ?col1) WHERE { ?T2 a :documents_with_expenses . ?T2 :documents_with_expenses\#document_id ?T2_document_id .        }     } }
cre_docs_and_epenses,What are the ids of documents with letter 's' in the name with any expense budgets.,"SELECT ?T1_document_id WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . ?T1 :documents\#document_name ?T1_document_name . FILTER(contains (?T1_document_name, 's')) .        }"
cre_docs_and_epenses,How many documents do not have any expense?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#document_id ?T1_document_id . FILTER(?T1_document_id not in (?T22_document_id)) .       {SELECT ?T22_document_id WHERE { ?T22 a :documents_with_expenses . ?T22 :documents_with_expenses\#document_id ?T22_document_id .        }    } }
cre_docs_and_epenses,Give the dates of creation for documents that have both budget type codes 'GV' and 'SF'.,SELECT DISTINCT ?T1_document_date WHERE { ?T1 a :documents . ?T2 a :documents_with_expenses . ?T2 :documents_with_expenses\#ref-document_id ?T1 .  ?T1 :documents\#document_date ?T1_document_date . ?T2 :documents_with_expenses\#budget_type_code ?T2_budget_type_code . FILTER(?T2_budget_type_code = 'GV') . FILTER (?T1_document_date in (?T3_document_date)) .   ?T3 a :documents . ?T4 a :documents_with_expenses . ?T4 :documents_with_expenses\#ref-document_id ?T3 .  ?T3 :documents\#document_date ?T3_document_date . ?T4 :documents_with_expenses\#budget_type_code ?T4_budget_type_code .  FILTER(?T4_budget_type_code = 'SF') .             }
cre_docs_and_epenses,"Return the account details with the greatest value, as well as those that include the character 5.","SELECT distinct(max( ?T1_account_details) as ?aggregation_T1_account_details_22 ) WHERE { { SELECT ((max( ?T1_account_details) as ?aggregation_T1_account_details_22 ) as ?col1) WHERE { ?T1 a :accounts . ?T1 :accounts\#account_details ?T1_account_details .   }} UNION {SELECT (?T1_account_details as ?col1) WHERE { ?T1 a :accounts . ?T1 :accounts\#account_details ?T1_account_details . ?T1 :accounts\#account_details ?T1_account_details . FILTER(contains (?T1_account_details, '5')) .        }      } }"
scientist_1,Find the total number of scientists.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :scientists .        }
scientist_1,How many scientists are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :scientists .        }
scientist_1,Find the total hours of all projects.,SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_174 ) WHERE { ?T1 a :projects . ?T1 :projects\#hours ?T1_hours .        }
scientist_1,What is the total number of hours for all projects?,SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_53 ) WHERE { ?T1 a :projects . ?T1 :projects\#hours ?T1_hours .        }
scientist_1,How many different scientists are assigned to any project?,SELECT DISTINCT (count(DISTINCT ?T1_scientist) as ?aggregation_T1_scientist_52 ) WHERE { ?T1 a :assignedto . ?T1 :assignedto\#scientist ?T1_scientist .        }
scientist_1,Count the number of different scientists assigned to any project.,SELECT DISTINCT (count(DISTINCT ?T1_scientist) as ?aggregation_T1_scientist_155 ) WHERE { ?T1 a :assignedto . ?T1 :assignedto\#scientist ?T1_scientist .        }
scientist_1,Find the number of distinct projects.,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_136 ) WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name .        }
scientist_1,How many different projects are there?,SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_18 ) WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name .        }
scientist_1,Find the average hours of all projects.,SELECT (avg( ?T1_hours) as ?aggregation_T1_hours_100 ) WHERE { ?T1 a :projects . ?T1 :projects\#hours ?T1_hours .        }
scientist_1,What is the average hours across all projects?,SELECT (avg( ?T1_hours) as ?aggregation_T1_hours_110 ) WHERE { ?T1 a :projects . ?T1 :projects\#hours ?T1_hours .        }
scientist_1,Find the name of project that continues for the longest time.,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours .        }   ORDER BY DESC (?T1_hours) LIMIT 1
scientist_1,What is the name of the project with the most hours?,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours .        }   ORDER BY DESC (?T1_hours) LIMIT 1
scientist_1,List the name of all projects that are operated longer than the average working hours of all projects.,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours . FILTER(?T1_hours > (?aggregation_T22_hours_22)) .       {SELECT (avg( ?T22_hours) as ?aggregation_T22_hours_22 ) WHERE { ?T22 a :projects . ?T22 :projects\#hours ?T22_hours .        }    } }
scientist_1,Find the name and hours of project that has the most number of scientists.,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_hours WHERE { ?T1 a :projects . ?T2 a :assignedto . ?T2 :assignedto\#ref-project ?T1 .  ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours .        } GROUP BY ?T1_name ?T1_hours  ORDER BY DESC (?aggregation_all) LIMIT 1
scientist_1,What is the name and hours for the project which has the most scientists assigned to it?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_hours WHERE { ?T1 a :projects . ?T2 a :assignedto . ?T2 :assignedto\#ref-project ?T1 .  ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours .        } GROUP BY ?T1_name ?T1_hours  ORDER BY DESC (?aggregation_all) LIMIT 1
scientist_1,Find the name of the project for which a scientist whose name contains Smith is assigned to.,"SELECT ?T1_name WHERE { ?T1 a :projects . ?T13 a :assignedto . ?T13 :assignedto\#ref-project ?T1 .  ?T1 :projects\#name ?T1_name . ?T2 :scientists\#name ?T2_name . ?T2 a :scientists . ?T13 :assignedto\#ref-scientist ?T2 .  ?T1 :projects\#name ?T1_name . ?T2 :scientists\#name ?T2_name . FILTER(contains (?T2_name, 'Smith')) .        }"
scientist_1,Find the total hours of the projects that scientists named Michael Rogers or Carol Smith are assigned to.,SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_141 ) WHERE { ?T1 a :projects . ?T13 a :assignedto . ?T13 :assignedto\#ref-project ?T1 .  ?T1 :projects\#hours ?T1_hours . ?T2 :scientists\#name ?T2_name . ?T2 :scientists\#name ?T2_name . ?T2 a :scientists . ?T13 :assignedto\#ref-scientist ?T2 .  ?T1 :projects\#hours ?T1_hours . ?T2 :scientists\#name ?T2_name . ?T2 :scientists\#name ?T2_name . FILTER(?T2_name = 'Michael Rogers' || ?T2_name = 'Carol Smith') .        }
scientist_1,Find the name of projects that require between 100 and 300 hours of work.,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours . FILTER(?T1_hours >= 100 && ?T1_hours <= 300) .        }
scientist_1,What are the names of projects that require between 100 and 300 hours?,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#hours ?T1_hours . FILTER(?T1_hours >= 100 && ?T1_hours <= 300) .        }
scientist_1,Find the name of the scientist who worked on both a project named 'Matter of Time' and a project named 'A Puzzling Parallax'.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :scientists . ?T13 a :assignedto . ?T13 :assignedto\#ref-scientist ?T1 .  ?T1 :scientists\#name ?T1_name . ?T2 :projects\#name ?T2_name . ?T2 a :projects . ?T13 :assignedto\#ref-project ?T2 .  ?T1 :scientists\#name ?T1_name . ?T2 :projects\#name ?T2_name . FILTER(?T2_name = 'Matter of Time') . FILTER (?T1_name in (?T3_name)) .   ?T3 a :scientists . ?T15 a :assignedto . ?T15 :assignedto\#ref-scientist ?T3 .  ?T3 :scientists\#name ?T3_name . ?T4 :projects\#name ?T4_name . ?T4 a :projects . ?T15 :assignedto\#ref-project ?T4 .  ?T3 :scientists\#name ?T3_name . ?T4 :projects\#name ?T4_name .  FILTER(?T4_name = 'A Puzzling Parallax') .             }
scientist_1,List the names of all scientists sorted in alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name . ?T1 :scientists\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
scientist_1,What are the names of all the scientists in alphabetical order?,SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name . ?T1 :scientists\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
scientist_1,Find the number of scientists involved for each project name.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :assignedto . ?T2 a :projects . ?T1 :assignedto\#ref-project ?T2 .  ?T2 :projects\#name ?T2_name .        } GROUP BY ?T2_name
scientist_1,Find the number of scientists involved for the projects that require more than 300 hours.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :assignedto . ?T2 a :projects . ?T1 :assignedto\#ref-project ?T2 .  ?T2 :projects\#name ?T2_name . ?T2 :projects\#hours ?T2_hours . FILTER(?T2_hours > 300) .        } GROUP BY ?T2_name
scientist_1,Find the number of projects which each scientist is working on and scientist's name.,SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :assignedto . ?T2 a :scientists . ?T1 :assignedto\#ref-scientist ?T2 .  ?T2 :scientists\#name ?T2_name .        } GROUP BY ?T2_name
scientist_1,Find the SSN and name of scientists who are assigned to the project with the longest hours.,SELECT ?T1_ssn ?T1_name WHERE { ?T1 a :scientists . ?T13 a :assignedto . ?T13 :assignedto\#ref-scientist ?T1 .  ?T1 :scientists\#ssn ?T1_ssn . ?T1 :scientists\#name ?T1_name . ?T2 :projects\#hours ?T2_hours . ?T2 a :projects . ?T13 :assignedto\#ref-project ?T2 .  ?T1 :scientists\#ssn ?T1_ssn . ?T1 :scientists\#name ?T1_name . ?T2 :projects\#hours ?T2_hours . FILTER(?T2_hours = (?aggregation_T23_hours_93)) .       {SELECT (max( ?T23_hours) as ?aggregation_T23_hours_93 ) WHERE { ?T23 a :projects . ?T23 :projects\#hours ?T23_hours .        }    } }
scientist_1,Find the name of scientists who are assigned to some project.,SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name .        }
scientist_1,What are the names of scientists who are assigned to any project?,SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name .        }
scientist_1,Select the project names which are not assigned yet.,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#code ?T1_code . FILTER(?T1_code not in (?T22_project)) .       {SELECT ?T22_project WHERE { ?T22 a :assignedto . ?T22 :assignedto\#project ?T22_project .        }    } }
scientist_1,What are the names of projects that have not been assigned?,SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :projects\#name ?T1_name . ?T1 :projects\#code ?T1_code . FILTER(?T1_code not in (?T22_project)) .       {SELECT ?T22_project WHERE { ?T22 a :assignedto . ?T22 :assignedto\#project ?T22_project .        }    } }
scientist_1,Find the name of scientists who are not assigned to any project.,SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name . ?T1 :scientists\#ssn ?T1_ssn . FILTER(?T1_ssn not in (?T22_scientist)) .       {SELECT ?T22_scientist WHERE { ?T22 a :assignedto . ?T22 :assignedto\#scientist ?T22_scientist .        }    } }
scientist_1,What are the names of scientists who have not been assigned a project?,SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name . ?T1 :scientists\#ssn ?T1_ssn . FILTER(?T1_ssn not in (?T22_scientist)) .       {SELECT ?T22_scientist WHERE { ?T22 a :assignedto . ?T22 :assignedto\#scientist ?T22_scientist .        }    } }
scientist_1,How many scientists do not have any projects assigned to them?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :scientists . ?T1 :scientists\#ssn ?T1_ssn . FILTER(?T1_ssn not in (?T22_scientist)) .       {SELECT ?T22_scientist WHERE { ?T22 a :assignedto . ?T22 :assignedto\#scientist ?T22_scientist .        }    } }
scientist_1,Find the names of scientists who are not working on the project with the highest hours.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :scientists . ?T14 a :assignedto . ?T14 :assignedto\#ref-scientist ?T2 .  ?T2 :scientists\#name ?T2_name . ?T3 :projects\#hours ?T3_hours . ?T3 a :projects . ?T14 :assignedto\#ref-project ?T3 .  ?T2 :scientists\#name ?T2_name . ?T3 :projects\#hours ?T3_hours . FILTER(?T3_hours = (?aggregation_T24_hours_173)) .       {SELECT ((max( ?T24_hours) as ?aggregation_T24_hours_173 ) as ?col1) WHERE { ?T24 a :projects . ?T24 :projects\#hours ?T24_hours .        }    } }     } }
scientist_1,What are the names of scientists who are not working on the project with the most hours?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :scientists . ?T1 :scientists\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :scientists . ?T14 a :assignedto . ?T14 :assignedto\#ref-scientist ?T2 .  ?T2 :scientists\#name ?T2_name . ?T3 :projects\#hours ?T3_hours . ?T3 a :projects . ?T14 :assignedto\#ref-project ?T3 .  ?T2 :scientists\#name ?T2_name . ?T3 :projects\#hours ?T3_hours . FILTER(?T3_hours = (?aggregation_T24_hours_94)) .       {SELECT ((max( ?T24_hours) as ?aggregation_T24_hours_94 ) as ?col1) WHERE { ?T24 a :projects . ?T24 :projects\#hours ?T24_hours .        }    } }     } }
scientist_1,"List all the scientists' names, their projects' names, and the hours worked by that scientist on each project, in alphabetical order of project name, and then scientist name.",SELECT ?T1_name ?T2_name ?T2_hours WHERE { ?T1 a :scientists . ?T13 a :assignedto . ?T13 :assignedto\#ref-scientist ?T1 .  ?T1 :scientists\#name ?T1_name . ?T2 :projects\#name ?T2_name . ?T2 :projects\#hours ?T2_hours . ?T2 :projects\#name ?T2_name . ?T2 a :projects . ?T13 :assignedto\#ref-project ?T2 .  ?T1 :scientists\#name ?T1_name . ?T2 :projects\#name ?T2_name . ?T2 :projects\#hours ?T2_hours . ?T2 :projects\#name ?T2_name .        }  ORDER BY ASC (?T2_name)
scientist_1,Find name of the project that needs the least amount of time to finish and the name of scientists who worked on it.,SELECT ?T1_name ?T2_name WHERE { ?T1 a :projects . ?T13 a :assignedto . ?T13 :assignedto\#ref-project ?T1 .  ?T1 :projects\#name ?T1_name . ?T2 :scientists\#name ?T2_name . ?T1 :projects\#hours ?T1_hours . ?T2 a :scientists . ?T13 :assignedto\#ref-scientist ?T2 .  ?T1 :projects\#name ?T1_name . ?T2 :scientists\#name ?T2_name . ?T1 :projects\#hours ?T1_hours . FILTER(?T1_hours = (?aggregation_T23_hours_0)) .       {SELECT (min( ?T23_hours) as ?aggregation_T23_hours_0 ) WHERE { ?T23 a :projects . ?T23 :projects\#hours ?T23_hours .        }    } }
wine_1,What is the name of the highest rated wine?,SELECT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score .        }   ORDER BY ASC (?T1_score) LIMIT 1
wine_1,Which winery is the wine that has the highest score from?,SELECT ?T1_winery WHERE { ?T1 a :wine . ?T1 :wine\#winery ?T1_winery . ?T1 :wine\#score ?T1_score .        }   ORDER BY ASC (?T1_score) LIMIT 1
wine_1,What is the winery at which the wine with the highest score was made?,SELECT ?T1_winery WHERE { ?T1 a :wine . ?T1 :wine\#winery ?T1_winery . ?T1 :wine\#score ?T1_score .        }   ORDER BY ASC (?T1_score) LIMIT 1
wine_1,Find the names of all wines produced in 2008.,SELECT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#year ?T1_year . FILTER(?T1_year = 2008) .        }
wine_1,What are the names of all wines produced in 2008?,SELECT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#year ?T1_year . FILTER(?T1_year = 2008) .        }
wine_1,List the grapes and appelations of all wines.,SELECT ?T1_grape ?T1_appelation WHERE { ?T1 a :wine . ?T1 :wine\#grape ?T1_grape . ?T1 :wine\#appelation ?T1_appelation .        }
wine_1,What are the grapes and appelations of each wine?,SELECT ?T1_grape ?T1_appelation WHERE { ?T1 a :wine . ?T1 :wine\#grape ?T1_grape . ?T1 :wine\#appelation ?T1_appelation .        }
wine_1,List the names and scores of all wines.,SELECT ?T1_name ?T1_score WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score .        }
wine_1,What are the names and scores of all wines?,SELECT ?T1_name ?T1_score WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score .        }
wine_1,List the area and county of all appelations.,SELECT ?T1_area ?T1_county WHERE { ?T1 a :appellations . ?T1 :appellations\#area ?T1_area . ?T1 :appellations\#county ?T1_county .        }
wine_1,What are the areas and counties for all appelations?,SELECT ?T1_area ?T1_county WHERE { ?T1 a :appellations . ?T1 :appellations\#area ?T1_area . ?T1 :appellations\#county ?T1_county .        }
wine_1,What are the prices of wines produced before the year of 2010?,SELECT ?T1_price WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#year ?T1_year . FILTER(?T1_year < 2010) .        }
wine_1,List the names of all distinct wines that have scores higher than 90.,SELECT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score . FILTER(?T1_score > 90) .        }
wine_1,What are the names of wines with scores higher than 90?,SELECT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score . FILTER(?T1_score > 90) .        }
wine_1,List the names of all distinct wines that are made of red color grape.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\#ref-grape ?T2 .  ?T1 :wine\#name ?T1_name . ?T2 :grapes\#color ?T2_color . FILTER(?T2_color = 'Red') .        }
wine_1,What are the names of wines made from red grapes?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\#ref-grape ?T2 .  ?T1 :wine\#name ?T1_name . ?T2 :grapes\#color ?T2_color . FILTER(?T2_color = 'Red') .        }
wine_1,Find the names of all distinct wines that have appellations in North Coast area.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T2 a :appellations . ?T1 :wine\#ref-appelation ?T2 .  ?T1 :wine\#name ?T1_name . ?T2 :appellations\#area ?T2_area . FILTER(?T2_area = 'North Coast') .        }
wine_1,How many wines are produced at Robert Biale winery?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :wine . ?T1 :wine\#winery ?T1_winery . FILTER(?T1_winery = 'Robert Biale') .        }
wine_1,How many appelations are in Napa Country?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :appellations . ?T1 :appellations\#county ?T1_county . FILTER(?T1_county = 'Napa') .        }
wine_1,Give me the average prices of wines that are produced by appelations in Sonoma County.,SELECT (avg( ?T1_price) as ?aggregation_T1_price_120 ) WHERE { ?T1 a :wine . ?T2 a :appellations . ?T1 :wine\#ref-appelation ?T2 .  ?T1 :wine\#price ?T1_price . ?T2 :appellations\#county ?T2_county . FILTER(?T2_county = 'Sonoma') .        }
wine_1,Give the names and scores of wines made from white grapes.,SELECT ?T1_name ?T1_score WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\#ref-grape ?T2 .  ?T1 :wine\#name ?T1_name . ?T1 :wine\#score ?T1_score . ?T2 :grapes\#color ?T2_color . FILTER(?T2_color = 'White') .        }
wine_1,Find the maximum price of wins from the appelations in Central Coast area and produced before the year of 2005.,SELECT (max( ?T1_price) as ?aggregation_T1_price_25 ) WHERE { ?T1 a :wine . ?T2 a :appellations . ?T1 :wine\#ref-appelation ?T2 .  ?T1 :wine\#price ?T1_price . ?T2 :appellations\#area ?T2_area . ?T1 :wine\#year ?T1_year . FILTER(?T2_area = 'Central Coast' && ?T1_year < 2005) .        }
wine_1,Find the the grape whose white color grapes are used to produce wines with scores higher than 90.,SELECT DISTINCT ?T1_grape WHERE { ?T1 a :grapes . ?T2 a :wine . ?T2 :wine\#ref-grape ?T1 .  ?T1 :grapes\#grape ?T1_grape . ?T1 :grapes\#color ?T1_color . ?T2 :wine\#score ?T2_score . FILTER(?T1_color = 'White' && ?T2_score > 90) .        }
wine_1,What are the names of wines made from red grapes and with prices above 50?,SELECT ?T1_name WHERE { ?T1 a :wine . ?T2 a :grapes . ?T1 :wine\#ref-grape ?T2 .  ?T1 :wine\#name ?T1_name . ?T2 :grapes\#color ?T2_color . ?T1 :wine\#price ?T1_price . FILTER(?T2_color = 'Red' && ?T1_price > 50) .        }
wine_1,Give the neames of wines with prices below 50 and with appelations in Monterey county.,SELECT ?T1_name WHERE { ?T1 a :wine . ?T2 a :appellations . ?T1 :wine\#ref-appelation ?T2 .  ?T1 :wine\#name ?T1_name . ?T2 :appellations\#county ?T2_county . ?T1 :wine\#price ?T1_price . FILTER(?T2_county = 'Monterey' && ?T1_price < 50) .        }
wine_1,What are the numbers of wines for different grapes?,SELECT (count( *) as ?aggregation_all) ?T1_grape WHERE { ?T1 a :wine . ?T1 :wine\#grape ?T1_grape .        } GROUP BY ?T1_grape
wine_1,How many wines are there for each grape?,SELECT (count( *) as ?aggregation_all) ?T1_grape WHERE { ?T1 a :wine . ?T1 :wine\#grape ?T1_grape .        } GROUP BY ?T1_grape
wine_1,What are the average prices of wines for different years?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_185 ) ?T1_year WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#year ?T1_year .        } GROUP BY ?T1_year
wine_1,What is the average prices of wines for each each?,SELECT (avg( ?T1_price) as ?aggregation_T1_price_52 ) ?T1_year WHERE { ?T1 a :wine . ?T1 :wine\#price ?T1_price . ?T1 :wine\#year ?T1_year .        } GROUP BY ?T1_year
wine_1,Find the distinct names of all wines that have prices higher than some wines from John Anthony winery.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#price ?T1_price . FILTER(?T1_price > (?T22_winery)) .       {SELECT (min( ?T22_price) as ?aggregation_T22_price_93 ) WHERE { ?T22 a :wine . ?T22 :wine\#price ?T22_price . ?T22 :wine\#winery ?T22_winery . FILTER(?T22_winery = 'John Anthony') .        }    } }
wine_1,What are the distinct names of wines with prices higher than any wine from John Anthony winery.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#price ?T1_price . FILTER(?T1_price > (?T22_winery)) .       {SELECT (min( ?T22_price) as ?aggregation_T22_price_71 ) WHERE { ?T22 a :wine . ?T22 :wine\#price ?T22_price . ?T22 :wine\#winery ?T22_winery . FILTER(?T22_winery = 'John Anthony') .        }    } }
wine_1,List the names of all distinct wines in alphabetical order.,SELECT DISTINCT ?T1_name WHERE { ?T1 a :wine . ?T1 :wine\#name ?T1_name . ?T1 :wine\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
