kg_name,question,query
assets_maintenance,Which third party companies have at least 2 maintenance engineers or have at least 2 maintenance contracts? List the company id and name.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_company_id as ?col1) (?T1_company_name as ?col2) WHERE { ?T1 a :third_party_companies . ?T13 a :maintenance_contracts . ?T13 :maintenance_contracts\#ref-maintenance_contract_company_id ?T1 .  ?T1 :third_party_companies\#company_id ?T1_company_id . ?T1 :third_party_companies\#company_name ?T1_company_name . ?T14 a :assets . ?T14 :assets\#ref-maintenance_contract_id ?T13 .  ?T1 :third_party_companies\#company_id ?T1_company_id . ?T1 :third_party_companies\#company_name ?T1_company_name . ?T15 a :fault_log . ?T15 :fault_log\#ref-asset_id ?T14 .  ?T1 :third_party_companies\#company_id ?T1_company_id . ?T1 :third_party_companies\#company_name ?T1_company_name . ?T16 a :engineer_visits . ?T16 :engineer_visits\#ref-fault_log_entry_id ?T15 .  ?T1 :third_party_companies\#company_id ?T1_company_id . ?T1 :third_party_companies\#company_name ?T1_company_name . ?T2 a :maintenance_engineers . ?T16 :engineer_visits\#ref-engineer_id ?T2 .  ?T1 :third_party_companies\#company_id ?T1_company_id . ?T1 :third_party_companies\#company_name ?T1_company_name .   }} UNION {SELECT (?T1_company_id as ?col1) (?T1_company_name as ?col2) WHERE { ?T1 a :third_party_companies . ?T2 a :maintenance_contracts . ?T2 :maintenance_contracts\#ref-maintenance_contract_company_id ?T1 .  ?T1 :third_party_companies\#company_id ?T1_company_id . ?T1 :third_party_companies\#company_name ?T1_company_name .        } GROUP BY ?T1_company_id ?T1_company_name   HAVING(count( *)  >= 2)  } } GROUP BY ?T1_company_id ?T1_company_name   HAVING(count( *)  >= 2)
assets_maintenance,"Which engineer has visited the most times? Show the engineer id, first name and last name.",SELECT ?T1_engineer_id (count( *) as ?aggregation_all) ?T1_first_name ?T1_last_name WHERE { ?T1 a :maintenance_engineers . ?T2 a :engineer_visits . ?T2 :engineer_visits\#ref-engineer_id ?T1 .  ?T1 :maintenance_engineers\#engineer_id ?T1_engineer_id . ?T1 :maintenance_engineers\#first_name ?T1_first_name . ?T1 :maintenance_engineers\#last_name ?T1_last_name .        } GROUP BY ?T1_engineer_id ?T1_first_name ?T1_last_name  ORDER BY DESC (?aggregation_all) LIMIT 1
assets_maintenance,Which parts have more than 2 faults? Show the part name and id.,SELECT ?T1_part_name ?T1_part_id WHERE { ?T1 a :parts . ?T2 a :part_faults . ?T2 :part_faults\#ref-part_id ?T1 .  ?T1 :parts\#part_name ?T1_part_name . ?T1 :parts\#part_id ?T1_part_id .        } GROUP BY ?T1_part_name ?T1_part_id   HAVING(count( *)  > 2)
assets_maintenance,"List all every engineer's first name, last name, details and coresponding skill description.",SELECT ?T1_first_name ?T1_last_name ?T1_other_details ?T2_skill_description WHERE { ?T1 a :maintenance_engineers . ?T13 a :engineer_skills . ?T13 :engineer_skills\#ref-engineer_id ?T1 .  ?T1 :maintenance_engineers\#first_name ?T1_first_name . ?T1 :maintenance_engineers\#last_name ?T1_last_name . ?T1 :maintenance_engineers\#other_details ?T1_other_details . ?T2 :skills\#skill_description ?T2_skill_description . ?T2 a :skills . ?T13 :engineer_skills\#ref-skill_id ?T2 .  ?T1 :maintenance_engineers\#first_name ?T1_first_name . ?T1 :maintenance_engineers\#last_name ?T1_last_name . ?T1 :maintenance_engineers\#other_details ?T1_other_details . ?T2 :skills\#skill_description ?T2_skill_description .        }
assets_maintenance,"For all the faults of different parts, what are all the decriptions of the skills required to fix them? List the name of the faults and the skill description.",SELECT ?T1_fault_short_name ?T2_skill_description WHERE { ?T1 a :part_faults . ?T13 a :skills_required_to_fix . ?T13 :skills_required_to_fix\#ref-part_fault_id ?T1 .  ?T1 :part_faults\#fault_short_name ?T1_fault_short_name . ?T2 :skills\#skill_description ?T2_skill_description . ?T2 a :skills . ?T13 :skills_required_to_fix\#ref-skill_id ?T2 .  ?T1 :part_faults\#fault_short_name ?T1_fault_short_name . ?T2 :skills\#skill_description ?T2_skill_description .        }
assets_maintenance,How many assets can each parts be used in? List the part name and the number.,SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a :parts . ?T2 a :asset_parts . ?T2 :asset_parts\#ref-part_id ?T1 .  ?T1 :parts\#part_name ?T1_part_name .        } GROUP BY ?T1_part_name
assets_maintenance,How many engineer visits are required at most for a single fault log? List the number and the log entry id.,SELECT (count( *) as ?aggregation_all) ?T2_fault_log_entry_id WHERE { ?T1 a :engineer_visits . ?T2 a :fault_log . ?T1 :engineer_visits\#ref-fault_log_entry_id ?T2 .  ?T2 :fault_log\#fault_log_entry_id ?T2_fault_log_entry_id .        } GROUP BY ?T2_fault_log_entry_id  ORDER BY DESC (?aggregation_all) LIMIT 1
assets_maintenance,What are all the distinct last names of all the engineers?,SELECT DISTINCT ?T1_last_name WHERE { ?T1 a :maintenance_engineers . ?T1 :maintenance_engineers\#last_name ?T1_last_name .        }
assets_maintenance,How many fault status codes are recorded in the fault log parts table?,SELECT DISTINCT ?T1_fault_status WHERE { ?T1 a :fault_log_parts . ?T1 :fault_log_parts\#fault_status ?T1_fault_status .        }
assets_maintenance,Which engineers have never visited to maintain the assets? List the engineer first name and last name.,SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :maintenance_engineers . ?T1 :maintenance_engineers\#first_name ?T1_first_name . ?T1 :maintenance_engineers\#last_name ?T1_last_name . ?T1 :maintenance_engineers\#engineer_id ?T1_engineer_id . FILTER(?T1_engineer_id not in (?T22_engineer_id)) .       {SELECT ?T22_engineer_id WHERE { ?T22 a :engineer_visits . ?T22 :engineer_visits\#engineer_id ?T22_engineer_id .        }    } }
assets_maintenance,"List the asset id, details, make and model for every asset.",SELECT ?T1_asset_id ?T1_asset_details ?T1_asset_make ?T1_asset_model WHERE { ?T1 a :assets . ?T1 :assets\#asset_id ?T1_asset_id . ?T1 :assets\#asset_details ?T1_asset_details . ?T1 :assets\#asset_make ?T1_asset_make . ?T1 :assets\#asset_model ?T1_asset_model .        }
assets_maintenance,When was the first asset acquired?,SELECT ?T1_asset_acquired_date WHERE { ?T1 a :assets . ?T1 :assets\#asset_acquired_date ?T1_asset_acquired_date . ?T1 :assets\#asset_acquired_date ?T1_asset_acquired_date .        }   ORDER BY ASC (?T1_asset_acquired_date) LIMIT 1
assets_maintenance,Which part fault requires the most number of skills to fix? List part id and name.,SELECT ?T1_part_id (count( *) as ?aggregation_all) ?T1_part_name WHERE { ?T1 a :parts . ?T1 :parts\#part_id ?T1_part_id . ?T1 :parts\#part_name ?T1_part_name .        } GROUP BY ?T1_part_id  ?T1_part_name  ORDER BY DESC (?aggregation_all) LIMIT 1
assets_maintenance,Which kind of part has the least number of faults? List the part name.,SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a :parts . ?T2 a :part_faults . ?T2 :part_faults\#ref-part_id ?T1 .  ?T1 :parts\#part_name ?T1_part_name .        } GROUP BY ?T1_part_name  ORDER BY ASC (?aggregation_all) LIMIT 1
assets_maintenance,Which staff have contacted which engineers? List the staff name and the engineer first name and last name.,SELECT ?T1_staff_name ?T2_first_name ?T2_last_name WHERE { ?T1 a :staff . ?T13 a :engineer_visits . ?T13 :engineer_visits\#ref-contact_staff_id ?T1 .  ?T1 :staff\#staff_name ?T1_staff_name . ?T2 :maintenance_engineers\#first_name ?T2_first_name . ?T2 :maintenance_engineers\#last_name ?T2_last_name . ?T2 a :maintenance_engineers . ?T13 :engineer_visits\#ref-engineer_id ?T2 .  ?T1 :staff\#staff_name ?T1_staff_name . ?T2 :maintenance_engineers\#first_name ?T2_first_name . ?T2 :maintenance_engineers\#last_name ?T2_last_name .        }
assets_maintenance,"Which fault log included the most number of faulty parts? List the fault log id, description and record time.",SELECT ?T1_fault_log_entry_id (count( *) as ?aggregation_all) ?T1_fault_description ?T1_fault_log_entry_datetime WHERE { ?T1 a :fault_log . ?T2 a :fault_log_parts . ?T2 :fault_log_parts\#ref-fault_log_entry_id ?T1 .  ?T1 :fault_log\#fault_log_entry_id ?T1_fault_log_entry_id . ?T1 :fault_log\#fault_description ?T1_fault_description . ?T1 :fault_log\#fault_log_entry_datetime ?T1_fault_log_entry_datetime .        } GROUP BY ?T1_fault_log_entry_id ?T1_fault_description ?T1_fault_log_entry_datetime  ORDER BY DESC (?aggregation_all) LIMIT 1
assets_maintenance,Which skill is used in fixing the most number of faults? List the skill id and description.,SELECT ?T1_skill_id (count( *) as ?aggregation_all) ?T1_skill_description WHERE { ?T1 a :skills . ?T2 a :skills_required_to_fix . ?T2 :skills_required_to_fix\#ref-skill_id ?T1 .  ?T1 :skills\#skill_id ?T1_skill_id . ?T1 :skills\#skill_description ?T1_skill_description .        } GROUP BY ?T1_skill_id ?T1_skill_description  ORDER BY DESC (?aggregation_all) LIMIT 1
assets_maintenance,What are all the distinct asset models?,SELECT DISTINCT ?T1_asset_model WHERE { ?T1 a :assets . ?T1 :assets\#asset_model ?T1_asset_model .        }
assets_maintenance,"List the all the assets make, model, details by the disposed date ascendingly.",SELECT ?T1_asset_make ?T1_asset_model ?T1_asset_details WHERE { ?T1 a :assets . ?T1 :assets\#asset_make ?T1_asset_make . ?T1 :assets\#asset_model ?T1_asset_model . ?T1 :assets\#asset_details ?T1_asset_details . ?T1 :assets\#asset_disposed_date ?T1_asset_disposed_date .        }  ORDER BY ASC (?T1_asset_disposed_date)
assets_maintenance,Which part has the least chargeable amount? List the part id and amount.,SELECT ?T1_part_id ?T1_chargeable_amount WHERE { ?T1 a :parts . ?T1 :parts\#part_id ?T1_part_id . ?T1 :parts\#chargeable_amount ?T1_chargeable_amount . ?T1 :parts\#chargeable_amount ?T1_chargeable_amount .        }   ORDER BY ASC (?T1_chargeable_amount) LIMIT 1
assets_maintenance,Which company started the earliest the maintenance contract? Show the company name.,SELECT ?T1_company_name WHERE { ?T1 a :third_party_companies . ?T2 a :maintenance_contracts . ?T2 :maintenance_contracts\#ref-maintenance_contract_company_id ?T1 .  ?T1 :third_party_companies\#company_name ?T1_company_name . ?T2 :maintenance_contracts\#contract_start_date ?T2_contract_start_date .        }   ORDER BY ASC (?T2_contract_start_date) LIMIT 1
assets_maintenance,What is the name of the type of the company who concluded its contracts most recently?,SELECT ?T1_company_name WHERE { ?T1 a :third_party_companies . ?T2 a :maintenance_contracts . ?T2 :maintenance_contracts\#ref-maintenance_contract_company_id ?T1 .  ?T1 :third_party_companies\#company_name ?T1_company_name . ?T2 :maintenance_contracts\#contract_end_date ?T2_contract_end_date .        }   ORDER BY DESC (?T2_contract_end_date) LIMIT 1
assets_maintenance,Which gender makes up the majority of the staff?,SELECT ?T1_gender (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T1 :staff\#gender ?T1_gender .        } GROUP BY ?T1_gender  ORDER BY DESC (?aggregation_all) LIMIT 1
assets_maintenance,How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.,SELECT ?T1_staff_name (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T2 a :engineer_visits . ?T2 :engineer_visits\#ref-contact_staff_id ?T1 .  ?T1 :staff\#staff_name ?T1_staff_name .        } GROUP BY ?T1_staff_name
assets_maintenance,Which assets did not incur any fault log? List the asset model.,SELECT ?T1_asset_model WHERE { ?T1 a :assets . ?T1 :assets\#asset_model ?T1_asset_model . ?T1 :assets\#asset_id ?T1_asset_id . FILTER(?T1_asset_id not in (?T22_asset_id)) .       {SELECT ?T22_asset_id WHERE { ?T22 a :fault_log . ?T22 :fault_log\#asset_id ?T22_asset_id .        }    } }
station_weather,list the local authorities and services provided by all stations.,SELECT ?T1_local_authority ?T1_services WHERE { ?T1 a :station . ?T1 :station\#local_authority ?T1_local_authority . ?T1 :station\#services ?T1_services .        }
station_weather,show all train numbers and names ordered by their time from early to late.,SELECT ?T1_train_number ?T1_name WHERE { ?T1 a :train . ?T1 :train\#train_number ?T1_train_number . ?T1 :train\#name ?T1_name . ?T1 :train\#time ?T1_time .        }  ORDER BY ASC (?T1_time)
station_weather,"Give me the times and numbers of all trains that go to Chennai, ordered by time.",SELECT ?T1_time ?T1_train_number WHERE { ?T1 a :train . ?T1 :train\#time ?T1_time . ?T1 :train\#train_number ?T1_train_number . ?T1 :train\#time ?T1_time . ?T1 :train\#destination ?T1_destination . FILTER(?T1_destination = 'Chennai') .        }  ORDER BY ASC (?T1_time)
station_weather,How many trains have 'Express' in their names?,"SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :train . ?T1 :train\#name ?T1_name . FILTER(contains (?T1_name, 'Express')) .        }"
station_weather,Find the number and time of the train that goes from Chennai to Guruvayur.,SELECT ?T1_train_number ?T1_time WHERE { ?T1 a :train . ?T1 :train\#train_number ?T1_train_number . ?T1 :train\#time ?T1_time . ?T1 :train\#origin ?T1_origin . ?T1 :train\#destination ?T1_destination . FILTER(?T1_origin = 'Chennai' && ?T1_destination = 'Guruvayur') .        }
station_weather,Find the number of trains starting from each origin.,SELECT ?T1_origin (count( *) as ?aggregation_all) WHERE { ?T1 a :train . ?T1 :train\#origin ?T1_origin .        } GROUP BY ?T1_origin
station_weather,Find the name of the train whose route runs through greatest number of stations.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :train . ?T2 a :route . ?T2 :route\#ref-train_id ?T1 .  ?T1 :train\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
station_weather,"Find the number of trains for each station, as well as the station network name and services.",SELECT (count( *) as ?aggregation_all) ?T2_network_name ?T2_services WHERE { ?T1 a :route . ?T2 a :station . ?T1 :route\#ref-station_id ?T2 .  ?T2 :station\#network_name ?T2_network_name . ?T2 :station\#services ?T2_services .        } GROUP BY ?T2_network_name ?T2_services
station_weather,What is the average high temperature for each day of week?,SELECT (avg( ?T1_high_temperature) as ?aggregation_T1_high_temperature_142 ) ?T1_day_of_week WHERE { ?T1 a :weekly_weather . ?T1 :weekly_weather\#high_temperature ?T1_high_temperature . ?T1 :weekly_weather\#day_of_week ?T1_day_of_week .        } GROUP BY ?T1_day_of_week
station_weather,Give me the maximum low temperature and average precipitation at the Amersham station.,SELECT (max( ?T1_low_temperature) as ?aggregation_T1_low_temperature_78 ) (avg( ?T1_precipitation) as ?aggregation_T1_precipitation_86 ) WHERE { ?T1 a :weekly_weather . ?T2 a :station . ?T1 :weekly_weather\#ref-station_id ?T2 .  ?T1 :weekly_weather\#low_temperature ?T1_low_temperature . ?T1 :weekly_weather\#precipitation ?T1_precipitation . ?T2 :station\#network_name ?T2_network_name . FILTER(?T2_network_name = 'Amersham') .        }
station_weather,Find names and times of trains that run through stations for the local authority Chiltern.,SELECT ?T1_name ?T1_time WHERE { ?T1 a :train . ?T13 a :route . ?T13 :route\#ref-train_id ?T1 .  ?T1 :train\#name ?T1_name . ?T1 :train\#time ?T1_time . ?T2 :station\#local_authority ?T2_local_authority . ?T2 a :station . ?T13 :route\#ref-station_id ?T2 .  ?T1 :train\#name ?T1_name . ?T1 :train\#time ?T1_time . ?T2 :station\#local_authority ?T2_local_authority . FILTER(?T2_local_authority = 'Chiltern') .        }
station_weather,How many different services are provided by all stations?,SELECT DISTINCT (count(DISTINCT ?T1_services) as ?aggregation_T1_services_31 ) WHERE { ?T1 a :station . ?T1 :station\#services ?T1_services .        }
station_weather,Find the id and local authority of the station with has the highest average high temperature.,SELECT ?T1_id ?T1_local_authority WHERE { ?T1 a :station . ?T2 a :weekly_weather . ?T2 :weekly_weather\#ref-station_id ?T1 .  ?T1 :station\#id ?T1_id . ?T1 :station\#local_authority ?T1_local_authority . ?T2 :weekly_weather\#high_temperature ?T2_high_temperature .        } GROUP BY ?T1_id ?T1_local_authority  ORDER BY DESC ((avg( ?T2_high_temperature) as ?aggregation_T2_high_temperature_87 )) LIMIT 1
station_weather,Find the id and local authority of the station whose maximum precipitation is higher than 50.,SELECT ?T1_id ?T1_local_authority WHERE { ?T1 a :station . ?T2 a :weekly_weather . ?T2 :weekly_weather\#ref-station_id ?T1 .  ?T1 :station\#id ?T1_id . ?T1 :station\#local_authority ?T1_local_authority . ?T2 :weekly_weather\#precipitation ?T2_precipitation .        } GROUP BY ?T1_id ?T1_local_authority   HAVING(max( ?T2_precipitation)  > 50)
station_weather,show the lowest low temperature and highest wind speed in miles per hour.,SELECT (min( ?T1_low_temperature) as ?aggregation_T1_low_temperature_81 ) (max( ?T1_wind_speed_mph) as ?aggregation_T1_wind_speed_mph_164 ) WHERE { ?T1 a :weekly_weather . ?T1 :weekly_weather\#low_temperature ?T1_low_temperature . ?T1 :weekly_weather\#wind_speed_mph ?T1_wind_speed_mph .        }
station_weather,Find the origins from which more than 1 train starts.,SELECT ?T1_origin WHERE { ?T1 a :train . ?T1 :train\#origin ?T1_origin .        } GROUP BY ?T1_origin   HAVING(count( *)  > 1)
college_1,Find the number of professors in accounting department.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T2 a :department . ?T1 :professor\#ref-dept_code ?T2 .  ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') .        }
college_1,How many professors are in the accounting dept?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T2 a :department . ?T1 :professor\#ref-dept_code ?T2 .  ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') .        }
college_1,How many professors are teaching class with code ACCT-211?,SELECT DISTINCT (count(DISTINCT ?T1_prof_num) as ?aggregation_T1_prof_num_21 ) WHERE { ?T1 a :class . ?T1 :class\#prof_num ?T1_prof_num . ?T1 :class\#crs_code ?T1_crs_code . FILTER(?T1_crs_code = 'ACCT-211') .        }
college_1,How many professors teach a class with the code ACCT-211?,SELECT DISTINCT (count(DISTINCT ?T1_prof_num) as ?aggregation_T1_prof_num_49 ) WHERE { ?T1 a :class . ?T1 :class\#prof_num ?T1_prof_num . ?T1 :class\#crs_code ?T1_crs_code . FILTER(?T1_crs_code = 'ACCT-211') .        }
college_1,What is the first and last name of the professor in biology department?,SELECT ?T1_emp_fname ?T1_emp_lname WHERE { ?T1 a :employee . ?T2 a :department . ?T2 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T1 :employee\#emp_lname ?T1_emp_lname . ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Biology') .        }
college_1,What are the first and last name of all biology professors?,SELECT ?T1_emp_fname ?T1_emp_lname WHERE { ?T1 a :employee . ?T2 a :department . ?T2 :department\#ref-emp_num ?T1 .  ?T1 :employee\#emp_fname ?T1_emp_fname . ?T1 :employee\#emp_lname ?T1_emp_lname . ?T2 :department\#dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Biology') .        }
college_1,How many classes are professor whose last name is Graztevski has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :class . ?T2 a :employee . ?T1 :class\#ref-prof_num ?T2 .  ?T2 :employee\#emp_lname ?T2_emp_lname . FILTER(?T2_emp_lname = 'Graztevski') .        }
college_1,What is the school code of the accounting department?,SELECT ?T1_school_code WHERE { ?T1 a :department . ?T1 :department\#school_code ?T1_school_code . ?T1 :department\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'Accounting') .        }
college_1,What is the description for the CIS-220 and how many credits does it have?,SELECT ?T1_crs_credit ?T1_crs_description WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#crs_description ?T1_crs_description . ?T1 :course\#crs_code ?T1_crs_code . FILTER(?T1_crs_code = 'CIS-220') .        }
college_1,what is the address of history department?,SELECT ?T1_dept_address WHERE { ?T1 a :department . ?T1 :department\#dept_address ?T1_dept_address . ?T1 :department\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'History') .        }
college_1,Where is the history department?,SELECT ?T1_dept_address WHERE { ?T1 a :department . ?T1 :department\#dept_address ?T1_dept_address . ?T1 :department\#dept_name ?T1_dept_name . FILTER(?T1_dept_name = 'History') .        }
college_1,How many different locations does the school with code BUS has?,SELECT DISTINCT (count(DISTINCT ?T1_dept_address) as ?aggregation_T1_dept_address_114 ) WHERE { ?T1 a :department . ?T1 :department\#dept_address ?T1_dept_address . ?T1 :department\#school_code ?T1_school_code . FILTER(?T1_school_code = 'BUS') .        }
college_1,What are the different locations of the school with the code BUS?,SELECT DISTINCT (count(DISTINCT ?T1_dept_address) as ?aggregation_T1_dept_address_184 ) WHERE { ?T1 a :department . ?T1 :department\#dept_address ?T1_dept_address . ?T1 :department\#school_code ?T1_school_code . FILTER(?T1_school_code = 'BUS') .        }
college_1,How many different locations does each school have?,SELECT DISTINCT (count(DISTINCT ?T1_dept_address) as ?aggregation_T1_dept_address_147 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :department\#dept_address ?T1_dept_address . ?T1 :department\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code
college_1,Count different addresses of each school.,SELECT DISTINCT (count(DISTINCT ?T1_dept_address) as ?aggregation_T1_dept_address_129 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :department\#dept_address ?T1_dept_address . ?T1 :department\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code
college_1,Find the description and credit for the course QM-261?,SELECT ?T1_crs_credit ?T1_crs_description WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#crs_description ?T1_crs_description . ?T1 :course\#crs_code ?T1_crs_code . FILTER(?T1_crs_code = 'QM-261') .        }
college_1,What is the course description and number of credits for QM-261?,SELECT ?T1_crs_credit ?T1_crs_description WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#crs_description ?T1_crs_description . ?T1 :course\#crs_code ?T1_crs_code . FILTER(?T1_crs_code = 'QM-261') .        }
college_1,Find the number of departments in each school.,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_151 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code
college_1,How many departments are in each school?,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_32 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code
college_1,Find the number of different departments in each school whose number of different departments is less than 5.,SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_44 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :department\#dept_name ?T1_dept_name . ?T1 :department\#school_code ?T1_school_code . ?T1 :department\#dept_name ?T1_dept_name .        } GROUP BY ?T1_school_code   HAVING(count( ?T1_dept_name) as ?aggregation_T1_dept_name_118 ) < '5')
college_1,How many sections does each course has?,SELECT (count( *) as ?aggregation_all) ?T1_crs_code WHERE { ?T1 a :class . ?T1 :class\#crs_code ?T1_crs_code .        } GROUP BY ?T1_crs_code
college_1,How many sections does each course have?,SELECT (count( *) as ?aggregation_all) ?T1_crs_code WHERE { ?T1 a :class . ?T1 :class\#crs_code ?T1_crs_code .        } GROUP BY ?T1_crs_code
college_1,What is the total credit does each department offer?,SELECT (sum( ?T1_crs_credit) as ?aggregation_T1_crs_credit_114 ) ?T1_dept_code WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,How many credits does the department offer?,SELECT (sum( ?T1_crs_credit) as ?aggregation_T1_crs_credit_141 ) ?T1_dept_code WHERE { ?T1 a :course . ?T1 :course\#crs_credit ?T1_crs_credit . ?T1 :course\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,Find the number of classes offered for all class rooms that held at least 2 classes.,SELECT (count( *) as ?aggregation_all) ?T1_class_room WHERE { ?T1 a :class . ?T1 :class\#class_room ?T1_class_room .        } GROUP BY ?T1_class_room   HAVING(count( *)  >= 2)
college_1,Find the number of classes in each department.,SELECT (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :class . ?T2 a :course . ?T1 :class\#ref-crs_code ?T2 .  ?T2 :course\#dept_code ?T2_dept_code .        } GROUP BY ?T2_dept_code
college_1,How many classes are held in each department?,SELECT (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :class . ?T2 a :course . ?T1 :class\#ref-crs_code ?T2 .  ?T2 :course\#dept_code ?T2_dept_code .        } GROUP BY ?T2_dept_code
college_1,Find the number of classes in each school.,SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T13 a :employee . ?T2 a :department . ?T2 :department\#ref-emp_num ?T13 .  ?T2 :department\#school_code ?T2_school_code .        } GROUP BY ?T2_school_code
college_1,How many classes exist for each school?,SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T13 a :employee . ?T2 a :department . ?T2 :department\#ref-emp_num ?T13 .  ?T2 :department\#school_code ?T2_school_code .        } GROUP BY ?T2_school_code
college_1,What is the number of professors for different school?,SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T1 a :professor . ?T2 a :department . ?T1 :professor\#ref-dept_code ?T2 .  ?T2 :department\#school_code ?T2_school_code .        } GROUP BY ?T2_school_code
college_1,How many different professors are there for the different schools?,SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T1 a :professor . ?T2 a :department . ?T1 :professor\#ref-dept_code ?T2 .  ?T2 :department\#school_code ?T2_school_code .        } GROUP BY ?T2_school_code
college_1,Find the count and code of the job has most employees.,SELECT ?T1_emp_jobcode (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :employee . ?T1 :employee\#emp_jobcode ?T1_emp_jobcode .        } GROUP BY ?T1_emp_jobcode  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,What is the count and code of the job with the most employee?,SELECT ?T1_emp_jobcode (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :employee . ?T1 :employee\#emp_jobcode ?T1_emp_jobcode .        } GROUP BY ?T1_emp_jobcode  ORDER BY DESC (?aggregation_all) LIMIT 1
college_1,Which school has the smallest amount of professors?,SELECT ?T1_school_code (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\#ref-dept_code ?T1 .  ?T1 :department\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code  ORDER BY ASC (?aggregation_all) LIMIT 1
college_1,Which school has the fewest professors?,SELECT ?T1_school_code (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :professor . ?T2 :professor\#ref-dept_code ?T1 .  ?T1 :department\#school_code ?T1_school_code .        } GROUP BY ?T1_school_code  ORDER BY ASC (?aggregation_all) LIMIT 1
college_1,Find the number of professors with a Ph.D. degree in each department.,SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a :professor . ?T1 :professor\#dept_code ?T1_dept_code . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.') .        } GROUP BY ?T1_dept_code
college_1,How many professors have a Ph.D. in each department?,SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a :professor . ?T1 :professor\#dept_code ?T1_dept_code . ?T1 :professor\#prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.') .        } GROUP BY ?T1_dept_code
college_1,Find the number of students for each department.,SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :student\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,How many students are in each department?,SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :student\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,Find the total number of hours have done for all students in each department.,SELECT (sum( ?T1_stu_hrs) as ?aggregation_T1_stu_hrs_105 ) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :student\#stu_hrs ?T1_stu_hrs . ?T1 :student\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,How many hours do the students spend studying in each department?,SELECT (sum( ?T1_stu_hrs) as ?aggregation_T1_stu_hrs_40 ) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :student\#stu_hrs ?T1_stu_hrs . ?T1 :student\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,"Find the max, average, and minimum gpa of all students in each department.",SELECT (max( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_30 ) (avg( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_86 ) (min( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_5 ) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :student\#stu_gpa ?T1_stu_gpa . ?T1 :student\#stu_gpa ?T1_stu_gpa . ?T1 :student\#stu_gpa ?T1_stu_gpa . ?T1 :student\#dept_code ?T1_dept_code .        } GROUP BY ?T1_dept_code
college_1,What is the name and the average gpa of department whose students have the highest average gpa?,SELECT ?T1_dept_name (avg( ?T2_stu_gpa) as ?aggregation_T2_stu_gpa_137 ) WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\#ref-dept_name ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :student\#stu_gpa ?T2_stu_gpa . ?T2 :student\#stu_gpa ?T2_stu_gpa .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((avg( ?T2_stu_gpa) as ?aggregation_T2_stu_gpa_140 )) LIMIT 1
college_1,"Which department has the highest average student GPA, and what is the average gpa?",SELECT ?T1_dept_name (avg( ?T2_stu_gpa) as ?aggregation_T2_stu_gpa_68 ) WHERE { ?T1 a :department . ?T2 a :student . ?T2 :student\#ref-dept_name ?T1 .  ?T1 :department\#dept_name ?T1_dept_name . ?T2 :student\#stu_gpa ?T2_stu_gpa . ?T2 :student\#stu_gpa ?T2_stu_gpa .        } GROUP BY ?T1_dept_name  ORDER BY DESC ((avg( ?T2_stu_gpa) as ?aggregation_T2_stu_gpa_139 )) LIMIT 1
college_1,how many schools exist in total?,SELECT DISTINCT (count(DISTINCT ?T1_school_code) as ?aggregation_T1_school_code_72 ) WHERE { ?T1 a :department . ?T1 :department\#school_code ?T1_school_code .        }
college_1,How many schools are there in the department?,SELECT DISTINCT (count(DISTINCT ?T1_school_code) as ?aggregation_T1_school_code_5 ) WHERE { ?T1 a :department . ?T1 :department\#school_code ?T1_school_code .        }
college_1,How many different classes are there?,SELECT DISTINCT (count(DISTINCT ?T1_class_code) as ?aggregation_T1_class_code_106 ) WHERE { ?T1 a :class . ?T1 :class\#class_code ?T1_class_code .        }
college_1,How many unique classes are offered?,SELECT DISTINCT (count(DISTINCT ?T1_class_code) as ?aggregation_T1_class_code_147 ) WHERE { ?T1 a :class . ?T1 :class\#class_code ?T1_class_code .        }
college_1,How many courses are offered?,SELECT DISTINCT (count(DISTINCT ?T1_crs_code) as ?aggregation_T1_crs_code_115 ) WHERE { ?T1 a :class . ?T1 :class\#crs_code ?T1_crs_code .        }
college_1,What are the number of different course codes?,SELECT DISTINCT (count(DISTINCT ?T1_crs_code) as ?aggregation_T1_crs_code_85 ) WHERE { ?T1 a :class . ?T1 :class\#crs_code ?T1_crs_code .        }
