kg_name,question,query
e_learning,List all the subject names.,SELECT ?T1_subject_name WHERE { ?T1 a :subjects . ?T1 :subjects\#subject_name ?T1_subject_name .        }
e_learning,List all the information about course authors and tutors in alphabetical order of the personal name.,SELECT * WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#personal_name ?T1_personal_name .        }  ORDER BY ASC (?T1_personal_name)
e_learning,List the personal names and family names of all the students in alphabetical order of family name.,SELECT ?T1_personal_name ?T1_family_name WHERE { ?T1 a :students . ?T1 :students\#personal_name ?T1_personal_name . ?T1 :students\#family_name ?T1_family_name . ?T1 :students\#family_name ?T1_family_name .        }  ORDER BY ASC (?T1_family_name)
e_learning,List each test result and its count in descending order of count.,SELECT ?T1_test_result (count( *) as ?aggregation_all) WHERE { ?T1 a :student_tests_taken . ?T1 :student_tests_taken\#test_result ?T1_test_result .        } GROUP BY ?T1_test_result ORDER BY DESC ((count( *) as ?aggregation_all))
e_learning,Find the login name of the course author that teaches the course with name 'advanced database'.,SELECT ?T1_login_name WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\#login_name ?T1_login_name . ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'advanced database') .        }
e_learning,Find the addresses of the course authors who teach the course with name 'operating system' or 'data structure'.,SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\#address_line_1 ?T1_address_line_1 . ?T2 :courses\#course_name ?T2_course_name . ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'operating system' || ?T2_course_name = 'data structure') .        }
e_learning,"Find the personal name, family name, and author ID of the course author that teaches the most courses.",SELECT ?T1_personal_name (count( *) as ?aggregation_all) ?T1_family_name ?T2_author_id WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\#personal_name ?T1_personal_name . ?T1 :course_authors_and_tutors\#family_name ?T1_family_name . ?T2 :courses\#author_id ?T2_author_id .        } GROUP BY ?T1_personal_name ?T1_family_name ?T2_author_id  ORDER BY DESC (?aggregation_all) LIMIT 1
e_learning,"What are the personal name, family name, and author ID of the course author who teaches the most courses?",SELECT ?T1_personal_name (count( *) as ?aggregation_all) ?T1_family_name ?T2_author_id WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\#personal_name ?T1_personal_name . ?T1 :course_authors_and_tutors\#family_name ?T1_family_name . ?T2 :courses\#author_id ?T2_author_id .        } GROUP BY ?T1_personal_name ?T1_family_name ?T2_author_id  ORDER BY DESC (?aggregation_all) LIMIT 1
e_learning,Find the addresses and author IDs of the course authors that teach at least two courses.,SELECT ?T1_address_line_1 ?T2_author_id WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :courses\#ref-author_id ?T1 .  ?T1 :course_authors_and_tutors\#address_line_1 ?T1_address_line_1 . ?T2 :courses\#author_id ?T2_author_id .        } GROUP BY ?T1_address_line_1 ?T2_author_id   HAVING(count( *)  >= 2)
e_learning,Find the names of courses taught by the tutor who has personal name 'Julio'.,SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :course_authors_and_tutors . ?T1 :courses\#ref-author_id ?T2 .  ?T1 :courses\#course_name ?T1_course_name . ?T2 :course_authors_and_tutors\#personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Julio') .        }
e_learning,What are the names of the courses taught by the tutor whose personal name is 'Julio'?,SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :course_authors_and_tutors . ?T1 :courses\#ref-author_id ?T2 .  ?T1 :courses\#course_name ?T1_course_name . ?T2 :course_authors_and_tutors\#personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Julio') .        }
e_learning,Find the names and descriptions of courses that belong to the subject named 'Computer Science'.,SELECT ?T1_course_name ?T1_course_description WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :courses\#ref-subject_id ?T2 .  ?T1 :courses\#course_name ?T1_course_name . ?T1 :courses\#course_description ?T1_course_description . ?T2 :subjects\#subject_name ?T2_subject_name . FILTER(?T2_subject_name = 'Computer Science') .        }
e_learning,What are the names and descriptions of the all courses under the 'Computer Science' subject?,SELECT ?T1_course_name ?T1_course_description WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :courses\#ref-subject_id ?T2 .  ?T1 :courses\#course_name ?T1_course_name . ?T1 :courses\#course_description ?T1_course_description . ?T2 :subjects\#subject_name ?T2_subject_name . FILTER(?T2_subject_name = 'Computer Science') .        }
e_learning,"Find the subject ID, subject name, and the corresponding number of available courses for each subject.",SELECT ?T1_subject_id ?T2_subject_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :courses\#ref-subject_id ?T2 .  ?T1 :courses\#subject_id ?T1_subject_id . ?T2 :subjects\#subject_name ?T2_subject_name .        } GROUP BY ?T1_subject_id ?T2_subject_name
e_learning,What is the date of enrollment of the course named 'Spanish'?,SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :courses . ?T1 :student_course_enrolment\#ref-course_id ?T2 .  ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T2 :courses\#course_name ?T2_course_name . FILTER(?T2_course_name = 'Spanish') .        }
e_learning,What is the name of the course that has the most student enrollment?,SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :student_course_enrolment\#ref-course_id ?T1 .  ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_learning,Find the names of the courses that have just one student enrollment.,SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :student_course_enrolment\#ref-course_id ?T1 .  ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_name   HAVING(count( *)  = 1)
e_learning,Return the descriptions and names of the courses that have more than two students enrolled in.,SELECT ?T1_course_description ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :student_course_enrolment\#ref-course_id ?T1 .  ?T1 :courses\#course_description ?T1_course_description . ?T1 :courses\#course_name ?T1_course_name .        } GROUP BY ?T1_course_description ?T1_course_name   HAVING(count( *)  > 2)
e_learning,What are the enrollment dates of all the tests that have result 'Pass'?,SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :student_tests_taken\#ref-registration_id ?T1 .  ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T2 :student_tests_taken\#test_result ?T2_test_result . FILTER(?T2_test_result = 'Pass') .        }
e_learning,What are the completion dates of all the tests that have result 'Fail'?,SELECT ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :student_tests_taken\#ref-registration_id ?T1 .  ?T1 :student_course_enrolment\#date_of_completion ?T1_date_of_completion . ?T2 :student_tests_taken\#test_result ?T2_test_result . FILTER(?T2_test_result = 'Fail') .        }
e_learning,List the dates of enrollment and completion of the student with personal name 'Karson'.,SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\#date_of_completion ?T1_date_of_completion . ?T2 :students\#personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Karson') .        }
e_learning,On what dates did the student whose personal name is 'Karson' enroll in and complete the courses?,SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\#date_of_completion ?T1_date_of_completion . ?T2 :students\#personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Karson') .        }
e_learning,On what dates did the student with family name 'Zieme' and personal name 'Bernie' enroll in and complete the courses?,SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#date_of_enrolment ?T1_date_of_enrolment . ?T1 :student_course_enrolment\#date_of_completion ?T1_date_of_completion . ?T2 :students\#family_name ?T2_family_name . ?T2 :students\#personal_name ?T2_personal_name . FILTER(?T2_family_name = 'Zieme' && ?T2_personal_name = 'Bernie') .        }
e_learning,Find the student ID and login name of the student with the most course enrollments,SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_login_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#student_id ?T1_student_id . ?T2 :students\#login_name ?T2_login_name .        } GROUP BY ?T1_student_id ?T2_login_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_learning,What are the student ID and login name of the student who are enrolled in the most courses?,SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_login_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#student_id ?T1_student_id . ?T2 :students\#login_name ?T2_login_name .        } GROUP BY ?T1_student_id ?T2_login_name  ORDER BY DESC (?aggregation_all) LIMIT 1
e_learning,Find the student ID and personal name of the student with at least two enrollments.,SELECT ?T1_student_id ?T2_personal_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#student_id ?T1_student_id . ?T2 :students\#personal_name ?T2_personal_name .        } GROUP BY ?T1_student_id ?T2_personal_name   HAVING(count( *)  >= 2)
e_learning,Find the student ID and middle name for all the students with at most two enrollments.,SELECT ?T1_student_id ?T2_middle_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :student_course_enrolment\#ref-student_id ?T2 .  ?T1 :student_course_enrolment\#student_id ?T1_student_id . ?T2 :students\#middle_name ?T2_middle_name .        } GROUP BY ?T1_student_id ?T2_middle_name   HAVING(count( *)  <= 2)
e_learning,Find the personal names of students not enrolled in any course.,SELECT distinct?col1 WHERE { { SELECT (?T1_personal_name as ?col1) WHERE { ?T1 a :students . ?T1 :students\#personal_name ?T1_personal_name .   }}  MINUS {SELECT (?T2_personal_name as ?col1) WHERE { ?T2 a :students . ?T2 :students\#personal_name ?T2_personal_name .        }     } }
e_learning,How many students did not have any course enrollment?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T1 :students\#student_id ?T1_student_id . FILTER(?T1_student_id not in (?T22_student_id)) .       {SELECT ?T22_student_id WHERE { ?T22 a :student_course_enrolment . ?T22 :student_course_enrolment\#student_id ?T22_student_id .        }    } }
e_learning,Find the common login name of course authors and students.,SELECT DISTINCT ?T1_login_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#login_name ?T1_login_name . FILTER (?T1_login_name in (?T2_login_name)) .   ?T2 a :students . ?T2 :students\#login_name ?T2_login_name .              }
e_learning,Find the common personal name of course authors and students.,SELECT DISTINCT ?T1_personal_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :course_authors_and_tutors\#personal_name ?T1_personal_name . FILTER (?T1_personal_name in (?T2_personal_name)) .   ?T2 a :students . ?T2 :students\#personal_name ?T2_personal_name .              }
insurance_policies,Which claims caused more than 2 settlements or have the maximum claim value? List the date the claim was made and the claim id.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_date_claim_made as ?col1) (?T1_claim_id as ?col2) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\#ref-claim_id ?T1 .  ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#claim_id ?T1_claim_id .   }} UNION {SELECT (?T1_date_claim_made as ?col1) (?T1_claim_id as ?col2) WHERE { ?T1 a :claims . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#claim_id ?T1_claim_id . ?T1 :claims\#amount_claimed ?T1_amount_claimed . FILTER(?T1_amount_claimed = (?aggregation_T22_amount_claimed_77)) .       {SELECT ((max( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_77 ) as ?col1) WHERE { ?T22 a :claims . ?T22 :claims\#amount_claimed ?T22_amount_claimed .        }    } }      } } GROUP BY ?T1_date_claim_made ?T1_claim_id   HAVING(count( *)  > 2)
insurance_policies,"Find the claims that led to more than two settlements or have the maximum claim value. For each of them, return the date the claim was made and the id of the claim.",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_date_claim_made as ?col1) (?T1_claim_id as ?col2) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\#ref-claim_id ?T1 .  ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#claim_id ?T1_claim_id .   }} UNION {SELECT (?T1_date_claim_made as ?col1) (?T1_claim_id as ?col2) WHERE { ?T1 a :claims . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#claim_id ?T1_claim_id . ?T1 :claims\#amount_claimed ?T1_amount_claimed . FILTER(?T1_amount_claimed = (?aggregation_T22_amount_claimed_168)) .       {SELECT ((max( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_168 ) as ?col1) WHERE { ?T22 a :claims . ?T22 :claims\#amount_claimed ?T22_amount_claimed .        }    } }      } } GROUP BY ?T1_date_claim_made ?T1_claim_id   HAVING(count( *)  > 2)
insurance_policies,Which customer had at least 2 policies but did not file any claims? List the customer details and id.,SELECT distinct?col1?col2 WHERE { { SELECT (?T1_customer_details as ?col1) (?T1_customer_id as ?col2) WHERE { ?T1 a :customers . ?T2 a :customer_policies . ?T2 :customer_policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T1 :customers\#customer_id ?T1_customer_id .   }}  MINUS {SELECT (?T3_customer_details as ?col1) (?T3_customer_id as ?col2) WHERE { ?T3 a :customers . ?T3 :customers\#customer_details ?T3_customer_details . ?T3 :customers\#customer_id ?T3_customer_id .        }     } } GROUP BY ?T1_customer_details ?T1_customer_id   HAVING(count( *)  >= 2)
insurance_policies,"List the method, date and amount of all the payments, in ascending order of date.",SELECT ?T1_payment_method_code ?T1_date_payment_made ?T1_amount_payment WHERE { ?T1 a :payments . ?T1 :payments\#payment_method_code ?T1_payment_method_code . ?T1 :payments\#date_payment_made ?T1_date_payment_made . ?T1 :payments\#amount_payment ?T1_amount_payment . ?T1 :payments\#date_payment_made ?T1_date_payment_made .        }  ORDER BY ASC (?T1_date_payment_made)
insurance_policies,"Among all the claims, what is the settlement amount of the claim with the largest claim amount? List both the settlement amount and claim amount.",SELECT ?T1_amount_settled ?T1_amount_claimed WHERE { ?T1 a :claims . ?T1 :claims\#amount_settled ?T1_amount_settled . ?T1 :claims\#amount_claimed ?T1_amount_claimed . ?T1 :claims\#amount_claimed ?T1_amount_claimed .        }   ORDER BY DESC (?T1_amount_claimed) LIMIT 1
insurance_policies,"Among all the claims, what is the amount claimed in the claim with the least amount settled? List both the settlement amount and claim amount.",SELECT ?T1_amount_settled ?T1_amount_claimed WHERE { ?T1 a :claims . ?T1 :claims\#amount_settled ?T1_amount_settled . ?T1 :claims\#amount_claimed ?T1_amount_claimed . ?T1 :claims\#amount_settled ?T1_amount_settled .        }   ORDER BY ASC (?T1_amount_settled) LIMIT 1
insurance_policies,"Among all the claims, which claims have a claimed amount larger than the average? List the date the claim was made and the date it was settled.",SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#date_claim_settled ?T1_date_claim_settled . ?T1 :claims\#amount_claimed ?T1_amount_claimed . FILTER(?T1_amount_claimed > (?aggregation_T22_amount_claimed_24)) .       {SELECT (avg( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_24 ) WHERE { ?T22 a :claims . ?T22 :claims\#amount_claimed ?T22_amount_claimed .        }    } }
insurance_policies,"Give me the claim date, settlement date for all the claims whose claimed amount is larger than the average.",SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#date_claim_settled ?T1_date_claim_settled . ?T1 :claims\#amount_claimed ?T1_amount_claimed . FILTER(?T1_amount_claimed > (?aggregation_T22_amount_claimed_47)) .       {SELECT (avg( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_47 ) WHERE { ?T22 a :claims . ?T22 :claims\#amount_claimed ?T22_amount_claimed .        }    } }
insurance_policies,"Among all the claims, which settlements have a claimed amount that is no more than the average? List the claim start date.",SELECT ?T1_date_claim_made WHERE { ?T1 a :claims . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#amount_settled ?T1_amount_settled . FILTER(?T1_amount_settled <= (?aggregation_T22_amount_settled_155)) .       {SELECT (avg( ?T22_amount_settled) as ?aggregation_T22_amount_settled_155 ) WHERE { ?T22 a :claims . ?T22 :claims\#amount_settled ?T22_amount_settled .        }    } }
insurance_policies,How many settlements does each claim correspond to? List the claim id and the number of settlements.,SELECT ?T1_claim_id (count( *) as ?aggregation_all) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\#ref-claim_id ?T1 .  ?T1 :claims\#claim_id ?T1_claim_id .        } GROUP BY ?T1_claim_id
insurance_policies,"Which claim incurred the most number of settlements? List the claim id, the date the claim was made, and the number.",SELECT ?T1_claim_id (count( *) as ?aggregation_all) ?T1_date_claim_made (count( *) as ?aggregation_all) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\#ref-claim_id ?T1 .  ?T1 :claims\#claim_id ?T1_claim_id . ?T1 :claims\#date_claim_made ?T1_date_claim_made .        } GROUP BY ?T1_claim_id ?T1_date_claim_made  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_policies,How many settlements were made on the claim with the most recent claim settlement date? List the number and the claim id.,SELECT (count( *) as ?aggregation_all) ?T2_claim_id WHERE { ?T1 a :settlements . ?T2 a :claims . ?T1 :settlements\#ref-claim_id ?T2 .  ?T2 :claims\#claim_id ?T2_claim_id . ?T2 :claims\#date_claim_settled ?T2_date_claim_settled .        } GROUP BY ?T2_claim_id  ORDER BY DESC (?T2_date_claim_settled) LIMIT 1
insurance_policies,Tell me the the date when the first claim was made.,SELECT ?T1_date_claim_made WHERE { ?T1 a :claims . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#date_claim_made ?T1_date_claim_made .        }   ORDER BY ASC (?T1_date_claim_made) LIMIT 1
insurance_policies,What is the total amount of settlement made for all the settlements?,SELECT (sum( ?T1_amount_settled) as ?aggregation_T1_amount_settled_72 ) WHERE { ?T1 a :settlements . ?T1 :settlements\#amount_settled ?T1_amount_settled .        }
insurance_policies,Compute the total amount of settlement across all the settlements.,SELECT (sum( ?T1_amount_settled) as ?aggregation_T1_amount_settled_172 ) WHERE { ?T1 a :settlements . ?T1 :settlements\#amount_settled ?T1_amount_settled .        }
insurance_policies,Who are the customers that had more than 1 policy? List the customer details and id.,SELECT ?T1_customer_details ?T1_customer_id WHERE { ?T1 a :customers . ?T2 a :customer_policies . ?T2 :customer_policies\#ref-customer_id ?T1 .  ?T1 :customers\#customer_details ?T1_customer_details . ?T1 :customers\#customer_id ?T1_customer_id .        } GROUP BY ?T1_customer_details ?T1_customer_id   HAVING(count( *)  > 1)
insurance_policies,What are the claim dates and settlement dates of all the settlements?,SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :settlements . ?T1 :settlements\#date_claim_made ?T1_date_claim_made . ?T1 :settlements\#date_claim_settled ?T1_date_claim_settled .        }
insurance_policies,What is the most popular payment method?,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :payments . ?T1 :payments\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_policies,Which payment method is used the most often?,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :payments . ?T1 :payments\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_policies,What is the payment method that were used the least often?,SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :payments . ?T1 :payments\#payment_method_code ?T1_payment_method_code .        } GROUP BY ?T1_payment_method_code  ORDER BY ASC (?aggregation_all) LIMIT 1
insurance_policies,What is the total amount of payment?,SELECT (sum( ?T1_amount_payment) as ?aggregation_T1_amount_payment_54 ) WHERE { ?T1 a :payments . ?T1 :payments\#amount_payment ?T1_amount_payment .        }
insurance_policies,Compute the total amount of payment processed.,SELECT (sum( ?T1_amount_payment) as ?aggregation_T1_amount_payment_58 ) WHERE { ?T1 a :payments . ?T1 :payments\#amount_payment ?T1_amount_payment .        }
insurance_policies,What are all the distinct details of the customers?,SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T1 :customers\#customer_details ?T1_customer_details .        }
insurance_policies,Which kind of policy type was chosen by the most customers?,SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customer_policies . ?T1 :customer_policies\#policy_type_code ?T1_policy_type_code .        } GROUP BY ?T1_policy_type_code  ORDER BY DESC (?aggregation_all) LIMIT 1
insurance_policies,How many settlements are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :settlements .        }
insurance_policies,"Which Payments were processed with Visa? List the payment Id, the date and the amount.",SELECT ?T1_payment_id ?T1_date_payment_made ?T1_amount_payment WHERE { ?T1 a :payments . ?T1 :payments\#payment_id ?T1_payment_id . ?T1 :payments\#date_payment_made ?T1_date_payment_made . ?T1 :payments\#amount_payment ?T1_amount_payment . ?T1 :payments\#payment_method_code ?T1_payment_method_code . FILTER(?T1_payment_method_code = 'Visa') .        }
insurance_policies,"List the date the claim was made, the date it was settled and the amount settled for all the claims which had exactly one settlement.",SELECT ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :settlements\#ref-claim_id ?T1 .  ?T1 :claims\#claim_id ?T1_claim_id . ?T1 :claims\#date_claim_made ?T1_date_claim_made . ?T1 :claims\#date_claim_settled ?T1_date_claim_settled .        } GROUP BY ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled   HAVING(count( *)  = 1)
insurance_policies,Find the total claimed amount of all the claims.,SELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_200 ) WHERE { ?T1 a :claims . ?T1 :claims\#amount_claimed ?T1_amount_claimed .        }
insurance_policies,What is total amount claimed summed across all the claims?,SELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_36 ) WHERE { ?T1 a :claims . ?T1 :claims\#amount_claimed ?T1_amount_claimed .        }
hospital_1,Which department has the largest number of employees?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\#name ?T1_name . ?T1 :department\#departmentid ?T1_departmentid .        } GROUP BY ?T1_name  ORDER BY DESC ((count( ?T1_departmentid) as ?aggregation_T1_departmentid_117 )) LIMIT 1
hospital_1,Tell me the employee id of the head of the department with the least employees.,SELECT ?T1_head (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :department\#head ?T1_head . ?T1 :department\#departmentid ?T1_departmentid .        } GROUP BY ?T1_head  ORDER BY ASC ((count( ?T1_departmentid) as ?aggregation_T1_departmentid_80 )) LIMIT 1
hospital_1,what is the name and position of the head whose department has least number of employees?,SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :department\#ref-head ?T1 .  ?T1 :physician\#name ?T1_name . ?T1 :physician\#position ?T1_position . ?T2 :department\#departmentid ?T2_departmentid .        } GROUP BY ?T1_name ?T1_position  ORDER BY ASC ((count( ?T2_departmentid) as ?aggregation_T2_departmentid_52 )) LIMIT 1
hospital_1,What are names of patients who made an appointment?,SELECT ?T1_name WHERE { ?T1 a :patient . ?T1 :patient\#name ?T1_name .        }
hospital_1,Which patients made more than one appointment? Tell me the name and phone number of these patients.,SELECT ?T1_name ?T1_phone WHERE { ?T1 a :patient . ?T2 a :appointment . ?T2 :appointment\#ref-patient ?T1 .  ?T1 :patient\#name ?T1_name . ?T1 :patient\#phone ?T1_phone .        } GROUP BY ?T1_name ?T1_phone   HAVING(count( *)  > 1)
hospital_1,Find the id of the appointment with the most recent start date?,SELECT ?T1_appointmentid WHERE { ?T1 a :appointment . ?T1 :appointment\#appointmentid ?T1_appointmentid . ?T1 :appointment\#start ?T1_start .        }   ORDER BY DESC (?T1_start) LIMIT 1
hospital_1,What is the id of the appointment that started most recently?,SELECT ?T1_appointmentid WHERE { ?T1 a :appointment . ?T1 :appointment\#appointmentid ?T1_appointmentid . ?T1 :appointment\#start ?T1_start .        }   ORDER BY DESC (?T1_start) LIMIT 1
hospital_1,List the name of physicians who took some appointment.,SELECT ?T1_name WHERE { ?T1 a :physician . ?T1 :physician\#name ?T1_name .        }
hospital_1,List the name of physicians who never took any appointment.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :physician . ?T1 :physician\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :physician . ?T2 :physician\#name ?T2_name .        }     } }
hospital_1,Find the names of all physicians and their primary affiliated departments' names.,SELECT ?t1_name ?t3_name WHERE {?t1 a :physician . ?t2 a :affiliated_with . ?t3 a :department . ?t1 :physician\#ref-employeeid ?t2 . ?t2 :affiliated_with\#ref-department ?t3 . ?t2 :affiliated_with\#primaryaffiliation ?t2_primaryaffiliation .    FILTER (?t2_primary_affiliation =True)}
hospital_1,What is the name of the patient who made the most recent appointment?,SELECT ?T1_name WHERE { ?T1 a :patient . ?T2 a :appointment . ?T2 :appointment\#ref-patient ?T1 .  ?T1 :patient\#name ?T1_name . ?T2 :appointment\#start ?T2_start .        }   ORDER BY DESC (?T2_start) LIMIT 1
hospital_1,How many patients stay in room 112?,SELECT (count( ?T1_patient) as ?aggregation_T1_patient_32 ) WHERE { ?T1 a :stay . ?T1 :stay\#patient ?T1_patient . ?T1 :stay\#room ?T1_room . FILTER(?T1_room = 112) .        }
hospital_1,Count the number of patients who stayed in room 112.,SELECT (count( ?T1_patient) as ?aggregation_T1_patient_114 ) WHERE { ?T1 a :stay . ?T1 :stay\#patient ?T1_patient . ?T1 :stay\#room ?T1_room . FILTER(?T1_room = 112) .        }
hospital_1,How many patients' prescriptions are made by physician John Dorian?,SELECT (count( ?T1_ssn) as ?aggregation_T1_ssn_162 ) WHERE { ?T1 a :patient . ?T2 a :physician . ?T1 :patient\#ref-pcp ?T2 .  ?T1 :patient\#ssn ?T1_ssn . ?T2 :physician\#name ?T2_name . FILTER(?T2_name = 'John Dorian') .        }
hospital_1,Find the number of patients' prescriptions physician John Dorian made.,SELECT (count( ?T1_ssn) as ?aggregation_T1_ssn_199 ) WHERE { ?T1 a :patient . ?T2 a :physician . ?T1 :patient\#ref-pcp ?T2 .  ?T1 :patient\#ssn ?T1_ssn . ?T2 :physician\#name ?T2_name . FILTER(?T2_name = 'John Dorian') .        }
hospital_1,Find the name of medication used on the patient who stays in room 111?,SELECT ?T1_name WHERE { ?T1 a :medication . ?T13 a :prescribes . ?T13 :prescribes\#ref-medication ?T1 .  ?T1 :medication\#name ?T1_name . ?T2 :stay\#room ?T2_room . ?T14 a :patient . ?T13 :prescribes\#ref-patient ?T14 .  ?T1 :medication\#name ?T1_name . ?T2 :stay\#room ?T2_room . ?T2 a :stay . ?T2 :stay\#ref-patient ?T14 .  ?T1 :medication\#name ?T1_name . ?T2 :stay\#room ?T2_room . FILTER(?T2_room = 111) .        }
hospital_1,Find the patient who most recently stayed in room 111.,SELECT ?T1_patient WHERE { ?T1 a :stay . ?T1 :stay\#patient ?T1_patient . ?T1 :stay\#staystart ?T1_staystart . ?T1 :stay\#room ?T1_room . FILTER(?T1_room = 111) .        }   ORDER BY DESC (?T1_staystart) LIMIT 1
hospital_1,What is the id of the patient who stayed in room 111 most recently?,SELECT ?T1_patient WHERE { ?T1 a :stay . ?T1 :stay\#patient ?T1_patient . ?T1 :stay\#staystart ?T1_staystart . ?T1 :stay\#room ?T1_room . FILTER(?T1_room = 111) .        }   ORDER BY DESC (?T1_staystart) LIMIT 1
hospital_1,What is the name of the nurse has the most appointments?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :nurse . ?T2 a :appointment . ?T2 :appointment\#ref-prepnurse ?T1 .  ?T1 :nurse\#name ?T1_name .        } GROUP BY ?T1_name  ORDER BY DESC (?aggregation_all) LIMIT 1
hospital_1,How many patients do each physician take care of? List their names and number of patients they take care of.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :physician . ?T2 a :patient . ?T2 :patient\#ref-pcp ?T1 .  ?T1 :physician\#name ?T1_name .        } GROUP BY ?T1_name
hospital_1,Find the name of physicians who are in charge of more than one patient.,SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :patient . ?T2 :patient\#ref-pcp ?T1 .  ?T1 :physician\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
hospital_1,Find the number of rooms located on each block floor.,SELECT (count( *) as ?aggregation_all) ?T2_blockfloor WHERE { ?T1 a :room . ?T2 a :block . ?T1 :room\#ref-blockfloor ?T2 .  ?T2 :block\#blockfloor ?T2_blockfloor .        } GROUP BY ?T2_blockfloor
hospital_1,How many rooms does each block floor have?,SELECT (count( *) as ?aggregation_all) ?T2_blockfloor WHERE { ?T1 a :room . ?T2 a :block . ?T1 :room\#ref-blockfloor ?T2 .  ?T2 :block\#blockfloor ?T2_blockfloor .        } GROUP BY ?T2_blockfloor
hospital_1,Find the number of rooms for different block code?,SELECT (count( *) as ?aggregation_all) ?T2_blockcode WHERE { ?T1 a :room . ?T2 a :block . ?T1 :room\#ref-blockfloor ?T2 .  ?T2 :block\#blockcode ?T2_blockcode .        } GROUP BY ?T2_blockcode
