kg_name,question,query
geo,what is the biggest capital city in the us,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_81)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_81 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the largest capital city in the usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_55)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_55 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the largest state capital in population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_140)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_140 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the largest capital,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_49)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_49 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the most populated capital in the usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_50)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_50 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what capital is the largest in the us,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_57)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_57 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what capital has the largest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_60)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_60 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is largest capital,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_47)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_47 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the capital of states that have cities named durham,SELECT ?T1_capital WHERE { ?T1 a :state . ?T2 a :city . ?T2 :city\#ref-state_name ?T1 .  ?T1 :state\#capital ?T1_capital . ?T2 :city\#city_name ?T2_city_name . FILTER(?T2_city_name = 'durham') .        }
geo,what is the capital of the smallest state,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_193)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_193 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the capital of the state with the largest population density,SELECT DISTINCT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_68)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_68 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what is the capital of the state with the largest population,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_119)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_119 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the capital of the state with the most inhabitants,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_55)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_55 ) WHERE { ?T22 a :state . ?T22 :state\#population ?T22_population .        }    } }
geo,what is the capital of the state with the longest river,SELECT ?T1_capital WHERE { ?T1 a :state . ?T1 :state\#capital ?T1_capital . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_length_70)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#length ?T22_length . FILTER(?T22_length = (?aggregation_T43_length_70)) .       {SELECT (max( ?T43_length) as ?aggregation_T43_length_70 ) WHERE { ?T43 a :river . ?T43 :river\#length ?T43_length .        }    } }    } }
geo,what is the combined area of all 50 states,SELECT (sum( ?T1_area) as ?aggregation_T1_area_42 ) WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,what is the area of all the states combined,SELECT (sum( ?T1_area) as ?aggregation_T1_area_58 ) WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,how many square kilometers in the us,SELECT (sum( ?T1_area) as ?aggregation_T1_area_96 ) WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,what is the total area of the usa,SELECT (sum( ?T1_area) as ?aggregation_T1_area_21 ) WHERE { ?T1 a :state . ?T1 :state\#area ?T1_area .        }
geo,what is the density of the wyoming,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_state_name = 'wyoming') .        }
geo,what is the highest mountain in the us,SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_name ?T1_mountain_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?aggregation_T22_mountain_altitude_38)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_38 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude .        }    } }
geo,what is the highest mountain in us,SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_name ?T1_mountain_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?aggregation_T22_mountain_altitude_139)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_139 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude .        }    } }
geo,what is the tallest mountain in america,SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_name ?T1_mountain_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?aggregation_T22_mountain_altitude_197)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_197 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude .        }    } }
geo,what is the tallest mountain in the united states,SELECT ?T1_mountain_name WHERE { ?T1 a :mountain . ?T1 :mountain\#mountain_name ?T1_mountain_name . ?T1 :mountain\#mountain_altitude ?T1_mountain_altitude . FILTER(?T1_mountain_altitude = (?aggregation_T22_mountain_altitude_174)) .       {SELECT (max( ?T22_mountain_altitude) as ?aggregation_T22_mountain_altitude_174 ) WHERE { ?T22 a :mountain . ?T22 :mountain\#mountain_altitude ?T22_mountain_altitude .        }    } }
geo,what is the highest point in the state with capital des moines,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_capital)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#capital ?T22_capital . FILTER(?T22_capital = 'des moines') .        }    } }
geo,what is the highest point in the usa,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_89)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_89 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the highest point of the usa,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_194)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_194 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the highest point in the country,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_154)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_154 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the highest point in the us,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_31)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_31 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the highest point in the united states,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#highest_elevation ?T1_highest_elevation . FILTER(?T1_highest_elevation = (?aggregation_T22_highest_elevation_176)) .       {SELECT (max( ?T22_highest_elevation) as ?aggregation_T22_highest_elevation_176 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#highest_elevation ?T22_highest_elevation .        }    } }
geo,what is the highest point of the state with the smallest population density,SELECT ?T1_highest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#highest_point ?T1_highest_point . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name in (?aggregation_T43_density_167)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#density ?T22_density . FILTER(?T22_density = (?aggregation_T43_density_167)) .       {SELECT (min( ?T43_density) as ?aggregation_T43_density_167 ) WHERE { ?T43 a :state . ?T43 :state\#density ?T43_density .        }    } }    } }
geo,what is the largest city in smallest state through which the mississippi runs,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T64_river_name)) .       {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_state_name in (?T43_river_name) && ?T22_area = (?T64_river_name)) .       {SELECT ?T43_traverse WHERE { ?T43 a :river . ?T43 :river\#traverse ?T43_traverse . ?T43 :river\#river_name ?T43_river_name . FILTER(?T43_river_name = 'mississippi') .        }    } {SELECT (min( ?T43_area) as ?aggregation_T43_area_72 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area . ?T43 :state\#state_name ?T43_state_name . FILTER(?T43_state_name in (?T64_river_name)) .       {SELECT ?T64_traverse WHERE { ?T64 a :river . ?T64 :river\#traverse ?T64_traverse . ?T64 :river\#river_name ?T64_river_name . FILTER(?T64_river_name = 'mississippi') .        }    } }    } }    } }   ORDER BY DESC (?T1_population) LIMIT 1
geo,what is the largest city in the smallest state in the usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?aggregation_T64_area_27) && ?T1_state_name in (?aggregation_T43_area_76)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_171 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_area_27)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_27)) .       {SELECT (min( ?T64_area) as ?aggregation_T64_area_27 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_76)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_76 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the biggest city in the smallest state,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?aggregation_T64_area_109) && ?T1_state_name in (?aggregation_T43_area_133)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_53 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_area_109)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_109)) .       {SELECT (min( ?T64_area) as ?aggregation_T64_area_109 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_133)) .       {SELECT (min( ?T43_area) as ?aggregation_T43_area_133 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the largest state bordering california,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_area = (?T43_state_name) && ?T1_state_name in (?T22_state_name)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_170 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'california') .        }    } }    } {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'california') .        }    } }
geo,what is the longest river in the largest state,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?aggregation_T64_area_179) && ?T1_traverse in (?aggregation_T43_area_21)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_95 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse in (?aggregation_T64_area_179)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_179)) .       {SELECT (max( ?T64_area) as ?aggregation_T64_area_179 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_21)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_21 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the longest river in the states that border tennessee,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_length = (?T43_state_name) && ?T1_traverse in (?T22_state_name)) .       {SELECT (max( ?T22_length) as ?aggregation_T22_length_146 ) WHERE { ?T22 a :river . ?T22 :river\#length ?T22_length . ?T22 :river\#traverse ?T22_traverse . FILTER(?T22_traverse in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'tennessee') .        }    } }    } {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'tennessee') .        }    } }
geo,what is the longest river in the state with the most major cities,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#length ?T1_length . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse = (?T22_state_name)) .       {SELECT ?T22_state_name (count( *) as ?aggregation_all) WHERE { ?T22 a :city . ?T22 :city\#state_name ?T22_state_name . ?T22 :city\#city_name ?T22_city_name . ?T22 :city\#population ?T22_population . FILTER(?T22_population > 150000) .        } GROUP BY ?T22_state_name  ORDER BY DESC ((count( ?T22_city_name) as ?aggregation_T22_city_name_71 )) LIMIT 1 } }   ORDER BY DESC (?T1_length) LIMIT 1
geo,what is the lowest point in iowa,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name = 'iowa') .        }
geo,what is the lowest point in usa,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_70)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_70 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,what is the lowest point in the united states,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_36)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_36 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,where is the lowest point in the us,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_124)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_124 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,what is the lowest point of the us,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . FILTER(?T1_lowest_elevation = (?aggregation_T22_lowest_elevation_177)) .       {SELECT (min( ?T22_lowest_elevation) as ?aggregation_T22_lowest_elevation_177 ) WHERE { ?T22 a :highlow . ?T22 :highlow\#lowest_elevation ?T22_lowest_elevation .        }    } }
geo,what is the lowest point of all states through which the mississippi river runs through,SELECT ?T1_lowest_point WHERE { ?T1 a :highlow . ?T1 :highlow\#lowest_point ?T1_lowest_point . ?T1 :highlow\#lowest_elevation ?T1_lowest_elevation . ?T1 :highlow\#state_name ?T1_state_name . FILTER(?T1_state_name in (?T22_river_name)) .       {SELECT ?T22_traverse WHERE { ?T22 a :river . ?T22 :river\#traverse ?T22_traverse . ?T22 :river\#river_name ?T22_river_name . FILTER(?T22_river_name = 'mississippi') .        }    } }   ORDER BY ASC (?T1_lowest_elevation) LIMIT 1
geo,what is the most dense state in the usa,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_78)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_78 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,which state has the greatest density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_193)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_193 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the highest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_75)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_75 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the greatest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_15)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_15 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what state has the largest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_6)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_6 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what is the state with the largest density in usa,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_89)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_89 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what is the state with the largest population density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_118)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_118 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,which state has the largest density,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_40)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_40 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what is the population density of the largest state,SELECT ?T1_density WHERE { ?T1 a :state . ?T1 :state\#density ?T1_density . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_103)) .       {SELECT (max( ?T22_area) as ?aggregation_T22_area_103 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the population of the largest city in the state with the largest area,SELECT ?T1_population WHERE { ?T1 a :city . ?T1 :city\#population ?T1_population . ?T1 :city\#population ?T1_population . ?T1 :city\#state_name ?T1_state_name . FILTER(?T1_population = (?aggregation_T64_area_6) && ?T1_state_name in (?aggregation_T43_area_169)) .       {SELECT (max( ?T22_population) as ?aggregation_T22_population_28 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population . ?T22 :city\#state_name ?T22_state_name . FILTER(?T22_state_name in (?aggregation_T64_area_6)) .       {SELECT ?T43_state_name WHERE { ?T43 a :state . ?T43 :state\#state_name ?T43_state_name . ?T43 :state\#area ?T43_area . FILTER(?T43_area = (?aggregation_T64_area_6)) .       {SELECT (max( ?T64_area) as ?aggregation_T64_area_6 ) WHERE { ?T64 a :state . ?T64 :state\#area ?T64_area .        }    } }    } }    } {SELECT ?T22_state_name WHERE { ?T22 a :state . ?T22 :state\#state_name ?T22_state_name . ?T22 :state\#area ?T22_area . FILTER(?T22_area = (?aggregation_T43_area_169)) .       {SELECT (max( ?T43_area) as ?aggregation_T43_area_169 ) WHERE { ?T43 a :state . ?T43 :state\#area ?T43_area .        }    } }    } }
geo,what is the population of the smallest state,SELECT ?T1_population WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_14)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_14 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the population of the state with the highest population density,SELECT ?T1_population WHERE { ?T1 a :state . ?T1 :state\#population ?T1_population . ?T1 :state\#density ?T1_density . FILTER(?T1_density = (?aggregation_T22_density_46)) .       {SELECT (max( ?T22_density) as ?aggregation_T22_density_46 ) WHERE { ?T22 a :state . ?T22 :state\#density ?T22_density .        }    } }
geo,what is the smallest city in the usa,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_158)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_158 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the smallest city in the us,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_186)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_186 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what city has the least population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_30)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_30 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the city with the smallest population,SELECT ?T1_city_name WHERE { ?T1 a :city . ?T1 :city\#city_name ?T1_city_name . ?T1 :city\#population ?T1_population . FILTER(?T1_population = (?aggregation_T22_population_193)) .       {SELECT (min( ?T22_population) as ?aggregation_T22_population_193 ) WHERE { ?T22 a :city . ?T22 :city\#population ?T22_population .        }    } }
geo,what is the smallest state bordering texas,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . ?T1 :state\#state_name ?T1_state_name . FILTER(?T1_area = (?T43_state_name) && ?T1_state_name in (?T22_state_name)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_4 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area . ?T22 :state\#state_name ?T22_state_name . FILTER(?T22_state_name in (?T43_state_name)) .       {SELECT ?T43_border WHERE { ?T43 a :border_info . ?T43 :border_info\#border ?T43_border . ?T43 :border_info\#state_name ?T43_state_name . FILTER(?T43_state_name = 'texas') .        }    } }    } {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'texas') .        }    } }
geo,what is the state with the smallest area,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_89)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_89 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,which is the smallest state,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_133)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_133 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,which state is the smallest,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_165)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_165 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the smallest state in the usa,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_60)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_60 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the smallest state by area,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_117)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_117 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what state has the smallest area,SELECT ?T1_state_name WHERE { ?T1 a :state . ?T1 :state\#state_name ?T1_state_name . ?T1 :state\#area ?T1_area . FILTER(?T1_area = (?aggregation_T22_area_33)) .       {SELECT (min( ?T22_area) as ?aggregation_T22_area_33 ) WHERE { ?T22 a :state . ?T22 :state\#area ?T22_area .        }    } }
geo,what is the total length of all rivers in the usa,SELECT (sum( ?T1_length) as ?aggregation_T1_length_193 ) WHERE { ?T1 a :river . ?T1 :river\#length ?T1_length .        }
geo,what river flows through the most states,SELECT ?T1_river_name (count( *) as ?aggregation_all) WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse .        } GROUP BY ?T1_river_name  ORDER BY DESC ((count( ?T1_traverse) as ?aggregation_T1_traverse_184 )) LIMIT 1
geo,what rivers are in states that border alabama,SELECT ?T1_river_name WHERE { ?T1 a :river . ?T1 :river\#river_name ?T1_river_name . ?T1 :river\#traverse ?T1_traverse . FILTER(?T1_traverse in (?T22_state_name)) .       {SELECT ?T22_border WHERE { ?T22 a :border_info . ?T22 :border_info\#border ?T22_border . ?T22 :border_info\#state_name ?T22_state_name . FILTER(?T22_state_name = 'alabama') .        }    } }
