kg_name,question,query
book_2,List the publisher of the publication with the highest price.,SELECT ?T1_publisher WHERE { ?T1 a :publication . ?T1 :publication\#publisher ?T1_publisher . ?T1 :publication\#price ?T1_price .        }   ORDER BY DESC (?T1_price) LIMIT 1
book_2,List the publication dates of publications with 3 lowest prices.,SELECT ?T1_publication_date WHERE { ?T1 a :publication . ?T1 :publication\#publication_date ?T1_publication_date . ?T1 :publication\#price ?T1_price .        }   ORDER BY ASC (?T1_price) LIMIT 1
book_2,Show the title and publication dates of books.,SELECT ?T1_title ?T2_publication_date WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :publication\#ref-book_id ?T1 .  ?T1 :book\#title ?T1_title . ?T2 :publication\#publication_date ?T2_publication_date .        }
book_2,Show writers who have published a book with price more than 4000000.,SELECT ?T1_writer WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :publication\#ref-book_id ?T1 .  ?T1 :book\#writer ?T1_writer . ?T2 :publication\#price ?T2_price . FILTER(?T2_price > 4000000) .        }
book_2,Show the titles of books in descending order of publication price.,SELECT ?T1_title WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :publication\#ref-book_id ?T1 .  ?T1 :book\#title ?T1_title . ?T2 :publication\#price ?T2_price .        }  ORDER BY DESC (?T2_price)
book_2,Show publishers that have more than one publication.,SELECT ?T1_publisher WHERE { ?T1 a :publication . ?T1 :publication\#publisher ?T1_publisher .        } GROUP BY ?T1_publisher   HAVING(count( *)  > 1)
book_2,Show different publishers together with the number of publications they have.,SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :publication . ?T1 :publication\#publisher ?T1_publisher .        } GROUP BY ?T1_publisher
book_2,Please show the most common publication date.,SELECT ?T1_publication_date (count( *) as ?aggregation_all) WHERE { ?T1 a :publication . ?T1 :publication\#publication_date ?T1_publication_date .        } GROUP BY ?T1_publication_date  ORDER BY DESC (?aggregation_all) LIMIT 1
book_2,List the writers who have written more than one book.,SELECT ?T1_writer WHERE { ?T1 a :book . ?T1 :book\#writer ?T1_writer .        } GROUP BY ?T1_writer   HAVING(count( *)  > 1)
book_2,List the titles of books that are not published.,SELECT ?T1_title WHERE { ?T1 a :book . ?T1 :book\#title ?T1_title . ?T1 :book\#book_id ?T1_book_id . FILTER(?T1_book_id not in (?T22_book_id)) .       {SELECT ?T22_book_id WHERE { ?T22 a :publication . ?T22 :publication\#book_id ?T22_book_id .        }    } }
book_2,Show the publishers that have publications with price higher than 10000000 and publications with price lower than 5000000.,SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :publication . ?T1 :publication\#publisher ?T1_publisher . ?T1 :publication\#price ?T1_price . FILTER(?T1_price > 10000000) . FILTER (?T1_publisher in (?T2_publisher)) .   ?T2 a :publication . ?T2 :publication\#publisher ?T2_publisher . ?T2 :publication\#price ?T2_price .  FILTER(?T2_price < 5000000) .             }
book_2,What is the number of distinct publication dates?,SELECT DISTINCT (count(DISTINCT ?T1_publication_date) as ?aggregation_T1_publication_date_107 ) WHERE { ?T1 a :publication . ?T1 :publication\#publication_date ?T1_publication_date .        }
book_2,How many distinct publication dates are there in our record?,SELECT DISTINCT (count(DISTINCT ?T1_publication_date) as ?aggregation_T1_publication_date_174 ) WHERE { ?T1 a :publication . ?T1 :publication\#publication_date ?T1_publication_date .        }
book_2,Show the prices of publications whose publisher is either 'Person' or 'Wiley',SELECT ?T1_price WHERE { ?T1 a :publication . ?T1 :publication\#price ?T1_price . ?T1 :publication\#publisher ?T1_publisher . ?T1 :publication\#publisher ?T1_publisher . FILTER(?T1_publisher = 'Person' || ?T1_publisher = 'Wiley') .        }
musical,How many actors are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :actor . }
musical,List the name of actors in ascending alphabetical order.,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
musical,What are the characters and duration of actors?,SELECT ?T1_character ?T1_duration WHERE { ?T1 a :actor . ?T1 :actor\#character ?T1_character . ?T1 :actor\#duration ?T1_duration .        }
musical,List the name of actors whose age is not 20.,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#age ?T1_age . FILTER(?T1_age != 20) .        }
musical,What are the names of actors who are not 20 years old?,SELECT ?T1_name WHERE { ?T1 a :actor . ?T1 :actor\#name ?T1_name . ?T1 :actor\#age ?T1_age . FILTER(?T1_age != 20) .        }
musical,What are the characters of actors in descending order of age?,SELECT ?T1_character WHERE { ?T1 a :actor . ?T1 :actor\#character ?T1_character . ?T1 :actor\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
musical,What is the duration of the oldest actor?,SELECT ?T1_duration WHERE { ?T1 a :actor . ?T1 :actor\#duration ?T1_duration . ?T1 :actor\#age ?T1_age .        }   ORDER BY DESC (?T1_age) LIMIT 1
musical,What are the names of musicals with nominee 'Bob Fosse'?,SELECT ?T1_name WHERE { ?T1 a :musical . ?T1 :musical\#name ?T1_name . ?T1 :musical\#nominee ?T1_nominee . FILTER(?T1_nominee = 'Bob Fosse') .        }
musical,What are the distinct nominees of the musicals with the award that is not 'Tony Award'?,SELECT DISTINCT ?T1_nominee WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee . ?T1 :musical\#award ?T1_award . FILTER(?T1_award != 'Tony Award') .        }
musical,Show names of actors and names of musicals they are in.,SELECT ?T1_name ?T2_name WHERE { ?T2 :musical\#ref-actor_id ?T1 .        }
musical,What are the names of actors and the musicals that they are in?,SELECT ?T1_name ?T2_name WHERE { ?T2 :musical\#ref-actor_id ?T1 .        }
musical,Show names of actors that have appeared in musical with name 'The Phantom of the Opera'.,SELECT ?T1_name WHERE { ?T2 :musical\#ref-actor_id ?T1 . FILTER(?T2_name = 'The Phantom of the Opera') .        }
musical,Show names of actors in descending order of the year their musical is awarded.,SELECT ?T1_name WHERE { ?T2 :musical\#ref-actor_id ?T1 .        }  ORDER BY DESC (?T2_year)
musical,Show names of musicals and the number of actors who have appeared in the musicals.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 :musical\#ref-actor_id ?T2 .        } GROUP BY ?T1_name
musical,How many actors have appeared in each musical?,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 :musical\#ref-actor_id ?T2 .        } GROUP BY ?T1_name
musical,Show names of musicals which have at least three actors.,SELECT ?T1_name WHERE { ?T1 :musical\#ref-actor_id ?T2 .        } GROUP BY ?T1_name   HAVING(count( *)  >= 3)
musical,What are the names of musicals who have at 3 or more actors?,SELECT ?T1_name WHERE { ?T1 :musical\#ref-actor_id ?T2 .        } GROUP BY ?T1_name   HAVING(count( *)  >= 3)
musical,Show different nominees and the number of musicals they have been nominated.,SELECT ?T1_nominee (count( *) as ?aggregation_all) WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee .        } GROUP BY ?T1_nominee
musical,How many musicals has each nominee been nominated for?,SELECT ?T1_nominee (count( *) as ?aggregation_all) WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee .        } GROUP BY ?T1_nominee
musical,Please show the nominee who has been nominated the greatest number of times.,SELECT ?T1_nominee (count( *) as ?aggregation_all) WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee .        } GROUP BY ?T1_nominee  ORDER BY DESC (?aggregation_all) LIMIT 1
musical,Who is the nominee who has been nominated for the most musicals?,SELECT ?T1_nominee (count( *) as ?aggregation_all) WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee .        } GROUP BY ?T1_nominee  ORDER BY DESC (?aggregation_all) LIMIT 1
musical,List the most common result of the musicals.,SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a :musical . ?T1 :musical\#result ?T1_result .        } GROUP BY ?T1_result  ORDER BY DESC (?aggregation_all) LIMIT 1
musical,List the nominees that have been nominated more than two musicals.,SELECT ?T1_nominee WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee .        } GROUP BY ?T1_nominee   HAVING(count( *)  > 2)
musical,Who are the nominees who have been nominated more than two times?,SELECT ?T1_nominee WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee .        } GROUP BY ?T1_nominee   HAVING(count( *)  > 2)
musical,List the name of musicals that do not have actors.,SELECT ?T1_name WHERE { ?T1 a :musical . ?T1 :musical\#name ?T1_name . ?T1 :musical\#musical_id ?T1_musical_id . FILTER(?T1_musical_id not in (?T22_musical_id)) .       {SELECT ?T22_musical_id WHERE { ?T22 a :actor . ?T22 :actor\#musical_id ?T22_musical_id .        }    } }
musical,What are the names of musicals who have no actors?,SELECT ?T1_name WHERE { ?T1 a :musical . ?T1 :musical\#name ?T1_name . ?T1 :musical\#musical_id ?T1_musical_id . FILTER(?T1_musical_id not in (?T22_musical_id)) .       {SELECT ?T22_musical_id WHERE { ?T22 a :actor . ?T22 :actor\#musical_id ?T22_musical_id .        }    } }
musical,Show the nominees that have nominated musicals for both 'Tony Award' and 'Drama Desk Award'.,SELECT DISTINCT ?T1_nominee WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee . ?T1 :musical\#award ?T1_award . FILTER(?T1_award = 'Tony Award') . FILTER (?T1_nominee in (?T2_nominee)) .   ?T2 a :musical . ?T2 :musical\#nominee ?T2_nominee . ?T2 :musical\#award ?T2_award .  FILTER(?T2_award = 'Drama Desk Award') .             }
musical,Show the musical nominee with award 'Bob Fosse' or 'Cleavant Derricks'.,SELECT ?T1_nominee WHERE { ?T1 a :musical . ?T1 :musical\#nominee ?T1_nominee . ?T1 :musical\#award ?T1_award . ?T1 :musical\#award ?T1_award . FILTER(?T1_award = 'Tony Award' || ?T1_award = 'Cleavant Derricks') .        }
twitter_1,Find the emails of the user named 'Mary'.,SELECT ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#email ?T1_email . ?T1 :user_profiles\#name ?T1_name . FILTER(?T1_name = 'Mary') .        }
twitter_1,What is the partition id of the user named 'Iron Man'.,SELECT ?T1_partitionid WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#partitionid ?T1_partitionid . ?T1 :user_profiles\#name ?T1_name . FILTER(?T1_name = 'Iron Man') .        }
twitter_1,How many users are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :user_profiles .        }
twitter_1,How many followers does each user have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :follows .        }
twitter_1,Find the number of tweets in record.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tweets .        }
twitter_1,Find the number of users who posted some tweets.,SELECT DISTINCT (count(DISTINCT ?T1_uid) as ?aggregation_T1_uid_131 ) WHERE { ?T1 a :tweets . ?T1 :tweets\#uid ?T1_uid .        }
twitter_1,Find the name and email of the user whose name contains the word Swift.,"SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#email ?T1_email . ?T1 :user_profiles\#name ?T1_name . FILTER(contains (?T1_name, 'Swift')) .        }"
twitter_1,Find the names of users whose emails contain superstar or edu.,"SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#email ?T1_email . ?T1 :user_profiles\#email ?T1_email . FILTER(contains (?T1_email, 'superstar') || contains (?T1_email, 'edu')) .        }"
twitter_1,Return the text of tweets about the topic 'intern'.,"SELECT ?T1_text WHERE { ?T1 a :tweets . ?T1 :tweets\#text ?T1_text . ?T1 :tweets\#text ?T1_text . FILTER(contains (?T1_text, 'intern')) .        }"
twitter_1,Find the name and email of the users who have more than 1000 followers.,SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#email ?T1_email . ?T1 :user_profiles\#followers ?T1_followers . FILTER(?T1_followers > 1000) .        }
twitter_1,Find the names of the users whose number of followers is greater than that of the user named 'Tyler Swift'.,SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T2 a :follows . ?T2 :follows\#ref-f1 ?T1 .  ?T1 :user_profiles\#name ?T1_name .       {SELECT (count( *) as ?aggregation_all) WHERE { ?T23 a :follows . ?T24 a :user_profiles . ?T23 :follows\#ref-f1 ?T24 .  ?T24 :user_profiles\#name ?T24_name . FILTER(?T24_name = 'Tyler Swift') .        }    } } GROUP BY ?T1_name   HAVING(count( *)  > (?T24_name))
twitter_1,Find the name and email for the users who have more than one follower.,SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T2 a :follows . ?T2 :follows\#ref-f1 ?T1 .  ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#email ?T1_email .        } GROUP BY ?T1_name ?T1_email   HAVING(count( *)  > 1)
twitter_1,Find the names of users who have more than one tweet.,SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :tweets\#ref-uid ?T1 .  ?T1 :user_profiles\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
twitter_1,Find the id of users who are followed by Mary and Susan.,SELECT DISTINCT ?T1_f1 WHERE { ?T1 a :follows . ?T2 a :user_profiles . ?T1 :follows\#ref-f1 ?T2 .  ?T1 :follows\#f1 ?T1_f1 . ?T2 :user_profiles\#name ?T2_name . FILTER(?T2_name = 'Mary') . FILTER (?T1_f1 in (?T3_f1)) .   ?T3 a :follows . ?T4 a :user_profiles . ?T3 :follows\#ref-f1 ?T4 .  ?T3 :follows\#f1 ?T3_f1 . ?T4 :user_profiles\#name ?T4_name .  FILTER(?T4_name = 'Susan') .             }
twitter_1,Find the id of users who are followed by Mary or Susan.,SELECT ?T1_f1 WHERE { ?T1 a :follows . ?T2 a :user_profiles . ?T1 :follows\#ref-f1 ?T2 .  ?T1 :follows\#f1 ?T1_f1 . ?T2 :user_profiles\#name ?T2_name . ?T2 :user_profiles\#name ?T2_name . FILTER(?T2_name = 'Mary' || ?T2_name = 'Susan') .        }
twitter_1,Find the name of the user who has the largest number of followers.,SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#followers ?T1_followers .        }   ORDER BY DESC (?T1_followers) LIMIT 1
twitter_1,Find the name and email of the user followed by the least number of people.,SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#email ?T1_email . ?T1 :user_profiles\#followers ?T1_followers .        }   ORDER BY ASC (?T1_followers) LIMIT 1
twitter_1,"List the name and number of followers for each user, and sort the results by the number of followers in descending order.",SELECT ?T1_name ?T1_followers WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#followers ?T1_followers . ?T1 :user_profiles\#followers ?T1_followers .        }  ORDER BY DESC (?T1_followers)
twitter_1,List the text of all tweets in the order of date.,SELECT ?T1_text WHERE { ?T1 a :tweets . ?T1 :tweets\#text ?T1_text . ?T1 :tweets\#createdate ?T1_createdate .        }  ORDER BY ASC (?T1_createdate)
twitter_1,Find the name of each user and number of tweets tweeted by each of them.,SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :tweets\#ref-uid ?T1 .  ?T1 :user_profiles\#name ?T1_name .        } GROUP BY ?T1_name
twitter_1,Find the name and partition id for users who tweeted less than twice.,SELECT ?T1_name ?T1_partitionid WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :tweets\#ref-uid ?T1 .  ?T1 :user_profiles\#name ?T1_name . ?T1 :user_profiles\#partitionid ?T1_partitionid .        } GROUP BY ?T1_name ?T1_partitionid   HAVING(count( *)  < 2)
twitter_1,"Find the name of the user who tweeted more than once, and number of tweets tweeted by them.",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :tweets\#ref-uid ?T1 .  ?T1 :user_profiles\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  > 1)
twitter_1,Find the average number of followers for the users who do not have any tweet.,SELECT (avg( ?T1_followers) as ?aggregation_T1_followers_6 ) WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#followers ?T1_followers . ?T1 :user_profiles\#uid ?T1_uid . FILTER(?T1_uid not in (?T22_uid)) .       {SELECT ?T22_uid WHERE { ?T22 a :tweets . ?T22 :tweets\#uid ?T22_uid .        }    } }
twitter_1,Find the average number of followers for the users who had some tweets.,SELECT (avg( ?T1_followers) as ?aggregation_T1_followers_115 ) WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :tweets\#ref-uid ?T1 .  ?T1 :user_profiles\#followers ?T1_followers . ?T1 :user_profiles\#uid ?T1_uid .        }
twitter_1,Find the maximum and total number of followers of all users.,SELECT (max( ?T1_followers) as ?aggregation_T1_followers_73 ) (sum( ?T1_followers) as ?aggregation_T1_followers_152 ) WHERE { ?T1 a :user_profiles . ?T1 :user_profiles\#followers ?T1_followers . ?T1 :user_profiles\#followers ?T1_followers .        }
product_catalog,Find the names of all the catalog entries.,SELECT DISTINCT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name .        }
product_catalog,What are all the catalog entry names?,SELECT DISTINCT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name .        }
product_catalog,Find the list of attribute data types possessed by more than 3 attribute definitions.,SELECT ?T1_attribute_data_type WHERE { ?T1 a :attribute_definitions . ?T1 :attribute_definitions\#attribute_data_type ?T1_attribute_data_type .        } GROUP BY ?T1_attribute_data_type   HAVING(count( *)  > 3)
product_catalog,What is the attribute data type of the attribute with name 'Green'?,SELECT ?T1_attribute_data_type WHERE { ?T1 a :attribute_definitions . ?T1 :attribute_definitions\#attribute_data_type ?T1_attribute_data_type . ?T1 :attribute_definitions\#attribute_name ?T1_attribute_name . FILTER(?T1_attribute_name = 'Green') .        }
product_catalog,Find the name and level of catalog structure with level between 5 and 10.,SELECT ?T1_catalog_level_name ?T1_catalog_level_number WHERE { ?T1 a :catalog_structure . ?T1 :catalog_structure\#catalog_level_name ?T1_catalog_level_name . ?T1 :catalog_structure\#catalog_level_number ?T1_catalog_level_number . ?T1 :catalog_structure\#catalog_level_number ?T1_catalog_level_number . FILTER(?T1_catalog_level_number >= 5 && ?T1_catalog_level_number <= 10) .        }
product_catalog,Find all the catalog publishers whose name contains 'Murray',"SELECT DISTINCT ?T1_catalog_publisher WHERE { ?T1 a :catalogs . ?T1 :catalogs\#catalog_publisher ?T1_catalog_publisher . ?T1 :catalogs\#catalog_publisher ?T1_catalog_publisher . FILTER(contains (?T1_catalog_publisher, 'Murray')) .        }"
product_catalog,Which catalog publishers have substring 'Murray' in their names?,"SELECT DISTINCT ?T1_catalog_publisher WHERE { ?T1 a :catalogs . ?T1 :catalogs\#catalog_publisher ?T1_catalog_publisher . ?T1 :catalogs\#catalog_publisher ?T1_catalog_publisher . FILTER(contains (?T1_catalog_publisher, 'Murray')) .        }"
product_catalog,Which catalog publisher has published the most catalogs?,SELECT ?T1_catalog_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :catalogs . ?T1 :catalogs\#catalog_publisher ?T1_catalog_publisher .        } GROUP BY ?T1_catalog_publisher  ORDER BY DESC (?aggregation_all) LIMIT 1
product_catalog,Find the names and publication dates of all catalogs that have catalog level number greater than 5.,SELECT ?T1_catalog_name ?T1_date_of_publication WHERE { ?T1 a :catalogs . ?T2 a :catalog_structure . ?T2 :catalog_structure\#ref-catalog_id ?T1 .  ?T1 :catalogs\#catalog_name ?T1_catalog_name . ?T1 :catalogs\#date_of_publication ?T1_date_of_publication . ?T2 :catalog_structure\#catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number > 5) .        }
product_catalog,What are the entry names of catalog with the attribute possessed by most entries.,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :catalog_contents_additional_attributes\#ref-catalog_entry_id ?T1 .  ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T2 :catalog_contents_additional_attributes\#attribute_value ?T2_attribute_value . FILTER(?T2_attribute_value = (?T23_attribute_value)) .       {SELECT ?T23_attribute_value (count( *) as ?aggregation_all) WHERE { ?T23 a :catalog_contents_additional_attributes . ?T23 :catalog_contents_additional_attributes\#attribute_value ?T23_attribute_value .        } GROUP BY ?T23_attribute_value  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
product_catalog,What is the entry name of the most expensive catalog (in USD)?,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#price_in_dollars ?T1_price_in_dollars .        }   ORDER BY DESC (?T1_price_in_dollars) LIMIT 1
product_catalog,What is the level name of the cheapest catalog (in USD)?,SELECT ?T1_catalog_level_name WHERE { ?T1 a :catalog_structure . ?T2 a :catalog_contents . ?T2 :catalog_contents\#ref-catalog_level_number ?T1 .  ?T1 :catalog_structure\#catalog_level_name ?T1_catalog_level_name . ?T2 :catalog_contents\#price_in_dollars ?T2_price_in_dollars .        }   ORDER BY ASC (?T2_price_in_dollars) LIMIT 1
product_catalog,What are the average and minimum price (in Euro) of all products?,SELECT (avg( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_3 ) (min( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_84 ) WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#price_in_euros ?T1_price_in_euros . ?T1 :catalog_contents\#price_in_euros ?T1_price_in_euros .        }
product_catalog,Give me the average and minimum price (in Euro) of the products.,SELECT (avg( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_137 ) (min( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_47 ) WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#price_in_euros ?T1_price_in_euros . ?T1 :catalog_contents\#price_in_euros ?T1_price_in_euros .        }
product_catalog,What is the product with the highest height? Give me the catalog entry name.,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#height ?T1_height .        }   ORDER BY DESC (?T1_height) LIMIT 1
product_catalog,Find the name of the product that has the smallest capacity.,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#capacity ?T1_capacity .        }   ORDER BY ASC (?T1_capacity) LIMIT 1
product_catalog,Find the names of all the products whose stock number starts with '2'.,"SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#product_stock_number ?T1_product_stock_number . FILTER(contains (?T1_product_stock_number, '2')) .        }"
product_catalog,Find the names of catalog entries with level number 8.,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :catalog_contents_additional_attributes\#ref-catalog_entry_id ?T1 .  ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T2 :catalog_contents_additional_attributes\#catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number = 8) .        }
product_catalog,What are the names of catalog entries with level number 8?,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :catalog_contents_additional_attributes\#ref-catalog_entry_id ?T1 .  ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T2 :catalog_contents_additional_attributes\#catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number = 8) .        }
product_catalog,Find the names of the products with length smaller than 3 or height greater than 5.,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#length ?T1_length . ?T1 :catalog_contents\#width ?T1_width . FILTER(?T1_length < 3 || ?T1_width > 5) .        }
product_catalog,Find the name and attribute ID of the attribute definitions with attribute value 0.,SELECT ?T1_attribute_name ?T1_attribute_id WHERE { ?T1 :attribute_definitions\#ref-catalog_contents_additional_attributes_id ?T2 . FILTER(?T2_attribute_value = 0) .        }
product_catalog,Find the name and capacity of products with price greater than 700 (in USD).,SELECT ?T1_catalog_entry_name ?T1_capacity WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#capacity ?T1_capacity . ?T1 :catalog_contents\#price_in_dollars ?T1_price_in_dollars . FILTER(?T1_price_in_dollars > 700) .        }
product_catalog,Find the dates on which more than one revisions were made.,SELECT ?T1_date_of_latest_revision WHERE { ?T1 a :catalogs . ?T1 :catalogs\#date_of_latest_revision ?T1_date_of_latest_revision .        } GROUP BY ?T1_date_of_latest_revision   HAVING(count( *)  > 1)
product_catalog,How many products are there in the records?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :catalog_contents .        }
product_catalog,Name all the products with next entry ID greater than 8.,SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_contents\#catalog_entry_name ?T1_catalog_entry_name . ?T1 :catalog_contents\#next_entry_id ?T1_next_entry_id . FILTER(?T1_next_entry_id > 8) .        }
flight_1,How many aircrafts do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft .        }
flight_1,How many aircrafts exist in the database?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft .        }
flight_1,Show name and distance for all aircrafts.,SELECT ?T1_name ?T1_distance WHERE { ?T1 a :aircraft . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance .        }
flight_1,What are the names and distances for all airplanes?,SELECT ?T1_name ?T1_distance WHERE { ?T1 a :aircraft . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance .        }
flight_1,Show ids for all aircrafts with more than 1000 distance.,SELECT ?T1_aid WHERE { ?T1 a :aircraft . ?T1 :aircraft\#aid ?T1_aid . ?T1 :aircraft\#distance ?T1_distance . FILTER(?T1_distance > 1000) .        }
flight_1,How many aircrafts have distance between 1000 and 5000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T1 :aircraft\#distance ?T1_distance . FILTER(?T1_distance >= 1000 && ?T1_distance <= 5000) .        }
flight_1,What is the name and distance for aircraft with id 12?,SELECT ?T1_name ?T1_distance WHERE { ?T1 a :aircraft . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance . ?T1 :aircraft\#aid ?T1_aid . FILTER(?T1_aid = 12) .        }
flight_1,What is the name and distance for the aircraft that has an id of 12?,SELECT ?T1_name ?T1_distance WHERE { ?T1 a :aircraft . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance . ?T1 :aircraft\#aid ?T1_aid . FILTER(?T1_aid = 12) .        }
flight_1,"What is the minimum, average, and maximum distance of all aircrafts.",SELECT (min( ?T1_distance) as ?aggregation_T1_distance_156 ) (avg( ?T1_distance) as ?aggregation_T1_distance_138 ) (max( ?T1_distance) as ?aggregation_T1_distance_45 ) WHERE { ?T1 a :aircraft . ?T1 :aircraft\#distance ?T1_distance . ?T1 :aircraft\#distance ?T1_distance . ?T1 :aircraft\#distance ?T1_distance .        }
flight_1,"Return the minimum, average and maximum distances traveled across all aircrafts.",SELECT (min( ?T1_distance) as ?aggregation_T1_distance_154 ) (avg( ?T1_distance) as ?aggregation_T1_distance_115 ) (max( ?T1_distance) as ?aggregation_T1_distance_41 ) WHERE { ?T1 a :aircraft . ?T1 :aircraft\#distance ?T1_distance . ?T1 :aircraft\#distance ?T1_distance . ?T1 :aircraft\#distance ?T1_distance .        }
flight_1,Show the id and name of the aircraft with the maximum distance.,SELECT ?T1_aid ?T1_name WHERE { ?T1 a :aircraft . ?T1 :aircraft\#aid ?T1_aid . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance .        }   ORDER BY DESC (?T1_distance) LIMIT 1
flight_1,Show the name of aircrafts with top three lowest distances.,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance .        }   ORDER BY ASC (?T1_distance) LIMIT 1
flight_1,Show names for all aircrafts with distances more than the average.,SELECT ?T1_name WHERE { ?T1 a :aircraft . ?T1 :aircraft\#name ?T1_name . ?T1 :aircraft\#distance ?T1_distance . FILTER(?T1_distance > (?aggregation_T22_distance_169)) .       {SELECT (avg( ?T22_distance) as ?aggregation_T22_distance_169 ) WHERE { ?T22 a :aircraft . ?T22 :aircraft\#distance ?T22_distance .        }    } }
flight_1,How many employees do we have?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employee .        }
flight_1,What is the number of employees?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employee .        }
flight_1,Show name and salary for all employees sorted by salary.,SELECT ?T1_name ?T1_salary WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#salary ?T1_salary .        }  ORDER BY ASC (?T1_salary)
flight_1,What is the name and salary of all employees in order of salary?,SELECT ?T1_name ?T1_salary WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#salary ?T1_salary .        }  ORDER BY ASC (?T1_salary)
flight_1,Show ids for all employees with at least 100000 salary.,SELECT ?T1_eid WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid . ?T1 :employee\#salary ?T1_salary . FILTER(?T1_salary > 100000) .        }
flight_1,What is the id of every employee who has at least a salary of  100000?,SELECT ?T1_eid WHERE { ?T1 a :employee . ?T1 :employee\#eid ?T1_eid . ?T1 :employee\#salary ?T1_salary . FILTER(?T1_salary > 100000) .        }
flight_1,How many employees have salary between 100000 and 200000?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :employee . ?T1 :employee\#salary ?T1_salary . FILTER(?T1_salary >= 100000 && ?T1_salary <= 200000) .        }
flight_1,What is the name and salary for employee with id 242518965?,SELECT ?T1_name ?T1_salary WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#eid ?T1_eid . FILTER(?T1_eid = 242518965) .        }
flight_1,What is the name and salary of the employee with the id 242518965?,SELECT ?T1_name ?T1_salary WHERE { ?T1 a :employee . ?T1 :employee\#name ?T1_name . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#eid ?T1_eid . FILTER(?T1_eid = 242518965) .        }
flight_1,What is average and maximum salary of all employees.,SELECT (avg( ?T1_salary) as ?aggregation_T1_salary_151 ) (max( ?T1_salary) as ?aggregation_T1_salary_31 ) WHERE { ?T1 a :employee . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#salary ?T1_salary .        }
flight_1,What is the average and largest salary of all employees?,SELECT (avg( ?T1_salary) as ?aggregation_T1_salary_75 ) (max( ?T1_salary) as ?aggregation_T1_salary_69 ) WHERE { ?T1 a :employee . ?T1 :employee\#salary ?T1_salary . ?T1 :employee\#salary ?T1_salary .        }
