kg_name,question,query
scholar,count of ACL papers by author,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_156 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'ACL') .        } GROUP BY ?T2_authorid
scholar,how many ACL papers by author,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_167 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'ACL') .        } GROUP BY ?T2_authorid
scholar,number of ACL papers by author,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_46 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'ACL') .        } GROUP BY ?T2_authorid
scholar,who wrote the most papers for CVPR 2007,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_138 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2007 && ?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_74 ))
scholar,who published papers in CVPR 2007,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_171 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2007 && ?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_96 ))
scholar,who wrote the most CVPR papers in 2007,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_47 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2007 && ?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_153 ))
scholar,who published the most papers in CVPR 2007,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_94 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2007 && ?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_74 ))
scholar,Who published the most papers in 2007 at CVPR ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_39 ) ?T2_authorid WHERE { ?T1 a :paper . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2007 && ?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_94 ))
scholar,How many papers in ACL 2015 ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_80 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'ACL') .        }
scholar,number of papers published in ACL 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_0 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T1_year = 2015 && ?T2_venuename = 'ACL') .        }
scholar,papers from 2014,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . FILTER(?T1_year = 2014) .        }
scholar,What papers does Richard Ladner have in chi ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,what paper has Richard Ladner published in chi journal ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,what paper has Richard Ladner published in chi ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,Does Richard Ladner publish in chi ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,What has Richard Ladner published at chi ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,What papers has Richard Ladner written at chi ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,Which paper did Richard Ladner present at chi ?,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T14 a :writes . ?T14 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :author . ?T14 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :author\#authorname ?T2_authorname . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_authorname = 'Richard Ladner' && ?T3_venuename = 'chi') .        }
scholar,Fetch me the most cited publications for Artificial Intelligence,SELECT DISTINCT ?T1_citedpaperid (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_132 ) WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T13 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . FILTER(?T2_keyphrasename = 'Artificial Intelligence') .        } GROUP BY ?T1_citedpaperid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_62 ))
scholar,topics at ACL 2014,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_139 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2014 && ?T3_venuename = 'ACL') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_119 ))
scholar,most common topics at NIPS 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_11 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2015 && ?T3_venuename = 'NIPS') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_71 ))
scholar,most popular topics at NIPS 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_111 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2015 && ?T3_venuename = 'NIPS') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_153 ))
scholar,hot topics at NIPS 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_175 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2015 && ?T3_venuename = 'NIPS') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_108 ))
scholar,popular topics at NIPS 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_126 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2015 && ?T3_venuename = 'NIPS') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_50 ))
scholar,which topics were most popular at NIPS 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_105 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2015 && ?T3_venuename = 'NIPS') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_162 ))
scholar,topics popular at NIPS 2015,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_71 ) ?T2_keyphraseid WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphraseid ?T2_keyphraseid . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T1_year = 2015 && ?T3_venuename = 'NIPS') .        } GROUP BY ?T2_keyphraseid ORDER BY DESC ((count( ?T1_paperid) as ?aggregation_T1_paperid_165 ))
scholar,How many papers related to deep reinforcement learning in nips ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_6 ) WHERE { ?T1 a :paper . ?T14 a :paperkeyphrase . ?T14 :paperkeyphrase\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :keyphrase . ?T14 :paperkeyphrase\#ref-keyphraseid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T1 :paper\#ref-venueid ?T3 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :keyphrase\#keyphrasename ?T2_keyphrasename . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T2_keyphrasename = 'deep reinforcement learning' && ?T3_venuename = 'nips') .        }
scholar,Papers on WebKB,SELECT DISTINCT ?T1_paperid WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(?T2_datasetname = 'WebKB') .        }
scholar,which papers used WebKB ?,SELECT DISTINCT ?T1_paperid WHERE { ?T2 :dataset\#ref-paper_id ?T1 . FILTER(?T2_datasetname = 'WebKB') .        }
scholar,conferences in 2013,SELECT DISTINCT ?T1_venueid WHERE { ?T1 a :paper . ?T1 :paper\#venueid ?T1_venueid . ?T1 :paper\#year ?T1_year . FILTER(?T1_year = 2013) .        }
scholar,how is the most cited author in CVPR ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_101 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\#ref-citedpaperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T14 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_45 ))
scholar,who is the most cited author at CVPR ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_54 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\#ref-citedpaperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :venue\#venuename ?T3_venuename . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :venue\#venuename ?T3_venuename . ?T3 a :venue . ?T14 :paper\#ref-venueid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :venue\#venuename ?T3_venuename . FILTER(?T3_venuename = 'CVPR') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_20 ))
scholar,what are some syntactic parsing papers that chris dyer did not write ?,SELECT DISTINCT ?T1_authorname ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname != 'chris dyer' && ?T3_keyphrasename = 'syntactic parsing') .        }
scholar,are there any syntactic parsing papers not written by chris dyer ?,SELECT DISTINCT ?T1_authorname ?T2_paperid WHERE { ?T1 a :author . ?T14 a :writes . ?T14 :writes\#ref-aid ?T1 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T2 a :paper . ?T14 :writes\#ref-paperid ?T2 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T15 a :paperkeyphrase . ?T15 :paperkeyphrase\#ref-paperid ?T2 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . ?T3 a :keyphrase . ?T15 :paperkeyphrase\#ref-keyphraseid ?T3 .  ?T1 :author\#authorname ?T1_authorname . ?T2 :paper\#paperid ?T2_paperid . ?T1 :author\#authorname ?T1_authorname . ?T3 :keyphrase\#keyphrasename ?T3_keyphrasename . FILTER(?T1_authorname != 'chris dyer' && ?T3_keyphrasename = 'syntactic parsing') .        }
scholar,papers published in the last year,SELECT DISTINCT ?T1_paperid WHERE { ?T1 a :paper . ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . FILTER(?T1_year = (?aggregation_T22_year_58)) .       {SELECT (max( ?T22_year) as ?aggregation_T22_year_58 ) WHERE { ?T22 a :paper . ?T22 :paper\#year ?T22_year .        }    } }
scholar,When was benjamin mako hill 's first publication ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_92 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'benjamin mako hill') .        } GROUP BY ?T1_year ORDER BY ASC (?T1_year)
scholar,When was benjamin mako hill 's first paper written ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_89 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'benjamin mako hill') .        } GROUP BY ?T1_year ORDER BY ASC (?T1_year)
scholar,When did ameet soni publish ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_158 ) ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'ameet soni') .        } GROUP BY ?T1_year ORDER BY ASC (?T1_year)
scholar,Who cites Daniel A Reed the most,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_128 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\#ref-citedpaperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :author\#authorname ?T3_authorname . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T2 :writes\#ref-aid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Daniel A Reed') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_5 ))
scholar,Who cites Daniel A Reed most ?,SELECT DISTINCT (count(DISTINCT ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_32 ) ?T2_authorid WHERE { ?T1 a :cite . ?T14 a :paper . ?T1 :cite\#ref-citedpaperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :author\#authorname ?T3_authorname . ?T2 a :writes . ?T2 :writes\#ref-paperid ?T14 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :author\#authorname ?T3_authorname . ?T3 a :author . ?T2 :writes\#ref-aid ?T3 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :writes\#authorid ?T2_authorid . ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T3 :author\#authorname ?T3_authorname . FILTER(?T3_authorname = 'Daniel A Reed') .        } GROUP BY ?T2_authorid ORDER BY DESC ((count( ?T1_citingpaperid) as ?aggregation_T1_citingpaperid_33 ))
scholar,how many papers are in sigir ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_110 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'sigir') .        }
scholar,how many papers does sigir have ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_160 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'sigir') .        }
scholar,how many papers are published in sigir ?,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_154 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'sigir') .        }
scholar,number of papers in sigir conference,SELECT DISTINCT (count(DISTINCT ?T1_paperid) as ?aggregation_T1_paperid_44 ) WHERE { ?T1 a :paper . ?T2 a :venue . ?T1 :paper\#ref-venueid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T2 :venue\#venuename ?T2_venuename . FILTER(?T2_venuename = 'sigir') .        }
scholar,what papers have fewer than 5 citations by ACL papers ?,SELECT DISTINCT ?T1_citingpaperid WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T1 :cite\#citedpaperid ?T1_citedpaperid . FILTER(?T2_venuename = 'ACL') .        } GROUP BY ?T1_citingpaperid   HAVING(count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_143 ) < 5)
scholar,what ACL papers have less than 5 citations ?,SELECT DISTINCT ?T1_citingpaperid WHERE { ?T1 a :cite . ?T13 a :paper . ?T1 :cite\#ref-citedpaperid ?T13 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T1 :cite\#citedpaperid ?T1_citedpaperid . ?T2 a :venue . ?T13 :paper\#ref-venueid ?T2 .  ?T1 :cite\#citingpaperid ?T1_citingpaperid . ?T2 :venue\#venuename ?T2_venuename . ?T1 :cite\#citedpaperid ?T1_citedpaperid . FILTER(?T2_venuename = 'ACL') .        } GROUP BY ?T1_citingpaperid   HAVING(count( ?T1_citedpaperid) as ?aggregation_T1_citedpaperid_5 ) < 5)
scholar,What are the 5 most recent papers of Mirella Lapata ?,SELECT DISTINCT ?T1_paperid ?T1_year WHERE { ?T1 a :paper . ?T13 a :writes . ?T13 :writes\#ref-paperid ?T1 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . ?T2 a :author . ?T13 :writes\#ref-aid ?T2 .  ?T1 :paper\#paperid ?T1_paperid . ?T1 :paper\#year ?T1_year . ?T1 :paper\#year ?T1_year . ?T2 :author\#authorname ?T2_authorname . FILTER(?T2_authorname = 'Mirella Lapata') .        }   ORDER BY DESC (?T1_year) LIMIT 1
