kg_name,question,query
tracking_grants_for_research,"Which organisation hired the most number of research staff? List the organisation id, type and detail.",SELECT ?T1_organisation_id (count( *) as ?aggregation_all) ?T1_organisation_type ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :research_staff . ?T2 :research_staff\#ref-employer_organisation_id ?T1 .  ?T1 :organisations\#organisation_id ?T1_organisation_id . ?T1 :organisations\#organisation_type ?T1_organisation_type . ?T1 :organisations\#organisation_details ?T1_organisation_details .        } GROUP BY ?T1_organisation_id ?T1_organisation_type ?T1_organisation_details  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,Show the role description and the id of the project staff involved in most number of project outcomes?,SELECT ?T1_role_description (count( *) as ?aggregation_all) ?T2_staff_id WHERE { ?T1 a :staff_roles . ?T2 a :project_staff . ?T2 :project_staff\#ref-role_code ?T1 .  ?T1 :staff_roles\#role_description ?T1_role_description . ?T2 :project_staff\#staff_id ?T2_staff_id . ?T14 a :projects . ?T2 :project_staff\#ref-project_id ?T14 .  ?T1 :staff_roles\#role_description ?T1_role_description . ?T2 :project_staff\#staff_id ?T2_staff_id . ?T3 a :project_outcomes . ?T3 :project_outcomes\#ref-project_id ?T14 .  ?T1 :staff_roles\#role_description ?T1_role_description . ?T2 :project_staff\#staff_id ?T2_staff_id .        } GROUP BY ?T1_role_description ?T2_staff_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,"For each staff id, what is the description of the role that is involved with the most number of projects?",SELECT ?T1_role_description (count( *) as ?aggregation_all) ?T2_staff_id WHERE { ?T1 a :staff_roles . ?T2 a :project_staff . ?T2 :project_staff\#ref-role_code ?T1 .  ?T1 :staff_roles\#role_description ?T1_role_description . ?T2 :project_staff\#staff_id ?T2_staff_id . ?T14 a :projects . ?T2 :project_staff\#ref-project_id ?T14 .  ?T1 :staff_roles\#role_description ?T1_role_description . ?T2 :project_staff\#staff_id ?T2_staff_id . ?T3 a :project_outcomes . ?T3 :project_outcomes\#ref-project_id ?T14 .  ?T1 :staff_roles\#role_description ?T1_role_description . ?T2 :project_staff\#staff_id ?T2_staff_id .        } GROUP BY ?T1_role_description ?T2_staff_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,Which document type is described with the prefix 'Initial'?,"SELECT ?T1_document_type_code WHERE { ?T1 a :document_types . ?T1 :document_types\#document_type_code ?T1_document_type_code . ?T1 :document_types\#document_description ?T1_document_description . FILTER(contains (?T1_document_description, 'Initial')) .        }"
tracking_grants_for_research,"For grants with both documents described as 'Regular' and documents described as 'Initial Application', list its start date.",SELECT DISTINCT ?T1_grant_start_date WHERE { ?T1 a :grants . ?T13 a :documents . ?T13 :documents\#ref-grant_id ?T1 .  ?T1 :grants\#grant_start_date ?T1_grant_start_date . ?T2 :document_types\#document_description ?T2_document_description . ?T2 a :document_types . ?T13 :documents\#ref-document_type_code ?T2 .  ?T1 :grants\#grant_start_date ?T1_grant_start_date . ?T2 :document_types\#document_description ?T2_document_description . FILTER(?T2_document_description = 'Regular') . FILTER (?T1_grant_start_date in (?T3_grant_start_date)) .   ?T3 a :grants . ?T15 a :documents . ?T15 :documents\#ref-grant_id ?T3 .  ?T3 :grants\#grant_start_date ?T3_grant_start_date . ?T4 :document_types\#document_description ?T4_document_description . ?T4 a :document_types . ?T15 :documents\#ref-document_type_code ?T4 .  ?T3 :grants\#grant_start_date ?T3_grant_start_date . ?T4 :document_types\#document_description ?T4_document_description .  FILTER(?T4_document_description = 'Initial Application') .             }
tracking_grants_for_research,"For grants that have descriptions of Regular and Initial Applications, what are their start dates?",SELECT DISTINCT ?T1_grant_start_date WHERE { ?T1 a :grants . ?T13 a :documents . ?T13 :documents\#ref-grant_id ?T1 .  ?T1 :grants\#grant_start_date ?T1_grant_start_date . ?T2 :document_types\#document_description ?T2_document_description . ?T2 a :document_types . ?T13 :documents\#ref-document_type_code ?T2 .  ?T1 :grants\#grant_start_date ?T1_grant_start_date . ?T2 :document_types\#document_description ?T2_document_description . FILTER(?T2_document_description = 'Regular') . FILTER (?T1_grant_start_date in (?T3_grant_start_date)) .   ?T3 a :grants . ?T15 a :documents . ?T15 :documents\#ref-grant_id ?T3 .  ?T3 :grants\#grant_start_date ?T3_grant_start_date . ?T4 :document_types\#document_description ?T4_document_description . ?T4 a :document_types . ?T15 :documents\#ref-document_type_code ?T4 .  ?T3 :grants\#grant_start_date ?T3_grant_start_date . ?T4 :document_types\#document_description ?T4_document_description .  FILTER(?T4_document_description = 'Initial Application') .             }
tracking_grants_for_research,How many documents can one grant have at most? List the grant id and number.,SELECT ?T1_grant_id (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :documents\#grant_id ?T1_grant_id .        } GROUP BY ?T1_grant_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,Find the organisation type description of the organisation detailed as 'quo'.,SELECT ?T1_organisation_type_description WHERE { ?T1 a :organisation_types . ?T2 a :organisations . ?T2 :organisations\#ref-organisation_type ?T1 .  ?T1 :organisation_types\#organisation_type_description ?T1_organisation_type_description . ?T2 :organisations\#organisation_details ?T2_organisation_details . FILTER(?T2_organisation_details = 'quo') .        }
tracking_grants_for_research,What are all the details of the organisations described as 'Sponsor'? Sort the result in an ascending order.,SELECT ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :organisation_types . ?T1 :organisations\#ref-organisation_type ?T2 .  ?T1 :organisations\#organisation_details ?T1_organisation_details . ?T1 :organisations\#organisation_details ?T1_organisation_details . ?T2 :organisation_types\#organisation_type_description ?T2_organisation_type_description . FILTER(?T2_organisation_type_description = 'Sponsor') .        }  ORDER BY ASC (?T1_organisation_details)
tracking_grants_for_research,How many Patent outcomes are generated from all the projects?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :project_outcomes . ?T1 :project_outcomes\#outcome_code ?T1_outcome_code . FILTER(?T1_outcome_code = 'Patent') .        }
tracking_grants_for_research,How many patents outcomes were listed for all the projects?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :project_outcomes . ?T1 :project_outcomes\#outcome_code ?T1_outcome_code . FILTER(?T1_outcome_code = 'Patent') .        }
tracking_grants_for_research,What is the last date of the staff leaving the projects?,SELECT ?T1_date_to WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#date_to ?T1_date_to .        }   ORDER BY DESC (?T1_date_to) LIMIT 1
tracking_grants_for_research,What is the last date that a staff member left a project?,SELECT ?T1_date_to WHERE { ?T1 a :project_staff . ?T1 :project_staff\#date_to ?T1_date_to . ?T1 :project_staff\#date_to ?T1_date_to .        }   ORDER BY DESC (?T1_date_to) LIMIT 1
tracking_grants_for_research,What are the result description of the project whose detail is 'sint'?,SELECT ?T1_outcome_description WHERE { ?T1 a :research_outcomes . ?T13 a :project_outcomes . ?T13 :project_outcomes\#ref-outcome_code ?T1 .  ?T1 :research_outcomes\#outcome_description ?T1_outcome_description . ?T2 :projects\#project_details ?T2_project_details . ?T2 a :projects . ?T13 :project_outcomes\#ref-project_id ?T2 .  ?T1 :research_outcomes\#outcome_description ?T1_outcome_description . ?T2 :projects\#project_details ?T2_project_details . FILTER(?T2_project_details = 'sint') .        }
tracking_grants_for_research,What is the description for the results whose project detail is 'sint'?,SELECT ?T1_outcome_description WHERE { ?T1 a :research_outcomes . ?T13 a :project_outcomes . ?T13 :project_outcomes\#ref-outcome_code ?T1 .  ?T1 :research_outcomes\#outcome_description ?T1_outcome_description . ?T2 :projects\#project_details ?T2_project_details . ?T2 a :projects . ?T13 :project_outcomes\#ref-project_id ?T2 .  ?T1 :research_outcomes\#outcome_description ?T1_outcome_description . ?T2 :projects\#project_details ?T2_project_details . FILTER(?T2_project_details = 'sint') .        }
tracking_grants_for_research,"List the organisation id with the maximum outcome count, and the count.",SELECT ?T1_organisation_id (count( *) as ?aggregation_all) (count( *) as ?aggregation_all) WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :project_outcomes\#ref-project_id ?T1 .  ?T1 :projects\#organisation_id ?T1_organisation_id .        } GROUP BY ?T1_organisation_id  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,List the project details of the projects launched by the organisation,SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :projects\#project_details ?T1_project_details . ?T1 :projects\#organisation_id ?T1_organisation_id . FILTER(?T1_organisation_id in (?T22_organisation_id)) .       {SELECT ?T22_organisation_id (count( *) as ?aggregation_all) WHERE { ?T22 a :projects . ?T22 :projects\#organisation_id ?T22_organisation_id .        } GROUP BY ?T22_organisation_id  ORDER BY DESC (?aggregation_all) LIMIT 1 } }
tracking_grants_for_research,"List the research staff details, and order in ascending order.",SELECT ?T1_staff_details WHERE { ?T1 a :research_staff . ?T1 :research_staff\#staff_details ?T1_staff_details . ?T1 :research_staff\#staff_details ?T1_staff_details .        }  ORDER BY ASC (?T1_staff_details)
tracking_grants_for_research,How many tasks are there in total?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tasks .        }
tracking_grants_for_research,How many tasks are there?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tasks .        }
tracking_grants_for_research,How many tasks does each project have? List the task count and the project detail.,SELECT (count( *) as ?aggregation_all) ?T2_project_details WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :tasks\#ref-project_id ?T2 .  ?T2 :projects\#project_details ?T2_project_details .        } GROUP BY ?T2_project_details
tracking_grants_for_research,What are the staff roles of the staff who,SELECT ?T1_role_code WHERE { ?T1 a :project_staff . ?T1 :project_staff\#role_code ?T1_role_code . ?T1 :project_staff\#date_from ?T1_date_from . ?T1 :project_staff\#date_to ?T1_date_to . FILTER(?T1_date_from > 2003-04-19 15:06:20 && ?T1_date_to < 2016-03-15 00:33:18) .        }
tracking_grants_for_research,What are the descriptions of all the project outcomes?,SELECT ?T1_outcome_description WHERE { ?T1 a :research_outcomes . ?T1 :research_outcomes\#outcome_description ?T1_outcome_description .        }
tracking_grants_for_research,Which role is most common for the staff?,SELECT ?T1_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code  ORDER BY DESC (?aggregation_all) LIMIT 1
tracking_grants_for_research,What is the most common role for the staff?,SELECT ?T1_role_code (count( *) as ?aggregation_all) WHERE { ?T1 a :project_staff . ?T1 :project_staff\#role_code ?T1_role_code .        } GROUP BY ?T1_role_code  ORDER BY DESC (?aggregation_all) LIMIT 1
network_2,How many friends does Dan have?,SELECT (count( ?T1_friend) as ?aggregation_T1_friend_66 ) WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T2 :person\#name ?T2_name . FILTER(?T2_name = 'Dan') .        }
network_2,How many females does this network has?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :person\#gender ?T1_gender . FILTER(?T1_gender = 'female') .        }
network_2,How many females are in the network?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :person\#gender ?T1_gender . FILTER(?T1_gender = 'female') .        }
network_2,What is the average age for all person?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_196 ) WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age .        }
network_2,What is the average age for all people in the table?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_175 ) WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age .        }
network_2,How many different cities are they from?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_174 ) WHERE { ?T1 a :person . ?T1 :person\#city ?T1_city .        }
network_2,How many different cities do people originate from?,SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_178 ) WHERE { ?T1 a :person . ?T1 :person\#city ?T1_city .        }
network_2,How many type of jobs do they have?,SELECT DISTINCT (count(DISTINCT ?T1_job) as ?aggregation_T1_job_115 ) WHERE { ?T1 a :person . ?T1 :person\#job ?T1_job .        }
network_2,How many different jobs are listed?,SELECT DISTINCT (count(DISTINCT ?T1_job) as ?aggregation_T1_job_146 ) WHERE { ?T1 a :person . ?T1 :person\#job ?T1_job .        }
network_2,Who is the oldest person?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_8)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_8 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age .        }    } }
network_2,What is the name of the person who is the oldest?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_12)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_12 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age .        }    } }
network_2,Who is the oldest person whose job is student?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#job ?T1_job . ?T1 :person\#age ?T1_age . FILTER(?T1_job = 'student' && ?T1_age = (?T22_job)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_17 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#job ?T22_job . FILTER(?T22_job = 'student') .        }    } }
network_2,What is the name of the oldest student?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#job ?T1_job . ?T1 :person\#age ?T1_age . FILTER(?T1_job = 'student' && ?T1_age = (?T22_job)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_179 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#job ?T22_job . FILTER(?T22_job = 'student') .        }    } }
network_2,Who is the youngest male?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#gender ?T1_gender . ?T1 :person\#age ?T1_age . FILTER(?T1_gender = 'male' && ?T1_age = (?T22_gender)) .       {SELECT (min( ?T22_age) as ?aggregation_T22_age_26 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#gender ?T22_gender . FILTER(?T22_gender = 'male') .        }    } }
network_2,What is the name of the youngest male?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#gender ?T1_gender . ?T1 :person\#age ?T1_age . FILTER(?T1_gender = 'male' && ?T1_age = (?T22_gender)) .       {SELECT (min( ?T22_age) as ?aggregation_T22_age_122 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#gender ?T22_gender . FILTER(?T22_gender = 'male') .        }    } }
network_2,How old is the doctor named Zach?,SELECT ?T1_age WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . ?T1 :person\#name ?T1_name . FILTER(?T1_job = 'doctor' && ?T1_name = 'Zach') .        }
network_2,What is the age of the doctor named Zach?,SELECT ?T1_age WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . ?T1 :person\#name ?T1_name . FILTER(?T1_job = 'doctor' && ?T1_name = 'Zach') .        }
network_2,Who is the person whose age is below 30?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . FILTER(?T1_age < 30) .        }
network_2,What is the name of the person whose age is below 30?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . FILTER(?T1_age < 30) .        }
network_2,How many people whose age is greater 30 and job is engineer?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . FILTER(?T1_age > 30 && ?T1_job = 'engineer') .        }
network_2,HOw many engineers are older than 30?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . FILTER(?T1_age > 30 && ?T1_job = 'engineer') .        }
network_2,What is the average age for each gender?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_191 ) ?T1_gender WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#gender ?T1_gender .        } GROUP BY ?T1_gender
network_2,What is average age for different job title?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_126 ) ?T1_job WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job .        } GROUP BY ?T1_job
network_2,How old is the average person for each job?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_109 ) ?T1_job WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job .        } GROUP BY ?T1_job
network_2,What is average age of male for different job title?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_49 ) ?T1_job WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . ?T1 :person\#gender ?T1_gender . FILTER(?T1_gender = 'male') .        } GROUP BY ?T1_job
network_2,What is the average age for a male in each job?,SELECT (avg( ?T1_age) as ?aggregation_T1_age_132 ) ?T1_job WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job . ?T1 :person\#gender ?T1_gender . FILTER(?T1_gender = 'male') .        } GROUP BY ?T1_job
network_2,What is minimum age for different job title?,SELECT (min( ?T1_age) as ?aggregation_T1_age_142 ) ?T1_job WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job .        } GROUP BY ?T1_job
network_2,How old is the youngest person for each job?,SELECT (min( ?T1_age) as ?aggregation_T1_age_185 ) ?T1_job WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . ?T1 :person\#job ?T1_job .        } GROUP BY ?T1_job
network_2,Find the number of people who is under 40 for each gender.,SELECT (count( *) as ?aggregation_all) ?T1_gender WHERE { ?T1 a :person . ?T1 :person\#gender ?T1_gender . ?T1 :person\#age ?T1_age . FILTER(?T1_age < 40) .        } GROUP BY ?T1_gender
network_2,How many people are under 40 for each gender?,SELECT (count( *) as ?aggregation_all) ?T1_gender WHERE { ?T1 a :person . ?T1 :person\#gender ?T1_gender . ?T1 :person\#age ?T1_age . FILTER(?T1_age < 40) .        } GROUP BY ?T1_gender
network_2,Find the name of people whose age is greater than any engineer sorted by their age.,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . ?T1 :person\#age ?T1_age . FILTER(?T1_age > (?T22_job)) .       {SELECT (min( ?T22_age) as ?aggregation_T22_age_18 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#job ?T22_job . FILTER(?T22_job = 'engineer') .        }    } }  ORDER BY ASC (?T1_age)
network_2,What is the name of all the people who are older than at least one engineer? Order them by age.,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . ?T1 :person\#age ?T1_age . FILTER(?T1_age > (?T22_job)) .       {SELECT (min( ?T22_age) as ?aggregation_T22_age_131 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#job ?T22_job . FILTER(?T22_job = 'engineer') .        }    } }  ORDER BY ASC (?T1_age)
network_2,Find the number of people whose age is greater than all engineers.,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . FILTER(?T1_age > (?T22_job)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_21 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#job ?T22_job . FILTER(?T22_job = 'engineer') .        }    } }
network_2,How many people are older than every engineer?,SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :person\#age ?T1_age . FILTER(?T1_age > (?T22_job)) .       {SELECT (max( ?T22_age) as ?aggregation_T22_age_28 ) WHERE { ?T22 a :person . ?T22 :person\#age ?T22_age . ?T22 :person\#job ?T22_job . FILTER(?T22_job = 'engineer') .        }    } }
network_2,"list the name, job title of all people ordered by their names.",SELECT ?T1_name ?T1_job WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#job ?T1_job . ?T1 :person\#name ?T1_name .        }  ORDER BY ASC (?T1_name)
network_2,Find the names of all person sorted in the descending order using age.,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
network_2,What are the names of everybody sorted by age in descending order?,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age .        }  ORDER BY DESC (?T1_age)
network_2,Find the name and age of all males in order of their age.,SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . ?T1 :person\#gender ?T1_gender . FILTER(?T1_gender = 'male') .        }  ORDER BY ASC (?T1_age)
network_2,Find the name and age of the person who is a friend of both Dan and Alice.,SELECT DISTINCT ?T1_name ?T1_age WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend = 'Dan') . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_age in (?T3_age)) .   ?T3 a :person . ?T4 a :personfriend . ?T4 :personfriend\#ref-friend ?T3 .  ?T3 :person\#name ?T3_name . ?T3 :person\#age ?T3_age . ?T4 :personfriend\#friend ?T4_friend .  FILTER(?T4_friend = 'Alice') .             }
network_2,Find the name and age of the person who is a friend of Dan or Alice.,SELECT DISTINCT ?T1_name ?T1_age WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T1 :person\#age ?T1_age . ?T2 :personfriend\#friend ?T2_friend . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend = 'Dan' || ?T2_friend = 'Alice') .        }
network_2,Find the name of the person who has friends with age above 40 and under age 30?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend in (?T23_age)) . FILTER (?T1_name in (?T25_name)) .   ?T3 a :person . ?T4 a :personfriend . ?T4 :personfriend\#ref-friend ?T3 .  ?T3 :person\#name ?T3_name . ?T4 :personfriend\#friend ?T4_friend .  FILTER(?T4_friend in (?T25_age)) .            { ?T23 a :person . ?T23 :person\#name ?T23_name . ?T23 :person\#age ?T23_age .  FILTER(?T23_age > 40) .       } }
network_2,What are the names of every person who has a friend over 40 and under 30?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend in (?T23_age)) . FILTER (?T1_name in (?T25_name)) .   ?T3 a :person . ?T4 a :personfriend . ?T4 :personfriend\#ref-friend ?T3 .  ?T3 :person\#name ?T3_name . ?T4 :personfriend\#friend ?T4_friend .  FILTER(?T4_friend in (?T25_age)) .            { ?T23 a :person . ?T23 :person\#name ?T23_name . ?T23 :person\#age ?T23_age .  FILTER(?T23_age > 40) .       } }
network_2,Find the name of the person who has friends with age above 40 but not under age 30?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend in (?T23_age)) .   }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T3 a :person . ?T4 a :personfriend . ?T4 :personfriend\#ref-friend ?T3 .  ?T3 :person\#name ?T3_name . ?T4 :personfriend\#friend ?T4_friend . FILTER(?T4_friend in (?T25_age)) .       {SELECT (?T25_name as ?col1) WHERE { ?T25 a :person . ?T25 :person\#name ?T25_name . ?T25 :person\#age ?T25_age . FILTER(?T25_age < 30) .        }    } }     } }
network_2,What are the names of the people who are older 40 but no friends under age 30?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend in (?T23_age)) .   }}  MINUS {SELECT (?T3_name as ?col1) WHERE { ?T3 a :person . ?T4 a :personfriend . ?T4 :personfriend\#ref-friend ?T3 .  ?T3 :person\#name ?T3_name . ?T4 :personfriend\#friend ?T4_friend . FILTER(?T4_friend in (?T25_age)) .       {SELECT (?T25_name as ?col1) WHERE { ?T25 a :person . ?T25 :person\#name ?T25_name . ?T25 :person\#age ?T25_age . FILTER(?T25_age < 30) .        }    } }     } }
network_2,Find the name of the person who has no student friends.,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :personfriend . ?T3 a :person . ?T2 :personfriend\#ref-friend ?T3 .  ?T2 :personfriend\#name ?T2_name . ?T3 :person\#job ?T3_job . FILTER(?T3_job = 'student') .        }     } }
network_2,What are the names of the people who have no friends who are students?,SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T1 :person\#name ?T1_name .   }}  MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :personfriend . ?T3 a :person . ?T2 :personfriend\#ref-friend ?T3 .  ?T2 :personfriend\#name ?T2_name . ?T3 :person\#job ?T3_job . FILTER(?T3_job = 'student') .        }     } }
network_2,Find the person who has exactly one friend.,SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T1 :personfriend\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  = 1)
network_2,What are the names of everybody who has exactly one friend?,SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T1 :personfriend\#name ?T1_name .        } GROUP BY ?T1_name   HAVING(count( *)  = 1)
network_2,Who are the friends of Bob?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T2 :person\#name ?T2_name . FILTER(?T2_name = 'Bob') .        }
network_2,Who are Bob's friends?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T2 :person\#name ?T2_name . FILTER(?T2_name = 'Bob') .        }
network_2,Find the name of persons who are friends with Bob.,SELECT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend = 'Bob') .        }
network_2,What are the names of all of Bob's friends?,SELECT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . FILTER(?T2_friend = 'Bob') .        }
network_2,Find the names of females who are friends with Zach,SELECT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . ?T1 :person\#gender ?T1_gender . FILTER(?T2_friend = 'Zach' && ?T1_gender = 'female') .        }
network_2,What are the names of all females who are friends with Zach?,SELECT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :personfriend\#ref-friend ?T1 .  ?T1 :person\#name ?T1_name . ?T2 :personfriend\#friend ?T2_friend . ?T1 :person\#gender ?T1_gender . FILTER(?T2_friend = 'Zach' && ?T1_gender = 'female') .        }
network_2,Find the female friends of Alice.,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#name ?T1_name . ?T2 :person\#gender ?T2_gender . FILTER(?T1_name = 'Alice' && ?T2_gender = 'female') .        }
network_2,What are all the friends of Alice who are female?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#name ?T1_name . ?T2 :person\#gender ?T2_gender . FILTER(?T1_name = 'Alice' && ?T2_gender = 'female') .        }
network_2,Find the male friend of Alice whose job is a doctor?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#name ?T1_name . ?T2 :person\#gender ?T2_gender . ?T2 :person\#job ?T2_job . FILTER(?T1_name = 'Alice' && ?T2_gender = 'male' && ?T2_job = 'doctor') .        }
network_2,Who are the friends of Alice that are doctors?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#name ?T1_name . ?T2 :person\#gender ?T2_gender . ?T2 :person\#job ?T2_job . FILTER(?T1_name = 'Alice' && ?T2_gender = 'male' && ?T2_job = 'doctor') .        }
network_2,Who has a friend that is from new york city?,SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T2 :person\#city ?T2_city . FILTER(?T2_city = 'new york city') .        }
network_2,What are the names of all friends who are from New York?,SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T2 :person\#city ?T2_city . FILTER(?T2_city = 'new york city') .        }
network_2,Who has friends that are younger than the average age?,SELECT DISTINCT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T2 :person\#age ?T2_age . FILTER(?T2_age < (?aggregation_T23_age_12)) .       {SELECT (avg( ?T23_age) as ?aggregation_T23_age_12 ) WHERE { ?T23 a :person . ?T23 :person\#age ?T23_age .        }    } }
network_2,Who has friends that are older than the average age? Print their friends and their ages as well,SELECT DISTINCT ?T1_name ?T1_friend ?T2_age WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :personfriend\#ref-friend ?T2 .  ?T1 :personfriend\#name ?T1_name . ?T1 :personfriend\#friend ?T1_friend . ?T2 :person\#age ?T2_age . ?T2 :person\#age ?T2_age . FILTER(?T2_age > (?aggregation_T23_age_19)) .       {SELECT (avg( ?T23_age) as ?aggregation_T23_age_19 ) WHERE { ?T23 a :person . ?T23 :person\#age ?T23_age .        }    } }
network_2,Who is the friend of Zach with longest year relationship?,SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T1 :personfriend\#friend ?T1_friend . ?T1 :personfriend\#name ?T1_name . ?T1 :personfriend\#year ?T1_year . FILTER(?T1_name = 'Zach' && ?T1_year = (?T22_name)) .       {SELECT (max( ?T22_year) as ?aggregation_T22_year_139 ) WHERE { ?T22 a :personfriend . ?T22 :personfriend\#year ?T22_year . ?T22 :personfriend\#name ?T22_name . FILTER(?T22_name = 'Zach') .        }    } }
